DSCore.CurveMapper.PowerCurve
CurveMapper의 거듭제곱 함수 곡선을 나타냅니다.
이 곡선은 제어점에서 파생된 거듭제곱 방정식으로 정의됩니다.

DSCore.CurveMapper.PowerCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
곡선을 따라 분배된 X 및 Y 값을 반환합니다.