DSCore.CurveMapper.GaussianCurve
CurveMapper의 가우스 곡선을 나타냅니다.
가우스 곡선은 4개의 제어점으로 정의된 종 모양의 분배를 따릅니다.

DSCore.CurveMapper.GaussianCurve.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
노드의 크기가 현재 조정되고 있는지 여부를 나타내며, 의도하지 않은 제어점 업데이트를 방지합니다.

DSCore.CurveMapper.GaussianCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
곡선을 따라 분배된 X 및 Y 값을 반환합니다.