DSCore.CurveMapper.BezierCurve
CurveMapper의 베지어 곡선을 나타냅니다.
베지어 곡선은 4개의 제어점으로 정의되며 부드러운 보간을 제공합니다.

DSCore.CurveMapper.BezierCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
할당된 매개변수 및 제한을 기준으로 보간된 Y 값을 구합니다.