DSCore.ObjectComparer
다음과 같은 규칙을 사용하여 두 객체에 대한 Compare 함수를 구현합니다.
1. 숫자가 가장 작은 것으로 간주되며 부울, 문자열 및 포인터 순으로 작습니다.
2. 두 객체가 IComparable이고 같은 유형인 경우 기본 비교 메커니즘을
사용합니다.
3. 두 입력 모두 값 유형이지만 그 중 하나가 부울이면 부울이 더 큽니다.
4. 그렇지 않으면 모두 double 값으로 변환하고 비교합니다.
5. 하나만 값 유형인 경우에는 값 유형 객체가 더 작습니다.
6. 하나만 문자열인 경우에는 문자열이 다른 객체보다 작습니다.
7. 비교 방법을 모를 경우에는 HashCode를 기반으로 비교합니다.