DSCore.CurveMapper.SquareRootCurve
CurveMapper의 제곱근 곡선을 나타냅니다.
이 곡선은 제곱근 함수를 따르며 두 제어점의 영향을 받습니다.

DSCore.CurveMapper.SquareRootCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
곡선을 따라 분배된 X 및 Y 값을 반환합니다.