DSCore.IO.FileSystem
파일 사용 방법.

DSCore.IO.FileSystem.AbsolutePath(System.String,System.String)
지정된 경로에서 절대 경로를 반환합니다. 지정된 경로가
상대 경로인 경우 해당 상대 경로가 현재 작업공간과 연관되어
해석됩니다. 파일이 상대 경로에 존재하지 않고 지정된 hintPath에
존재하면 hintPath가 반환됩니다.
path: 상대 경로 또는 전체 경로
hintPath: 마지막 해석된 경로
Returns: 절대 경로

DSCore.IO.FileSystem.FileFromPath(System.String)
지정된 파일 경로에서 파일 객체를 작성합니다.

DSCore.IO.FileSystem.ReadText(System.IO.FileInfo)
텍스트 파일을 읽고 내용을 문자열로 반환합니다.
file: 문자를 읽을 파일 객체
텍스트 파일 내용.
read file,text,file

DSCore.IO.FileSystem.MoveFile(System.String,System.String,System.Boolean)
지정된 파일을 새 위치로 이동합니다
path: 기존 경로의 문자열 표현
newPath: 새 경로의 문자열 표현
overwrite: 토글하여 기존 파일 덮어쓰기
노드가 작업 수행, 출력 생성 안 함

DSCore.IO.FileSystem.DeleteFile(System.String)
지정된 파일을 삭제합니다.
path: 삭제할 파일 경로
노드 작업 수행, 출력 생성 안 함

DSCore.IO.FileSystem.CopyFile(System.IO.FileInfo,System.String,System.Boolean)
파일을 복사합니다.
file: 복사할 파일 객체
destinationPath: 대상 파일 경로의 문자열 표현
overwrite: 토글하여 기존 파일 덮어쓰기
노드는 작업을 수행하고 복사 작업에 성공하면 true를 반환합니다.

DSCore.IO.FileSystem.FileExists(System.String)
지정된 경로에 파일이 존재하는지 확인합니다.
path: 파일 경로를 나타내는 문자열
파일이 존재하면 true, 그렇지 않으면 false
filepath

DSCore.IO.FileSystem.WriteText(System.String,System.String)
텍스트 내용을 경로로 지정된 파일에 씁니다
filePath: 쓸 경로
text: 텍스트 내용
출력 없음
write file,text,file,filepath

DSCore.IO.FileSystem.AppendText(System.String,System.String)
텍스트 내용을 경로에 지정된 파일에 추가합니다.
filePath: 쓸 경로
text: 텍스트 내용
노드가 작업을 수행하고 출력을 생성하지 않음
append file,write file,text,file,filepath

DSCore.IO.FileSystem.CombinePath(System.String[])
여러 문자열을 하나의 파일 경로로 결합합니다.
strings: 경로로 결합할 문자열
결합된 파일 경로

DSCore.IO.FileSystem.FileExtension(System.String)
파일 경로에서 확장자를 반환합니다.
path: 확장자를 가져올 경로
파일 확장자

DSCore.IO.FileSystem.ChangePathExtension(System.String,System.String)
파일 경로의 확장자를 변경합니다.
path: 확장자를 변경할 경로
newExtension: 새 확장자의 문자열 표현
확장자가 변경된 파일 경로

DSCore.IO.FileSystem.DirectoryName(System.String)
파일 경로의 디렉토리 이름을 반환합니다.
path: 디렉토리 정보를 가져올 경로
파일 경로의 디렉토리 이름
directorypath

DSCore.IO.FileSystem.FileName(System.String,System.Boolean)
파일 경로의 파일 이름을 반환합니다.
path: 파일 이름을 가져올 경로
withExtension: 토글하여 결과에 확장자 포함
파일 경로의 파일 이름

DSCore.IO.FileSystem.FileHasExtension(System.String)
파일 경로에 확장자가 포함되어 있는지 여부를 확인합니다.
path: 확장자를 확인할 경로
파일 경로에 확장자가 포함되어 있으면 true, 그렇지 않으면 false

DSCore.IO.FileSystem.GetDirectoryContents(System.IO.DirectoryInfo,System.String,System.Boolean)
지정된 디렉토리에 포함된 파일 및 디렉토리의 리스트를 반환합니다. 선택적 searchString을 사용하여 결과를 필터링할 수 있습니다.
directory: 컨텐츠를 가져올 디렉토리
searchString: 결과 필터링에 사용된 검색 문자열
includeSubdirectories: true로 설정하여 하위 디렉토리(재귀)에 파일 및 폴더를 포함하거나 false로 설정하여 지정된 디렉토리의 상단 레벨의 결과만 포함합니다.
조회의 결과 파일
조회 결과 디렉토리

DSCore.IO.FileSystem.CopyDirectory(System.IO.DirectoryInfo,System.String,System.Boolean)
디렉토리를 대상 위치에 복사합니다.
directory: 복사할 디렉토리
destinationPath: 디스크에서의 복사 작업 대상
overwriteFiles: 토글하여 기존 디렉토리 덮어쓰기
노드 작업 수행, 출력 생성 안 함

DSCore.IO.FileSystem.DeleteDirectory(System.String,System.Boolean)
디렉토리를 삭제합니다.
path: 디스크의 디렉토리에 대한 경로
recursive: 디렉토리의 모든 내용을 삭제할 것인지 여부. 기본값은 false입니다.
노드 작업 수행, 출력 생성 안 함

DSCore.IO.FileSystem.DirectoryExists(System.String)
지정된 경로에 디렉토리가 존재하는지 확인합니다.
path: 디스크의 디렉토리에 대한 경로
디렉토리가 존재하면 true, 그렇지 않으면 false
directorypath

DSCore.IO.FileSystem.MoveDirectory(System.String,System.String,System.Boolean)
디렉토리를 새 위치로 이동합니다.
path: 기존 경로의 문자열 표현
newPath: 새 경로의 문자열 표현
overwriteFiles: 토글하여 기존 파일 덮어쓰기
노드 작업 수행, 출력 생성 안 함