DSCore.DateTime
특정 날짜 및 시간을 나타내는 객체.

DSCore.DateTime.MinValue
표현할 수 있는 최초의 날짜 및 시간.
가능한 최소 DateTime 표현

DSCore.DateTime.MaxValue
표현할 수 있는 최신 날짜 및 시간.
가능한 최대 DateTime 표현

DSCore.DateTime.Now
현재 시스템 날짜 및 시간.
현재 시간을 표현하는 DateTime

DSCore.DateTime.Today
현재 시스템 날짜(시간은 자정으로 설정됨).
오늘을 표현하는 DateTime

DSCore.DateTime.Format(System.DateTime,System.String)
지정된 날짜 및 시간을 지정된 형식의 문자열로 반환합니다.
dateTime: 형식 지정할 DateTime
format: 날짜 형식의 문자열 표현입니다. InvariantCulture를 사용하며 이는 사용자의 운영 체제 언어와 무관하게 결과물을 출력합니다.
기본값인 표준 형식 "F" : "화요일, 21 2월 2017 23:02:43"
형식 지정자 전체 리스트를 확인하려면"MSDN 사용자 지정 날짜 및 시간 형식 문자열"를 검색해 보십시오.
문자열로 표현된 DateTime

DSCore.DateTime.ByDate(System.Int32,System.Int32,System.Int32)
정확한 날짜에 새 DateTime을 만듭니다.
year: 정확한 연도(1-9999)
month: 정확한 월(1-12)
day: 정확한 일(1-[달의 일 수])
날짜에서 작성된 DateTime

DSCore.DateTime.ByDateAndTime(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
정확한 날짜와 시간에 새 DateTime을 만듭니다.
year: 정확한 연도(1-9999)
month: 정확한 월(1-12)
day: 정확한 일(1-[달의 일 수])
hour: 정확한 시간(0-23)
minute: 정확한 분(0-59)
second: 정확한 초(0-59)
millisecond: 정확한 밀리초(0-999)
날짜 및 시간에서 작성된 DateTime

DSCore.DateTime.SubtractTimeSpan(System.DateTime,System.TimeSpan)
DateTime에서 TimeSpan을 빼서 새 DateTime을 생성합니다.
dateTime: 시작 DateTime
timeSpan: 뺄 시간
뺀 DateTime

DSCore.DateTime.AddTimeSpan(System.DateTime,System.TimeSpan)
DateTime에 TimeSpan을 추가하여 새 DateTime을 생성합니다.
dateTime: 시작 DateTime
timeSpan: DateTime에 추가할 시간
시간 간격 추가에 따른 결과 DateTime

DSCore.DateTime.DaysInMonth(System.Int32,System.Int32)
지정된 연도의 지정된 달의 일 수를 계산합니다.
year: 정확한 연도(1-9999)
month: 정확한 월(1-12)
월 일수

DSCore.DateTime.IsDaylightSavingsTime(System.DateTime)
지정된 DateTime에 일광 절약 시간인지 여부를 확인합니다.
dateTime: 일광 절약 시간 여부를 확인하는 데 사용되는 DateTime
DateTime이 일광 절약 시간이면 true, 그렇지 않으면 false

DSCore.DateTime.IsLeapYear(System.Int32)
지정된 연도가 윤년인지 여부를 확인합니다.
year: 정확한 연도(1-9999)
연도가 윤년이면 true, 그렇지 않으면 false

DSCore.DateTime.FromString(System.String)
문자열에서 DateTime 구문 분석 시도
string: DateTime의 문자열 표현
구문 분석된 문자열 DateTime

DSCore.DateTime.Date(System.DateTime)
DateTime에서 날짜만 추출합니다. 시간 구성요소는 0으로 설정됩니다.
dateTime: DateTime.
DateTime의 날짜
Date

DSCore.DateTime.Components(System.DateTime)
DateTime의 개별 구성요소를 추출합니다.
dateTime: 구성요소를 가져올 DateTime
연도의 숫자 표현(1-9999)
월의 숫자 표현(1-12)
날짜의 숫자 표현(1-[월의 일수])
시간의 숫자 표현(0-23)
분의 숫자 표현(0-59)
초의 숫자 표현(0-59)
밀리초의 숫자 표현(0-999)

DSCore.DateTime.DayOfWeek(System.DateTime)
지정된 DateTime에서 요일을 반환합니다.
dateTime: 요일을 가져올 DateTime 객체
요일

DSCore.DateTime.DayOfYear(System.DateTime)
연도 중 날짜(0-366)를 반환합니다
dateTime: 연도 중 날짜를 가져올 DateTime
연도 시작일로부터의 일수

DSCore.DateTime.TimeOfDay(System.DateTime)
지정된 DateTime의 자정 이후 경과한 시간을 나타내는 새 TimeSpan을 생성합니다.
dateTime: DateTime.
자정 이후의 TimeSpan