DSCore.CurveMapper.PerlinNoiseCurve
CurveMapper의 펄린 노이즈 곡선을 나타냅니다.
이 곡선은 제어점 및 펄린 노이즈 함수를 기준으로 절차적 노이즈를 생성합니다.

DSCore.CurveMapper.PerlinNoiseCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
곡선을 따라 분배된 X 및 Y 값을 반환합니다.