DSCore.CurveMapper.SineWave
CurveMapper의 사인파 곡선을 나타냅니다.
사인파는 두 제어점으로 정의되며 삼각 함수를 따릅니다.

DSCore.CurveMapper.SineWave.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
곡선을 따라 분배된 X 및 Y 값을 반환합니다.