DSCore.ColorRange1D.ByColorsAndParameters(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double})
색상과 매개변수의 리스트를 제공하여 ColorRange1D를 작성합니다.
colors: 색상 리스트.
parameters: 0.0과 1.0 사이의 매개변수 리스트.
Returns: ColorRange1D 객체.

DSCore.ColorRange1D.GetColorAtParameter(DSCore.ColorRange1D,System.Double)
지정된 매개변수의 해당 색상 범위에서 색상을 반환합니다.
parameter: 0.0과 1.0 사이의 값.
Returns: Color.

DSCore.ColorRange1D.Default
기본 색상 구성표를 사용하여 ColorRange1D를 작성합니다.