DSCore.TimeSpan
경과된 기간을 나타내는 객체(특정한 시작 또는 종료 날짜 없음).

DSCore.TimeSpan.ByDateDifference(System.DateTime,System.DateTime)
두 DateTime 간 시간 간격에서 계산된 새 TimeSpan 산출
dateTime: 뺄 DateTime
otherDateTime: 뺄 DateTime
두 날짜 간 TimeSpan 간격

DSCore.TimeSpan.Zero
경과 시간 0을 나타내는 TimeSpan.
경과 시간 0을 나타내는 TimeSpan

DSCore.TimeSpan.MaxValue
표시할 수 있는 최대 TimeSpan.
가능한 최대 TimeSpan 표현

DSCore.TimeSpan.MinValue
표시할 수 있는 최소 TimeSpan.
가능한 최소 TimeSpan 표현

DSCore.TimeSpan.Create(System.Double,System.Double,System.Double,System.Double,System.Double)
시간 간격에서 새 TimeSpan을 만듭니다.
days: 날짜 간격.
hours: 시간 간격.
minutes: 분 간격.
seconds: 초 간격.
milliseconds: 밀리초 간격.
TimeSpan 작성됨

DSCore.TimeSpan.Scale(System.TimeSpan,System.Double)
TimeSpan에 배율 인수 곱하기
timeSpan: 곱할 TimeSpan
scaleFactor: TimeSpan의 축척 비율. 예를 들어, 축척 비율이 2이면 시간 간격이 두 배가 됩니다.
TimeSpan 제품

DSCore.TimeSpan.Negate(System.TimeSpan)
TimeSpan 부정
timeSpan: 부정할 TimeSpan
음수 TimeSpan

DSCore.TimeSpan.Add(System.TimeSpan,System.TimeSpan)
두 TimeSpan 더하기
timeSpan1: 더할 TimeSpan
timeSpan2: 더할 다른 TimeSpan
더한 결과 TimeSpan

DSCore.TimeSpan.Subtract(System.TimeSpan,System.TimeSpan)
두 TimeSpan 빼기
timeSpan1: 뺄 TimeSpan
timeSpan2: 뺄 TimeSpan
뺀 결과 TimeSpan

DSCore.TimeSpan.FromString(System.String)
문자열에서 TimeSpan 구문 분석 시도
string: TimeSpan의 문자열 표현.
구문 분석된 문자열의 TimeSpan

DSCore.TimeSpan.Components(System.TimeSpan)
TimeSpan의 개별 구성요소를 추출합니다.
timeSpan: 구성요소를 가져올 TimeSpan
일수(정수 입력)
시간(정수 입력)
분(정수 입력)
초(정수 입력)
밀리초(정수 입력)

DSCore.TimeSpan.TotalDays(System.TimeSpan)
TimeSpan이 나타내는 총 시간을 부정확한 기간(일)으로 변환합니다.
timeSpan: 총 일수를 조회할 TimeSpan
총 일수

DSCore.TimeSpan.TotalHours(System.TimeSpan)
TimeSpan이 나타내는 총 시간을 부정확한 기간(시간)으로 변환합니다.
timeSpan: 총 시간을 조회할 TimeSpan
총 시간(시)

DSCore.TimeSpan.TotalMinutes(System.TimeSpan)
TimeSpan이 나타내는 총 시간을 부정확한 기간(분)으로 변환합니다.
timeSpan: 총 시간(분)을 조회할 TimeSpan
총 시간(분)

DSCore.TimeSpan.TotalSeconds(System.TimeSpan)
TimeSpan이 나타내는 총 시간을 부정확한 기간(초)으로 변환합니다.
timeSpan: 총 시간(초)을 조회할 TimeSpan
총 시간(초)

DSCore.TimeSpan.TotalMilliseconds(System.TimeSpan)
TimeSpan이 나타내는 총 시간을 부정확한 기간(밀리초)으로 변환합니다.
timeSpan: 밀리초를 조회할 TimeSpan
총 시간(밀리초)