DSCore.Math
수학적 연산 수행 방법.

DSCore.Math.Random(System.Nullable{System.Int32})
[0, 1) 범위의 난수(double 값)를 생성합니다.
seed: 난수 생성기의 시드 값.
0과 1 사이의 난수.
random,seed

DSCore.Math.Random(System.Double,System.Double)
[lower_number, higher_number) 범위의 난수를 생성합니다.
value1: 난수 범위의 하한
value2: 난수 범위의 상한
[lower_number, higher_number) 범위의 난수
random,numberrange

DSCore.Math.Random(System.Double,System.Double,System.Int32)
초기 시드 값을 기준으로 [lower_number, higher_number) 범위의 난수를 생성합니다.
value1: 난수 범위의 하한
value2: 난수 범위의 상한
seed: 난수 생성기의 시드 값
[lower_number, higher_number) 범위의 난수
random,numberrange,seed

DSCore.Math.RandomList(System.Int32)
[0, 1) 범위의 난수(double 값)가 지정된 수만큼 포함된
리스트를 생성합니다.
amount: 결과 리스트에 포함될 난수의 수.
0과 1 사이의 난수 리스트.
random,listcontains

DSCore.Math.RandomList(System.Int32,System.Double,System.Double,System.Int32)
초기 시드 값을 기준으로 정의된 [lower_number, higher_number) 범위의
지정된 임의 배정도 양을 포함하는 리스트를 생성합니다.
amount: 결과 리스트에 포함될 난수의 수.
value1: 난수 범위의 하한
value2: 난수 범위의 상한
seed: 난수 생성기의 시드 값
[lower_number, higher_number) 범위의 난수 리스트
random,listcontains,seed

DSCore.Math.PiTimes2
파이 상수 x 2
2 x 파이.
2pi,2*pi,twopi,two*pi

DSCore.Math.Average(System.Collections.Generic.IList{System.Double})
숫자 리스트의 평균을 계산합니다.
numbers: 평균을 계산할 숫자의 리스트.
숫자 리스트의 평균.
avg,mean

DSCore.Math.Map(System.Double,System.Double,System.Double)
입력 범위를 기준으로 입력 값을 0과 1 사이의 숫자로 매핑합니다.
rangeMin: 입력 범위의 최소값입니다.
rangeMax: 입력 범위의 최대값입니다.
inputValue: 매핑할 숫자입니다.
매핑된 값입니다.
map,range,minimum,maximum,normalize,scale,remap

DSCore.Math.MapTo(System.Double,System.Double,System.Double,System.Double,System.Double)
입력 값을 targetRangeMin과 targetRangeMax 사이의 숫자로 매핑합니다.
rangeMin: 입력 범위의 최소값입니다.
rangeMax: 입력 범위의 최대값입니다.
inputValue: 매핑할 숫자입니다.
targetRangeMin: 새 범위의 최소값입니다.
targetRangeMax: 새 범위의 최대값입니다.
매핑된 값입니다.
map,range,mapto,minimum,maximum,normalize,scale,remap

DSCore.Math.RemapRange(System.Collections.Generic.IList{System.Double},System.Double,System.Double)
분포 비율을 유지하면서 숫자 리스트의 범위를 조정합니다.
numbers: 범위를 조정할 숫자의 리스트.
newMin: 범위의 새 최소값.
newMax: 범위의 새 최대값
새 범위로 다시 매핑된 리스트.
remap range

DSCore.Math.kRadiansToDegrees
함수/메서드를 Math.dll에서 이 DSCoreNode.dll로 이동합니다.

DSCore.Math.PI
수학적 상수 파이, 3.14159...
상수 파이
3.141592653589793

DSCore.Math.E
수학적 상수 e, 2.71828...
상수 e
exp,2.718281828459045

DSCore.Math.GoldenRatio
황금비, (1 + sqrt(5))/2 = 1.61803...
황금비
golden,ratio,divine,phi,tau,1.61803398875

DSCore.Math.RadiansToDegrees(System.Double)
라디안 각도를 도 각도로 변환합니다.
radians: 라디안 각도.
도 각도.
radians,degrees,angle

DSCore.Math.DegreesToRadians(System.Double)
도 각도를 라디안 각도로 변환합니다.
degrees: 도 각도.
라디안 각도.
degrees,radians,angle

DSCore.Math.Abs(System.Double)
숫자의 절대값을 계산합니다.
number: 절대값을 가져올 숫자
숫자의 절대값
absolute value,magnitude

DSCore.Math.Equals(System.Double,System.Double,System.Double)
이 방법은 허용치가 설정된 같음 NodeMode 노드에서만 사용됩니다.

DSCore.Math.Abs(System.Int64)
숫자의 절대값을 계산합니다.
integer: 숫자.
숫자의 절대값.
absolute value,magnitude

DSCore.Math.Acos(System.Double)
역코사인을 계산합니다(코사인이 지정된 비율인 각도).
ratio: 각도의 코사인([-1, 1] 범위의 숫자).
코사인이 입력 비율인 각도.
acosine,arccosine

DSCore.Math.Asin(System.Double)
역사인을 계산합니다(사인이 지정된 비율인 각도).
ratio: 각도의 사인([-1, 1] 범위의 숫자).
사인이 입력 비율인 각도
asine,arcsin

DSCore.Math.Atan(System.Double)
역탄젠트를 계산합니다(탄젠트가 지정된 비율인 각도).
ratio: 각도의 탄젠트.
탄젠트가 입력 비율인 각도
atangent,arctangent

DSCore.Math.Atan2(System.Double,System.Double)
두 숫자의 몫의 역탄젠트를 계산합니다. 탄젠트가 분자/분모 비율인
각도를 반환합니다.
numerator: 각도의 탄젠트의 분자.
denominator: 각도의 탄젠트의 분모.
탄젠트가 분자/분모인 각도
atangent,arctangent

DSCore.Math.Ceiling(System.Double)
지정된 숫자보다 큰 첫 번째 정수를 반환합니다
number: 반올림할 숫자.
지정된 숫자보다 큰 첫 번째 정수
ceiling,round

DSCore.Math.Cos(System.Double)
각도의 코사인을 계산합니다.
angle: 코사인을 계산할 각도(도).
각도의 코사인
cosine

DSCore.Math.Cosh(System.Double)
각도(라디안)의 쌍곡선 코사인을 계산합니다.
angle: 라디안 각도.
각도의 쌍곡선 코사인
hyperbolic cosine

DSCore.Math.DivRem(System.Int64,System.Int64)
피제수/제수의 나머지를 계산합니다.
dividend: 피제수.
divisor: 제수.
나눗셈의 나머지
remainder

DSCore.Math.EvaluateFormula(System.String,System.String[],System.Object[])
지정된 매개변수 매핑을 사용하여 NCalc 수식을 평가합니다.
formulaString: NCalc 수식
parameters: 변수 이름
arguments: 변수 바인딩
유형: var[]..[](수식 계산 결과)

DSCore.Math.Exp(System.Double)
숫자의 지수를 반환합니다(상수 e의 제곱수).
number: 숫자.
숫자의 지수.
exponential

DSCore.Math.Floor(System.Double)
지정된 숫자보다 작은 첫 번째 정수를 반환합니다.
number: 반내림할 숫자
지정된 숫자보다 작은 첫 번째 정수
round

DSCore.Math.Log(System.Double)
(0, ∞) 범위에 있는 숫자의 자연 로그를 계산합니다.
number: 0보다 큰 숫자.
숫자의 자연 로그.
natural,logarithm,ln

DSCore.Math.Log(System.Double,System.Double)
지정된 밑을 사용하여 숫자의 로그를 계산합니다.
number: 0보다 큰 숫자.
logBase: [0,1),(1, ∞) 범위의 로그의 밑.
숫자의 로그.
logarithm,ld,lg

DSCore.Math.Log10(System.Double)
숫자의 상용 로그를 계산합니다.
number: 0보다 큰 숫자.
숫자의 로그.
logarithm

DSCore.Math.Max(System.Double,System.Double)
두 숫자 중 큰 숫자를 반환합니다.
value1: 비교할 숫자.
value2: 비교할 숫자.
두 숫자 중 큰 숫자.
maximum,greater,larger

DSCore.Math.Max(System.Int64,System.Int64)
두 숫자 중 큰 숫자를 반환합니다.
int1: 비교할 숫자.
int2: 비교할 숫자.
두 숫자 중 큰 숫자.
maximum,greater,larger

DSCore.Math.Min(System.Double,System.Double)
두 숫자 중 작은 숫자를 반환합니다.
value1: 비교할 숫자.
value2: 비교할 숫자.
두 숫자 중 작은 숫자.
minimum,lesser,smaller

DSCore.Math.Min(System.Int64,System.Int64)
두 숫자 중 작은 숫자를 반환합니다.
int1: 비교할 숫자.
int2: 비교할 숫자.
두 숫자 중 작은 숫자.
minimum,lesser,smaller

DSCore.Math.Pow(System.Double,System.Double)
숫자를 지정된 멱 수만큼 제곱합니다.
number: 제곱할 숫자.
power: 숫자를 제곱할 멱 수.
제곱한 숫자.
^,power,raise,exponent

DSCore.Math.Rand
[0, 1) 범위의 난수를 생성합니다.
[0, 1) 범위의 난수.
random,numberrange

DSCore.Math.Round(System.Double)
숫자를 가장 가까운 정수 값으로 반올림합니다.
참고로 이 방법은 정수 유형 대신 배정밀도 부동 소수점 수로 반환합니다.
number: 반올림할 숫자.
해당 숫자와 가까운 정수 값입니다.

DSCore.Math.Round(System.Double,System.Int32)
숫자를 지정된 소수 자릿수로 반올림합니다.
number: 반올림할 숫자
digits: 반환 값에 대한 소수 자릿수
자릿수와 동일한 소수 자릿수를 포함하는 값과 가장 가까운 숫자

DSCore.Math.Sign(System.Double)
숫자의 부호를 반환합니다(-1, 0, 1).
number: 부호를 가져올 숫자
숫자의 부호: -1, 0 또는 1

DSCore.Math.Sign(System.Int64)
숫자의 부호를 반환합니다(-1, 0, 1).
int: 부호를 가져올 정수
숫자의 부호: -1, 0 또는 1

DSCore.Math.Sin(System.Double)
각도의 사인을 계산합니다.
angle: 사인을 계산할 각도(도)입니다.
각도의 사인.
sine

DSCore.Math.Sinh(System.Double)
각도(라디안)의 쌍곡선 사인을 계산합니다.
angle: 라디안 각도.
각도의 쌍곡선 사인.
hyperbolic

DSCore.Math.Sqrt(System.Double)
[0, ∞) 범위 숫자의 양의 제곱근을 계산합니다.
number: [0, ∞) 범위의 숫자.
숫자의 양의 제곱근.
square,root,radical

DSCore.Math.Tan(System.Double)
각도의 탄젠트를 계산합니다.
angle: 라디안 각도
각도의 탄젠트
tangent

DSCore.Math.Tanh(System.Double)
각도(라디안)의 쌍곡선 탄젠트를 계산합니다.
angle: 라디안 각도
각도의 쌍곡선 탄젠트
hyperbolic,tanh

DSCore.Math.Sum(System.Collections.Generic.IEnumerable{System.Double})
숫자의 합계를 계산합니다
values: 합계를 더할 숫자
값의 합계
mass addition,massadd

DSCore.Math.Factorial(System.Int64)
양의 정수의 계승을 계산합니다.
number: 양의 정수
정수의 계승.
!

DSCore.Math.Xor(System.Boolean,System.Boolean)
부울 XOR: 정확히 하나의 입력이 true인 경우에만 true를 반환합니다.
bool: 부울
otherBool: 기타 부울
부울 결과
xor,exclusive,or

DSCore.Math.DoCheckedCast(System.Double)
선택한 컨텍스트에서 오래 캐스트할 수 있도록 투사를 수행합니다. 작업에서 오버플로우가 발생하면 경고가 생성되고 오버플로 처리된 결과가 반환됩니다.
value: 수행할 작업
Returns: 작업의 결과