DSCore.Data.ParseJSON(System.String)
Parse는 임의의 JSON 문자열을 값으로 변환합니다. 이는 JSON.Stringify의 반대 작업입니다.
json: JSON 문자열
결과 유형은 입력 문자열의 내용에 따라 달라집니다. 결과 유형은 원형 값(예: 문자열, 부울, 이중), 리스트 또는 사전이 될 수 있습니다.

DSCore.Data.ToNative(Newtonsoft.Json.Linq.JToken)
JToken 유형을 네이티브 .NET 객체로 변환하기 위한 구문 분석 구현입니다.
token: N으로 구문 분석할 JToken

DSCore.Data.DynamoJObjectToNative(Newtonsoft.Json.Linq.JObject)
JObject 유형을 특정 Dynamo 객체(예: 형상, 색상, 이미지 등)로 변환하기 위한 구문 분석 구현입니다.
Throws System.Exception:

DSCore.Data.StringifyJSON(System.Object)
Stringify는 임의 값이나 임의 값 리스트를 JSON으로 변환합니다. 리스트에 작업을 적용하는 데 복제를 사용할 수 있으며, 사용하면 JSON 문자열 리스트가 생성됩니다.
values: 값 리스트
원형 유형(예: double, 정수, 부울), 리스트 및 사전 값이 연관된 JSON 유형으로 변환되는 JSON 문자열입니다.

DSCore.Data.CanObjectBeCached(System.Object)
객체를 캐시할 수 있는지 또는 객체가 null, "null" 문자열 또는 빈 리스트인지 확인하는 헬퍼 함수입니다.
inputObject: 확인할 객체

DSCore.Data.Remember(System.Object,System.String)
Data.Remember 노드에 대한 캐싱을 처리하는 함수입니다.
inputObject: 캐시할 오브젝트
cachedJson: 선택적 기존 캐시 json

DSCore.Data.DataNodeDynamoTypeList
Dynamo에서 지원하는 모든 데이터 유형에 대한 정적 리스트
Returns: 지원되는 데이터 유형을 포함하는 리스트

DSCore.Data.#cctor
정적 생성자

DSCore.Data.SafeExtractDictionaryValue(System.Collections.Generic.Dictionary{System.String,System.Object},System.String)
사전 값을 안전하게 추출하기 위한 도우미 함수
dict: 값을 추출할 사전
key: 키/값 쌍의 키

DSCore.Data.EvaluateDefineDataNode(System.Object,System.String,System.Boolean,System.Boolean,System.String)
AST에서 데이터 정의 노드를 평가하는 데 사용하는 함수입니다.
유효성 검사를 수행하는 동안 노드 논리의 일부를 처리합니다
inputValue: 업스트림 입력 값
typeString: 유형을 문자열로(할 일: 유형을 직접 비교하기 위해 'Type' 유형의 객체를 전달하는 것이 더 좋음)
isList: 입력이 `ArrayList` 유형인 경우
isAutoMode: 노드가 Auto 모드인 경우
playerValue: Dynamo 플레이어에서 노드로 주입된 값(있는 경우)

DSCore.Data.FindCommonAncestor(System.Collections.ArrayList)
AutoMode에서 객체의 ArrayList가 전달된 경우 유형을 찾는 데 도움이 되는 함수입니다.
list: ArrayList 유형이 될 것으로 보이는 입력 값

DSCore.Data.LikelyAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
DataNodeDynamoType 노드 리스트에서 가장 낮은 레벨의 노드를 반환하는 도우미 함수입니다.
nodes: 평가할 DataNodeDynamoType의 리스트

DSCore.Data.FindClosestCommonAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
데이터 유형의 리스트에서 공통 조상을 확인하려는 도우미 함수입니다.
nodes: 평가할 DataType 노드의 리스트

DSCore.Data.FindCommonAncestorBetweenTwoNodes(DSCore.Data.DataNodeDynamoType,DSCore.Data.DataNodeDynamoType)
두 개의 Dynamo 유형 간의 공통 조상을 찾아보는 재귀 함수입니다.
가능성이 있는 조상이 될 때까지 계층 트리를 올라갑니다.
node: 이 노드가 가능성이 있는 조상으로부터 파생된 노드인지 확인
likelyAncestor: 노드가 파생될 가능성이 있는 조상

DSCore.Data.GetListFromTypes(System.Collections.ArrayList)
객체의 ArrayList에서 DataNodeDynamoTypes 리스트를 반환합니다.
list: 형식을 다시 지정할 객체의 ArrayList

DSCore.Data.IsSingleValueOrSingleLevelArrayList(System.Object)
입력 객체가 단일 값인지 또는 단일 레벨 ArrayList인지 확인합니다.
obj: 평가할 입력 객체

DSCore.Data.IsSupportedDataNodeDynamoType(System.Object,System.Type,System.Boolean)
지원되는 Dynamo 입력 유형에 대해 입력 유형의 유효성을 검사하는 함수
inputValue: 유효성을 확인할 수신 데이터
type: 사용자가 제공한 입력 유형입니다. inputValue 유형과 일치해야 합니다
isList: 이 부울 값은 입력이 단일 객체인지 리스트인지를 결정합니다

DSCore.Data.IsItemOfType(System.Object,System.Type)
이 메서드는 항목이 필수 Dynamo DataType에 속하는지 확인합니다
'IsInstanceOfType'은 위로 상속되는지 재귀적으로 확인합니다
item: 데이터 유형을 확인할 항목
dataType: 확인할 데이터 유형
Returns: 유효성 검사 확인을 기준으로 참 또는 거짓 결과

DSCore.Data.IsDerivedFrom(System.Type,System.Type)
이 메서드는 유형이 기본 유형으로부터 파생되었는지 여부를 확인합니다.
derivedType: 어설션할 유형
baseType: 비교 대상의 기본 유형