DSCore.IO.Image
이미지 비트맵 사용 방법.

DSCore.IO.Image.ReadFromFile(System.IO.FileInfo)
파일을 비트맵으로 로드합니다.
file: 이미지를 로드할 파일 객체
파일의 이미지 객체

DSCore.IO.Image.Pixels(System.Drawing.Bitmap,System.Nullable{System.Int32},System.Nullable{System.Int32})
이미지 파일을 읽고 지정된 그리드 위치에 색상 값을 반환합니다.
image: 픽셀 색상을 가져올 이미지 객체
xSamples: X 방향의 샘플 그리드 점 수.
ySamples: Y 방향의 샘플 그리드 점 수.
지정된 그리드 점의 색상
read,image,bitmap,png,jpg,jpeg

DSCore.IO.Image.FromPixels(DSCore.Color[][])
픽셀의 2D 리스트에서 이미지를 구성합니다.
colors: 픽셀을 나타내는 색상의 2D 직사각형 리스트
픽셀의 2D 리스트의 이미지

DSCore.IO.Image.FromPixels(DSCore.Color[],System.Int32,System.Int32)
픽셀. 폭 및 높이의 단순 리스트에서 이미지를 구성합니다.
colors: 픽셀을 나타내는 색상 리스트
width: 새 이미지의 폭(픽셀)
height: 새 이미지의 높이(픽셀)
픽셀 리스트의 이미지

DSCore.IO.Image.Dimensions(System.Drawing.Bitmap)
이미지의 폭 및 높이를 반환합니다.
image: 치수를 가져올 이미지.
픽셀 단위의 이미지 폭
픽셀 단위의 이미지 높이

DSCore.IO.Image.WriteToFile(System.String,System.Drawing.Bitmap)
이미지를 지정된 파일 이름으로 경로에 씁니다.
image: 쓸 이미지
이미지 객체를 작성함
write image,image,file,filepath