DSCore.ColorRange.ByColorsAndParameters(System.Collections.Generic.IList{DSCore.Color},System.Collections.Generic.IList{Autodesk.DesignScript.Geometry.UV})
UV 및 색상 리스트를 제공하여 ColorRange를 작성합니다.
colors: 색상 리스트.
parameters: (0.0,0.0)에서 (1.0,1.0) 사이의 매개변수 리스트.
Returns: ColorRange 객체.

DSCore.ColorRange.GetColorAtParameter(Autodesk.DesignScript.Geometry.UV)
지정된 매개변수의 해당 색상 범위에서 색상을 반환합니다.
parameter: (0.0,0.0)에서 (1.0,1.0) 사이의 UV.
Returns: 색상.