DSCore.String
문자열 관리 방법.

DSCore.String.ToNumber(System.String)
문자열을 정수 또는 double 값으로 변환합니다.
string: 변환할 문자열
정수 또는 double 유형 숫자
2number,str2number,strtonumber,string2number,stringtonumber,int,double,cast

DSCore.String.GetNumber(System.String)
대상 문자열에서 모든 숫자 문자열을 문자열로 가져옵니다.
string: 가져올 대상 문자열
문자열의 숫자
getnumber,tonumber,strtonumber,numberinstring,string2number,stringtonumber,int,double,cast

DSCore.String.Concat(System.String[])
여러 문자열을 하나의 문자열로 연결합니다.
strings: 연결할 문자열 리스트.
문자열 리스트에서 작성된 문자열.
concatenate,join,combine strings

DSCore.String.Length(System.String)
지정된 문자열에 포함된 문자의 수를 반환합니다.
string: 길이를 찾을 문자열
문자열 내 문자의 수
count,size,characters,chars,length,sizeof

DSCore.String.Split(System.String,System.String[])
단일 문자열을 지정된 구분 기호 문자열을 사용하여 문자열
리스트로 구분합니다.
string: 분할할 문자열
separators: 분할의 시작과 끝을 지정하는 문자열(존재하는 경우).
입력 문자열에서 작성된 문자열의 리스트
divide,separator,delimiter,cut,csv,comma,

DSCore.String.Join(System.String,System.String[])
결합되는 각 문자열 사이에 지정된 구분자를 삽입하여, 여러 문자열을
하나의 문자열로 연결합니다.
separator: 결합되는 문자열 사이에 삽입할 문자열.
strings: 단일 문자열로 결합될 문자열.
구분 문자가 포함된 문자열 리스트에서 작성된 문자열.
join,separator,build csv,concat,construct

DSCore.String.ToUpper(System.String)
지정된 문자열의 모든 문자를 대문자로 변환합니다.
string: 대문자로 변환할 문자열
대문자 문자열
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.ToLower(System.String)
지정된 문자열의 모든 문자를 소문자로 변환합니다.
string: 소문자로 변환할 문자열
소문자 문자열
2lowercase,to lowercase,tolowercase,lowercase

DSCore.String.ToTitle(System.String)
지정된 문자열을 제목으로 변환합니다.
str: 제목이 될 문자열
제목 문자열
2titlecase,to titlecase,to title case,totitlecase,titlecase

DSCore.String.ChangeCase(System.String,System.Boolean)
지정된 문자열의 모든 문자를 부울 매개변수를 기준으로
대문자 또는 소문자로 변환합니다.
string: 대문자 또는 소문자로 변환할 문자열.
upper: true면 대문자, false면 소문자로 변환합니다.
대문자 또는 소문자로 변환된 문자열.
2lowercase,to lowercase,tolowercase,lowercase,
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.Substring(System.String,System.Int32,System.Int32)
지정된 문자열에서 하위 문자열을 검색합니다. 하위 문자열은 지정된 문자
위치에서 시작하고 지정된 길이를 가집니다.
string: 하위 문자열을 가져올 문자열
startIndex: 원래 문자열에서 하위 문자열의 시작 문자 위치
length: 하위 문자열의 문자 수
원래 문자열에서 가져온 하위 문자열
subset,get string,part,smaller string

DSCore.String.Contains(System.String,System.String,System.Boolean)
지정된 문자열에 지정된 하위 문자열이 포함되어 있는지 확인합니다.
string: 검색할 문자열
searchFor: 검색할 하위 문자열
ignoreCase: 대소문자 구분 여부
문자열에 하위 문자열이 포함되어 있는지 여부
test,within,in,is in,part of

DSCore.String.CountOccurrences(System.String,System.String,System.Boolean)
지정된 문자열에 하위 문자열이 겹치지 않고 나오는 횟수를 계산합니다.
string: 검색할 문자열
searchFor: 검색할 하위 문자열
ignoreCase: 대소문자 구분 여부
지정된 문자열에 하위 문자열이 겹치지 않고 나오는 횟수
count,substring,count occurrences,numberof,search,find,within

DSCore.String.Replace(System.String,System.String,System.String)
문자열에서 지정된 텍스트가 나오는 모든 경우 다른 텍스트로 대체합니다.
string: 하위 문자열을 대체할 문자열.
searchFor: 대체될 텍스트.
replaceWith: 대체할 텍스트.
대체가 완료된 문자열.
replace,overwrite,override,find and replace

DSCore.String.EndsWith(System.String,System.String,System.Boolean)
지정된 문자열이 지정된 하위 문자열로 끝나는지 확인합니다.
string: 끝 부분을 검색할 문자열
searchFor: 끝 부분에서 검색할 하위 문자열
ignoreCase: 대소문자를 구분하지 않으려면 true, 대소문자를 구분하려면 false
문자열이 하위 문자열로 시작하면 true, 그렇지 않으면 false
test,does end,last,str end,terminated

DSCore.String.StartsWith(System.String,System.String,System.Boolean)
지정된 문자열이 지정된 하위 문자열로 시작하는지 확인합니다.
string: 시작 부분을 검색할 문자열
searchFor: 시작 부분에서 검색할 하위 문자열.
ignoreCase: 대소문자를 구분하지 않으려면 true, 대소문자를 구분하려면 false
문자열이 하위 문자열로 시작하면 true, 그렇지 않으면 false
test,beginswith,start,string start,front

DSCore.String.TrimWhitespace(System.String)
지정된 문자열의 처음과 끝에서 공백을 모두 제거합니다.
string: 자를 문자열.
처음과 끝에서 공백이 제거된 문자열.
trimstring,cleanstring,whitespace,blanks,spaces,string trim

DSCore.String.TrimLeadingWhitespace(System.String)
지정된 문자열의 처음에서 공백을 모두 제거합니다.
string: 자를 문자열.
선행 공백이 제거된 문자열.
trim string,clean string,trim leading whitespaces,string trim

DSCore.String.TrimTrailingWhitespace(System.String)
지정된 문자열의 끝에서 공백을 모두 제거합니다.
string: 자를 문자열.
끝에서 공백이 제거된 문자열.
trim string,clean string,trim trailing whitespaces,string trim

DSCore.String.IndexOf(System.String,System.String,System.Boolean)
문자열 내에서 하위 문자열이 처음 나오는 경우의 0 기반 인덱스를 찾습니다.
인덱스를 찾을 수 없는 경우 -1을 반환합니다.
string: 검색할 문자열
searchFor: 검색할 하위 문자열
ignoreCase: 대소문자 구분 여부
하위 문자열이 처음 나오는 경우의 인덱스 또는 -1(찾을 수 없는 경우)
index of,find substring,where,search

DSCore.String.AllIndicesOf(System.String,System.String,System.Boolean)
하위 문자열이 문자열 내에 나타나는 색인의 리스트를 찾습니다.
string: 검색할 문자열.
searchFor: 검색할 하위 문자열.
ignoreCase: 대소문자 구분 여부.
하위 문자열이 발견된 색인의 리스트(유형: int[])
all indices of,find substring,where,search

DSCore.String.LastIndexOf(System.String,System.String,System.Boolean)
문자열 내에서 하위 문자열이 마지막으로 나오는 경우의 0 기반 인덱스를 찾습니다.
인덱스를 찾을 수 없는 경우 -1을 반환합니다.
string: 검색할 문자열.
searchFor: 검색할 하위 문자열.
ignoreCase: 대소문자 구분 여부.
하위 문자열이 마지막으로 나오는 경우의 인덱스 또는 -1(찾을 수 없는 경우).
last index of,find substring,where,search

DSCore.String.PadLeft(System.String,System.Int32,System.String)
지정된 문자열의 문자를 지정된 총 길이가 되도록 왼쪽에 공백을 채워
오른쪽 정렬합니다.
string: 채울 문자열
newLength: 문자를 채운 후 문자열의 총 길이
padChars: 채울 문자, 기본값은 공백입니다.
지정된 총 길이가 되도록 선행 공백을 채워 오른쪽 정렬한 문자열.
pad left,right align,right-align,pad,string space,whitespace

DSCore.String.PadRight(System.String,System.Int32,System.String)
지정된 문자열의 문자를 지정된 총 길이가 되도록 오른쪽에 공백을 채워
왼쪽 정렬합니다.
string: 채울 문자열
newLength: 문자를 채운 후 문자열의 총 길이
padChars: 채울 문자, 기본값은 공백입니다.
지정된 총 길이가 되도록 후행 공백을 채워 왼쪽 정렬한 문자열
pad right,left align,left-align,pad string space,whitespace

DSCore.String.Center(System.String,System.Int32,System.String)
원래 문자의 양쪽에 공백을 넣어 문자열의 폭을 늘립니다.
string: 중앙에 놓을 문자열
newLength: 중앙에 놓은 후 문자열의 총 길이
padChars: 양쪽에 넣을 문자. 기본값은 공백입니다.
지정된 총 길이가 되도록 선행 및 후행 공백을 채워
가운데 정렬한 문자열.
center align,center-align,centered,whitespace,expand string,surround

DSCore.String.Insert(System.String,System.Int32,System.String)
문자열을 지정된 인덱스의 다른 문자열에 삽입합니다.
string: 삽입할 문자열.
index: 인덱스 위치.
toInsert: 삽입할 문자열.
하위 문자열이 삽입된 문자열.
insertstring,insert string

DSCore.String.Remove(System.String,System.Int32,System.Nullable{System.Int32})
문자열에서 문자를 제거합니다.
string: 문자를 제거할 문자열.
startIndex: 제거를 시작할 위치의 인덱스.
count: 제거할 문자 수,
주: 개수가 음수이면 제거 프로세스는 오른쪽에서 왼쪽으로 진행됩니다.
문자가 제거된 문자열.
delete,rem,shorten