DSCore.Object
모든 데이터에 적용되는 일반 함수.

DSCore.Object.IsNull(System.Object)
지정된 객체가 null인지 확인합니다.
object: 테스트할 객체.
객체가 null인지 여부.
is null

DSCore.Object.Identity(System.Object)
전달된 값을 반환하며 아무 것도 하지 않습니다.
object: 객체.
동일한 객체

DSCore.Object.Type(System.Object)
문자열로 표현된 객체 유형을 반환합니다.
object: 유형을 조회할 객체
Returns: 객체 유형.