DSCore.Quadtree.ByUVs(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.UV})
(0,0)->(1,1) 도메인을 포함하는 Quadtree를 구성합니다.
uvs: (0,0)->(1,1) 도메인 내 UV 집합.
Returns: Quadtree 객체.

DSCore.Quadtree.FindPointsWithinRadius(Autodesk.DesignScript.Geometry.UV,System.Double)
지정된 UV 위치의 반지름 내 쿼드트리에서 모든 쿼드트리 점(UV)을 찾습니다.
center: 검색 영역 중심의 UV.
radius: 검색 영역의 반지름.
Returns: UV 리스트.