DSCore.Color.Red
색상의 빨간색 구성요소를 찾습니다(0-255).
RGB 색상 모델의 빨간색 값, 0에서 255 사이의 정수.

DSCore.Color.Green
색상의 녹색 구성요소를 찾습니다(0-255).
RGB 색상 모델의 녹색 값, 0에서 255 사이의 정수.

DSCore.Color.Blue
색상의 파란색 구성요소를 찾습니다(0-255).
RGB 색상 모델의 파란색 값, 0에서 255 사이의 정수.

DSCore.Color.Alpha
색상의 알파 구성요소를 찾습니다(0-255).
알파 값, 0에서 255 사이의 정수.

DSCore.Color.ByARGB(System.Int32,System.Int32,System.Int32,System.Int32)
알파, 빨간색, 녹색, 파란색 구성요소로 색상을 구성합니다.
alpha: 알파 값(0에서 255 사이)
red: RGB 색상 모델의 빨간색 값(0에서 255 사이)
green: RGB 색상 모델의 녹색 값(0에서 255 사이)
blue: RGB 색상 모델의 파란색 값(0에서 255 사이)
ARGB에서 작성된 색상
color

DSCore.Color.Brightness(DSCore.Color)
이 색상의 밝기 값을 반환합니다.
color: 밝기를 조회할 색상
밝기 값(0에서 1 사이)

DSCore.Color.Saturation(DSCore.Color)
이 색상의 채도 값을 반환합니다.
0에서 1 사이의 double인 채도 값.

DSCore.Color.Hue(DSCore.Color)
이 색상의 색조 값을 반환합니다.
color: 색상 객체
색상의 색조 값, 0에서 1 사이의 double.
hues

DSCore.Color.Components(DSCore.Color)
색상의 구성요소를 알파, 빨간색, 녹색, 파란색의 순서로 나열합니다.
color: 색상 객체
알파 값, 0에서 255 사이의 정수.
RGB 색상 모델의 빨간색 값, 0에서 255 사이의 정수.
RGB 색상 모델의 녹색 값, 0에서 255 사이의 정수.
RGB 색상 모델의 파란색 값, 0에서 255 사이의 정수.
alpha,red,green,blue

DSCore.Color.BuildColorFrom1DRange(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double},System.Double)
시작 색상과 끝 색상 간의 색상 그라데이션에서 색상을 반환합니다.
parameters: 색상을 샘플링하려는 범위의 0과 1 사이의 값.
지정된 범위의 색상.
color,range,gradient

DSCore.Color.Lerp(DSCore.Color,DSCore.Color,System.Double)
두 색상 사이에서 선형으로 보간합니다.
start: 시작 색상.
end: 끝 색상.
t: 0.0과 1.0 사이의 매개변수.
Returns: 보간된 색상 또는 흰색.

DSCore.Color.Blerp(System.Collections.Generic.IList{DSCore.Color.IndexedColor2D},Autodesk.DesignScript.Geometry.UV)
색상 집합 사이에서 이중 선형으로 보간합니다.
Returns: 보간된 색상 또는 흰색.
This algorithm is not the same as the solution found from wikipedia
(reference: https://en.wikipedia.org/wiki/Bilinear_interpolation)

DSCore.Color.Add(DSCore.Color,DSCore.Color)
두 개의 기존 색상의 ARGB 값을 결합하여 색상을 구성합니다.
color: 추가할 색상
otherColor: 추가할 다른 색상
두 색상을 추가한 색상 결과

DSCore.Color.Multiply(DSCore.Color,System.Double)
입력 색상에 숫자 승수를 곱하여 더 어두운 색상을 만들 수 있습니다. 입력 색상의 알파 값은 255보다 작아야 합니다.
color: 곱할 색상
multiplier: 승수 값
곱한 색상 결과

DSCore.Color.Divide(DSCore.Color,System.Double)
입력 색상을 숫자 제수로 나누어 더 밝은 색상을 만들고 색상 색조를 제거할 수 있습니다.
color: 분할할 색상
dividend: 분할 값
분할한 색상 결과