DSCore.Data.DataNodeDynamoType
Dynamo에서 지원하는 DataType을 나타내는 클래스

DSCore.Data.DataNodeDynamoType.#ctor(System.Type,System.String,System.String)
Dynamo에서 지원하는 DataType을 나타내는 클래스

DSCore.Data.DataNodeDynamoType.Type
기본 Type

DSCore.Data.DataNodeDynamoType.Name
Type 이름을 재지정할 선택적 Name(`long` 대신 Number`)

DSCore.Data.DataNodeDynamoType.TypeId
와이어 형식 $typeid(예: "autodesk.math:point3d-1.0.0").
$typeid 직렬화를 사용하지 않는' 기본체 유형의 경우 null.

DSCore.Data.DataNodeDynamoType.Level
UI에 표시할 계층 레벨

DSCore.Data.DataNodeDynamoType.IsLastChild
유형이 계층의 마지막 하위인 경우(UI 용도)

DSCore.Data.DataNodeDynamoType.Parent
유형의 상위(있는 경우)