DSCore.Compare
비교 방법.

DSCore.Compare.GreaterThan(System.Object,System.Object)
a가 b보다 큰 경우 true를 반환합니다.
a: 비교 가능한 객체.
b: 비교 가능한 객체.
부울 결과.
larger,bigger

DSCore.Compare.GreaterThanOrEqual(System.Object,System.Object)
a가 b보다 크거나 같은 경우 true를 반환합니다.
a: 비교 가능한 객체.
b: 비교 가능한 객체.
부울 결과.
larger,bigger,equal

DSCore.Compare.LessThan(System.Object,System.Object)
a가 b보다 작은 경우 true를 반환합니다.
a: 비교 가능한 객체.
b: 비교 가능한 객체.
부울 결과.
less,smaller

DSCore.Compare.LessThanOrEqual(System.Object,System.Object)
a가 b보다 작거나 같은 경우 true를 반환합니다.
a: 비교 가능한 객체.
b: 비교 가능한 객체.
부울 결과.
smaller,equal