DSCore.CurveMapper.CurveBase
CurveMapper의 모든 곡선 유형에 대한 기본 클래스를 나타냅니다.
곡선 값을 생성하고 검색하는 데 사용할 수 있는 일반적인 기능을 제공합니다.

DSCore.CurveMapper.CurveBase.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
파생 클래스에서 곡선 값을 생성하기 위해 구현해야 하는 추상 메서드입니다.

DSCore.CurveMapper.CurveBase.GetCurveXValues(System.Collections.Generic.List{System.Double},System.Boolean)
X 값을 검색하는 일반적인 메서드입니다.

DSCore.CurveMapper.CurveBase.GetCurveYValues(System.Collections.Generic.List{System.Double},System.Boolean)
Y 값을 검색하는 일반적인 메서드입니다.

DSCore.CurveMapper.CurveBase.GenerateFromDomain(System.Collections.Generic.List{System.Double},System.Func{System.Double,System.Double})
도메인 입력을 캔버스 공간에 매핑하고 곡선 함수를 계산하여 X 및 Y 값을 생성합니다.