DSCore.List
리스트 작성 및 조작 방법.

DSCore.List.Empty
빈 리스트를 반환합니다.
빈 리스트.
empty list, emptylist,[]

DSCore.List.UniqueItems(System.Collections.IList)
지정된 리스트의 고유한 항목이 모두 포함된 새 리스트를 만듭니다.
list: 중복 항목을 필터링할 리스트.
필터링된 리스트.
removes,duplicates,remove duplicates,cull duplicates,distinct,listcontains

DSCore.List.Contains(System.Collections.IList,System.Object)
지정된 리스트에 지정된 항목이 포함되어 있는지 확인합니다. 이 기능은 지정된 리스트에 포함된 하위 리스트를 검색합니다.
list: 검색할 리스트
item: 찾을 항목
리스트에 항목이 포함되어 있으면 true, 그렇지 않으면 false
item,search,in,listcontains

DSCore.List.IsHomogeneous(System.Collections.IList)
리스트의 항목이 동일한 유형인지 확인합니다.
list: 동종인 경우 확인할 리스트입니다.
리스트가 동종인지 여부입니다.
homogeneous,allequal,same,type

DSCore.List.IsRectangular(System.Collections.IList)
리스트의 모든 행에 있는 항목 수가 동일한지 확인합니다.
list: 행에 동일한 수의 항목이 있는지 검사할 리스트입니다.
리스트에 있는 모든 행의 항목 수가 동일한지 여부입니다.
rectangular,isrectangular,same,sublist,row

DSCore.List.IsUniformDepth(System.Collections.IList)
리스트에 있는 항목의 깊이가 동일한지 확인합니다.
list: 항목의 깊이가 동일한지 검사할 리스트입니다.
리스트의 깊이가 일정한지 여부입니다.
depth,uniform,isuniformdepth,sublist,jagged

DSCore.List.SetDifference(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
List1의 객체는 포함하지만 List2의 객체는 제외된 새 리스트를 반환합니다.
list1: 새 리스트에 포함할 객체의 리스트
list2: 새 리스트에서 제외할 객체의 리스트
List1의 객체는 포함하나 List2의 객체는 포함하지 않는 새 리스트
difference,setdifference,set

DSCore.List.SetIntersection(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
List1 및 List2 모두에 있는 객체를 포함하는 새 리스트를 반환합니다.
list1: List2와 비교할 객체의 리스트
list2: List1과 비교할 객체의 리스트
List1 및 List2 모두에 있는 객체를 포함하는 새 리스트
intersection,setintersection,set,overlap

DSCore.List.SetUnion(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
List1 또는 List2에 있는 객체를 포함하는 새 리스트를 반환합니다.
list1: 포함할 객체의 리스트
list2: List1에 포함할 객체의 리스트
List1 또는 List2에 있는 객체를 포함하는 새 리스트
union,setunion,set

DSCore.List.IndexOf(System.Collections.IList,System.Object)
지정된 리스트에 있는 요소의 색인을 반환합니다. 지정된 리스트와 대상 요소 간의 일치는 엄격하게 일치해야 합니다(예: 정수와 정수, double과 double, 문자열과 문자열, 객체와 객체 등).
list: 요소를 찾을 리스트입니다.
element: 색인이 반환될 요소입니다.
리스트에 있는 요소의 색인입니다. 엄격한 일치를 찾을 수 없는 경우 유효하지 않은 색인 -1이 반환됩니다.
index,indexof

DSCore.List.CountFalse(System.Collections.IList)
지정된 리스트의 false 부울 값 수를 반환합니다.
list: False 부울 값을 찾을 리스트입니다.
리스트의 False 부울 값 수입니다.
false,count

DSCore.List.CountTrue(System.Collections.IList)
지정된 리스트의 true 부울 값 수를 반환합니다.
list: True 부울 값을 찾을 리스트입니다.
리스트의 True 부울 값 수입니다.
true,count

DSCore.List.Insert(System.Collections.IList,System.Object,System.Int32)
요소를 지정된 색인의 리스트에 삽입합니다.
list: 요소가 삽입될 리스트
element: 삽입될 요소
index: 삽입할 요소 리스트의 위치 지정
요소가 삽입된 리스트
insert,add

DSCore.List.Reorder(System.Collections.IList,System.Collections.IList)
지정된 색인의 리스트를 기준으로 입력 리스트를 다시 정렬합니다.
list: 다시 정렬할 리스트
indices: 리스트의 항목을 다시 정렬하는 데 사용되는 색인
다시 정렬된 리스트
reorder,index,indices

DSCore.List.SortIndexByValue(System.Collections.Generic.List{System.Double})
항목별로 리스트를 정렬하고 색인을 반환합니다.
list: 정렬될 항목의 리스트
정렬한 리스트에 있는 항목의 색인
sort,index,value

DSCore.List.NormalizeDepth(System.Collections.IList,System.Int32)
지정된 순위에 따라 다차원 리스트를 반환합니다.
list: 순위에 따라 깊이가 정규화될 리스트입니다.
rank: 리스트가 정규화될 순위입니다. 기본값은 1입니다.
정규화된 순위를 가진 리스트입니다.
depth,normalize

DSCore.List.Reverse(System.Collections.IList)
지정된 리스트의 항목이 역순으로 포함된 새 리스트를 만듭니다.
list: 반전할 리스트.
반전된 리스트
flip,listcontains

DSCore.List.__Create(System.Collections.IList)
지정된 항목이 포함된 새 리스트를 작성합니다.
items: 새 리스트에 저장될 항목.

DSCore.List.Sublists(System.Collections.IList,System.Collections.IList,System.Int32)
리스트에서 DesignScript 범위 구문을 사용하여 하위 리스트를 작성합니다.
list: 하위 리스트를 작성할 리스트.
ranges: 하위 리스트 요소의 인덱스 범위.
예: \"{0..3,5,2}\"
offset: 하위 리스트에 적용할 간격띄우기.
예: 간격띄우기가 2인 \"0..3\" 범위는 다음과 같은 결과를 생성합니다.
{0,1,2,3}{2,3,4,5}{4,5,6,7}...
유형: var[]..[]
sublists,build sublists,subset,

DSCore.List.Sort(System.Collections.Generic.IEnumerable{System.Object})
내장된 기본 순서를 사용하여 리스트를 정렬합니다.
list: 정렬할 리스트
정렬된 리스트
sort,order,sorted

DSCore.List.MinimumItem(System.Collections.Generic.IEnumerable{System.Object})
리스트에서 최소값을 반환합니다.
list: 최소값을 가져올 비교 가능한 항목의 리스트
리스트의 최소값 항목
least,smallest,find min

DSCore.List.MaximumItem(System.Collections.Generic.IEnumerable{System.Object})
리스트에서 최대값을 반환합니다.
list: 최대값을 가져올 비교 가능한 항목의 리스트
리스트의 최대값 항목
greatest,largest,biggest,find max

DSCore.List.FilterByBoolMask(System.Collections.IList,System.Collections.IList)
별도의 부울 리스트에서 해당하는 인덱스를 조회하여 시퀀스를
필터링합니다.
list: 필터링할 리스트.
mask: 마스크를 나타내는 부울 리스트.
마스크 인덱스가 true인 항목.
마스크 인덱스가 false인 항목.
filter,in,out,mask,dispatch,bool filter,boolfilter,bool filter

DSCore.List.Deconstruct(System.Collections.IList)
지정된 리스트에서 리스트의 첫 번째 항목 및 첫 번째 항목을 제외한 모든
항목이 포함된 새 리스트를 생성합니다.
list: 분할할 리스트.
리스트의 첫 번째 항목(유형: var[]..[])
리스트의 나머지 항목(유형: var[]..[])
first,rest,list split,listcontains

DSCore.List.SortByKey(System.Collections.IList,System.Collections.IList)
키를 기준으로 리스트 정렬
list: 정렬할 리스트
keys: 키 리스트, 키는 정렬 가능해야 함(예: 숫자, 문자열)
유형: var[]..[]
유형: var[]..[]
sort;key

DSCore.List.GroupByKey(System.Collections.IList,System.Collections.IList)
유사한 키 값을 기준으로 항목을 하위 리스트로 그룹화
list: 하위 리스트로 그룹화할 항목 리스트
keys: 항목 그룹화에 사용하는 키 값(입력 리스트 항목당 하나)
항목이 유사한 키 값으로 그룹화된 하위 리스트의 리스트
각 그룹에 해당하는 키 값
list;group;groupbykey;

DSCore.List.GroupBySimilarity(System.Collections.IList,System.Double,System.Boolean)
클러스터는 색인의 인접성 및 값의 유사성을 기준으로 요소를 나열합니다.
list: 인접성 및 유사성을 기준으로 하위 리스트로 그룹화할 항목의 리스트
tolerance: 유사 항목을 그룹화하기 위한 임계값
considerAdjacency: 노드가 인접성을 고려해야 하는지 여부를 제어하는 부울 값입니다.
유사한 값으로 그룹화된 항목이 있는 하위 리스트의 리스트
그룹화된 값의 원래 색인을 포함하는 하위 리스트의 리스트
list;group;similar;adjacent;adjacency;groupbyadjacency;groupadjacentitems;groupsimilaritems;cluster;tolerance

DSCore.List.LevenshteinDistance(System.String,System.String)
레벤슈타인 거리는 두 문자열 사이의 거리를 구하는 데 사용되는 알고리즘입니다.
| 소스

DSCore.List.AddItemToFront(System.Object,System.Collections.IList)
리스트의 처음에 항목을 추가합니다.
item: 추가할 항목. 항목은 객체 또는 리스트일 수 있습니다.
list: 항목을 추가할 리스트.
추가 항목 리스트
insert,add,item,front,start,begin

DSCore.List.AddItemToEnd(System.Object,System.Collections.IList)
리스트의 끝에 항목을 추가합니다.
item: 추가할 항목. 항목은 객체 또는 리스트일 수 있습니다.
list: 항목을 추가할 리스트.
추가 항목 리스트
insert,add,item,end

DSCore.List.TakeItems(System.Collections.IList,System.Int32)
리스트의 시작 부분에서 항목을 가져옵니다.
list: 항목을 가져올 리스트.
amount: 가져올 항목의 수. 음수인 경우 리스트의 끝에서 항목을 가져옵니다.
추출된 항목의 리스트.
get,sub,sublist,extract

DSCore.List.DropItems(System.Collections.IList,System.Int32)
리스트의 시작 부분에서 일정한 양의 항목을 제거합니다. 양이 음수 값이면,
리스트의 끝 부분에서 항목이 제거됩니다.
list: 항목을 제거할 리스트.
amount: 제거할 항목의 수. 음수인 경우 리스트의 끝에서 항목이 제거됩니다.
나머지 항목의 리스트.
drop,remove,shorten

DSCore.List.ShiftIndices(System.Collections.IList,System.Int32)
리스트의 인덱스를 지정된 수만큼 오른쪽으로 이동합니다.
list: 이동할 리스트.
amount: 이동할 인덱스의 수. 음수인 경우 인덱스가 왼쪽으로 이동됩니다.
이동된 리스트.
shift,offset

DSCore.List.GetItemAtIndex(System.Collections.IList,System.Int32)
지정된 색인에 위치하는 지정된 리스트에서 항목을 반환합니다.
list: 항목을 가져올 리스트.
index: 가져올 항목의 인덱스.
지정된 인덱스의 리스트에 있는 항목.
get,item,index,fetch,at,getfrom,get from,extract

DSCore.List.ReplaceItemAtIndex(System.Collections.IList,System.Int32,System.Object)
지정된 인덱스에 위치한 지정된 리스트에서 항목을 대체합니다.
list: 항목을 대체할 리스트.
index: 대체할 항목의 인덱스.
item: 삽입할 항목.
항목이 대체된 새 리스트.
replace,switch

DSCore.List.ReplaceItemAtIndices(System.Collections.IList,System.Collections.Generic.IList{System.Int32},System.Object)
지정된 리스트에서 지정된 색인에 있는 항목을 대치합니다.
list: 항목을 대체할 리스트.
indices: 대치할 항목의 색인.
item: 삽입할 항목.
항목이 대치된 새 리스트.
replace,switch

DSCore.List.Slice(System.Collections.IList,System.Nullable{System.Int32},System.Nullable{System.Int32},System.Int32)
시작 색인, 끝 색인 및 단계 양을 기준으로 지정된 리스트에서 단일 하위 리스트를
반환합니다.
list: 슬라이스를 가져올 리스트.
start: 슬라이스의 시작 인덱스.
end: 슬라이스의 끝 인덱스.
step: 원래 리스트에서 분리될 항목의 인덱스 수.
지정된 리스트의 슬라이스에 있는 항목.
list,sub,sublist,subrange,get sublist

DSCore.List.RemoveItemAtIndex(System.Collections.IList,System.Int32[])
지정된 인덱스의 지정된 리스트에서 항목을 제거합니다.
list: 항목을 제거할 리스트.
indices: 제거할 항목의 인덱스.
항목이 제거된 리스트.
index,indices,cull,remove,item

DSCore.List.DropEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
지정된 리스트에서 지정된 간격띄우기 이후 지정된 값의 배수인
인덱스의 항목을 제거합니다.
list: 항목을 제거할 리스트
n: 이 인수의 배수인 인덱스가 제거됩니다.
offset: 리스트의 시작 부분에서 무시할 항목 수.
항목이 제거된 리스트.
nth,remove,cull,every

DSCore.List.TakeEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
지정된 리스트에서 지정된 간격띄우기 이후 지정된 값의 배수인
인덱스의 항목을 가져옵니다.
list: 항목을 가져올 리스트.
n: (간격띄우기 후) 이 숫자의 배수인 인덱스를 가져옵니다.
offset: 리스트의 시작 부분에서 무시할 항목 수.
리스트에서 가져온 항목.
fetch,take,every,nth

DSCore.List.IsEmpty(System.Collections.IList)
지정된 리스트가 비어 있는지 확인합니다.
list: 비어 있는지 확인할 리스트
리스트가 비어 있으면 true, 그렇지 않으면 false
test,is,empty,null,count

DSCore.List.AllTrue(System.Collections.IList)
지정된 리스트의 모든 항목이 부울이고 true 값을 가지는지 여부를 결정합니다.
list: 모든 항목이 true인지 여부를 확인할 리스트입니다.
리스트의 모든 항목이 true이면 true, 하나 이상의 항목이 true가 아니면 false
test,all,true,istrue

DSCore.List.AllFalse(System.Collections.IList)
지정된 리스트의 모든 항목이 부울이고 false 값을 가지는지 여부를 결정합니다.
list: 모든 항목이 false인지 여부를 확인할 리스트입니다.
리스트의 모든 항목이 false이면 true, 하나 이상의 항목이 false가 아니면 false
test,all,false,isfalse

DSCore.List.AnyTrue(System.Collections.IList)
지정된 리스트의 항목이 부울인지와 true 값을 갖는지 여부를 확인합니다.
list: 항목이 true인지 여부를 확인할 리스트입니다.
항목이 true인지 여부입니다.
test,any,true,istrue

DSCore.List.AnyFalse(System.Collections.IList)
지정된 리스트의 항목이 부울인지와 false 값을 갖는지 여부를 확인합니다.
list: 항목이 false인지 여부를 확인할 리스트입니다.
항목이 false인지 여부입니다.
test,any,false,isfalse

DSCore.List.Count(System.Collections.IList)
지정된 리스트에 저장된 항목의 개수를 반환합니다.
list: 항목 수를 가져올 리스트.
리스트 길이.
listlength,list length,count,size,sizeof

DSCore.List.Join(System.Collections.IList[])
지정된 모든 리스트를 단일 리스트로 연결합니다.
lists: 하나로 결합할 리스트.
결합된 리스트.
join lists,merge,concatenate

DSCore.List.FirstItem(System.Collections.IList)
리스트에서 첫 번째 항목을 반환합니다.
list: 첫 번째 항목을 가져올 리스트.
리스트의 첫 번째 항목.
get,fetch,first,item,start

DSCore.List.RestOfItems(System.Collections.IList)
지정된 리스트에서 첫 번째 항목을 제거합니다.
list: 나머지 항목을 가져올 리스트.
리스트의 나머지 항목.
get,fetch,rest,end,rest of list

DSCore.List.Chop(System.Collections.IList,System.Collections.Generic.List{System.Int32})
리스트를 지정된 길이의 연속적인 하위 리스트 세트로 자릅니다. 리스트 분할은 리스트 맨 위에서 시작합니다.
list: 하위 리스트로 자를 리스트
lengths: 입력 리스트에서 작성될 연속적인 하위 리스트 길이
리스트에서 작성된 하위 리스트
sublists,build sublists,slices,partitions,cut,listcontains,chop

DSCore.List.DiagonalRight(System.Collections.IList,System.Int32)
매트릭스에서 왼쪽 하단부터 오른쪽 상단까지 각 대각선을 따라 요소를 나열합니다.
list: 단순 리스트
subLength: 각 새 하위 리스트의 길이.
매트릭스 대각선을 따라 나열된 요소의 리스트.
diagonal,right,matrix,get diagonals,diagonal sublists

DSCore.List.DiagonalLeft(System.Collections.IList,System.Int32)
매트릭스에서 왼쪽 상단부터 오른쪽 하단까지 각 대각선을 따라 요소를 나열합니다.
list: 단순 리스트.
rowLength: 각 새 하위 리스트의 길이.
매트릭스 대각선을 따라 나열된 요소의 리스트.
diagonal,left,matrix,get diagonals,diagonal sublists

DSCore.List.Transpose(System.Collections.IList)
리스트의 리스트에서 행 및 열을 교체합니다.
다른 행보다 짧은 행이 몇 개 있을 경우
null 값이 결과 배열에 자리 표시자로 삽입되어
항상 직사각형이 되도록 합니다.
lists: 행과 열을 바꿀 리스트의 리스트
행과 열을 바꾼 리스트의 리스트
transpose,flip matrix,matrix,swap,rows,columns

DSCore.List.Clean(System.Collections.IList,System.Boolean)
지정된 임의 치수의 리스트에서 null 및 빈 리스트의 데이터를 정리합니다.
list: 정리할 null 및 빈 하위 리스트가 포함된 리스트
preserveIndices: 후행이 아닌 null이 필터링되지 않을 수 있도록
행과 열을 바꾼 리스트의 리스트
데이터 색인을 유지하는 옵션 제공
Returns: null 및 빈 리스트를 정리한 리스트

DSCore.List.OfRepeatedItem(System.Object,System.Int32)
지정된 항목이 지정된 횟수만큼 포함된 리스트를 만듭니다.
item: 반복할 항목.
amount: 반복할 횟수.
반복된 항목의 리스트.
repeat,repeated,duplicate,list of item,fill list,copies,listcontains

DSCore.List.Cycle(System.Collections.IList,System.Int32)
지정된 리스트의 사본을 연결하여 새 리스트를 만듭니다.
list: 반복할 리스트.
amount: 반복할 횟수.
유형의 반복된 리스트의 리스트: var[]..[]
repeat,repeated,duplicate,repeated list,concat list

DSCore.List.LastItem(System.Collections.IList)
리스트의 마지막 항목을 검색합니다.
list: 마지막 항목을 가져올 리스트
리스트의 마지막 항목
get,fetch,last,item,end of list

DSCore.List.Shuffle(System.Collections.IList)
리스트 항목의 순서를 무작위로 섞습니다.
list: 항목을 섞을 리스트.
항목을 무작위로 섞은 리스트.
random,randomize,shuffle,jitter,randomness

DSCore.List.Shuffle(System.Collections.IList,System.Int32)
리스트 항목을 섞어 초기 시드 값을 기준으로 항목의 순서를 무작위로 지정합니다.
list: 항목을 섞을 리스트.
seed: 난수 생성기의 시드 값
항목을 무작위로 섞은 리스트.
random,randomize,shuffle,jitter,randomness,seed

DSCore.List.Permutations(System.Collections.IList,System.Nullable{System.Int32})
지정된 리스트의 지정된 길이의 모든 순열을 생성합니다.
list: 순열을 생성할 리스트.
length: 각 순열의 길이.
지정된 길이의 리스트 순열(유형: var[]..[])
permutation,permutations

DSCore.List.Combinations(System.Collections.IList,System.Int32,System.Boolean)
지정된 리스트의 지정된 길이의 모든 조합을 생성합니다.
list: 조합을 생성할 리스트
length: 각 조합의 길이
replace: 항목이 조합을 위해 선택된 후 제거되는지 여부. 기본값은 false입니다.
지정된 길이의 리스트 조합
combo

DSCore.List.FirstIndexOf(System.Collections.IList,System.Object)
항목을 지정하면 리스트에서 첫 번째 발생의 0 기점 색인을 반환합니다.
리스트에서 항목을 찾을 수 없으면 -1이 반환됩니다.
list: 검색할 리스트. 이 인수가 null이면 -1이 반환됩니다.
item: 찾을 항목.
Returns: 리스트에서 항목의 0 기점 색인 또는 항목이 없는 경우 -1.

DSCore.List.AllIndicesOf(System.Collections.IList,System.Object)
항목을 지정하면 리스트에서 모든 발생의 0 기점 색인을 반환합니다.
항목을 찾을 수 없으면 빈 리스트가 반환됩니다.
list: 검색할 리스트. 이 인수가 null이면 빈 리스트가 반환됩니다.
item: 찾을 항목.
항목이 발견된 경우 항목의 모든 발생의 0 기점 색인
리스트 또는 항목이 리스트에 없는 경우 빈 리스트.

DSCore.List.Flatten(System.Collections.IList,System.Int32)
리스트의 내포된 리스트를 특정한 양만큼 단순화합니다.
list: 단순화할 리스트.
amount: 제거할 리스트 내포 레이어(-1은 모든 리스트 내포 제거)
양 기준으로 단순화한 리스트
flatten,completely

DSCore.List.IndexInList(System.Collections.IList,System.Object)
항목이 배열인 경우 Enumerable.SequenceEqual을 통해 리스트에 항목이 포함되어 있는지 확인하는
IList.Contains를 사용하는 대체 방법입니다. 찾는 경우 색인을,
찾을 수 없는 경우 -1를 반환합니다.
list: 항목이 포함되어 있는지 확인하는 리스트입니다.
item: 찾아야 하는 항목입니다.
리스트에 있는 항목의 색인입니다.

DSCore.List.GetDepth(System.Object)
지정된 리스트의 최대 깊이를 가져옵니다.
list: 깊이를 가져오는 입력 리스트입니다.
지정된 리스트의 깊이입니다.

DSCore.List.CountBool(System.Collections.IList,System.Boolean)
지정된 리스트에 있는 지정된 부울 값 수를 반환합니다.
list: 부울 값을 찾을 리스트입니다.
value: 찾을 부울 값입니다.
리스트의 지정된 부울 값 수 입니다.

DSCore.List.IncreaseDepth(System.Collections.IList,System.Int32)
지정된 리스트의 깊이를 지정된 양만큼 증가시킵니다. 지정된 리스트를 포함하는
새 리스트를 작성하면 깊이가 증가합니다.
list: 깊이가 증가할 리스트입니다.
amt: 깊이를 증가시킬 양입니다.
양만큼 깊이가 증가하는 새 리스트입니다.

DSCore.List.DoubleConverter(System.Object)
정수를 double 값으로 변환하고, 그렇지 않은 경우 입력 객체를 반환합니다.