DSCore.Properties.Resources
현지화된 문자열 등을 조회하기 위한 강력한 유형의 리소스 클래스

DSCore.Properties.Resources.ResourceManager
이 클래스에서 사용하는 캐시된 ResourceManager 인스턴스(instance)를 반환합니다.

DSCore.Properties.Resources.Culture
이러한 강력한 유형의 리소스 클래스를 사용하여 모든 리소스
조회에 대한 현재 스레드의 CurrentUICulture 특성을 재지정합니다.

DSCore.Properties.Resources.BitmapOverflowError
"제공된 색상 데이터가 너무 커서 이미지 경계에 맞지 않습니다."와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.CurveMapperEqualMinMaxWarning
'• 최소값과 최대값은 달라야 합니다.'와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.CurveMapperInvalidCountWarning
'• 값은 숫자 리스트이거나 2 이상의 단일 숫자여야 합니다.'와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.CurveMapperInvalidCurveWarning
'• 선택한 곡선의 제어점이 유효하지 않습니다.'와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.CurveMapperInvalidXYFormatWarning
'• X 및 Y 입력은 리스트가 아닌 단일 숫자여야 합니다.'와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.DefineDataSupportedInputValueExceptionMessage
"입력은 단일 값 또는 내포되지 않은 리스트여야 합니다."와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.DefineDataUnexpectedInputExceptionMessage
"이 노드는 {0} 입력을 예상했지만 {1} 입력을 수신했습니다. 필요한 입력을 제공하거나 노드의 드롭다운 메뉴에서 새 유형을 선택하십시오."와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.DefineDataUnsupportedCombinationOfDataTypesExceptionMessage
"이 노드는 현재 입력 리스트 {0}의 데이터 유형 조합을 지원하지 않습니다. 입력 리스트에 동일한 데이터 유형의 항목이 포함되어 있는지, 아니면 공통 상위 유형이 혼합된 유형인지 확인하십시오."와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.DefineDataUnsupportedDataTypeExceptionMessage
"이 노드는 현재 입력 데이터 유형({0})을 지원하지 않습니다. 드롭다운 메뉴에서 지원되는 데이터 유형을 확인하십시오."와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.EnumDateOfWeekFriday
'금요일'과 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.EnumDateOfWeekMonday
'월요일'과 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.EnumDateOfWeekSaturday
'토요일'과 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.EnumDateOfWeekSunday
'일요일'과 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.EnumDateOfWeekThursday
'목요일'과 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.EnumDateOfWeekTuesday
'화요일'과 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.EnumDateOfWeekWednesday
'수요일'과 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.Exception_Deserialize_Bad_Format
"유형 {0}에 대한 json 형식이 올바르게 지정되지 않았습니다."와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.Exception_Deserialize_Unsupported_Cache
"저장된 데이터를 로드할 수 없습니다."와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.Exception_Serialize_Depth_Unsupported
'경로 "{2}"에서 깊이 {0}이(가) 최대 깊이 {1}을(를) 초과합니다.'와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.Exception_Serialize_DesignScript_Unsupported
"이 유형의 형상은 직렬화할 수 없습니다."와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.Exception_Serialize_Unsupported_Type
"유형 {0}의 데이터를 저장할 수 없습니다."와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.ExportToCSVObsolete
'대신 Data.ExportCSV 노드를 사용하십시오.'와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.FactorialNegativeInt
'Math.Factorial 입력 값은 음수일 수 없습니다.'와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.FactorialOverflow
'Math.Factorial 반환 값이 범위를 벗어났습니다.'와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.FindPointsWithinRadiusNullPointMessage
'중심점을 입력해야 합니다.'와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.FindPointsWithinRadiusSearchRadiusMessage
'검색 반지름은 0이 아니어야 합니다.'와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.FromObjectObsolete
'사용하지 않는 노드입니다. "String from Object"를 사용하십시오.'와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.IntegerOverflow
'작업으로 인해 정수 오버플로우가 발생하였습니다. 그 결과가 예기치 않게 발생할 수 있습니다.'와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.InvalidDestinationPathErrorMessage
복사 경로로 사용된 잘못된 대상 파일 경로와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.InvalidKeysErrorMessage
'하나 이상의 입력 유형이 일치하지 않습니다. 키로 나열한 리스트는 지원되지 않습니다.'와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.InvalidKeysLenghtErrorMessage
'항목 수가 키 수와 일치하지 않습니다.'와 유사한 현지화된 문자열을 조회합니다. href=InvalidKeysLenghtErrorMessage.html.

DSCore.Properties.Resources.LoadImageFromPathObsolete
'대신 File.FromPath -> Image.ReadFromFile 노드를 사용하십시오.'와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.MissingPythonEngine
'선택한 Python 엔진을 찾을 수 없음'과 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.ObjectArgumentExceptionMessage
Object와 유사한 현지화된 문자열 조회는 null일 수 없습니다. 적절한 값을 제공하십시오.

DSCore.Properties.Resources.QuadtreeConstructionEmptyUVSetMessage
'빈 점 집합에서 쿼드트리를 구성할 수 없습니다.'와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.QuadtreeConstructionNullUVSetMessage
'null UV 집합에서 Quadtree를 구성할 수 없습니다.'와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.ReadImageObsolete
'대신 File.FromPath -> Image.ReadFromFile -> Image.Pixels 노드를 사용하십시오.'와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.ReadTextObsolete
'대신 File.FromPath -> File.ReadText 노드를 사용하십시오.'와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.StringRemoveCountOutOfRangeMessage
'개수가 범위를 벗어났습니다!'와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.StringRemoveStartIndexOutOfRangeMessage
'StartIndex가 범위를 벗어났습니다!'와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.StringToNumberInvalidNumberMessage
유효하지 않은 숫자와 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.WebRequestNullUrlMessage
Null이 될 수 없는 URL과 유사한 현지화된 문자열을 조회합니다.

DSCore.Properties.Resources.WriteImageObsolete
'대신 Image.WriteToFile 노드를 사용하십시오.'와 유사한 현지화된 문자열을 조회합니다.