DSCore.CurveMapper.ParabolicCurve
CurveMapper의 포물선 곡선을 나타냅니다.
이 곡선은 두 제어점을 기준으로 하는 2차 방정식을 따릅니다.

DSCore.CurveMapper.ParabolicCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
곡선을 따라 분배된 X 및 Y 값을 반환합니다.