DSCore.CurveMapper.LinearCurve
CurveMapper의 선형 곡선을 나타냅니다.
선형 곡선은 두 제어점 사이의 직선입니다.

DSCore.CurveMapper.LinearCurve.LineEquation(System.Double)
최소 및 최대 X 값에 대한 Y 값(캔버스 좌표)을 계산합니다.

DSCore.CurveMapper.LinearCurve.SolveForXGivenY(System.Double)
최소 및 최대 Y 값에 대한 X 값(캔버스 좌표)을 계산합니다.

DSCore.CurveMapper.LinearCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
곡선을 따라 분배된 X 및 Y 값을 반환합니다.