Repository: DynamoDS/Dynamo
Catalog: src/Engine/ProtoCore/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# ValidForImperativeBlockOnly
source: '{0}' statement can only be used in imperative language block
cs_cz: Výraz „{0}“ lze použít pouze na nezbytném bloku jazyka.
de_de: Anweisung '{0}' kann nur imperativem Sprachenblock verwendet werden.
es_es: La sentencia '{0}' solo se puede utilizar en bloque de lenguaje imperativo
fr_fr: L'instruction '{0}' peut uniquement être utilisée dans un bloc de langage impératif
it_it: L'istruzione '{0}' può essere utilizzata solo in un blocco di linguaggio imperativo
ja_jp: '{0}' 条件文は命令型言語ブロックにのみ使用できます。
ko_kr: '{0}' 문은 명령형 언어 블록에서만 사용할 수 있습니다
pl_pl: Instrukcja '{0}' może być używana tylko w bloku języka imperatywnego
pt_br: A declaração '{0}' somente pode ser utilizada em um bloco de linguagem imperativo
ru_ru: Выражение '{0}' может использоваться только в императивном языковом блоке
zh_cn: '{0}' 语句只能用于命令式语言块
zh_tw: '{0}' 陳述式只能用在必要語言區塊中

# ModuloByZero
source: Integer modulo by zero
cs_cz: Modulo celého čísla nulou
de_de: Ganzzahl-Modulo durch Null
es_es: Módulo entero por cero
fr_fr: Opération modulo sur un entier par zéro
it_it: Modulo numero intero in base a zero
ja_jp: ゼロで整数モジュロ
ko_kr: 정수를 0으로 나눔
pl_pl: Modulo liczby całkowitej przez zero
pt_br: Módulo de número inteiro por zero
ru_ru: Целое число по модулю нуль
zh_cn: 按零整数求模
zh_tw: 整數以零為係數

# addadd_expected
source: "++" expected
cs_cz: očekáváno „++“
de_de: "++" erwartet
es_es: se esperaba "++"
fr_fr: "++" attendu
it_it: "++" previsto
ja_jp: "++" が必要です
ko_kr: "++" 예상됨
pl_pl: oczekiwano "++"
pt_br: "++" esperado
ru_ru: ожидается «++»
zh_cn: 应输入“++”
zh_tw: 預期 "++"

# add_expected
source: "+" expected
cs_cz: očekáváno „+“
de_de: "+" erwartet
es_es: se esperaba "+"
fr_fr: "+" attendu
it_it: "+" previsto
ja_jp: "+" が必要です
ko_kr: "+" 예상됨
pl_pl: oczekiwano "+"
pt_br: "+" esperado
ru_ru: Ожидается «+»
zh_cn: 应输入“+”
zh_tw: 預期 "+"

# andand_expected
source: "&&" expected
cs_cz: očekáváno „&&“
de_de: "&&" erwartet
es_es: se esperaba "&&"
fr_fr: "&&" attendu
it_it: "&&" previsto
ja_jp: "&&" が必要です
ko_kr: "&&" 예상됨
pl_pl: oczekiwano "&&"
pt_br: "&" esperado
ru_ru: Ожидается «&&»
zh_cn: 应输入“&&”
zh_tw: 預期 "&&"

# and_expected
source: "&" expected
cs_cz: očekáváno „&“
de_de: "&" erwartet
es_es: se esperaba "&"
fr_fr: "&" attendu
it_it: "&" previsto
ja_jp: "&" が必要です
ko_kr: "&" 예상됨
pl_pl: oczekiwano "&"
pt_br: "&" esperado
ru_ru: Ожидается «&»
zh_cn: 应输入“&”
zh_tw: 預期 "&"

# asterisk_expected
source: "*" expected
cs_cz: očekáváno „*“
de_de: "*" erwartet
es_es: se esperaba "*"
fr_fr: "*" attendu
it_it: "*" previsto
ja_jp: "*" が必要です
ko_kr: "*" 예상됨
pl_pl: oczekiwano "*"
pt_br: "*" esperado
ru_ru: ожидается «*»
zh_cn: 应输入“*”
zh_tw: 預期 "*"

source: "catch" expected
cs_cz: Očekáváno „catch“
de_de: "catch" erwartet
es_es: se esperaba "catch"
fr_fr: "catch" attendu
it_it: "catch" previsto
ja_jp: "catch" が必要です
ko_kr: "catch" 예상됨
pl_pl: oczekiwano "zatrzask"
pt_br: "pegar" esperado
ru_ru: Ожидается «catch»
zh_cn: 应输入“catch”
zh_tw: 預期 "catch"

source: char expected
cs_cz: očekáván typ CHAR
de_de: char erwartet
es_es: se esperaba char
fr_fr: char attendu
it_it: char previsto
ja_jp: char が必要です
ko_kr: char 예상됨
pl_pl: oczekiwano znaku
pt_br: char esperado
ru_ru: требуется символ
zh_cn: 应输入 char
zh_tw: 預期 char

# closebrace_expected
source: "}" expected
cs_cz: očekáváno „}“
de_de: "}" erwartet
es_es: se esperaba "}"
fr_fr: "}" attendu
it_it: "}" previsto
ja_jp: "}" が必要です
ko_kr: "}" 예상됨
pl_pl: oczekiwano "}"
pt_br: "}" esperado
ru_ru: Ожидается «}»
zh_cn: 应输入“}”
zh_tw: 預期 "}"

source: closebracket expected
cs_cz: očekáváno „closebracket“
de_de: closebracket erwartet
es_es: se esperaba closebracket
fr_fr: closebracket attendu
it_it: closebracket previsto
ja_jp: closebracket が必要です
ko_kr: closebracket 예상됨
pl_pl: oczekiwano closebracket
pt_br: colchete fechado esperado
ru_ru: ожидается closebracket
zh_cn: 应输入 closebracket
zh_tw: 預期 closebracket

source: closeparen expected
cs_cz: očekáváno closeparen
de_de: closeparen erwartet
es_es: se esperaba closeparen
fr_fr: closeparen attendu
it_it: closeparen previsto
ja_jp: closeparen が必要です
ko_kr: closeparen 예상됨
pl_pl: oczekiwano closeparen
pt_br: parênteses fechado esperado
ru_ru: требуется закрыть кавычки
zh_cn: 应输入右圆括号“)”
zh_tw: 預期 closeparen

# comma_expected
source: "," expected
cs_cz: očekáváno „,“
de_de: "," erwartet
es_es: se esperaba ","
fr_fr: "," attendu
it_it: "," previsto
ja_jp: "," が必要です
ko_kr: "," 예상됨
pl_pl: oczekiwano ","
pt_br: "," esperado
ru_ru: Ожидается «,»
zh_cn: 应输入“,”
zh_tw: 預期 ","

# curvedash_expected
source: "~\" expected
cs_cz: Očekáváno „~\“
de_de: "~\" erwartet
es_es: se esperaba "~\"
fr_fr: "~\" attendu
it_it: "~\" previsto
ja_jp: "~\" が必要です
ko_kr: "~\" 예상됨
pl_pl: oczekiwano "~\"
pt_br: "~\" esperado
ru_ru: Ожидается «~\»
zh_cn: 应输入“~\”
zh_tw: 預期 "~\"

# dashdash_expected
source: "--" expected
cs_cz: očekáváno „--“
de_de: "--" erwartet
es_es: se esperaba "--"
fr_fr: "--" attendu
it_it: "--" previsto
ja_jp: "--" が必要です
ko_kr: "--" 예상됨
pl_pl: oczekiwano "--"
pt_br: "--" esperado
ru_ru: Ожидается «--»
zh_cn: 应输入“--”
zh_tw: 預期 "--"

# divider_expected
source: "/" expected
cs_cz: očekáváno „/“
de_de: "/" erwartet
es_es: se esperaba "/"
fr_fr: "/" attendu
it_it: "/" previsto
ja_jp: "/" が必要です
ko_kr: "/" 예상됨
pl_pl: oczekiwano "/"
pt_br: "/" esperado
ru_ru: Ожидается «/»
zh_cn: 应输入“/”
zh_tw: 預期 "/"

# doublecolumn_expected
source: ":" expected
cs_cz: očekáváno „:“
de_de: ":" erwartet
es_es: se esperaba ":"
fr_fr: ":" attendu
it_it: ":" previsto
ja_jp: ":" が必要です
ko_kr: ":" 예상됨
pl_pl: oczekiwano ":"
pt_br: ":" esperado
ru_ru: Ожидается «:»
zh_cn: 应输入“:”
zh_tw: 預期 ":"

source: endline expected
cs_cz: očekáváno endline
de_de: endline erwartet
es_es: se esperaba endline
fr_fr: endline attendu
it_it: endline previsto
ja_jp: 終端が必要です
ko_kr: endline 예상됨
pl_pl: oczekiwano endline
pt_br: fim de linha esperado
ru_ru: Ожидается конец линии
zh_cn: 应输入 endline
zh_tw: 預期 endline

source: EOF expected
cs_cz: očekáváno EOF
de_de: EOF erwartet
es_es: se esperaba EOF
fr_fr: EOF attendu
it_it: EOF previsto
ja_jp: EOF が必要です
ko_kr: EOF 예상됨
pl_pl: Oczekiwano końca elementów (EOF)
pt_br: EOF esperado
ru_ru: ожидается EOF
zh_cn: 应输入 EOF
zh_tw: 預期 EOF

# equalmark_expected
source: "=" expected
cs_cz: očekáváno „=“
de_de: "=" erwartet
es_es: se esperaba "="
fr_fr: "=" attendu
it_it: "=" previsto
ja_jp: "=" が必要です
ko_kr: "=" 예상됨
pl_pl: oczekiwano "="
pt_br: "=" esperado
ru_ru: Ожидается «=»
zh_cn: 应输入“=”
zh_tw: 預期 "="

# equalright_expected
source: "=>" expected
cs_cz: očekáváno „=>“
de_de: "=>" erwartet
es_es: se esperaba "=>"
fr_fr: "=>" attendu
it_it: "=>" previsto
ja_jp: "=>" が必要です
ko_kr: "=>" 예상됨
pl_pl: oczekiwano "=>"
pt_br: "=> " esperado
ru_ru: Ожидается «=>»
zh_cn: 应输入“=>”
zh_tw: 預期 "=>"

source: equal expected
cs_cz: očekáváno „equal“
de_de: equal erwartet
es_es: se esperaba equal
fr_fr: equal attendu
it_it: equal previsto
ja_jp: = が必要です
ko_kr: equal 예상됨
pl_pl: oczekiwano równości
pt_br: igual esperado
ru_ru: ожидается равенство
zh_cn: 应输入等号“=”
zh_tw: 預期 equal

source: error
cs_cz: chyba
de_de: Fehler
fr_fr: erreur
it_it: Errore
ja_jp: エラー
ko_kr: 오류
pl_pl: błąd
pt_br: erro
ru_ru: ошибка
zh_cn: 错误
zh_tw: 錯誤

source: float expected
cs_cz: očekáváno float
de_de: float erwartet
es_es: se esperaba float
fr_fr: float attendu
it_it: float previsto
ko_kr: float 예상됨
pl_pl: oczekiwano float
pt_br: flutuante esperado
ru_ru: ожидается float
zh_cn: 应输入浮点数
zh_tw: 預期浮動

source: greaterequal expected
cs_cz: očekáváno „greaterequal“
de_de: greaterequal erwartet
es_es: se esperaba greaterequal
fr_fr: greaterequal attendu
it_it: greaterequal previsto
ja_jp: >= が必要です
ko_kr: greaterequal 예상됨
pl_pl: oczekiwano greaterequal
pt_br: greaterequal esperado
ru_ru: ожидается greaterequal
zh_cn: 应输入 greaterequal
zh_tw: 預期 greaterequal

source: greaterthan expected
cs_cz: očekáváno „greaterthan“
de_de: greaterthan erwartet
es_es: se esperaba greaterthan
fr_fr: greaterthan attendu
it_it: greaterthan previsto
ja_jp: > が必要です
ko_kr: greaterthan 예상됨
pl_pl: oczekiwano greaterthan
pt_br: greaterthan esperado
ru_ru: Ожидается greaterthan
zh_cn: 应输入 greaterthan
zh_tw: 預期 greaterthan

# hax_expected
source: "#" expected
cs_cz: očekáváno „#“
de_de: "#" erwartet
es_es: se esperaba "#"
fr_fr: "#" attendu
it_it: "#" previsto
ja_jp: "#" が必要です
ko_kr: "#" 예상됨
pl_pl: oczekiwano "#"
pt_br: "#" esperado
ru_ru: Ожидается «#»
zh_cn: 应输入“#”
zh_tw: 預期 "#"

source: ident expected
cs_cz: Očekáváno ident
de_de: ident erwartet
es_es: se esperaba ident
fr_fr: ident attendu
it_it: ident previsto
ja_jp: 識別子が必要です
ko_kr: ident 예상됨
pl_pl: oczekiwano ident
pt_br: identado esperado
ru_ru: ожидается ident
zh_cn: 应输入 indent
zh_tw: 預期相同

source: invalid Associative_AccessSpecifier
cs_cz: neplatný objekt Associative_AccessSpecifier
de_de: Ungültige Associative_AccessSpecifier
es_es: Associative_AccessSpecifier no válido
fr_fr: Associative_AccessSpecifier incorrect
it_it: Associative_AccessSpecifier non valido
ja_jp: Associative_AccessSpecifier が無効です
ko_kr: 잘못된 Associative_AccessSpecifier
pl_pl: nieprawidłowy Associative_AccessSpecifier
pt_br: Associative_AccessSpecifier inválido
ru_ru: недопустимый Associative_AccessSpecifier
zh_cn: Associative_AccessSpecifier 无效
zh_tw: 無效的 Associative_AccessSpecifier

source: invalid_Associative_AddOp
es_es: Associative_AddOp no válido
it_it: Associative_AddOp non valido
pt_br: Associative_AddOp inválida
zh_cn: invalid_Associative_AddOp 无效

source: invalid Associative_BinaryOps
cs_cz: neplatný objekt Associative_BinaryOps
de_de: Ungültige Associative_BinaryOps
es_es: Associative_BinaryOps no válido
fr_fr: Associative_BinaryOps incorrect
it_it: Associative_BinaryOps non valido
ja_jp: Associative_BinaryOps が無効です
ko_kr: 잘못된 Associative_BinaryOps
pl_pl: nieprawidłowy Associative_BinaryOps
pt_br: Associative_BinaryOps inválido
ru_ru: недопустимый Associative_BinaryOps
zh_cn: Associative_BinaryOps 无效
zh_tw: 無效的 Associative_BinaryOps

source: invalid Associative_BitOp
cs_cz: neplatný objekt Associative_BitOp
de_de: Ungültige Associative_BitOp
es_es: Associative_BitOp no válido
fr_fr: Associative_BitOp incorrect
it_it: Associative_BitOp non valido
ja_jp: Associative_BitOp が無効です
ko_kr: 잘못된 Associative_BitOp
pl_pl: nieprawidłowy Associative_BitOp
pt_br: Associative_BitOp inválido
ru_ru: недопустимый Associative_BitOp
zh_cn: Associative_BitOp 无效
zh_tw: 無效的 Associative_BitOp

source: invalid Associative_classdecl
cs_cz: neplatný objekt Associative_classdecl
de_de: Ungültige Associative_classdecl
es_es: Associative_classdecl no válido
fr_fr: Associative_classdecl incorrect
it_it: Associative_classdecl non valido
ja_jp: Associative_classdecl が無効です
ko_kr: 잘못된 Associative_classdecl
pl_pl: nieprawidłowy Associative_classdecl
pt_br: Associative_classdecl inválido
ru_ru: недопустимый Associative_classdecl
zh_cn: Associative_classdecl 无效
zh_tw: 無效的 Associative_classdecl

source: invalid Associative_ComparisonOp
cs_cz: neplatný objekt Associative_ComparisonOp
de_de: Ungültige Associative_ComparisonOp
es_es: Associative_ComparisonOp no válido
fr_fr: Associative_ComparisonOp incorrect
it_it: Associative_ComparisonOp non valido
ja_jp: Associative_ComparisonOp が無効です
ko_kr: 잘못된 Associative_ComparisonOp
pl_pl: nieprawidłowy Associative_ComparisonOp
pt_br: Associative_ComparisonOp inválido
ru_ru: недопустимый Associative_ComparisonOp
zh_cn: Associative_ComparisonOp 无效
zh_tw: 無效的 Associative_ComparisonOp

source: invalid Associative_DecoratedIdentifier
cs_cz: neplatný objekt Associative_DecoratedIdentifier
de_de: Ungültige Associative_DecoratedIdentifier
es_es: Associative_DecoratedIdentifier no válido
fr_fr: Associative_DecoratedIdentifier incorrect
it_it: Associative_DecoratedIdentifier non valido
ja_jp: Associative_DecoratedIdentifier が無効です
ko_kr: 잘못된 Associative_DecoratedIdentifier
pl_pl: nieprawidłowy Associative_DecoratedIdentifier
pt_br: Associative_DecoratedIdentifier inválido
ru_ru: недопустимый Associative_DecoratedIdentifier
zh_cn: Associative_DecoratedIdentifier 无效
zh_tw: 無效的 Associative_DecoratedIdentifier

source: invalid Associative_Factor
cs_cz: neplatný objekt Associative_Factor
de_de: Ungültiger Associative_Factor
es_es: Associative_Factor no válido
fr_fr: Associative_Factor incorrect
it_it: Associative_Factor non valido
ja_jp: Associative_Factor が無効です
ko_kr: 잘못된 Associative_Factor
pl_pl: nieprawidłowy Associative_Factor
pt_br: Associative_Factor inválido
ru_ru: недопустимый Associative_Factor
zh_cn: Associative_Factor 无效
zh_tw: 無效的 Associative_Factor

source: invalid Associative_FunctionalStatement
cs_cz: neplatný objekt Associative_FunctionalStatement
de_de: Ungültige Associative_FunctionalStatement
es_es: Associative_FunctionalStatement no válido
fr_fr: Associative_FunctionalStatement incorrect
it_it: Associative_FunctionalStatement non valido
ja_jp: Associative_FunctionalStatement が無効です
ko_kr: 잘못된 Associative_FunctionalStatement
pl_pl: nieprawidłowy Associative_FunctionalStatement
pt_br: Associative_FunctionalStatement inválido
ru_ru: недопустимый Associative_FunctionalStatement
zh_cn: Associative_FunctionalStatement 无效
zh_tw: 無效的 Associative_FunctionalStatement

source: invalid Associative_functiondecl
cs_cz: neplatný objekt Associative_functiondecl
de_de: Ungültige Associative_functiondecl
es_es: Associative_functiondecl no válido
fr_fr: Associative_functiondecl incorrect
it_it: Associative_functiondecl non valido
ja_jp: Associative_functiondecl が無効です
ko_kr: 잘못된 Associative_functiondecl
pl_pl: nieprawidłowy Associative_functiondecl
pt_br: Associative_functiondecl inválido
ru_ru: недопустимый Associative_functiondecl
zh_cn: Associative_functiondecl 无效
zh_tw: 無效的 Associative_functiondecl

source: invalid Associative_LanguageBlock
cs_cz: neplatný objekt Associative_LanguageBlock
de_de: Ungültiger Associative_LanguageBlock
es_es: Associative_LanguageBlock no válido
fr_fr: Associative_LanguageBlock incorrect
it_it: Associative_LanguageBlock non valido
ja_jp: Associative_LanguageBlock が無効です
ko_kr: 잘못된 Associative_LanguageBlock
pl_pl: nieprawidłowy Associative_LanguageBlock
pt_br: Associative_LanguageBlock inválido
ru_ru: недопустимый Associative_LanguageBlock
zh_cn: Associative_LanguageBlock 无效
zh_tw: 無效的 Associative_LanguageBlock

source: invalid Associative_LogicalOp
cs_cz: neplatný objekt Associative_LogicalOp
de_de: Ungültige Associative_LogicalOp
es_es: Associative_LogicalOp no válido
fr_fr: Associative_LogicalOp incorrect
it_it: Associative_LogicalOp non valido
ja_jp: Associative_LogicalOp が無効です
ko_kr: 잘못된 Associative_LogicalOp
pl_pl: nieprawidłowy Associative_LogicalOp
pt_br: Associative_LogicalOp inválido
ru_ru: недопустимый Associative_LogicalOp
zh_cn: Associative_LogicalOp 无效
zh_tw: 無效的 Associative_LogicalOp

source: invalid Associative_MulOp
cs_cz: neplatný objekt Associative_MulOp
de_de: Ungültige Associative_MulOp
es_es: Associative_MulOp no válido
fr_fr: Associative_MulOp incorrect
it_it: Associative_MulOp non valido
ja_jp: Associative_MulOp が無効です
ko_kr: 잘못된 Associative_MulOp
pl_pl: nieprawidłowy Associative_MulOp
pt_br: Associative_MulOp inválido
ru_ru: недопустимый Associative_MulOp
zh_cn: Associative_MulOp 无效
zh_tw: 無效的 Associative_MulOp

source: invalid Associative_NameReference
cs_cz: neplatný objekt Associative_NameReference
de_de: Ungültige Associative_NameReference
es_es: Associative_NameReference no válido
fr_fr: Associative_NameReference incorrect
it_it: Associative_NameReference non valido
ja_jp: Associative_NameReference が無効です
ko_kr: 잘못된 Associative_NameReference
pl_pl: nieprawidłowy Associative_NameReference
pt_br: Associative_NameReference inválido
ru_ru: недопустимый Associative_NameReference
zh_cn: Associative_NameReference 无效
zh_tw: 無效的 Associative_NameReference

source: invalid Associative_negop
cs_cz: neplatný objekt Associative_negop
de_de: Ungültige Associative_negop
es_es: Associative_negop no válido
fr_fr: Associative_negop incorrect
it_it: Associative_negop non valido
ja_jp: Associative_negop が無効です
ko_kr: 잘못된 Associative_negop
pl_pl: nieprawidłowy Associative_negop
pt_br: Associative_negop inválido
ru_ru: недопустимый Associative_negop
zh_cn: Associative_negop 无效
zh_tw: 無效的 Associative_negop

source: invalid Associative_Number
cs_cz: neplatný objekt Associative_Number
de_de: Ungültige Associative_Number
es_es: Associative_Number no válido
fr_fr: Associative_Number incorrect
it_it: Associative_Number non valido
ja_jp: Associative_Number が無効です
ko_kr: 잘못된 Associative_Number
pl_pl: nieprawidłowy Associative_Number
pt_br: Associative_Number inválido
ru_ru: недопустимый Associative_Number
zh_cn: Associative_Number 无效
zh_tw: 無效的 Associative_Number

source: invalid Associative_PostFixOp
cs_cz: neplatný objekt Associative_PostFixOp
de_de: Ungültige Associative_PostFixOp
es_es: Associative_PostFixOp no válido
fr_fr: Associative_PostFixOp incorrect
it_it: Associative_PostFixOp non valido
ja_jp: Associative_PostFixOp が無効です
ko_kr: 잘못된 Associative_PostFixOp
pl_pl: nieprawidłowy Associative_PostFixOp
pt_br: Associative_PostFixOp inválido
ru_ru: недопустимый Associative_PostFixOp
zh_cn: Associative_PostFixOp 无效
zh_tw: 無效的 Associative_PostFixOp

source: invalid Associative_Statement
cs_cz: neplatný objekt Associative_Statement
de_de: Ungültige Associative_Statement
es_es: Associative_Statement no válido
fr_fr: Associative_Statement incorrect
it_it: Associative_Statement non valido
ja_jp: Associative_Statement が無効です
ko_kr: 잘못된 Associative_Statement
pl_pl: nieprawidłowy Associative_Statement
pt_br: Associative_Statement inválido
ru_ru: недопустимый Associative_Statement
zh_cn: Associative_Statement 无效
zh_tw: 無效的 Associative_Statement

source: invalid Associative_UnaryExpression
cs_cz: neplatný objekt Associative_UnaryExpression
de_de: Ungültige Associative_UnaryExpression
es_es: Associative_UnaryExpression no válido
fr_fr: Associative_UnaryExpression incorrect
it_it: Associative_UnaryExpression non valido
ja_jp: Associative_UnaryExpression が無効です
ko_kr: 잘못된 Associative_UnaryExpression
pl_pl: nieprawidłowy Associative_UnaryExpression
pt_br: Associative_UnaryExpression inválido
ru_ru: недопустимый Associative_UnaryExpression
zh_cn: Associative_UnaryExpression 无效
zh_tw: 無效的 Associative_UnaryExpression

source: invalid Associative_unaryop
cs_cz: neplatný objekt Associative_unaryop
de_de: Ungültige Associative_unaryop
es_es: Associative_unaryop no válido
fr_fr: Associative_unaryop incorrect
it_it: Associative_unaryop non valido
ja_jp: Associative_unaryop が無効です
ko_kr: 잘못된 Associative_unaryop
pl_pl: nieprawidłowy Associative_unaryop
pt_br: Associative_unaryop inválido
ru_ru: недопустимый Associative_unaryop
zh_cn: Associative_unaryop 无效
zh_tw: 無效的 Associative_unaryop

source: invalid Hydrogen
cs_cz: neplatný objekt Hydrogen
de_de: Hydrogen ungültig
es_es: Hydrogen no válido
fr_fr: Hydrogen incorrect
it_it: Hydrogen non valido
ja_jp: Hydrogen が無効です
ko_kr: 잘못된 수소
pl_pl: nieprawidłowy Wodór
pt_br: Hidrogênio inválido
ru_ru: недопустимый Hydrogen
zh_cn: 氢无效
zh_tw: 無效的氫

source: invalid Imperative_addop
cs_cz: neplatný objekt Imperative_addop
de_de: Ungültige Imperative_addop
es_es: Imperative_addop no válido
fr_fr: Imperative_addop incorrect
it_it: Imperative_addop non valido
ja_jp: Imperative_addop が無効です
ko_kr: 잘못된 Imperative_addop
pl_pl: nieprawidłowy Imperative_addop
pt_br: Imperative_addop inválido
ru_ru: недопустимый Imperative_addop
zh_cn: Imperative_addop 无效
zh_tw: 無效的 Imperative_addop

source: invalid Imperative_assignstmt
cs_cz: neplatný objekt Imperative_assignstmt
de_de: Ungültige Imperative_assignstmt
es_es: Imperative_assignstmt no válido
fr_fr: Imperative_assignstmt incorrect
it_it: Imperative_assignstmt non valido
ja_jp: Imperative_assignstmt が無効です
ko_kr: 잘못된 Imperative_assignstmt
pl_pl: nieprawidłowy Imperative_assignstmt
pt_br: Imperative_assignstmt inválido
ru_ru: недопустимый Imperative_assignstmt
zh_cn: Imperative_assignstmt 无效
zh_tw: 無效的 Imperative_assignstmt

source: invalid Imperative_bitop
cs_cz: neplatný objekt Imperative_bitop
de_de: Ungültige Imperative_bitop
es_es: Imperative_bitop no válido
fr_fr: Imperative_bitop incorrect
it_it: Imperative_bitop non valido
ja_jp: Imperative_bitop が無効です
ko_kr: 잘못된 Imperative_bitop
pl_pl: nieprawidłowy Imperative_bitop
pt_br: Imperative_bitop inválido
ru_ru: недопустимый Imperative_bitop
zh_cn: Imperative_bitop 无效
zh_tw: 無效的 Imperative_bitop

source: invalid Imperative_decoratedIdentifier
cs_cz: neplatný objekt Imperative_decoratedIdentifier
de_de: Ungültige Imperative_decoratedIdentifier
es_es: Imperative_decoratedIdentifier no válido
fr_fr: Imperative_decoratedIdentifier incorrect
it_it: Imperative_decoratedIdentifier non valido
ja_jp: Imperative_decoratedIdentifier が無効です
ko_kr: 잘못된 Imperative_decoratedIdentifier
pl_pl: nieprawidłowy Imperative_decoratedIdentifier
pt_br: Imperative_decoratedIdentifier inválido
ru_ru: недопустимый Imperative_decoratedIdentifier
zh_cn: Imperative_decoratedIdentifier 无效
zh_tw: 無效的 Imperative_decoratedIdentifier

source: invalid Imperative_factor
cs_cz: neplatný objekt Imperative_factor
de_de: Ungültiger Imperative_factor
es_es: Imperative_factor no válido
fr_fr: Imperative_factor incorrect
it_it: Imperative_factor non valido
ja_jp: Imperative_factor が無効です
ko_kr: 잘못된 Imperative_factor
pl_pl: nieprawidłowy Imperative_factor
pt_br: Imperative_factor inválido
ru_ru: недопустимый Imperative_factor
zh_cn: Imperative_factor 无效
zh_tw: 無效的 Imperative_factor

source: invalid Imperative_forloop
cs_cz: neplatný objekt Imperative_forloop
de_de: Ungültige Imperative_forloop
es_es: Imperative_forloop no válido
fr_fr: Imperative_forloop incorrect
it_it: Imperative_forloop non valido
ja_jp: Imperative_forloop が無効です
ko_kr: 잘못된 Imperative_forloop
pl_pl: nieprawidłowy Imperative_forloop
pt_br: Imperative_forloop inválido
ru_ru: недопустимый Imperative_forloop
zh_cn: Imperative_forloop 无效
zh_tw: 無效的 Imperative_forloop

source: invalid Imperative_functiondecl
cs_cz: neplatný objekt Imperative_functiondecl
de_de: Ungültige Imperative_functiondecl
es_es: Imperative_functiondecl no válido
fr_fr: Imperative_functiondecl incorrect
it_it: Imperative_functiondecl non valido
ja_jp: Imperative_functiondecl が無効です
ko_kr: 잘못된 Imperative_functiondecl
pl_pl: nieprawidłowy Imperative_functiondecl
pt_br: Imperative_functiondecl inválido
ru_ru: недопустимый Imperative_functiondecl
zh_cn: Imperative_functiondecl 无效
zh_tw: 無效的 Imperative_functiondecl

source: invalid Imperative_ifstmt
cs_cz: neplatný objekt Imperative_ifstmt
de_de: Ungültige Imperative_ifstmt
es_es: Imperative_ifstmt no válido
fr_fr: Imperative_ifstmt incorrect
it_it: Imperative_ifstmt non valido
ja_jp: Imperative_ifstmt が無効です
ko_kr: 잘못된 Imperative_ifstmt
pl_pl: nieprawidłowy Imperative_ifstmt
pt_br: Imperative_ifstmt inválido
ru_ru: недопустимый Imperative_ifstmt
zh_cn: Imperative_ifstmt 无效
zh_tw: 無效的 Imperative_ifstmt

source: invalid Imperative_languageblock
cs_cz: neplatný objekt Imperative_languageblock
de_de: Ungültiger Imperative_languageblock
es_es: Imperative_languageblock no válido
fr_fr: Imperative_languageblock incorrect
it_it: Imperative_languageblock non valido
ja_jp: Imperative_languageblock が無効です
ko_kr: 잘못된 Imperative_languageblock
pl_pl: nieprawidłowy Imperative_languageblock
pt_br: Imperative_languageblock inválido
ru_ru: недопустимый Imperative_languageblock
zh_cn: Imperative_languageblock 无效
zh_tw: 無效的 Imperative_languageblock

source: invalid Imperative_logicalop
cs_cz: neplatný objekt Imperative_logicalop
de_de: Ungültige Imperative_logicalop
es_es: Imperative_logicalop no válido
fr_fr: Imperative_logicalop incorrect
it_it: Imperative_logicalop non valido
ja_jp: Imperative_logicalop が無効です
ko_kr: 잘못된 Imperative_logicalop
pl_pl: nieprawidłowy Imperative_logicalop
pt_br: Imperative_logicalop inválido
ru_ru: недопустимый Imperative_logicalop
zh_cn: Imperative_logicalop 无效
zh_tw: 無效的 Imperative_logicalop
