Repository: DynamoDS/Dynamo
Catalog: src/Engine/ProtoCore/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# AttributeArgMustBeConstant
source: An attribute argument must be a constant expression
cs_cz: Argument atributu musí být konstantní výraz
de_de: Ein Attributargument muss ein Konstantenausdruck sein.
es_es: Un argumento de atributo debe ser una expresión constante
fr_fr: Un argument d'attribut doit être une expression constante
it_it: Un argomento attributo deve essere un'espressione costante
ja_jp: 属性引数は定数式にする必要があります
ko_kr: 속성 인수는 상수 표현식이어야 합니다
pl_pl: Argument atrybutu musi być wyrażeniem stałym
pt_br: Um argumento de atributo deve ser uma expressão constante
ru_ru: Аргумент атрибута должен являться постоянным выражением
zh_cn: 属性参数必须是常数表达式
zh_tw: 屬性引數必須為常數表示式

# BaseIsExpectedToCallBaseConstructor
source: The keyword 'base' is expected here to call the base class constructor
cs_cz: Klíčové slovo „základna“ je zde očekáváno za účelem volání konstruktoru základní třídy.
de_de: Schlüsselwort 'base' wird hier erwartet, um den Konstruktor der Basisklasse aufzurufen.
es_es: La palabra clave 'base' se esperaba aquí para llamar al constructor de clase base
fr_fr: Le mot-clé 'base' est attendu pour appeler le constructeur de classe de base
it_it: Parola chiave 'base' prevista in questo contesto per chiamare il costruttore della classe di base
ja_jp: ベース クラスのコンストラクタを呼び出すには、ここにキーワード「base」が必要です
ko_kr: 기준 클래스 생성자를 호출하려면 여기에 키워드 '기준'이 필요합니다
pl_pl: Słowo kluczowe 'baza' jest tutaj oczekiwane, aby przywołać konstruktor klasy bazowej
pt_br: A palavra-chave 'base' é esperada aqui para chamar a classe base Constructor
ru_ru: Ключевое слово «базовый» здесь обозначает конструктор начального класса
zh_cn: 此处应输入关键字“base”以调用基本类构造函数
zh_tw: 這裡預期關鍵字 'base'，以呼叫基準類別建構函式

# CheckIfTheElementsInListAreSameType
source: Checks if all the elements in the specified list are of the same type
cs_cz: Kontroluje, zda jsou všechny prvky v určeném seznamu stejného typu.
de_de: Prüft, ob alle Elemente in der angegebenen Liste zum selben Typ gehören.
es_es: Comprueba si todos los elementos de la lista especificada son del mismo tipo
fr_fr: Vérifie si tous les éléments dans la liste spécifiée sont du même type
it_it: Verifica se tutti gli elementi dell'elenco specificato sono dello stesso tipo
ja_jp: 指定したリスト内のすべての要素が同じタイプかどうかを確認します
ko_kr: 지정된 리스트의 모든 요소가 동일한 유형인지 확인합니다
pl_pl: Sprawdza, czy wszystkie elementy z określonej listy są tego samego typu
pt_br: Verifica se todos os elementos na lista especificada são do mesmo tipo
ru_ru: Выполняется проверка того, все ли элементы в указанном списке подпадают под один тип
zh_cn: 检查指定列表中所有元素的类型是否相同
zh_tw: 檢查指定清單中的所有元素是否屬於相同類型

# ChecksIfLengthsAreSameInMultiDimentionalList
source: Checks if each of rows in multidimensional list has the same number of elements
cs_cz: Kontroluje, zda jednotlivé řádky ve vícerozměrném seznamu mají stejný počet prvků .
de_de: Prüft, ob alle Zeilen in der multidimensionalen Liste dieselbe Anzahl von Elementen enthalten.
es_es: Comprueba si cada una de las filas de la lista multidimensional tiene el mismo número de elementos
fr_fr: Vérifie si chacune des lignes dans la liste multidimensionnelle contient le même nombre d'éléments
it_it: Verifica se ogni riga dell'elenco multidimensionale presenta lo stesso numero di elementi
ja_jp: 多次元のリスト内にあるそれぞれの行の要素の数が同じかどうかを確認します
ko_kr: 다차원 리스트의 각 행의 요소 수가 같은지 확인합니다
pl_pl: Sprawdza, czy każdy z wierszy na liście wielowymiarowej ma taką samą liczbę elementów
pt_br: Verifica se todas as linhas na lista multidimensional têm o mesmo número de elementos
ru_ru: Проверка того, во всех ли строках в многоплановом списке имеется одинаковое число элементов
zh_cn: 检查多维列表中所有行是否都具有相同数量的元素
zh_tw: 檢查多維清單中的每一列是否都具有相同的元素數目

# ChecksIfListContainsTheElement
source: Checks if the specified element is present in the specified list
cs_cz: Kontroluje, zda je daný prvek v zadaném seznamu.
de_de: Überprüft, ob das angegebene Element in der angegebenen Liste enthalten ist.
es_es: Comprueba si el elemento especificado está presente en la lista especificada
fr_fr: Vérifie si l'élément spécifié est déjà dans la liste
it_it: Verifica se l'elemento specificato è presente nell'elenco specificato
ja_jp: 指定した要素が指定したリストにあるかどうかを確認します
ko_kr: 지정된 요소가 지정된 리스트에 존재하는지 확인합니다
pl_pl: Sprawdza, czy określony element znajduje się na określonej liście
pt_br: Verifica se o elemento especificado está presente na lista especificada
ru_ru: Проверка наличия указанного элемента в заданном списке
zh_cn: 检查指定列表中是否存在指定图元
zh_tw: 檢查指定的元素是否出現在指定的清單中

# ChecksIfTheListIsAllFalse
source: Checks if all elements in the specified list are false
cs_cz: Zkontroluje, zda mají všechny prvky v určeném seznamu hodnotu false.
de_de: Prüft, ob alle Elemente in der angegebenen Liste false sind.
es_es: Comprueba si todos los elementos de la lista especificada son False
fr_fr: Vérifie si tous les éléments de la liste spécifiée sont faux
it_it: Verifica se tutti gli elementi nell'elenco specificato sono false
ja_jp: 指定したリスト内のすべての要素が false かどうかを確認します
ko_kr: 지정된 리스트의 모든 요소가 false인지 확인합니다
pl_pl: Sprawdza, czy wszystkie elementy z określonej listy mają wartość fałsz
pt_br: Verifica se todos os elementos na lista especificada são falsos
ru_ru: Проверка того, все ли элементы имеют значение «ложь»
zh_cn: 检查指定列表中的所有元素是否均为“False”
zh_tw: 檢查指定清單中的所有元素是否全都為 False

# ChecksIfTheListIsAllTrue
source: Checks if all elements in the specified list are true
cs_cz: Zkontroluje, zda mají všechny prvky v určeném seznamu hodnotu true.
de_de: Prüft, ob alle Elemente in der angegebenen Liste true sind.
es_es: Comprueba si todos los elementos de la lista especificada son True
fr_fr: Vérifie si tous les éléments de la liste spécifiée sont True
it_it: Verifica se tutti gli elementi nell'elenco specificato sono true
ja_jp: 指定したリスト内のすべての要素が True かどうかを確認します
ko_kr: 지정된 리스트의 모든 요소가 true인지 확인합니다
pl_pl: Sprawdza, czy wszystkie elementy z określonej listy mają wartość prawda
pt_br: Verifica se todos os elementos na lista especificada são verdadeiros
ru_ru: Проверка того, все ли элементы имеют значение «истина»
zh_cn: 检查指定列表中的所有元素是否均为“True”
zh_tw: 檢查指定清單中的所有元素是否全都為 True

# ChecksListWithUniformDepth
source: Checks if the list has a uniform depth
cs_cz: Kontroluje, zda má seznam jednotnou hloubkou.
de_de: Prüft, ob der Liste eine einheitliche Tiefe aufweist.
es_es: Comprueba si la lista tiene una profundidad uniforme
fr_fr: Vérifie si la liste a une profondeur uniforme
it_it: Verifica se l'elenco presenta una profondità uniforme
ja_jp: リストの深さが一定であるかどうかを確認します
ko_kr: 리스트의 깊이가 균일한지 확인합니다
pl_pl: Sprawdza, czy lista ma jednolitą głębokość
pt_br: Verifica se a lista tem uma profundidade uniforme
ru_ru: Проверка равномерности глубины списка
zh_cn: 检查列表是否具有均匀深度
zh_tw: 檢查清單是否具有均勻的深度

# CloseBracketExpected
source: ')' expected - Imcomplete Closure
cs_cz: očekáváno ')' – Neúplné uzavření
de_de: ')' erwartet – Unvollständiger Abschluss
es_es: se esperaba ')': cierre incompleto
fr_fr: ')' attendu - Fermeture incomplète
it_it: ')' previsto - Chiusura incompleta
ja_jp: ')' がありません - 括弧が不完全です
ko_kr: ')' 예상됨 - 불완전한 종료
pl_pl: Oczekiwano „)” — niepełne zamknięcie
pt_br: ')' esperado – Fechamento incompleto
ru_ru: Ожидается «)»: неполное закрытие
zh_cn: 应输入“)”- 半括号
zh_tw: 預期要有 ')' - 結束不完整

# ContainsKeys
source: Checks if the specified key is present in the specified key-value pair list
cs_cz: Kontroluje, zda se zadaný klíč nachází v zadaném seznamu dvojic klíč-hodnota.
de_de: Prüft, ob der angegebene Schlüssel in der angegebenen Liste von Schlüssel-Wert-Paaren vorhanden ist.
es_es: Comprueba si la clave especificada está presente en la lista de pares clave-valor
fr_fr: Vérifie si la clé spécifiée est répertoriée dans la liste de paires clé-valeur spécifiée
it_it: Verifica se la chiave specificata è presente nell'elenco di coppie chiave-valore specificato
ja_jp: 指定したキーが指定したキー値ペアのリストにあるかどうかを確認します
ko_kr: 지정된 키-값 쌍 리스트에 지정된 키가 존재하는지 확인합니다
pl_pl: Sprawdza, czy podany klucz jest obecny na określonej liście par klucz-wartość
pt_br: Verifica se a chave especificada está presente na lista de pares de valores-chave
ru_ru: Проверка наличия указанного ключа в заданном списке ключевых пар
zh_cn: 检查指定 key-value 对列表中是否存在指定关键点
zh_tw: 檢查指定的鍵是否存在於指定的鍵 - 值對清單中

# DeterminesObjectsAreEqual
source: Determines whether two object instances are equal
cs_cz: Určuje, zda jsou dvě instance objektu stejné.
de_de: Legt fest, ob zwei Objektinstanzen gleich sind.
es_es: Determina si dos ejemplares de objeto son iguales
fr_fr: Détermine si deux instances d'objets sont égales
it_it: Determina se due istanze di oggetto sono uguali
ja_jp: 2 つのオブジェクト インスタンスが等しいかどうかを判断します
ko_kr: 두 객체 인스턴스(instance)가 같은지 여부를 확인합니다
pl_pl: Określa, czy dwa wystąpienia obiektu są równe
pt_br: Determina se as duas instâncias de objeto são iguais
ru_ru: Определение эквивалентности двух экземпляров объекта
zh_cn: 确定两个对象实例是否相等
zh_tw: 判定兩個物件例證是否相等

source: Empty character literal
cs_cz: Prázdný literál znaku
de_de: Leeres Zeichenliteral
es_es: Carácter literal vacío
fr_fr: Littéral de caractère vide
it_it: Carattere di tipo letterale vuoto
ja_jp: 空の文字リテラル
ko_kr: 빈 문자 리터럴
pl_pl: Pusty literał znakowy
pt_br: Caractere literal vazio
ru_ru: Пустой литерал символа
zh_cn: 空字符文字
zh_tw: 空字元文字

# FailedToImport
source: Failed to import {0}
cs_cz: Nezdařilo se naimportovat {0}.
de_de: Fehler beim Importieren von {0}
es_es: Error al importar {0}
fr_fr: Echec de l'importation de {0}
it_it: Impossibile importare {0}
ja_jp: {0} の読み込みに失敗しました
ko_kr: {0}을(를) 가져오지 못했습니다
pl_pl: Nie udało się zaimportować {0}
pt_br: Falha ao importar {0}
ru_ru: Не удалось импортировать {0}
zh_cn: 无法导入 {0}
zh_tw: 無法匯入 {0}

# FunctionCallCannotBeAtLeftSide
source: A function call is not allowed on the left hand side of an assignment
cs_cz: Volání funkce není povoleno na levé straně přiřazení.
de_de: Ein Funktionsaufruf ist auf der linken Seite einer Zuweisung nicht zulässig.
es_es: Una llamada de función no se permite en el lado izquierdo de una asignación
fr_fr: Un appel de fonction n'est pas autorisé sur le côté gauche d'une affectation
it_it: Le chiamate di funzione non sono consentite sul lato sinistro di un'assegnazione
ja_jp: 割り当ての左側では、関数呼び出しが許可されていません
ko_kr: 지정의 왼쪽에는 함수 호출을 사용할 수 없습니다
pl_pl: Wywołanie funkcji nie jest dozwolone po lewej stronie przypisania
pt_br: A chamada de função não é permitida no lado esquerdo de uma atribuição
ru_ru: Вызов функции не разрешен в левой части задания
zh_cn: 分配项左侧不允许调用函数
zh_tw: 指定的左側不允許函數呼叫

# GetKeys
source: Gets all keys from the specified key-value pair list
cs_cz: Získá všechny klíče ze zadaného seznam dvojic klíč-hodnota.
de_de: Ruft alle Schlüssel aus der angegebenen Liste mit Schlüssel-Wert-Paaren ab.
es_es: Obtiene todas las claves de la lista de pares clave-valor
fr_fr: Obtient toutes les clés à partir de la liste de paires clé-valeur spécifiée
it_it: Ottiene tutte le chiavi dall'elenco di coppie chiave-valore specificato
ja_jp: 指定したキーと値のペアのリストからすべてのキーを取得します
ko_kr: 지정된 키-값 쌍 리스트에서 모든 키를 가져옵니다
pl_pl: Pobiera wszystkie klucze z określonej listy par klucz-wartość
pt_br: Obtém todas as chaves da lista de pares de valores chave
ru_ru: Получение всех ключей из заданного списка ключевых пар
zh_cn: 从指定关键值对列表获取所有关键点
zh_tw: 從指定的鍵 - 值對清單中取得所有鍵

# Gettypes
source: Gets the Type of the current instance
cs_cz: Získá typ aktuální instance
de_de: Ruft den Typ der aktuellen Instanz ab.
es_es: Obtiene el tipo del ejemplar actual
fr_fr: Obtient le type de l'occurrence actuelle
it_it: Ottiene il tipo dell'istanza corrente
ja_jp: 現在のインスタンスの Type を取得します
ko_kr: 현재 인스턴스(instance)의 유형을 가져옵니다
pl_pl: Pobiera typ bieżącego wystąpienia
pt_br: Obtém o tipo da instância atual
ru_ru: Получение типа текущего экземпляра
zh_cn: 获取当前实例的类型
zh_tw: 取得目前例證的類型

# GetValues
source: Gets all values stored in the specified key-value pair list and for a simple list it returns all elements in the list
cs_cz: Vrátí všechny hodnoty uložené v zadaném seznamu dvojic klíč-hodnota a pro jednoduchý seznam vrátí všechny prvky v seznamu.
de_de: Ruft alle Werte in der angegebenen Liste mit Schlüssel-Wert-Paaren ab, und gibt im Fall einer einfachen Liste sämtliche Elemente in der Liste zurück.
es_es: Obtiene todos los valores guardados en la lista de pares clave-valor y para una lista sencilla devuelve todos los elementos de la lista
fr_fr: Obtient toutes les valeurs de la liste de paires clé-valeur spécifiée et, pour une liste simple, renvoie tous les éléments dans la liste
it_it: Ottiene tutti i valori memorizzati nell'elenco di coppie chiave-valore specificato. Per un elenco semplice, restituisce tutte le voci dell'elenco
ja_jp: 指定したキーと値のペアのリストに格納されているすべての要素を返します。シンプルなリストの場合は、リストのすべての要素を返します
ko_kr: 지정된 키-값 쌍 리스트에 저장된 모든 값을 가져오며 단순 리스트의 경우 리스트의 모든 요소를 반환합니다
pl_pl: Pobiera wszystkie wartości przechowywane na określonej liście par klucz-wartość, a dla prostej listy zwraca wszystkie elementy z listy
pt_br: Obtém os valores armazenados na lista de pares de valores chave e para uma lista simples retorna todos os elementos na lista
ru_ru: Получение всех значений, хранящихся в заданном списке ключевых пар. В случае простого списка, в результате выводятся все элементы данного списка
zh_cn: 获取存储在指定关键值对列表中的所有值，对于简单列表，它将返回列表中的所有元素
zh_tw: 取得指定鍵 - 值對清單中儲存的所有值，而且若為簡單清單，它會傳回清單中的所有元素

# ImportFileByGivenFilePath
source: Imports data from a text file containing comma separated values into two-dimensional list
cs_cz: Importuje data z textového souboru obsahujícího hodnoty oddělené čárkou do dvojrozměrného seznamu.
de_de: Importiert Daten aus einer Textdatei mit kommagetrennten Werten in eine zweidimensionalen Liste.
es_es: Importa los datos de un archivo de texto que contiene valores separados por comas a lista bidimensional
fr_fr: Importe des données à partir d'un fichier texte contenant des valeurs séparées par des virgules dans une liste bidimensionnelle
it_it: Importa dati da un file di testo contenente valori delimitati da virgole in un elenco bidimensionale
ja_jp: カンマで区切られた値を含むテキスト ファイルからデータを 2 次元のリストに読み込みます
ko_kr: 쉼표로 구분된 값이 포함된 텍스트 파일의 데이터를 2차원 리스트로 가져옵니다
pl_pl: Importuje dane z pliku tekstowego zawierającego wartości oddzielone przecinkami do listy dwuwymiarowej
pt_br: Importa dados de um arquivo de texto que contém valores separados por vírgula em uma lista bidimensional
ru_ru: Импорт данных из текстового файла, содержащего значения, разделенные запятыми, в двумерный список
zh_cn: 将数据从文本文件(包含用逗号分隔的值)导入二维列表
zh_tw: 將資料從包含逗號分隔值的文字檔匯入至二維清單

# ImportFileByGivenFilePathWithMode
source: Imports data from a text file containing comma separated values into two-dimensional list and also transpose the output list if specified
cs_cz: Importuje data z textového souboru, který obsahuje hodnoty oddělené čárkami, do dvojrozměrného seznamu a také převádí výstup (pokud je určen).
de_de: Importiert Daten aus einer Textdatei mit kommagetrennten Werten in eine zweidimensionale Liste, und versetzt die ausgegebene Liste, sofern angegeben.
es_es: Importa datos de un archivo de texto que contiene valores separados por comas en una lista bidimensional y también traslada la lista de salida si se especifica
fr_fr: Importe des données à partir d'un fichier texte contenant des valeurs séparées par des virgules dans une liste bidimensionnelle et transpose également la liste de sortie, si spécifié
it_it: Importa dati da un file di testo contenente valori delimitati da virgole in un elenco bidimensionale e traspone l'elenco di output se specificato
ja_jp: カンマで区切られた値を含むテキスト ファイルからデータを 2 次元のリストに読み込み、指定した場合は、出力リストを転置します
ko_kr: 쉼표로 구분된 값이 포함된 텍스트 파일의 데이터를 2차원 리스트로 가져오고 지정된 경우 출력 리스트의 행과 열을 바꿉니다
pl_pl: Importuje dane z pliku tekstowego zawierającego wartości oddzielone przecinkami do listy dwuwymiarowej, a także przestawia listę wyników, jeśli określono
pt_br: Importa dados de um arquivo de texto que contém valores separados por vírgula em uma lista bidimensional lista e também efetua a transposição da lista de saída se especificado
ru_ru: Импорт данных из текстового файла, содержащего значения, разделенные запятыми, в двумерный список, а также перенос выходного списка, если он указан
zh_cn: 将数据从文本文件(包含用逗号分隔的值)导入二维列表，并对输出列表(若已指定)进行转置
zh_tw: 將資料從包含逗號分隔值的文字檔匯入至二維清單，同時也轉置輸出清單 (如果指定)

# ImportStatementNotSupported
source: Imports statements are not supported in CodeBlock Nodes, please use the Library UI instead
cs_cz: Příkazy pro importování nejsou podporovány v uzlech CodeBlock, použijte místo nich uživatelské rozhraní knihovny.
de_de: Importanweisungen werden in CodeBlock-Blöcken nicht unterstützt, bitte stattdessen Bibliotheks-Benutzeroberfläche verwenden
es_es: Las sentencias de importación no se admiten en CodeBlock Nodes, utilice Library UI en su lugar
fr_fr: Les instructions Imports ne sont pas prises en charge dans les noeuds CodeBlock, veuillez utiliser l'interface utilisateur de la bibliothèque à la place
it_it: Le istruzioni di importazione non sono supportate nei nodi del blocco di codice. Utilizzare la libreria dell'interfaccia utente
ja_jp: CodeBlock Node では Imports ステートメントはサポートされていません。代わりに Library UI を使用してください
ko_kr: CodeBlock 노드에서는 Imports 문이 지원되지 않습니다. 대신 라이브러리 UI를 사용하십시오
pl_pl: Instrukcje importu nie są obsługiwane w węzłach CodeBlock, należy zamiast tego użyć interfejsu użytkownika biblioteki
pt_br: As declarações de importação não são suportada em nós do bloco de códigos, use em seu lugar a biblioteca da interface de usuário
ru_ru: Импортируются выражения, не поддерживаемые узлами CodeBlock. Используйте вместо этого интерфейс библиотеки.
zh_cn: 导入语句在 CodeBlock 节点中不受支持，请使用库 UI
zh_tw: CodeBlock 節點不支援匯入陳述式，請改用資源庫使用者介面

# InsertsAnElementIntoList
source: Inserts an element into a list at specified index
cs_cz: Vloží prvek do seznamu v zadaném indexu.
de_de: Fügt ein Element am angegebenen Index in eine Liste ein.
es_es: Inserta un elemento en una lista en el índice especificado
fr_fr: Insère un élément dans une liste à l'index spécifié
it_it: Inserisce un elemento in un elenco in corrispondenza dell'indice specificato
ja_jp: インデックスを指定し、要素をリストに挿入します
ko_kr: 요소를 지정된 인덱스의 리스트에 삽입합니다
pl_pl: Wstawia element na listę o określonym indeksie
pt_br: Insere um elemento em uma lista no índice especificado
ru_ru: Вставка элемента в список по заданному индексу
zh_cn: 在指定索引处将元素插入列表中
zh_tw: 將元素插入至清單中的指定索引

# InvalidLanguageBlockIdentifier
source: \"{0}\" is not a valid language block identifier, do you mean \"Associative\" or \"Imperative\"?
cs_cz: \„{0}\“ není platný identifikátor bloku jazyka, nemysleli jste \„Asociativní\“ nebo \„Imperativní\“?
de_de: \"{0}\" ist keine gültige Kennung für einen Sprachenblock. Ist \"Assoziative\" oder \"Imperativ\" gemeint?
es_es: \"{0}\" no es un identificador de bloque de lenguaje válido, ¿quiere decir \"Associative\" o \"Imperative\"?
fr_fr: \"{0}\" n'est pas un identificateur de bloc de langage valide, voulez-vous dire \"Associative\" or \"Imperative\"?
it_it: \"{0}\" non è un identificatore del blocco di linguaggio valido. Specificare \" Associative\" o \"Imperative\"?
ja_jp: \"{0}\" は有効な言語ブロック識別子ではありません。\"Associative\" または \"Imperative\" を使用しますか?
ko_kr: \"{0}\"은(는) 유효한 언어 블록 식별자가 아닙니다. \"결합형\" 또는 \"명령형\"을 의미합니까?
pl_pl: \"{0}\" nie jest prawidłowym identyfikatorem bloku języka, czy powinno być \"Skojarzony\" lub \"Imperatywny\"?
pt_br: \"{0}\" não é um identificador de bloco de linguagem válido e você quer dizer \"Associativo\" ou \"Imperativo\"?
ru_ru: \"{0}\" является недопустимым идентификатором языкового блока. Вы имеете в виду \"Associative\" или \"Imperative\"?
zh_cn: \"{0}\" 不是有效的语言块标识符，您是指 \"Associative\" 还是 \"Imperative\"？
zh_tw: \"{0}\" 不是有效的語言區塊識別碼，您表示 \"Associative\" 還是 \"Imperative\"？

# InvalidSymbol
source: Syntax Error: invalid symbol '{0}'. (Did you mean to use Modifier Stack \" => \")
cs_cz: Chyba syntaxe: neplatný symbol „{0}“. (Možná jste chtěli použít modifikátor \„ => \“)
de_de: Syntaxfehler: Ungültiges Symbol '{0}'. (Ist die Verwendung von Modifikatorstapel \" => \" beabsichtigt?)
es_es: Error de sintaxis: símbolo no válido '{0}'. (¿Quería decir utilizar pila de modificadores \" => \"?)
fr_fr: Erreur de syntaxe: symbole incorrect '{0}'. (Vouliez-vous utiliser la pile des modificateurs \" => \")
it_it: Errore di sintassi: simbolo '{0}' non valido. Si intendeva utilizzare lo stack di modifica \" => \"
ja_jp: 構文エラー: 無効な記号 '{0}' です。(Modifier Stack \" => \" を使用しますか)
ko_kr: 구문 오류: 잘못된 기호 '{0}'. (수정자 스택 \" => \"을 사용하시겠습니까?)
pl_pl: Błąd składni: nieprawidłowy symbol '{0}'. (Czy chcesz użyć stosu modyfikatorów \" => \")
pt_br: Erro de sintaxe: símbolo inválido '{0}'. (Você quis dizer para utilizar o modificador de pilha \" => \")
ru_ru: Синтаксическая ошибка: недопустимый символ '{0}'. (Вы планировали использовать стек модификаций? \" => \")
zh_cn: 语法错误: 符号 '{0}' 无效。(您是要使用修改器堆栈 \" => \" 吗)
zh_tw: 語法錯誤：無效的符號 '{0}'。 (是否表示使用修改子堆疊 \" => \")

# kAlreadyImported
source: File : '{0}' is already imported
cs_cz: Soubor: „{0}“ je již importován
de_de: Datei: '{0}' ist bereits importiert
es_es: El archivo: '{0}' ya se ha importado
fr_fr: Fichier: '{0}' déjà importé
it_it: File: '{0}' già importato
ja_jp: ファイル: '{0}' は読み込み済みです
ko_kr: '{0}' 파일은 이미 가져왔습니다
pl_pl: Plik: '{0}' został już zaimportowany
pt_br: O arquivo: '{0}' já está importado
ru_ru: Файл: '{0}' уже импортирован
zh_cn: 文件: '{0}' 已经导入
zh_tw: 已匯入檔案：'{0}'

# kAmbigousMethodDispatch
source: Internal error, please report: Function could not be found on final dispatch (e5235508)
cs_cz: Nahlaste vnitřní chybu: Funkci nebylo možné při posledním odeslání nalézt.
de_de: Interner Fehler, bitte melden: Funktion konnte für abschließende Ausgabe nicht gefunden werden.
es_es: Error interno, informe: no se ha podido encontrar la función en envío final.
fr_fr: Erreur interne, veuillez signaler: fonction introuvable dans la répartition finale.
it_it: Errore interno, segnalare: impossibile trovare la funzione nell'invio finale.
ja_jp: 内部エラーです。次の内容を報告してください。最後のディスパッチに関数が見つかりませんでした
ko_kr: 내부 오류. 신고하십시오. 최종 디스패치에서 함수를 찾을 수 없습니다.
pl_pl: Błąd wewnętrzny, raportuj: funkcja nie może być odnaleziona w ostatecznej wysyłce.
pt_br: Erro interno, reporte: a função não pôde ser encontrado no envio final.
ru_ru: Внутренняя ошибка. Отправьте отчет: функция не найдена в финальной отправке.
zh_cn: 内部错误，请报告: 最终调用上找不到函数。
zh_tw: 內部錯誤，請報告：最終發送時找不到函數。

# kArgumentTypeUndefined
source: Type '{0}' of argument '{1}' is not defined
cs_cz: Typ „{0}“ argumentu „{1}“ není definován.
de_de: Typ '{0}' von Argument '{1}' ist nicht definiert.
es_es: Tipo '{0}' de argumento '{1}' no definido
fr_fr: Le type '{0}' d'argument '{1}' n'est pas défini
it_it: Il tipo '{0}' dell'argomento '{1}' non è definito
ja_jp: 引数 '{1}' のタイプ '{0}' が設定されていません
ko_kr: '{1}' 인수의 '{0}' 유형이 정의되지 않았습니다
pl_pl: Typ '{0}' argumentu '{1}' nie jest zdefiniowany
pt_br: O tipo '{0}' do argumento '{1}' não está definido
ru_ru: Тип '{0}' аргумента '{1}' не определен
zh_cn: 参数 '{1}' 的类型 '{0}' 未定义
zh_tw: 未定義引數 '{1}' 的類型 '{0}'

# kArrayOverIndexed
source: The index is outside the given range
cs_cz: Index je mimo zadaný rozsah href=kArrayOverIndexed.html
de_de: Der Index liegt außerhalb des angegebenen Bereichs href=kArrayOverIndexed.html
es_es: El índice está fuera del rango especificado. href=kArrayOverIndexed.html
fr_fr: L'index est en dehors de la plage donnée href=kArrayOverIndexed.html
it_it: L'indice non rientra nell'intervallo specificato href=kArrayOverIndexed.html
ja_jp: インデックスは指定した範囲の外です href=kArrayOverIndexed.html
ko_kr: 인덱스가 지정된 범위 밖에 있습니다. href=kArrayOverIndexed.html
pl_pl: Indeks jest poza podanym zakresem href=kArrayOverIndexed.html
pt_br: O índice está fora da faixa especificada href=kArrayOverIndexed.html
ru_ru: Индекс выходит за пределы заданного диапазона href=kArrayOverIndexed.html
zh_cn: 索引超出给定范围 href=kArrayOverIndexed.html
zh_tw: 索引超出給定範圍 href=kArrayOverIndexed.html
