Repository: DynamoDS/Dynamo
Catalog: src/Engine/ProtoCore/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# kArrayRankReduction
source: Type conversion would cause array rank reduction. This is not permitted outside of replication. {511ED65F-FB66-4709-BDDA-DCD5E053B87F}
cs_cz: Převod typu způsobí snížení pořadí pole. To není povoleno mimo replikace. {511ED65F-FB66-4709-BDDA-DCD5E053B87F}
de_de: Eine Typumwandlung würde zu einer Reduktion des Array-Rangs führen. Dies ist außerhalb der Replizierung nicht zulässig. {511ED65F-FB66-4709-BDDA-DCD5E053B87F}
es_es: La conversión de tipo causaría reducción de clasificación de matrices. Esto no se permite fuera de replicación. {511ED65F-FB66-4709-BDDA-DCD5E053B87F}
fr_fr: La conversion du type provoquerait la réduction du classement du réseau. Cette opération n'est pas autorisée en dehors de la réplication. {511ED65F-FB66-4709-BDDA-DCD5E053B87F}
it_it: La conversione del tipo provocherebbe la riduzione dell'ordine della matrice. L'operazione non è consentita al di fuori della replica. {511ED65F-FB66-4709-BDDA-DCD5E053B87F}
ja_jp: タイプ変換により配列ランクが減少することがあります。この操作は複製以外では実行できません。{511ED65F-FB66-4709-BDDA-DCD5E053B87F}
ko_kr: 유형을 변환하면 배열 순위가 감소합니다. 복제 범위 밖에서는 허용되지 않습니다. {511ED65F-FB66-4709-BDDA-DCD5E053B87F}
pl_pl: Konwersja typu może spowodować zmniejszenie rangi szyku. Operacja ta jest niedozwolona poza replikacją. {511ED65F-FB66-4709-BDDA-DCD5E053B87F}
pt_br: A conversão do tipo irá causar a redução de classificação da matriz. Esta não é permitida fora de replicação. {511ED65F-FB66-4709-BDDA-DCD5E053B87F}
ru_ru: Преобразование типа приведет к снижению ранга массива. Это действие не допускается вне репликации. {511ED65F-FB66-4709-BDDA-DCD5E053B87F}
zh_cn: 类型转换将导致数组秩减小。在重复内容以外不被允许。{511ED65F-FB66-4709-BDDA-DCD5E053B87F}
zh_tw: 類型轉換將導致陣列等級降低。不允許在複製外發生此情況。{511ED65F-FB66-4709-BDDA-DCD5E053B87F}

# kAssignNonCharacterToString
source: A string must be made up of characters
cs_cz: Řetězec musí být tvořen ze znaků.
de_de: Eine Zeichenfolge muss aus Zeichen bestehen.
es_es: Una cadena debe estar formada por caracteres
fr_fr: Une chaîne doit être composée de caractères
it_it: Le stringhe devono essere composte da caratteri
ja_jp: 文字列は文字で構成する必要があります
ko_kr: 문자열은 문자로 구성되어야 합니다
pl_pl: Ciąg musi składać się ze znaków
pt_br: Uma sequência de caracteres deve ser composta de caracteres
ru_ru: Строка должна содержать символы
zh_cn: 字符串必须由字符组成
zh_tw: 字串必須由字元構成

# kAssingToThis
source: 'this' is readonly and cannot be assigned to
cs_cz: hodnota „this“ je jen pro čtení a nelze k ní přiřazovat
de_de: 'this' ist schreibgeschützt und kann nicht zugewiesen werden an
es_es: 'this' es de solo lectura y no se puede asignar a
fr_fr: 'this' est en lecture seule et ne peut pas être affecté à
it_it: 'this' è di sola lettura e non può essere assegnato a
ja_jp: 'this' は読み込み専用であり、割り当てることはできません
ko_kr: '이' 항목은 읽기 전용이며 지정할 수 없습니다
pl_pl: 'ten' jest tylko do odczytu i nie może być przypisany
pt_br: 'este' é de somente leitura e não pode ser atribuído para
ru_ru: 'это' доступно только для чтения и не может быть назначено
zh_cn: 'this' 为只读，不能赋值
zh_tw: 'this' 是唯讀的，無法指定

# kCallingConstructorInConstructor
source: Cannot call the constructor '{0}()' inside itself
cs_cz: Nelze volat konstruktor „{0}()“ uvnitř sebe sama.
de_de: Konstruktor '{0}()' kann nicht in sich selbst aufgerufen werden.
es_es: No se puede llamar al constructor '{0}()' dentro de él
fr_fr: Impossible d'appeler le constructeur '{0}()' à l'intérieur de lui-même
it_it: Impossibile chiamare il costruttore '{0}()' all'interno di se stesso
ja_jp: コンストラクタ '{0}()' をそれ自身の中で呼び出すことはできません。
ko_kr: 생성자 자체 내에서 '{0}()' 생성자를 호출할 수 없습니다
pl_pl: Nie można przywołać konstruktora '{0}()' wewnątrz niego
pt_br: Não é possível chamar o construtor '{0}()' dentro de si próprio
ru_ru: Невозможно вызвать конструктор '{0}()' внутри его самого
zh_cn: 无法调用自身内部的构造函数 '{0}()'
zh_tw: 無法在本身內部呼叫建構函式 '{0}()'

# KCallingConstructorOnInstance
source: Cannot call the constructor '{0}()' on an existing object
cs_cz: Nelze volat konstruktor „{0}()“ na existujícím objektu.
de_de: Konstruktor '{0}()' kann nicht für vorhandenes Objekt aufgerufen werden.
es_es: No se puede llamar al constructor '{0}()' en un objeto existente
fr_fr: Impossible d'appeler le constructeur '{0}()' sur un objet existant
it_it: Impossibile chiamare il costruttore '{0}()' per un oggetto esistente
ja_jp: コンストラクタ '{0}()' を既存のオブジェクト上で呼び出すことはできません
ko_kr: 기존 객체에서 '{0}()' 생성자를 호출할 수 없습니다
pl_pl: Nie można przywołać konstruktora '{0}()' na istniejącym obiekcie
pt_br: Não é possível chamar o construtor '{0}()' em um objeto existente
ru_ru: Невозможно вызвать конструктор '{0}()' для имеющегося объекта
zh_cn: 无法调用现有对象的构造函数 '{0}()'
zh_tw: 無法在既有物件上呼叫建構函式 '{0}()'

# kCallingNonStaticMethod
source: '{0}.{1}()' is not a static method
cs_cz: „{0}.{1}()“ není statická metoda
de_de: '{0}.{1}()' ist keine statische Methode.
es_es: '{0}.{1}()' no es un método estático
fr_fr: '{0}.{1}()' n'est pas une méthode statique
it_it: '{0}.{1}()' non è un metodo statico
ja_jp: '{0}.{1}()' は静的メソッドではありません
ko_kr: '{0}.{1}()'은(는) 정적 방법이 아닙니다
pl_pl: '.{0} {1}()' nie jest metodą statyczną
pt_br: '{0}.{1}()' não é um método estático
ru_ru: '{0}.{1}()' не является статическим методом
zh_cn: '{0}.{1}()' 不是静态方法函数
zh_tw: '{0}.{1}()' 不是靜態方法

# kCallingNonStaticProperty
source: '{0}.{1}' is not a static property
cs_cz: „{0}.{1}“ není statická vlastnost.
de_de: '{0}.{1}' ist keine statische Eigenschaft.
es_es: '{0}.{1}' no es una propiedad estática
fr_fr: '{0}.{1}' n'est pas une propriété statique
it_it: '{0}.{1}' non è una proprietà statica
ja_jp: '{0}.{1}' は静的プロパティではありません
ko_kr: '{0}.{1}'은(는) 정적 특성이 아닙니다
pl_pl: '{0}.{1}' nie jest właściwością statyczną
pt_br: '{0}.{1}' não é uma propriedade estática
ru_ru: '{0}.{1}' не является статическим свойством
zh_cn: '{0}.{1}' 不是静态特性
zh_tw: '{0}.{1}' 不是一個靜態性質

# kConsoleWarningMessage
source: > Runtime warning: {0}\n - \"{1}\" <line: {2}, col: {3}>
cs_cz: > Běhové varování: {0}\n - \„{1}\“ <řádek : {2}, sloupec: {3}>
de_de: > Laufzeitwarnung: {0}\n - \"{1}\" <Zeile: {2}, Spalte: {3}>
es_es: > Advertencia de tiempo de ejecución: {0}\n - \"{1}\" <line: {2}, col: {3}>
fr_fr: > Avertissement d'exécution: {0}\n - \"{1}\" <line: {2}, col: {3}>
it_it: > Avviso di runtime: {0}\n - \"{1}\" <riga: {2}, col: {3}>
ja_jp: > ランタイム警告: {0}\n - \"{1}\" <行: {2}、列: {3}>
ko_kr: > 런타임 경고: {0}\n - \"{1}\" <행: {2}, 열: {3}>
pl_pl: > Ostrzeżenie dla środowiska uruchomieniowego: {0}\n - \"{1}\" <line: {2}, col: {3}>
pt_br: > Aviso de tempo de execução: {0}\n - \"{1}\" <line: {2}, col: {3}>
ru_ru: > Предупреждение о времени выполнения: {0}\n - \"{1}\" <line: {2}, col: {3}>
zh_cn: > 运行警告: {0}\n - \"{1}\" <line: {2}, col: {3}>
zh_tw: > 執行時期警告：{0}\n - \"{1}\" <行：{2}，欄：{3}>

# kConvertArrayToNonArray
source: Converting an array to {0} would cause array rank reduction and is not permitted
cs_cz: Převod pole na {0} může způsobit snížení pořadí pole a není povolen. href=kConvertArrayToNonArray.html
de_de: Konvertieren eines Array in {0} würde eine Reduktion des Array-Rangs bewirken und ist nicht zulässig href=kConvertArrayToNonArray.html
es_es: La conversión de una matriz a {0} puede causar una reducción de clasificación de matrices y no está permitido. href=kConvertArrayToNonArray.html
fr_fr: La conversion d'un réseau en {0} provoquerait une réduction du classement du réseau et n'est pas autorisée href=kConvertArrayToNonArray.html
it_it: La conversione di una matrice in {0} provocherebbe la riduzione dell'ordine della matrice e non è consentita href=kConvertArrayToNonArray.html
ja_jp: 配列を {0} に変換すると、配列のランクが減りますが、これは許容されていません href=kConvertArrayToNonArray.html
ko_kr: 배열을 {0}(으)로 변환하면 배열 순위가 감소하며, 이는 허용되지 않습니다. href=kConvertArrayToNonArray.html
pl_pl: Przekonwertowanie szyku na {0} może spowodować zmniejszenie rangi szyku i nie jest dozwolone href=kConvertArrayToNonArray.html
pt_br: A conversão de uma matriz em {0} que causaria a redução da classificação da matriz não é permitida href=kConvertArrayToNonArray.html
ru_ru: Преобразование массива в {0} приведет к снижению ранга массива и поэтому не допускается href=kConvertArrayToNonArray.html
zh_cn: 将数组转换为 {0} 会导致数组秩减小，此结果不被允许 href=kConvertArrayToNonArray.html
zh_tw: 將陣列轉換為 {0} 會導致陣列等級降低，因此不允許 href=kConvertArrayToNonArray.html

# kConvertDoubleToInt
source: Converting a double to an int may lose information
cs_cz: Převod typu double na typ int může způsobit ztrátu informací.
de_de: Beim Konvertieren von double in int können Informationen verloren gehen.
es_es: La conversión de un doble en entero puede provocar pérdida de información.
fr_fr: La conversion d'un nombre double en nombre entier risque d'entraîner la perte d'informations.
it_it: La conversione di un valore Double in un numero intero potrebbe provocare la perdita di informazioni.
ja_jp: 倍精度浮動小数点数を整数に変換すると、情報が失われる場合があります。
ko_kr: double을 int으로 변환하면 정보가 손실될 수 있습니다.
pl_pl: Przekonwertowanie liczby o podwójnej precyzji (double) na liczbę całkowitą (int) może spowodować utratę informacji.
pt_br: A conversão de um valor duplo em um inteiro pode causar a perda de informações.
ru_ru: Преобразование двойного значения в данные int может привести к потере информации.
zh_cn: 将双精度型数据转换为整型可能会丢失信息。
zh_tw: 將倍精數轉換為整數可能會遺失資訊。

# kConvertNonConvertibleTypes
source: Asked to convert non-convertible types
cs_cz: Dotaz na převod nepřevoditelných typů
de_de: Konvertierung nicht konvertierbarer Typen angefordert
es_es: Solicitado convertir tipos no convertibles
fr_fr: A demandé à convertir des types non convertibles
it_it: È stato richiesto di convertire tipi non convertibili
ja_jp: 変換できないタイプの変換を要求しました
ko_kr: 변환 불가능한 유형의 변환을 요청했습니다
pl_pl: Monit o przekształcenie typów niemożliwych do przekształcenia
pt_br: Solicitado a converter tipos não conversíveis
ru_ru: Запрос на преобразование типов, преобразование которых невозможно
zh_cn: 要求转换不可转换类型
zh_tw: 要求轉換不可轉換的類型

# kCyclicDependency
source: A cyclic dependency exists between '{0}' and '{1}'
cs_cz: Mezi dvěma proměnnými existuje cyklická závislost. href=kCyclicDependency.html
de_de: Zwischen zwei Variablen besteht eine zyklische Abhängigkeit href=kCyclicDependency.html
es_es: Hay una dependencia cíclica entre dos variables. href=kCyclicDependency.html
fr_fr: Une dépendance cyclique existe entre deux variables href=kCyclicDependency.html
it_it: È presente una dipendenza ciclica tra due variabili href=kCyclicDependency.html
ja_jp: 2 つの変数間に循環従属関係が存在します href=kCyclicDependency.html
ko_kr: 두 변수 사이에 존재하는 주기적 의존성 href=kCyclicDependency.html
pl_pl: Istnieje cykliczna zależność między dwiema zmiennymi href=kCyclicDependency.html
pt_br: Existe uma dependência cíclica entre duas variáveis href=kCyclicDependency.html
ru_ru: Существует циклическая зависимость между двумя переменными href=kCyclicDependency.html
zh_cn: 两个变量之间存在循环从属关系 href=kCyclicDependency.html
zh_tw: 兩個變數之間存在循環相依性 href=kCyclicDependency.html

# kExceptionTypeUndefined
source: The exception type '{0}' is not defined
cs_cz: Typ výjimky „{0}“ není definován.
de_de: Der Ausnahmetyp '{0}' ist nicht definiert.
es_es: El tipo de excepción '{0}' no se ha definido
fr_fr: L'exception de type '{0}' n'est pas définie
it_it: Il tipo di eccezione '{0}' non è definito
ja_jp: 例外タイプ '{0}' が設定されていません
ko_kr: 예외 유형 '{0}'이(가) 정의되지 않았습니다
pl_pl: Typ wyjątku '{0}' nie jest zdefiniowany
pt_br: O tipo de exceção '{0}' não está definido
ru_ru: Тип исключения '{0}' не определен
zh_cn: 异常类型 '{0}' 未定义
zh_tw: 尚未定義例外類型 '{0}'

# keywordCannotBeUsedAsConstructorName
source: \"{0}\" is a keyword, it can't be used as constructor name
cs_cz: \„{0}\“ je klíčové slovo, nelze jej použít jako název konstruktoru.
de_de: \"{0}\" ist ein Schlüsselwort und kann nicht als Name für einen Konstruktor verwendet werden.
es_es: \"{0}\" es una palabra clave, no se puede utilizar como nombre de constructor
fr_fr: \"{0}\" est un mot-clé, il ne peut pas être utilisé en tant que nom du constructeur
it_it: \"{0}\" è una parola chiave, non può essere utilizzata come nome per il costruttore
ja_jp: \"{0}\" はキーワードであり、コンストラクタ名として使用できません
ko_kr: \"{0}\"은(는) 키워드이며 생성자 이름으로 사용할 수 없습니다
pl_pl: \"{0}\" jest słowem kluczowym, nie może być użyte jako nazwa konstruktora
pt_br: \"{0}\" é uma palavra-chave e não pode ser usada como nome do construtor
ru_ru: \"{0}\" является ключевым словом и не может использоваться в качестве имени конструктора
zh_cn: \"{0}\" 是关键字，不能用作构造函数名称
zh_tw: \"{0}\"是關鍵字，無法用作建構函式名稱

# keywordCantBeUsedAsIdentifier
source: \"{0}\" is a keyword, but an identifier was expected
cs_cz: \„{0}\“ je klíčové slovo, ale byl očekáván identifikátor.
de_de: \"{0}\" ist ein Schlüsselwort, es wird jedoch eine Kennung erwartet.
es_es: \"{0}\" es una palabra clave, pero se esperaba un identificador
fr_fr: {0}\"\" est un mot-clé, mais un identificateur était attendu
it_it: \"{0}\" è una parola chiave, ma era previsto un identificatore
ja_jp: \"{0}\" はキーワードですが、識別子が必要です
ko_kr: \"{0}\"은(는) 키워드이지만 식별자가 예상됩니다
pl_pl: \"{0}\" jest słowem kluczowym, ale oczekiwano identyfikatora
pt_br: \"{0}\" é uma palavra-chave, mas um identificador era esperado
ru_ru: \"{0}\" является ключевым словом, но идентификатор был ожидаемым
zh_cn: \"{0}\" 是关键字，应输入标识符
zh_tw: \"{0}\" 是關鍵字，但預期識別碼

# kFailToConverToFunction
source: Converting objects to a function pointer is not allowed
cs_cz: Převod objektů na ukazatel funkce není povolen.
de_de: Konvertieren von Objekten in einen Funktionszeiger ist nicht zulässig.
es_es: La conversión de objetos en puntero de función no está permitida
fr_fr: La conversion d'objets en pointeur de fonction n'est pas autorisée
it_it: La conversione di oggetti in puntatori funzione non è consentita
ja_jp: オブジェクトを関数ポインタに変換することはできません
ko_kr: 객체를 함수 포인터로 변환할 수 없습니다
pl_pl: Przekształcanie obiektów we wskaźnik do funkcji jest niedozwolone
pt_br: A conversão de objetos para um ponteiro de função não é permitida
ru_ru: Преобразование объектов в указатель функции не разрешено
zh_cn: 不允许将对象转换为函数指针
zh_tw: 不允許將物件轉換為函數指標

# kFailToConverToNull
source: Converting other things to null is not allowed
cs_cz: Převod dalších věcí na hodnotu NULL není povoleno.
de_de: Umwandeln anderer Objekte in Null ist nicht zulässig.
es_es: No se permite la conversión de otras cosas en nulo
fr_fr: La conversion d'autres éléments en éléments nuls n'est pas autorisée
it_it: La conversione di altri elementi in valori null non è consentita
ja_jp: 他の要素を NULL に変換することはできません
ko_kr: 다른 항목은 null로 변환할 수 없습니다
pl_pl: Przekształcanie innych elementów na puste nie jest dozwolone
pt_br: Converter outras coisas para nulo não é permitido
ru_ru: Преобразование других элементов в объекты с нулевым значением не допускается
zh_cn: 不允许将其它对象转换为空
zh_tw: 不允許將其他項目轉換為空值

# kFailToConverToPointer
source: Cannot convert objects to function pointers
cs_cz: Nelze převést objekty na ukazatele funkcí.
de_de: Objekte können nicht in Funktionszeiger konvertiert werden.
es_es: No se puede convertir objetos en punteros de función
fr_fr: Ne peut pas convertir des objets en pointeurs de fonction
it_it: Impossibile convertire oggetti in puntatori funzione
ja_jp: オブジェクトを関数ポインタに変換できません
ko_kr: 객체를 함수 포인터로 변환할 수 없습니다
pl_pl: Nie można przekształcić obiektów na wskaźniki do funkcji
pt_br: Não é possível converter os objetos para a ponteiros de função
ru_ru: Невозможно преобразовать объекты в указатели функции
zh_cn: 无法将对象转换为函数的指针
zh_tw: 無法將物件轉換為函數指標

# kFFIFailedToObtainObject
source: Failed to obtain object '{0}' for '{1}.{2}'
cs_cz: Nepodařilo se získat objekt „{0}“ pro „{1}.{2}“.
de_de: Objekt '{0}' für '{1}.{2}' konnte nicht abgerufen werden.
es_es: Error al obtener objeto '{0}' para '{1}.{2}'
fr_fr: Impossible d'obtenir l'objet '{0}' pour '{1}.{2}'
it_it: Impossibile ottenere l'oggetto '{0}' per '{1}.{2}'
ja_jp: '{1}.{2}' のオブジェクト '{0}' を取得できませんでした
ko_kr: '{1}.{2}'에 대해 '{0}' 객체를 가져오지 못했습니다
pl_pl: Nie można pobrać obiektu '{0}' dla {1}.{2}'
pt_br: Falha ao obter o objeto '{0}' para '{1}'.{2}
ru_ru: Не удалось получить объект '{0}' для '{1}.{2}'
zh_cn: 无法为 '{1}.{2}' 获取对象 '{0}'
zh_tw: 無法取得 '{2}.{1}' 的物件 '{0}

# kFFIFailedToObtainThisObject
source: Failed to obtain this object for '{0}.{1}'
cs_cz: Nepodařilo se získat tento objekt pro „{0}.{1}“.
de_de: Fehler beim Abrufen dieses Objekts für '{0}.{1}'
es_es: Error al obtener este objeto para '{0}.{1}'
fr_fr: Echec de l'obtention de cet objet pour '{0}.{1}'
it_it: Impossibile ottenere l'oggetto per '{0}.{1}'
ja_jp: '{0}.{1}' のこのオブジェクトを取得できませんでした
ko_kr: '{0}.{1}'에 대해 이 객체를 가져오지 못했습니다
pl_pl: Nie można pobrać tego obiektu dla '{0}.{1}'
pt_br: Falha ao obter o objeto para '{0}'.{1}
ru_ru: Не удалось получить объект для '{0}.{1}'
zh_cn: 无法为 '{0}.{1}' 获取该对象
zh_tw: 無法為 '{0}.{1}' 取得此物件

# kFFIInvalidCast
source: '{0}' is being cast to '{1}', but the allowed range is [{2}..{3}]
cs_cz: Hodnota „{0}“ je vrhána na „{1}“, ale povolený rozsah je [{2}..{3}].
de_de: '{0}' wird in '{1}' umgewandelt, der zulässige Bereich ist jedoch [{2}..{3}].
es_es: '{0}' se proyecta en '{1}', pero el rango permitido es [{2}..{3}]
fr_fr: '{0}' est projeté dans '{1}', mais l'intervalle autorisé est [{2}..{3}]
it_it: '{0}' viene proiettato su '{1}', ma l'intervallo consentito è [{2}..{3}]
ja_jp: '{0}' が '{1}' にキャストされますが、許容範囲は[{2}..{3}]です
ko_kr: '{0}'이(가) '{1}'에 투영되지만 허용되는 범위는 [{2}..{3}]입니다
pl_pl: '{0}' jest rzutowany na '{1}', ale dozwolony zakres to [{2}..{3}]
pt_br: '{0}' está sendo projetada para '{1}', mas a faixa permitida é de [{2}...{3}]
ru_ru: '{0}' распространяется на '{1}', однако допустимый диапазон — [{2}...{3}]
zh_cn: 正在将 '{0}' 投射到 '{1}'，但允许的范围为 [{2}..{3}]
zh_tw: '{0}' 正在轉型為 '{1}'，但允許範圍為 [{2}..{3}]

# kFileNotFound
source: File : '{0}' not found
cs_cz: Soubor: „{0}“ nebyl nalezen
de_de: Datei: '{0}' nicht gefunden
es_es: Archivo: '{0}' no encontrado
fr_fr: Fichier: "{0}" introuvable
it_it: File: '{0}' non trovato
ja_jp: ファイル : '{0}' が見つかりません
ko_kr: '{0}' 파일을 찾을 수 없습니다
pl_pl: Plik: '{0}' nie został odnaleziony
pt_br: Arquivo: '{0}' não encontrado
ru_ru: Файл: '{0}' не найден
zh_cn: 文件: 未找到 '{0}'
zh_tw: 找不到檔案：'{0}'

# kFunctionNotFound
source: No candidate function could be found
cs_cz: Nelze nalézt žádné předpokládané funkce.
de_de: Keine Kandidatenfunktion gefunden
es_es: No se ha podido encontrar ninguna función candidato
fr_fr: Aucune fonction candidate n'a été trouvée
it_it: Impossibile trovare funzioni compatibili
ja_jp: 候補の関数が見つかりませんでした
ko_kr: 후보 함수를 찾을 수 없습니다
pl_pl: Nie można odnaleźć potencjalnej funkcji
pt_br: Nenhuma função candidata pôde ser encontrada
ru_ru: Не удалось найти потенциальные функции
zh_cn: 找不到任何候选函数
zh_tw: 找不到任何候選函數

# kFunctionNotReturnAtAllCodePaths
source: All paths through the method '{0}()' must return a value
cs_cz: Všechny cesty v metodě „{0}()“ musí vracet hodnotu
de_de: Alle Pfade durch die Methode '{0}()' müssen einen Wert zurückgeben.
es_es: Todas las rutas mediante el método '{0}()' deben devolver un valor
fr_fr: Tous les chemins d'accès via la méthode '{0}()' doivent renvoyer une valeur
it_it: Tutti i percorsi del metodo '{0}()' devono restituire un valore
ja_jp: メソッド '{0}()' が値を返す、すべてのパス
ko_kr: '{0}()' 방법을 통한 모든 경로에서 값을 반환해야 합니다
pl_pl: Wszystkie ścieżki prowadzące przez metodę '{0}()' muszą zwracać wartość
pt_br: Todos os caminhos através do método '{0}()' devem retornar um valor
ru_ru: Использование метода '{0}()' со всеми путями должно дать в результате значение
zh_cn: 通过方法函数 '{0}()' 的所有路径必须返回值
zh_tw: 所有通過方法 '{0}()' 的路徑必須傳回一值

# kIndexOutOfRange
source: Index is out of range
cs_cz: Index je mimo rozsah href=kIndexOutOfRange.html
de_de: Index liegt außerhalb des Bereichs href=kIndexOutOfRange.html
es_es: Índice fuera de rango href=kIndexOutOfRange.html
fr_fr: L'index est hors intervalle href=kIndexOutOfRange.html
it_it: L'indice non rientra nell'intervallo href=kIndexOutOfRange.html
ja_jp: インデックスが範囲外です href=kIndexOutOfRange.html
ko_kr: 인덱스가 범위를 벗어났습니다. href=kIndexOutOfRange.html
pl_pl: Indeks jest poza zakresem href=kIndexOutOfRange.html
pt_br: Índice fora da faixa href=kIndexOutOfRange.html
ru_ru: Индекс вне диапазона href=kIndexOutOfRange.html
zh_cn: 索引超出范围 href=kIndexOutOfRange.html
zh_tw: 索引超出範圍 href=kIndexOutOfRange.html

# kInvalidAmountInRangeExpression
source: The amount in range expression should be an positive integer
cs_cz: Velikost ve výrazu rozsahu musí být kladné celé číslo.
de_de: Der Betrag im Bereichsausdruck muss eine positive Ganzzahl sein.
es_es: La cantidad en expresión de rango debe ser un entero positivo
fr_fr: La quantité dans l'expression d'intervalle doit être un nombre entier positif
it_it: La quantità nell'espressione di intervallo deve essere un numero intero positivo
ja_jp: 範囲式の数量は正の整数である必要があります
ko_kr: 범위 표현식의 수는 양의 정수여야 합니다
pl_pl: Wielkość w wyrażeniu zakresu powinna być dodatnią liczbą całkowitą
pt_br: A quantidade na expressão da faixa deve ser um número inteiro positivo
ru_ru: Значение в выражении диапазона должно быть положительным целым числом
zh_cn: 范围表达式中的数量应为正整数
zh_tw: 範圍表示式中的數量應該是正整數

# kInvalidArguments
source: Argument is invalid
cs_cz: Argument není platný.
de_de: Argument ist ungültig
es_es: Argumento no válido
fr_fr: Argument incorrect
it_it: L'argomento non è valido
ja_jp: 引数が無効です
ko_kr: 인수가 잘못되었습니다
pl_pl: Argument jest nieprawidłowy
pt_br: O argumento é inválido
ru_ru: Недопустимый аргумент
zh_cn: 参数无效
zh_tw: 引數無效

# kInvalidArgumentsInRangeExpression
source: The value used in a range expression must be a number
cs_cz: Hodnota použitá ve výrazu rozsahu musí být číslo nebo písmeno.
de_de: Der Wert in einem Bereichsausdruck muss eine Zahl oder ein Buchstabe sein.
es_es: El valor utilizado en una expresión de rango debe ser un número o una letra
fr_fr: La valeur utilisée dans une expression d'intervalle doit être un chiffre ou une lettre
it_it: Il valore utilizzato in un'espressione di intervallo deve essere un numero o una lettera
ja_jp: 範囲式で使用する値は数値または文字にする必要があります
ko_kr: 범위 표현식에 사용되는 값은 숫자 또는 문자여야 합니다
pl_pl: Wartość używana w wyrażeniu zakresu musi być liczbą lub literą
pt_br: O valor utilizado em uma expressão de faixa deve ser um número ou uma letra
ru_ru: Значение, используемое в выражении диапазона, должно являться числом или буквой
zh_cn: 范围表达式中使用的值必须是数字或字母
zh_tw: 用於範圍表示式的值必須是一個數字或字母

# kInvalidBreakForFunction
source: Internal error, please report: Statement break causes function to abnormally return null. (6ced82a9)
cs_cz: Nahlaste vnitřní chybu: Provádění příkazu bude přerušeno, protože funkce oproti očekávání vrací hodnotu null.
de_de: Interner Fehler, bitte melden: Unterbrechung der Anweisung bewirkt unerwartete Rückgabe von Null.
es_es: Error interno, informe: la interrupción de la sentencia hace que la función devuelva nulo de manera anómala.
fr_fr: Erreur interne, veuillez signaler: en raison de l'interruption de l'instruction, la fonction renvoie une valeur anormale (nulle).
it_it: Errore interno, segnalare: a causa dell'interruzione dell'istruzione, la funzione restituisce in maniera anomala un valore nullo.
ja_jp: 内部エラーです。次の内容を報告してください。break ステートメントにより関数が誤って NULL を返しました
ko_kr: 내부 오류. 신고하십시오. break 문으로 인해 함수에서 비정상적으로 null을 반환합니다.
pl_pl: Błąd wewnętrzny, raportuj: Instrukcja Przerwij powoduje, że funkcja błędnie zwraca pustą wartość.
pt_br: Erro interno, reporte: a quebra da declaração faz com que a função retorne nulo de forma anormal.
ru_ru: Внутренняя ошибка. Отправьте отчет: из-за разрыва выражения функция возвращает нулевое значение, что в данном случае неправильно.
zh_cn: 内部错误，请报告: 语句中断导致函数异常返回空值。
zh_tw: 內部錯誤，請報告：陳述式中斷會導致異常傳回空值。
