Repository: DynamoDS/Dynamo
Catalog: src/Engine/ProtoCore/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

source: invalid Imperative_mulop
cs_cz: neplatný objekt Imperative_mulop
de_de: Ungültige Imperative_mulop
es_es: Imperative_mulop no válido
fr_fr: Imperative_mulop incorrect
it_it: Imperative_mulop non valido
ja_jp: Imperative_mulop が無効です
ko_kr: 잘못된 Imperative_mulop
pl_pl: nieprawidłowy Imperative_mulop
pt_br: Imperative_mulop inválido
ru_ru: недопустимый Imperative_mulop
zh_cn: Imperative_mulop 无效
zh_tw: 無效的 Imperative_mulop

source: invalid Imperative_NameReference
cs_cz: neplatný objekt Imperative_NameReference
de_de: Ungültige Imperative_NameReference
es_es: Imperative_NameReference no válido
fr_fr: Imperative_NameReference incorrect
it_it: Imperative_NameReference non valido
ja_jp: Imperative_NameReference が無効です
ko_kr: 잘못된 Imperative_NameReference
pl_pl: nieprawidłowy Imperative_NameReference
pt_br: Imperative_NameReference inválido
ru_ru: недопустимый Imperative_NameReference
zh_cn: Imperative_NameReference 无效
zh_tw: 無效的 Imperative_NameReference

source: invalid Imperative_num
cs_cz: neplatný objekt Imperative_num
de_de: Ungültige Imperative_num
es_es: Imperative_num no válido
fr_fr: Imperative_num incorrect
it_it: Imperative_num non valido
ja_jp: Imperative_num が無効です
ko_kr: 잘못된 Imperative_num
pl_pl: nieprawidłowy Imperative_num
pt_br: Imperative_num inválido
ru_ru: недопустимый Imperative_num
zh_cn: Imperative_num 无效
zh_tw: 無效的 Imperative_num

source: invalid Imperative_PostFixOp
cs_cz: neplatný objekt Imperative_PostFixOp
de_de: Ungültige Imperative_PostFixOp
es_es: Imperative_PostFixOp no válido
fr_fr: Imperative_PostFixOp incorrect
it_it: Imperative_PostFixOp non valido
ja_jp: Imperative_PostFixOp が無効です
ko_kr: 잘못된 Imperative_PostFixOp
pl_pl: nieprawidłowy Imperative_PostFixOp
pt_br: Imperative_PostFixOp inválido
ru_ru: недопустимый Imperative_PostFixOp
zh_cn: Imperative_PostFixOp 无效
zh_tw: 無效的 Imperative_PostFixOp

source: invalid Imperative_relop
cs_cz: neplatný objekt Imperative_relop
de_de: Ungültige Imperative_relop
es_es: Imperative_relop no válido
fr_fr: Imperative_relop incorrect
it_it: Imperative_relop non valido
ja_jp: Imperative_relop が無効です
ko_kr: 잘못된 Imperative_relop
pl_pl: nieprawidłowy Imperative_relop
pt_br: Imperative_relop inválido
ru_ru: недопустимый Imperative_relop
zh_cn: Imperative_relop 无效
zh_tw: 無效的 Imperative_relop

source: invalid Imperative_stmt
cs_cz: neplatný objekt Imperative_stmt
de_de: Ungültige Imperative_stmt
es_es: Imperative_stmt no válido
fr_fr: Imperative_stmt incorrect
it_it: Imperative_stmt non valido
ja_jp: Imperative_stmt が無効です
ko_kr: 잘못된 Imperative_stmt
pl_pl: nieprawidłowy Imperative_stmt
pt_br: Imperative_stmt inválido
ru_ru: недопустимый Imperative_stmt
zh_cn: Imperative_stmt 无效
zh_tw: 無效的 Imperative_stmt

source: invalid Imperative_unaryexpr
cs_cz: neplatný objekt Imperative_unaryexpr
de_de: Ungültige Imperative_unaryexpr
es_es: Imperative_unaryexpr no válido
fr_fr: Imperative_unaryexpr incorrect
it_it: Imperative_unaryexpr non valido
ja_jp: Imperative_unaryexpr が無効です
ko_kr: 잘못된 Imperative_unaryexpr
pl_pl: nieprawidłowy Imperative_unaryexpr
pt_br: Imperative_unaryexpr inválido
ru_ru: недопустимый Imperative_unaryexpr
zh_cn: Imperative_unaryexpr 无效
zh_tw: 無效的 Imperative_unaryexpr

source: invalid Imperative_unaryop
cs_cz: neplatný objekt Imperative_unaryop
de_de: Ungültige Imperative_unaryop
es_es: Imperative_unaryop no válido
fr_fr: Imperative_unaryop incorrect
it_it: Imperative_unaryop non valido
ja_jp: Imperative_unaryop が無効です
ko_kr: 잘못된 Imperative_unaryop
pl_pl: nieprawidłowy Imperative_unaryop
pt_br: Imperative_unaryop inválido
ru_ru: недопустимый Imperative_unaryop
zh_cn: Imperative_unaryop 无效
zh_tw: 無效的 Imperative_unaryop

source: invalid Import_Statement
cs_cz: neplatný objekt Import_Statement
de_de: Ungültige Import_Statement
es_es: import_Statement no válido
fr_fr: Import_Statement incorrect
it_it: Import_Statement non valido
ja_jp: Import_Statement が無効です
ko_kr: 잘못된 Import_Statement
pl_pl: nieprawidłowy Import_Statement
pt_br: Import_Statement inválido
ru_ru: недопустимый Import_Statement
zh_cn: Import_Statement 无效
zh_tw: 無效的 Import_Statement

source: "in" expected
cs_cz: očekávano „in“
de_de: "in" erwartet
es_es: se esperaba "in"
fr_fr: "in" attendu
it_it: "in" previsto
ja_jp: "in" が必要です
ko_kr: "in" 예상됨
pl_pl: oczekiwano "w"
pt_br: "em" esperado
ru_ru: Ожидается «in»
zh_cn: 应输入“in”
zh_tw: 預期 "in"

source: kw_break expected
cs_cz: očekáváno kw_break
de_de: kw_break erwartet
es_es: se esperaba kw_break
fr_fr: kw_break attendu
it_it: kw_break previsto
ja_jp: kw_break が必要です
ko_kr: kw_break 예상됨
pl_pl: oczekiwano kw_break
pt_br: kw_break esperado
ru_ru: ожидается kw_break
zh_cn: 应输入 kw_break
zh_tw: 預期 kw_break

source: kw_class expected
cs_cz: očekáváno kw_class
de_de: kw_class erwartet
es_es: se esperaba kw_class
fr_fr: kw_class attendu
it_it: kw_class previsto
ja_jp: kw_class が必要です
ko_kr: kw_class 예상됨
pl_pl: oczekiwano kw_class
pt_br: kw_class esperado
ru_ru: Ожидается kw_class
zh_cn: 应输入 kw_class
zh_tw: kw_class 預期

source: kw_constructor expected
cs_cz: očekáváno kw_constructor
de_de: kw_constructor erwartet
es_es: se esperaba kw_constructor
fr_fr: kw_constructor attendu
it_it: kw_constructor previsto
ja_jp: kw_constructor が必要です
ko_kr: kw_constructor 예상됨
pl_pl: oczekiwano kw_constructor
pt_br: kw_constructor esperado
ru_ru: Ожидается kw_constructor
zh_cn: 应输入 kw_constructor
zh_tw: 預期 kw_constructor

source: kw_continue expected
cs_cz: očekáván objekt kw_continue
de_de: kw_continue erwartet
es_es: se esperaba kw_continue
fr_fr: kw_continue attendu
it_it: kw_continue previsto
ja_jp: kw_continue が必要です
ko_kr: kw_continue 예상됨
pl_pl: oczekiwano kw_continue
pt_br: kw_continue esperado
ru_ru: Ожидается kw_continue
zh_cn: 应输入 kw_continue
zh_tw: 預期 kw_continue

source: kw_def expected
cs_cz: očekáváno kw_def
de_de: kw_def erwartet
es_es: se esperaba kw_def
fr_fr: kw_def attendu
it_it: kw_def previsto
ja_jp: kw_def が必要です
ko_kr: kw_def 예상됨
pl_pl: oczekiwano kw_def
pt_br: kw_def esperado
ru_ru: Ожидается kw_def
zh_cn: 应输入 kw_def
zh_tw: 預期 kw_def

source: kw_elseif expected
cs_cz: o4ek8v8no kw_elseif
de_de: kw_elseif erwartet
es_es: se esperaba kw_elseif
fr_fr: kw_elseif attendu
it_it: kw_elseif previsto
ja_jp: kw_elseif が必要です
ko_kr: kw_elseif 예상됨
pl_pl: oczekiwano kw_elseif
pt_br: kw_elseif esperado
ru_ru: Ожидается kw_elseif
zh_cn: 应输入 kw_elseif
zh_tw: 預期 kw_elseif

source: kw_else expected
cs_cz: očekáváno kw_else
de_de: kw_else erwartet
es_es: se esperaba kw_else
fr_fr: kw_else attendu
it_it: kw_else previsto
ja_jp: kw_else が必要です
ko_kr: kw_else 예상됨
pl_pl: oczekiwano kw_else
pt_br: kw_else esperado
ru_ru: ожидается kw_else
zh_cn: 应输入 kw_else
zh_tw: 預期 kw_else

source: kw_extend expected
cs_cz: očekáváno kw_extend
de_de: kw_extend erwartet
es_es: se esperaba kw_extend
fr_fr: kw_extend attendu
it_it: kw_extend previsto
ja_jp: kw_extend が必要です
ko_kr: kw_extend 예상됨
pl_pl: oczekiwano kw_extend
pt_br: kw_extend esperado
ru_ru: ожидается kw_extend
zh_cn: 应输入 kw_extend
zh_tw: 預期 kw_extend

source: kw_external expected
cs_cz: očekáváno kw_external
de_de: kw_external erwartet
es_es: se esperaba kw_external
fr_fr: kw_external attendu
it_it: kw_external previsto
ja_jp: kw_external が必要です
ko_kr: kw_external 예상됨
pl_pl: oczekiwano kw_external
pt_br: kw_external esperado
ru_ru: Ожидается kw_external
zh_cn: 应输入 kw_external
zh_tw: 預期 kw_external

source: kw_for expected
cs_cz: očekáváno kw_for
de_de: kw_for erwartet
es_es: se esperaba kw_for
fr_fr: kw_for attendu
it_it: kw_for previsto
ja_jp: kw_for が必要です
ko_kr: kw_for 예상됨
pl_pl: oczekiwano kw_for
pt_br: kw_for esperado
ru_ru: Ожидается kw_for
zh_cn: 应输入 kw_for
zh_tw: 預期 kw_for

source: kw_from expected
cs_cz: očekáváno kw_from
de_de: kw_from erwartet
es_es: se esperaba kw_from
fr_fr: kw_from attendu
it_it: kw_from previsto
ja_jp: kw_from が必要です
ko_kr: kw_from 예상됨
pl_pl: oczekiwano kw_from
pt_br: kw_from esperado
ru_ru: ожидается kw_from
zh_cn: 应输入 kw_from
zh_tw: 預期 kw_from

source: kw_heap expected
cs_cz: očekáváno kw_heap
de_de: kw_heap erwartet
es_es: se esperaba kw_heap
fr_fr: kw_heap attendu
it_it: kw_heap previsto
ja_jp: kw_heap が必要です
ko_kr: kw_heap 예상됨
pl_pl: oczekiwano kw_heap
pt_br: kw_heap esperado
ru_ru: ожидается kw_heap
zh_cn: 应输入 kw_heap
zh_tw: 預期 kw_heap

source: kw_if expected
cs_cz: očekáváno kw_if
de_de: kw_if erwartet
es_es: se esperaba kw_if
fr_fr: kw_if attendu
it_it: kw_if previsto
ja_jp: kw_if が必要です
ko_kr: kw_if 예상됨
pl_pl: oczekiwano kw_if
pt_br: kw_if esperado
ru_ru: Ожидается kw_if
zh_cn: 应输入 kw_if
zh_tw: 預期 kw_if

source: kw_import expected
cs_cz: očekáváno kw_import
de_de: kw_import erwartet
es_es: se esperaba kw_import
fr_fr: kw_import attendu
it_it: kw_import previsto
ja_jp: kw_import が必要です
ko_kr: kw_import 예상됨
pl_pl: oczekiwano kw_import
pt_br: kw_import esperado
ru_ru: Ожидается kw_import
zh_cn: 应输入 kw_import
zh_tw: 預期 kw_import

source: kw_local expected
cs_cz: očekáváno kw_local
de_de: kw_local erwartet
es_es: se esperaba kw_local
fr_fr: kw_local attendu
it_it: kw_local previsto
ja_jp: kw_local が必要です
ko_kr: kw_local 예상됨
pl_pl: oczekiwano kw_local
pt_br: kw_local esperado
ru_ru: Ожидается kw_local
zh_cn: 应输入 kw_local
zh_tw: 預期 kw_local

source: kw_native expected
cs_cz: očekáváno kw_native
de_de: kw_native erwartet
es_es: se esperaba kw_native
fr_fr: kw_native attendu
it_it: kw_native previsto
ja_jp: kw_native が必要です
ko_kr: kw_native 예상됨
pl_pl: oczekiwano kw_native
pt_br: kw_native esperado
ru_ru: Ожидается kw_native
zh_cn: 应输入 kw_native
zh_tw: 預期 kw_native

source: kw_prefix expected
cs_cz: očekáváno kw_prefix
de_de: tkw_prefix erwartet
es_es: se esperaba kw_prefix
fr_fr: kw_prefix attendu
it_it: kw_prefix previsto
ja_jp: kw_prefix が必要です
ko_kr: kw_prefix 예상됨
pl_pl: oczekiwano kw_prefix
pt_br: kw_prefix esperado
ru_ru: Ожидается kw_prefix
zh_cn: 应输入 kw_prefix
zh_tw: 預期 kw_prefix

source: kw_static expected
cs_cz: očekáváno kw_static
de_de: kw_static erwartet
es_es: se esperaba kw_static
fr_fr: kw_static attendu
it_it: kw_static previsto
ja_jp: kw_static が必要です
ko_kr: kw_static 예상됨
pl_pl: oczekiwano kw_static
pt_br: kw_static esperado
ru_ru: Ожидается kw_static
zh_cn: 应输入 kw_static
zh_tw: 預期 kw_static

source: kw_while expected
cs_cz: očekáváno kw_while
de_de: kw_while erwartet
es_es: se esperaba kw_while
fr_fr: kw_while attendu
it_it: kw_while previsto
ja_jp: kw_while が必要です
ko_kr: kw_while 예상됨
pl_pl: oczekiwano kw_while
pt_br: kw_while esperado
ru_ru: Ожидается kw_while
zh_cn: 应输入 kw_while
zh_tw: 預期 kw_while

source: lessequal expected
cs_cz: očekáváno „lessequal“
de_de: lessequal erwartet
es_es: se esperaba lessequal
fr_fr: lessequal attendu
it_it: lessequal previsto
ja_jp: <= が必要です
ko_kr: lessequal 예상됨
pl_pl: oczekiwano lessequal
pt_br: lessequal esperado
ru_ru: Ожидается lessequal
zh_cn: 应输入小于等于“<=”
zh_tw: 預期 lessequal

source: lessthan expected
cs_cz: očekáváno „lessthan“
de_de: lessthan erwartet
es_es: se esperaba lessthan
fr_fr: lessthan attendu
it_it: lessthan previsto
ja_jp: < が必要です
ko_kr: lessthan 예상됨
pl_pl: oczekiwano lessthan
pt_br: lessthan esperado
ru_ru: Ожидается lessthan
zh_cn: 应输入小于“<”
zh_tw: 預期 lessthan

source: literal_false expected
cs_cz: očekáváno literal_false
de_de: literal_false erwartet
es_es: se esperaba literal_false
fr_fr: literal_false attendu
it_it: literal_false previsto
ja_jp: literal_false が必要です
ko_kr: literal_false 예상됨
pl_pl: oczekiwano literal_false
pt_br: literal_false esperado
ru_ru: Ожидается literal_false
zh_cn: 应输入 literal_false
zh_tw: 預期 literal_false

source: literal_null expected
cs_cz: očekáváno literal_null
de_de: literal_null erwartet
es_es: se esperaba literal_null
fr_fr: literal_null attendu
it_it: literal_null previsto
ja_jp: literal_null が必要です
ko_kr: literal_null 예상됨
pl_pl: oczekiwano literal_null
pt_br: literal_null esperado
ru_ru: Ожидается literal_null
zh_cn: 应输入 literal_null
zh_tw: 預期 literal_null

source: literal_true expected
cs_cz: očekáváno literal_true
de_de: literal_true erwartet
es_es: se esperaba literal_true
fr_fr: literal_true attendu
it_it: literal_true previsto
ja_jp: literal_true が必要です
ko_kr: literal_true 예상됨
pl_pl: oczekiwano literal_true
pt_br: literal_true esperado
ru_ru: Ожидается literal_true
zh_cn: 应输入 literal_true
zh_tw: 預期 literal_true

source: neg expected
cs_cz: očekáváno „neg“
de_de: neg erwartet
es_es: se esperaba neg
fr_fr: neg attendu
it_it: neg previsto
ja_jp: neg が必要です
ko_kr: neg 예상됨
pl_pl: oczekiwano wartości ujem
pt_br: neg esperado
ru_ru: ожидается neg
zh_cn: 应输入负号“-”
zh_tw: 預期 neg

source: notequal expected
cs_cz: očekáváno „notequal“
de_de: notequal erwartet
es_es: se esperaba notequal
fr_fr: notequal attendu
it_it: notequal previsto
ja_jp: != が必要です
ko_kr: notequal 예상됨
pl_pl: oczekiwano notequal
pt_br: notequal esperado
ru_ru: ожидается notequal
zh_cn: 应输入 notequal
zh_tw: 預期 notequal

source: not expected
cs_cz: není očekáváno
de_de: nicht erwartet
es_es: no se esperaba
fr_fr: non attendu
it_it: not previsto
ja_jp: not が必要です
ko_kr: not 예상됨
pl_pl: nieoczekiwane
pt_br: não esperado
ru_ru: не ожидается
zh_cn: 不应有
zh_tw: 非預期

source: number expected
cs_cz: očekáváno „number“
de_de: number erwartet
es_es: se esperaba number
fr_fr: nombre attendu
it_it: number previsto
ja_jp: 数値が必要です
ko_kr: number 예상됨
pl_pl: oczekiwano liczby
pt_br: número esperado
ru_ru: ожидается число
zh_cn: 应输入数字
zh_tw: 預期 number

# openbrace_expected
source: "{" expected
cs_cz: očekáváno „{“
de_de: "{" erwartet
es_es: se esperaba "{"
fr_fr: "{" attendu
it_it: "{" previsto
ja_jp: "{" が必要です
ko_kr: "{" 예상됨
pl_pl: oczekiwano "{"
pt_br: "{" esperado
ru_ru: Ожидается «{»
zh_cn: 应输入“{”
zh_tw: 預期 "{"

source: openbracket expected
cs_cz: očekáváno openbracket
de_de: openbracket erwartet
es_es: se esperaba openbracket
fr_fr: openbracket attendu
it_it: openbracket previsto
ja_jp: openbracket が必要です
ko_kr: openbracket 예상됨
pl_pl: oczekiwano openbracket
pt_br: colchete aberto esperado
ru_ru: Ожидается openbracket
zh_cn: 应输入左方括号“[”
zh_tw: 預期 openbracket

source: openparen expected
cs_cz: očekáváno openparen
de_de: openparen erwartet
es_es: se esperaba openparen
fr_fr: openparen attendu
it_it: openparen previsto
ja_jp: openparen が必要です
ko_kr: openparen 예상됨
pl_pl: oczekiwano openparen
pt_br: parênteses aberto esperado
ru_ru: Ожидается openparen
zh_cn: 应输入左圆括号“(”
zh_tw: 預期 openparen

# oror_expected
source: "||" expected
cs_cz: Očekáváno „||“
de_de: "||" erwartet
es_es: se esperaba "||"
fr_fr: "||" attendu
it_it: "||" previsto
ja_jp: "||" が必要です
ko_kr: "||" 예상됨
pl_pl: oczekiwano "||"
pt_br: "||" esperado
ru_ru: ожидается «||»
zh_cn: 应输入“||”
zh_tw: 預期 "||"

source: period expected
cs_cz: očekávána tečka
de_de: Punkt erwartet
es_es: se esperaba period
fr_fr: period attendu
it_it: period previsto
ja_jp: period が必要です
ko_kr: period 예상됨
pl_pl: oczekiwany okres
pt_br: ponto esperado
ru_ru: ожидается точка
zh_cn: 应输入周期
zh_tw: 預期句點

source: pipe expected
cs_cz: očekávána trubka
de_de: Pipe erwartet
es_es: se esperaba pipe
fr_fr: pipe attendu
it_it: pipe previsto
ja_jp: pipe が必要です
ko_kr: pipe 예상됨
pl_pl: oczekiwano rury
pt_br: tubulação esperado
ru_ru: ожидается pipe
zh_cn: 应输入 pipe
zh_tw: 預期管

source: postfixed replicationguide expected
cs_cz: očekáváno „postfixed replicationguide“
de_de: postfixed replicationguide erwartet
es_es: se esperaba postfixed replicationguide
fr_fr: postfixed replicationguide attendu
it_it: postfixed replicationguide previsto
ja_jp: postfixed replicationguide が必要です
ko_kr: postfixed replicationguide 예상됨
pl_pl: oczekiwano postfixed replicationguide
pt_br: postfixed replicationguide esperado
ru_ru: ожидается postfixed replicationguide
zh_cn: 应输入 postfixed replicationguide
zh_tw: 預期 postfixed replicationguide

# power_expected
source: "^" expected
cs_cz: očekáváno „^“
de_de: "^" erwartet
es_es: se esperaba "^"
fr_fr: "^" attendu
it_it: "^" previsto
ja_jp: "^" が必要です
ko_kr: "^" 예상됨
pl_pl: oczekiwano "^"
pt_br: "^" esperado
ru_ru: Ожидается «^»
zh_cn: 应输入“^”
zh_tw: 預期 "^"

source: "private" expected
cs_cz: očekáváno „private“
de_de: "private" erwartet
es_es: se esperaba "private"
fr_fr: "private" attendu
it_it: "private" previsto
ja_jp: "private" が必要です
ko_kr: "private" 예상됨
pl_pl: oczekiwano "prywatny"
pt_br: "privado" esperado
ru_ru: ожидается «private»
zh_cn: 应输入“private”
zh_tw: 預期 "private"

source: "protected" expected
cs_cz: očekáváno „protected“
de_de: "geschützt" erwartet
es_es: se esperaba "protected"
fr_fr: "protected" attendu
it_it: "protected" previsto
ja_jp: "protected" が必要です
ko_kr: "protected" 예상됨
pl_pl: oczekiwano "zabezpieczony"
pt_br: "protegido" esperado
ru_ru: Ожидается «protected»
zh_cn: 应输入“protected”
zh_tw: 預期 "protected"

source: "public" expected
cs_cz: očekávano „public“
de_de: "public" erwartet
es_es: se esperaba "public"
fr_fr: "public" attendu
it_it: "public" previsto
ja_jp: "public" が必要です
ko_kr: "public" 예상됨
pl_pl: oczekiwano "publiczny"
pt_br: "público" esperado
ru_ru: Ожидается «public»
zh_cn: 应输入“public”
zh_tw: 預期 "public"

# question_expected
source: "?" expected
cs_cz: očekáváno „?“
de_de: "?" erwartet
es_es: se esperaba "?"
fr_fr: "?" attendu
it_it: "?" previsto
ja_jp: "?" が必要です
ko_kr: "?" 예상됨
pl_pl: oczekiwano "?"
pt_br: "?" esperado
ru_ru: Ожидается «?»
zh_cn: 应输入“?”
zh_tw: 預期 "?"

source: rangeop expected
cs_cz: očekáváno „rangeop“
de_de: rangeop erwartet
es_es: se esperaba rangeop
fr_fr: rangeop attendu
it_it: rangeop previsto
ja_jp: rangeop が必要です
ko_kr: rangeop 예상됨
pl_pl: oczekiwano rangeop
pt_br: rangeop esperado
ru_ru: Ожидается rangeop
zh_cn: 应输入 rangeop
zh_tw: 預期 rangeop

# reminder_expected
source: "%" expected
cs_cz: očekáváno „%“
de_de: "%" erwartet
es_es: se esperaba "%"
fr_fr: "%" attendu
it_it: "%" previsto
ja_jp: "%" が必要です
ko_kr: "%" 예상됨
pl_pl: oczekiwano "%"
pt_br: "%" esperado
ru_ru: Ожидается «%»
zh_cn: 应输入“%”
zh_tw: 預期 "%"

source: replicationguide_postfix expected
cs_cz: očekáváno replicationguide_postfix
de_de: replicationguide_postfix erwartet
es_es: se esperaba replicationguide_postfix
fr_fr: replicationguide_postfix attendu
it_it: replicationguide_postfix previsto
ja_jp: replicationguide_postfix が必要です
ko_kr: replicationguide_postfix 예상됨
pl_pl: oczekiwano replicationguide_postfix
pt_br: replicationguide_postfix esperado
ru_ru: Ожидается replicationguide_postfix
zh_cn: 应输入 replicationguide_postfix
zh_tw: 預期 replicationguide_postfix

source: textstring expected
cs_cz: očekáváno textstring
de_de: textstring erwartet
es_es: se esperaba textstring
fr_fr: textString attendu
it_it: textstring previsto
ja_jp: textstring が必要です
ko_kr: textstring 예상됨
pl_pl: oczekiwano textstring
pt_br: textString esperado
ru_ru: Ожидается строка текста
zh_cn: 应输入 textString
zh_tw: 預期 textString

source: this symbol not expected in Associative_FunctionalStatement
cs_cz: tento symbol není očekáván v objektu Associative_FunctionalStatement.
de_de: Dieses Symbol wird in Associative_FunctionalStatement nicht erwartet.
es_es: este símbolo no esperado en Associative_FunctionalStatement
fr_fr: ce symbole n'est pas attendu dans Associative_FunctionalStatement
it_it: simbolo non previsto in Associative_FunctionalStatement
ja_jp: この記号は Associative_FunctionalStatement には必要ありません
ko_kr: 이 기호는 Associative_FunctionalStatement에서 예상되지 않습니다
pl_pl: nie oczekiwano tego symbolu w Associative_FunctionalStatement
pt_br: este símbolo não é esperado no Associative_FunctionalStatement
ru_ru: это обозначение не характерно для Associative_FunctionalStatement
zh_cn: Associative_FunctionalStatement 中不应有该符号
zh_tw: Associative_FunctionalStatement 中未預期此符號

source: this symbol not expected in Associative_FunctionCallStatement
cs_cz: tento symbol není očekáván v objektu Associative_FunctionCallStatement
de_de: Dieses Symbol wird in Associative_FunctionCallStatement nicht erwartet.
es_es: este símbolo no esperado en Associative_FunctionCallStatement
fr_fr: ce symbole n'est pas attendu dans Associative_FunctionCallStatement
it_it: simbolo non previsto in Associative_FunctionCallStatement
ja_jp: この記号は Associative_FunctionCallStatement には必要ありません
ko_kr: 이 기호는 Associative_FunctionCallStatement에서 예상되지 않습니다
pl_pl: ten symbol nie był oczekiwany w Associative_FunctionCallStatement
pt_br: este símbolo não esperado no Associative_FunctionCallStatement
ru_ru: это обозначение не характерно для Associative_FunctionCallStatement
zh_cn: Associative_FunctionCallStatement 中不应有该符号
zh_tw: Associative_FunctionCallStatement 中未預期此符號

source: this symbol not expected in Associative_Statement
cs_cz: tento symbol není očekáván v objektu Associative_Statement.
de_de: Dieses Symbol wird in Associative_Statement nicht erwartet.
es_es: este símbolo no esperado en Associative_Statement
fr_fr: ce symbole n'est pas attendu dans Associative_Statement
it_it: simbolo non previsto in Associative_Statement
ja_jp: この記号は Associative_Statement には必要ありません
ko_kr: 이 기호는 Associative_Statement에서 예상되지 않습니다
pl_pl: nie oczekiwano tego symbolu w Associative_Statement
pt_br: este símbolo não esperado no Associative_Statement
ru_ru: это обозначение не характерно для Associative_Statement
zh_cn: Associative_Statement 中不应有该符号
zh_tw: Associative_Statement 中未預期此符號

source: this symbol not expected in Import_Statement
cs_cz: tento symbol není očekáván v objektu Import_Statement.
de_de: Dieses Symbol wird in Import_Statement nicht erwartet.
es_es: este símbolo no esperado en Import_Statement
fr_fr: ce symbole n'est pas attendu dans Import_Statement
it_it: simbolo non previsto in Import_Statement
ja_jp: この記号は Import_Statement には必要ありません
ko_kr: 이 기호는 Import_Statement에서 예상되지 않습니다
pl_pl: nie oczekiwano tego symbolu w Import_Statement
pt_br: este símbolo não esperado no Import_Statement
ru_ru: это обозначение не характерно для Import_Statement
zh_cn: Import_Statement 中不应有该符号
zh_tw: Import_Statement 中未預期此符號

# this_symbol_no_expected_in_Associative_FunctionalStatement
source: this symbol not expected in Associative_FunctionalStatement
cs_cz: tento symbol není očekáván v objektu Associative_FunctionalStatement.
de_de: Dieses Symbol wird in Associative_FunctionalStatement nicht erwartet.
es_es: este símbolo no esperado en Associative_FunctionalStatement
fr_fr: ce symbole n'est pas attendu dans Associative_FunctionalStatement
it_it: simbolo non previsto in Associative_FunctionalStatement
ja_jp: この記号は Associative_FunctionalStatement には必要ありません
ko_kr: 이 기호는 Associative_FunctionalStatement에서 예상되지 않습니다
pl_pl: nie oczekiwano tego symbolu w Associative_FunctionalStatement
pt_br: este símbolo não é esperado no Associative_FunctionalStatement
ru_ru: это обозначение не характерно для Associative_FunctionalStatement
zh_cn: Associative_FunctionalStatement 中不应有该符号
zh_tw: Associative_FunctionalStatement 中未預期此符號

# this_symbo_no_expected_in_Associative_NonAssignmentStatement
source: this symbol not expected in Associative_NonAssignmentStatement
cs_cz: tento symbol není očekáván v objektu Associative_NonAssignmentStatement.
de_de: dieses Symbol nicht erwartet in Associative_NonAssignmentStatement
es_es: no se esperaba este símbolo en Associative_NonAssignmentStatement
fr_fr: ce symbole n'est pas attendu dans Associative_NonAssignmentStatement
it_it: simbolo non previsto in Associative_NonAssignmentStatement
ja_jp: この記号は Associative_NonAssignmentStatement には必要ありません
ko_kr: 이 기호는 Associative_NonAssignmentStatement에서 예상되지 않습니다
pl_pl: nie oczekiwano tego symbolu w Associative_NonAssignmentStatement
pt_br: este símbolo não esperado no Associative_NonAssignmentStatement
ru_ru: это обозначение не характерно для Associative_NonAssignmentStatement
zh_cn: Associative_NonAssignmentStatement 中不应有该符号
zh_tw: Associative_NonAssignmentStatement 中未預期此符號

source: throw expected
cs_cz: očekáváno „throw“
de_de: throw erwartet
es_es: se esperaba throw
fr_fr: throw attendu
it_it: throw previsto
ja_jp: throw が必要です
ko_kr: throw 예상됨
pl_pl: oczekiwano rzutu
pt_br: impulso esperado
ru_ru: ожидается исключение
zh_cn: 应输入 throw
zh_tw: 預期 throw
