Repository: DynamoDS/Dynamo
Catalog: src/Engine/ProtoCore/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# kStringOverIndexed
source: String is over indexed
cs_cz: Řetězec je nadindexován.
de_de: Zeichenfolge ist überindiziert.
es_es: La cadena está sobreindexada
fr_fr: La chaîne est surindexée
it_it: La stringa è eccessivamente indicizzata
ja_jp: String には範囲外のインデックスが設定されています
ko_kr: 문자열이 지나치게 인덱스되었습니다
pl_pl: Ciąg jest nadindeksowany
pt_br: A sequência de caracteres está sobre-indexada
ru_ru: Завышен индекс строки
zh_cn: 字符串索引过多
zh_tw: 字串過度檢索

# kTypeUndefined
source: Type '{0}' is not defined
cs_cz: Typ „{0}“ není definován
de_de: Typ '{0}' ist nicht definiert.
es_es: Tipo '{0}' no definido
fr_fr: Le type "{0}" n'est pas défini
it_it: Tipo '{0}' non definito
ja_jp: タイプ '{0}' が設定されていません
ko_kr: '{0}' 유형이 정의되지 않았습니다
pl_pl: Typ '{0}' nie jest zdefiniowany
pt_br: O tipo '{0}' não está definido
ru_ru: Тип '{0}' не определен
zh_cn: 类型 '{0}' 未定义
zh_tw: 未定義類型 '{0}'

# kUnboundIdentifierMsg
source: Variable '{0}' hasn't been defined yet
cs_cz: Proměnná „{0}“ dosud nebyla definována.
de_de: Variable '{0}' wurde noch nicht definiert.
es_es: La variable '{0}' aún no se ha definido
fr_fr: La variable '{0}' n'a pas été encore définie
it_it: La variabile '{0}' non è definita
ja_jp: 変数 '{0}' はまだ設定されていません
ko_kr: '{0}' 변수가 아직 정의되지 않았습니다
pl_pl: Zmienna '{0}' nie została jeszcze zdefiniowana
pt_br: A variável '{0}' ainda não foi definida
ru_ru: Переменная '{0}' еще не определена
zh_cn: 变量 '{0}' 尚未定义
zh_tw: 尚未定義變數 '{0}'

# kUsingNonStaticMemberInStaticContext
source: '{0}' is not a static property, so cannot be assigned to static properties or used in static methods.
cs_cz: „{0}“ není statická vlastnost, takže ji nelze přiřadit ke statické vlastnosti nebo použít ve statických metodách.
de_de: '{0}' ist keine statische Eigenschaft und kann daher weder statischen Eigenschaften zugewiesen noch in statischen Methoden verwendet werden.
es_es: '{0}' no es una propiedad estática, así que no se puede asignar a propiedades estáticas ni utilizarse en métodos estáticos
fr_fr: '{0}' n'est pas une propriété statique et ne peut donc pas être affecté aux propriétés statiques ou utilisé dans des méthodes statiques.
it_it: '{0}' non è una proprietà statica, pertanto non può essere assegnata a proprietà statiche o utilizzata in metodi statici.
ja_jp: '{0}' は静的プロパティではないため、静的プロパティに割り当てたり、静的メソッドで使用することはできません。
ko_kr: '{0}'은(는) 정적 특성이 아니므로 정적 특성에 지정하거나 정적 방법에서 사용할 수 없습니다.
pl_pl: '{0}' nie jest właściwością statyczną, dlatego nie może być przypisana do właściwości statycznych ani używana w metodach statycznych.
pt_br: A '{0}' não é uma propriedade estática, portanto, não pode ser atribuída para propriedades estáticas ou utilizada em métodos estáticos.
ru_ru: '{0}' не является статическим свойством и поэтому не может быть назначено другим статическим свойствам или использоваться со статическими методами.
zh_cn: '{0}' 不是静态特性 ，因此不能分配给静态特性或用于静态方法函数。
zh_tw: '{0}' 不是靜態性質，因此無法指定給靜態性質或用於靜態方法中。

# kUsingThisInStaticFunction
source: 'this' cannot be used in static method
cs_cz: hodnotu „this“ nelze použít ve statické metodě.
de_de: 'this' kann in statischen Methoden nicht verwendet werden.
es_es: 'this' no se puede utilizar en método estático
fr_fr: 'this' ne peut pas être utilisé dans la méthode statique
it_it: 'this' non può essere utilizzato nel metodo statico
ja_jp: 'this' を静的メソッドで使用することはできません
ko_kr: '이' 항목은 정적 방법에서 사용할 수 없습니다
pl_pl: 'ten' nie może być użyty w metodzie statycznej
pt_br: 'isso' não pode ser usado no método estático
ru_ru: 'этот' не может использоваться со статическим методом
zh_cn: “this”不能用于静态方法
zh_tw: 無法在靜態方法中使用 'this'

# MapsValueFromOneRangeToAnotherRange
source: Maps a vlaue from one range to another range
cs_cz: Mapuje hodnotu z jednoho rozsahu do druhého.
de_de: Ordnet einen Wert aus einem Bereich einem anderen Bereich zu.
es_es: Asigna un valor de un rango a otro rango
fr_fr: Mappe une valeur d'un intervalle à un autre
it_it: Mappa un valore di un intervallo su un altro intervallo
ja_jp: ある範囲の値を別の範囲にマッピングします
ko_kr: 한 범위의 값을 다른 범위로 매핑합니다
pl_pl: Przypisuje wartość z jednego zakresu do drugiego
pt_br: Mapeia um valor de uma faixa para outra faixa
ru_ru: Сопоставление значения из одного диапазона с другим
zh_cn: 将值从一个范围映射到另一个范围
zh_tw: 將值從一個範圍對應至另一個範圍

# MapsValueIntoInputRange
source: Maps a value into an input range
cs_cz: Mapuje hodnotu do vstupního rozsahu.
de_de: Ordnet einen Wert für einen Eingabebereich zu.
es_es: Asigna un valor a un rango de entrada
fr_fr: Mappe une valeur dans un intervalle d'entrée
it_it: Mappa un valore in un intervallo di input
ja_jp: 入力範囲に値をマッピングします
ko_kr: 값을 입력 범위로 매핑합니다
pl_pl: Przypisuje wartość do zakresu danych wejściowych
pt_br: Mapeia um valor para uma faixa de entrada
ru_ru: Сопоставление значения с диапазоном входных данных
zh_cn: 将值映射到输入范围
zh_tw: 將值對應至輸入範圍

# NoConstructorForAttribute
source: No constructors for Attribute '{0}' takes {1} arguments
cs_cz: Žádné kontruktory pro atribut „{0}“ nepřijímají argumenty {1}.
de_de: Keine Konstruktoren für Attribut '{0}' akzeptieren {1} Argumente.
es_es: No hay constructores para atributo '{0}' que tomen {1} argumentos
fr_fr: Pour l'attribut '{0}', aucun constructeur n'accepte les arguments {1}
it_it: Nessun costruttore per l'attributo '{0}' accetta argomenti {1}
ja_jp: Attribute '{0}' のコンストラクタで {1} 引数を取るものはありません
ko_kr: 속성 '{0}'에 대한 어떤 생성자도 {1}개의 인수를 사용하지 않습니다
pl_pl: Brak konstruktorów dla atrybutu '{0}' wymaga {1} argumentów
pt_br: Não há construtores para o atributo '{0}' obtém {1} argumentos
ru_ru: Для атрибута '{0}' не имеется конструкций для взятия аргументов {1}
zh_cn: 属性 '{0}' 的构造函数没有采用 {1} 个参数
zh_tw: 屬性 '{0}' 的建構程式未採用 {1} 引數

# NoSuchFileOrDirectoryToImport
source: Cannot import file: '{0}': No such file or directory
cs_cz: Nelze importovat soubor: „{0}“: žádný takový soubor nebo adresář.
de_de: Datei kann nicht importiert werden: '{0}': Datei oder Verzeichnis nicht vorhanden
es_es: No se puede importar el archivo: '{0}': ese archivo o directorio no existe
fr_fr: Impossible d'importer le fichier: '{0}': aucun fichier ou répertoire de ce type
it_it: Impossibile importare il file '{0}': file o directory non trovati
ja_jp: ファイルを読み込めません: '{0}': このようなファイルまたはフォルダはありません
ko_kr: '{0}' 파일을 가져올 수 없습니다. 이러한 파일 또는 디렉토리가 없습니다
pl_pl: Nie można zaimportować pliku: '{0}': plik lub katalog nie istnieje
pt_br: Não é possível importar o arquivo: '{0}': o arquivo ou diretório não existe
ru_ru: Не удается импортировать файл: '{0}': такого файла или каталога не существует
zh_cn: 无法导入文件: '{0}': 没有此类文件或目录
zh_tw: 無法匯入檔案：'{0}'。無此類檔案或目錄

# ObjectsContainsInList1NotInList2
source: Returns objects that are included in List1 but excluded in List2
cs_cz: Vrací objekty, které jsou zahrnuty v seznamu List1, ale jsou vyloučené ze seznamu List2
de_de: Gibt Objekte zurück, die in List1 eingeschlossen, aber von List2 ausgeschlossen sind.
es_es: Devuelve objetos que se incluyen en List1 pero que se excluyen en List2
fr_fr: Renvoie les objets qui sont inclus dans List1 mais exclus dans List2
it_it: Restituisce gli oggetti inclusi in List1 ma esclusi da List2
ja_jp: List1 に含まれるが、List2 では除外されているオブジェクトを返します
ko_kr: List1에는 포함되지만 List2에서는 제외된 객체를 반환합니다
pl_pl: Zwraca obiekty, które są uwzględnione na List1, ale wyłączone z List2
pt_br: Retorna os objetos que estão incluídos na List1 mas excluído da Lista2
ru_ru: Получение объектов, содержащихся в списке List1 и исключенных из списка List2
zh_cn: 返回的对象包含在 List1 但不包括在 List2
zh_tw: 傳回 List1 中包括的物件，但排除 List2 中的物件

# ProducesTheSetIntersection
source: Produces the set intersection of two sequences
cs_cz: Vytvoří průsečík sady dvou sekvencí.
de_de: Gibt die Schnittmenge zweier Sequenzen aus.
es_es: Genera la intersección definida de dos secuencias
fr_fr: Crée l'intersection définie de deux séquences
it_it: Produce l'intersezione impostata di due sequenze
ja_jp: 2 つのシーケンスの交点のセットを生成します
ko_kr: 두 시퀀스의 설정 교차점을 생성합니다
pl_pl: Tworzy ustawione przecięcie dwóch sekwencji
pt_br: Produz a intersecção definida de duas sequências
ru_ru: Построение пересечения двух последовательностей
zh_cn: 生成两个序列的交集
zh_tw: 產生兩個順序的交集

# ProducesTheSetUnion
source: Produces the set union of two sequences by using the default equality comparer
cs_cz: Vytvoří sjednocení sady dvou posloupností pomocí výchozího porovnávače rovnosti.
de_de: Gibt unter Verwendung der vorgegebenen Funktion zur Feststellung von Gleichheit die Vereinigungsmenge zweier Sequenzen zurück.
es_es: Crea la unión definida de dos secuencias mediante el comparador de igualdad por defecto
fr_fr: Crée l'union définie de deux séquences en utilisant le comparateur d'égalité par défaut
it_it: Produce l'unione impostata di due sequenze tramite l'operatore di uguaglianza di default
ja_jp: 既定の均等性比較ツールを使用して 2 つのシーケンスの和集合を生成します
ko_kr: 기본 균일성 비교자를 사용하여 두 시퀀스의 설정 조합을 생성합니다
pl_pl: Tworzy zestaw dwóch sekwencji za pomocą domyślnej funkcji porównywania zrównania
pt_br: Produz a união definida de duas sequências usando o comparador igualdade padrão
ru_ru: Создание установленного объединения двух последовательностей при помощи стандартного сравнительного метода
zh_cn: 使用默认等分比较器生成两个序列的并集
zh_tw: 使用預設等式比較子，來產生兩個順序的聯集

# RemoveKeys
source: Returns true if the specified key is removed from list, otherwise returns false
cs_cz: Odebere klíč ze seznamu.
de_de: Entfernt den Schlüssel aus der Liste.
es_es: Elimina la clave de la lista
fr_fr: Supprime la clé de la liste
it_it: Rimuove la chiave dall'elenco
ja_jp: リストからキーを削除します
ko_kr: 리스트에서 키를 제거합니다
pl_pl: Usuwa z listy kluczy
pt_br: Remove a chave da lista
ru_ru: Удаление ключа из списка
zh_cn: 从列表中删除关键点
zh_tw: 從清單中移除鍵

# RemovesTheMembersofTheList
source: Removes the members of the list which are not members of the specified type
cs_cz: Odstraní ze seznamu členy, které nejsou členy vybraného typu.
de_de: Entfernt die Einträge der Liste, die nicht dem angegebenen Typ angehören.
es_es: Elimina los elementos de la lista que no son elementos del tipo especificado
fr_fr: Supprime les éléments de la liste qui ne correspondent pas au type spécifié
it_it: Rimuove le voci dell'elenco che non appartengono al tipo specificato
ja_jp: 指定したタイプのメンバーではないリストのメンバーを削除します
ko_kr: 리스트에서 지정된 유형의 구성원이 아닌 구성원을 제거합니다
pl_pl: Usuwa z listy elementy, które nie należą do określonego typu
pt_br: Remove os membros da lista que não são membros do tipo especificado
ru_ru: Удаление элементов из списка, которые не являются элементами указанного типа
zh_cn: 删除列表中非指定类型的成员
zh_tw: 移除不屬於指定類型成員的清單成員

# ReordersList
source: Reorders the list using the specified indices
cs_cz: Změní pořadí seznamu pomocí zadaných indexů.
de_de: Ordnet die Liste mit den angegebenen Indizes neu.
es_es: Reordena la lista mediante los índices especificados
fr_fr: Trie la liste à l'aide des index spécifiés
it_it: Riordina l'elenco in base agli indici specificati
ja_jp: 指定したインデックスを使用してリストを並べ替えます
ko_kr: 지정된 인덱스를 사용하여 리스트를 다시 정렬합니다
pl_pl: Zmienia porządek listy za pomocą określonych indeksów
pt_br: Reordena a lista utilizando os índices especificados
ru_ru: Изменение порядка расположения элементов в списке с использованием указанных индексов
zh_cn: 使用指定索引给列表重新排序
zh_tw: 使用指定的索引重新排序清單

# ReturnsConcatenatingList
source: Joins two lists into a single list
cs_cz: Spojí dva seznamy do jednoho seznamu
de_de: Verbindet zwei Listen zu einer einzigen Liste.
es_es: Unir dos listas en una sola
fr_fr: Joint deux listes dans une liste unique
it_it: Unisce due elenchi in un unico elenco
ja_jp: 2 つのリストを 1 つのリストに結合します
ko_kr: 두 리스트를 단일 리스트로 결합합니다
pl_pl: Łączy dwie listy w jedną
pt_br: Une duas listas em uma única lista
ru_ru: Объединение двух списков в один список
zh_cn: 将两个列表合并为单个列表
zh_tw: 將兩個清單接合為單一清單

# ReturnsListWithRankDepth
source: Returns multidimentional list according the rank given
cs_cz: Vrací vícerozměrný seznam podle daného pořadí.
de_de: Gibt multidimentionale Liste entsprechend dem angegebenen Rang zurück.
es_es: Devuelve lista multidimensional según la clasificación especificada
fr_fr: Renvoie une liste multidimensionnelle en fonction du classement donné
it_it: Restituisce un elenco multidimensionale in base all'ordine specificato
ja_jp: 指定したランクに従って、多次元のリストを返します
ko_kr: 지정된 순위에 따라 다차원 리스트를 반환합니다
pl_pl: Zwraca listę wielowymiarową zgodnie z podaną kolejnością
pt_br: Retorna a lista multidimensional e acordo com a determinada classificação
ru_ru: Получение многопланового списка в соответствии с заданным рангом
zh_cn: 根据给定等级返回多维列表
zh_tw: 根據給定的等級傳回多維清單

# ReturnsListWithUniformDepth
source: Returns a list with uniform depth as specified by the input depth
cs_cz: Vrací seznam s jednotnou hloubkou tak, jak určuje vstupní hloubka.
de_de: Gibt eine Liste mit einheitlicher Tiefe entsprechend der Eingabetiefe zurück.
es_es: Devuelve una lista con profundidad uniforme tal como se especifica por la profundidad de entrada
fr_fr: Renvoie une liste avec une profondeur uniforme, comme spécifié par la profondeur d'entrée
it_it: Restituisce un elenco con profondità uniforme in base alla profondità di input
ja_jp: 入力深さで指定し、深さが一定のリストを返します
ko_kr: 입력 깊이로 지정된 대로 깊이가 균일한 리스트를 반환합니다
pl_pl: Zwraca listę z jednolitą głębokością określoną przez głębokość wejściową
pt_br: Retorna uma lista com profundidade uniforme como especificado pela profundidade de entrada
ru_ru: Получение списка с равномерной глубиной в соответствии с указанной глубиной ввода
zh_cn: 返回具有输入深度指定的均匀深度的列表
zh_tw: 傳回具有均勻深度的清單，此深度是由輸入深度指定

# ReturnsNumberOfItems
source: Returns number of items in the specified list
cs_cz: Vrací počet položek v určeném seznamu.
de_de: Gibt die Anzahl der Elemente in der angegebenen Liste zurück.
es_es: Devuelve número de elementos de la lista especificada
fr_fr: Renvoie le nombre d'éléments dans la liste spécifiée
it_it: Restituisce il numero di voci dell'elenco specificato
ja_jp: 指定したリスト内の項目の数を返します
ko_kr: 지정된 리스트의 항목 수를 반환합니다
pl_pl: Zwraca liczbę elementów z określonej listy
pt_br: Retorna o número de itens na lista especificada
ru_ru: Получение числа элементов в списке
zh_cn: 返回指定列表中的项数
zh_tw: 傳回指定清單中的項目數

source: return statement is not allowed in constructor
cs_cz: návratový výraz není v konstruktoru povolen.
de_de: Rückgabeanweisung nicht zulässig im Konstruktor
es_es: sentencia de retorno no se permite en constructor
fr_fr: instruction de retour non autorisée dans le constructeur
it_it: Istruzione return non consentita nel costruttore
ja_jp: return ステートメントはコンストラクタでは使用できません
ko_kr: 생성자에는 return 문을 사용할 수 없습니다
pl_pl: instrukcja zwrotu nie jest dozwolona w konstruktorze
pt_br: a declaração retornada não é permitido no construtor
ru_ru: выражение возврата запрещено в конструкторе
zh_cn: 构造函数中不允许使用返回语句
zh_tw: 建構函式中不允許傳回陳述式

source: Returns the deepest depth of the list
cs_cz: Vrací nejhlubší hloubku seznamu
de_de: Gibt die tiefste Ebene der Liste an.
es_es: Devuelve la profundidad máxima de la lista
fr_fr: Renvoie la plus grande profondeur de la liste
it_it: Restituisce la profondità maggiore dell'elenco
ja_jp: リストの最も深い深さを返します
ko_kr: 리스트의 가장 깊은 깊이를 반환합니다
pl_pl: Zwraca najgłębszą głębokość listy
pt_br: Retorna a maior profundidade da lista
ru_ru: Получение максимального значения глубины списка
zh_cn: 返回最深的列表深度
zh_tw: 傳回清單的最深深度

# ReturnsTheFlattened1DList
source: Returns the flattened 1D list of the multi-dimensional input list
cs_cz: Vrací plochý 1D seznam vícerozměrných vstupů. Pokud je zadání jedna hodnota, vrátí tuto hodnotu.
de_de: Gibt die vereinfachte 1D-Liste für die eingegebene mehrdimensionale Liste zurück. Wurde nur ein Wert eingegeben, wird dieser zurückgegeben.
es_es: Devuelve la lista 1D plana de la lista de entrada multidimensional. Si la entrada es un único valor, devuelve ese valor.
fr_fr: Renvoie la liste 1D aplanie de la liste d'entrée multidimensionnelle. Si l'entrée est une valeur unique, renvoie cette valeur.
it_it: Restituisce la versione 1D dell'elenco di input multidimensionale. Se l'input è un valore singolo, restituisce tale valore.
ja_jp: 多次元リストの入力をフラットにした 1 次元のリストを返します。 入力が単一の値の場合は、その値を返します。
ko_kr: 다차원 입력 리스트의 단순화된 1차원 리스트를 반환합니다. 입력이 단일 값이면 해당 값을 반환합니다.
pl_pl: Zwraca spłaszczoną listę 1D listy wielowymiarowej danych wejściowych. Jeśli dane są wartością pojedynczą, zwraca tę wartość.
pt_br: Retorna a lista 1D aplainada da lista de entrada multidimensional. Se a entrada for um único valor, retorna tal valor.
ru_ru: Получение плоского линейного списка, содержащегося в многоплановом списке ввода. Если ввод представляет собой одно значение, то возвращается это значение.
zh_cn: 返回多维输入列表的展平一维列表。如果输入为单个值，将返回该值。
zh_tw: 傳回多維輸入清單的展開 1D 清單。如果輸入為單一數值，則傳回該值。

# ReturnsTheIndex
source: Returns the index of the member in the list
cs_cz: Vrací index člena v seznamu
de_de: Gibt den Index des Listeneintrags zurück.
es_es: Devuelve el índice del miembro en la lista
fr_fr: Renvoie l'index de l'élément dans la liste
it_it: Restituisce l'indice della voce nell'elenco
ja_jp: リスト内のメンバーのインデックスを返します
ko_kr: 리스트 구성원의 인덱스를 반환합니다
pl_pl: Zwraca indeks elementu na liście
pt_br: Retorna o índice do membro na lista
ru_ru: Получение индекса элемента в списке
zh_cn: 返回列表中成员的索引
zh_tw: 傳回清單中的成員索引

# ReturnsTheNumberOfFalseValueInList
source: Returns the number of false values in the list
cs_cz: Vrací počet hodnot false v seznamu.
de_de: Gibt die Anzahl der false-Werte in der Liste zurück.
es_es: Devuelve el número de valores false de la lista
fr_fr: Renvoie le nombre de valeurs fausses dans la liste
it_it: Restituisce il numero di valori false nell'elenco
ja_jp: リスト内の false 値の数を返します
ko_kr: 리스트에서 false 값의 수를 반환합니다
pl_pl: Zwraca liczbę wartości fałsz na liście
pt_br: Retorna o número de valores falsos na lista
ru_ru: Получение числа ложных значений в списке
zh_cn: 返回列表中“False”值的数量
zh_tw: 傳回清單中的 False 值數

# ReturnsTheNumberOfTrueValue
source: Returns the number of true values in the list
cs_cz: Vrací počet hodnot true v seznamu.
de_de: Gibt die Anzahl der true-Werte in der Liste zurück.
es_es: Devuelve el número de valores true de la lista
fr_fr: Renvoie le nombre de valeurs True dans la liste
it_it: Restituisce il numero di valori true nell'elenco
ja_jp: リスト内の true 値の数を返します
ko_kr: 리스트에서 true 값의 수를 반환합니다
pl_pl: Zwraca liczbę wartości prawda na liście
pt_br: Retorna o número de valores verdadeiros na lista
ru_ru: Получение числа истинных значений в списке
zh_cn: 返回列表中“True”值的数量
zh_tw: 傳回清單中的 True 值數

# SemiColonExpected
source: ';' is expected
cs_cz: Očekávano „;“
de_de: ';' wird erwartet
es_es: se esperaba ';'
fr_fr: ';' est attendu
it_it: ';' previsto
ja_jp: ';' が必要です
ko_kr: ';'이 예상됩니다
pl_pl: oczekuje się ';'
pt_br: ';' é esperado
ru_ru: Ожидается ';'
zh_cn: 应输入 ';'
zh_tw: 預期 ';'

# SortsListByValue
source: Sorts a specified list by the values of its members in either ascending or descending order
cs_cz: Uspořádá zadaný seznam podle hodnot jeho členů buď vzestupně, nebo sestupně.
de_de: Sortiert eine angegebene Liste nach den Werten ihrer Einträge, entweder aufsteigend oder absteigend.
es_es: Ordena de forma ascendente o descendente una lista especificada por los valores de sus elementos
fr_fr: Trie la liste spécifiée en fonction des valeurs de leurs éléments dans l'ordre croissant ou décroissant
it_it: Dispone l'elenco specificato in ordine crescente o decrescente in base ai valori delle relative voci
ja_jp: メンバーの値で指定したリストを、昇順または降順のいずれかに並べ替えます
ko_kr: 지정된 리스트를 구성원의 값을 기준으로 오름차순 또는 내림차순으로 정렬합니다
pl_pl: Sortuje określoną listę według wartości jej elementów w porządku rosnącym lub malejącym
pt_br: Classifica a lista especificada pelos valores de seus membros em ordem crescente ou decrescente
ru_ru: Сортировка определенного списка по значениям его элементов по возрастанию или по убыванию
zh_cn: 按成员值的升序或降序顺序给指定列表排序
zh_tw: 依其成員的值以遞增或遞減順序排序指定清單

# SortsListByValueInAscending
source: Sorts a specified list by values of its members in ascending order
cs_cz: Seřadí zadaný seznam podle hodnot jeho členů ve vzestupném pořadí.
de_de: Sortiert eine angegebene Liste nach Werten ihrer Einträge in aufsteigender Reihenfolge.
es_es: Ordena una determinada lista según valores de sus elementos en orden ascendente
fr_fr: Trie la liste spécifiée selon les valeurs de ses éléments dans l'ordre croissant
it_it: Dispone l'elenco specificato in ordine crescente in base ai valori delle relative voci
ja_jp: メンバーの値で指定したリストを昇順に並べ替えます
ko_kr: 지정된 리스트를 구성원의 값을 기준으로 오름차순으로 정렬합니다
pl_pl: Sortuje określoną listę według wartości jej elementów w porządku rosnącym
pt_br: Classifica a lista especificada por valores de seus membros em ordem crescente
ru_ru: Сортировка определенного списка по значениям его элементов по возрастанию
zh_cn: 按成员值的升序顺序给指定列表排序
zh_tw: 依其成員的值以升序順序排序指定的清單

# TooManyCharacters
source: Too many characters in character literal
cs_cz: Příliš mnoho znaků v literálu znaku
de_de: zu viele Zeichen in Zeichenliteral
es_es: Demasiados caracteres en carácter literal
fr_fr: Trop de caractères dans le littéral de caractère
it_it: Troppi caratteri nel valore letterale di carattere
ja_jp: 文字リテラルの文字数が多すぎます
ko_kr: 문자 리터럴에 문자가 너무 많습니다
pl_pl: Zbyt dużo znaków w literale znakowym
pt_br: Excesso de caracteres na literal de caractere
ru_ru: Слишком много символов в литерале символа
zh_cn: 字符文本中的字符太多
zh_tw: 字元文字中有太多的字元

# UnknownAttribute
source: Unknown attribute {0}
cs_cz: Neznámý atribut {0}
de_de: Unbekanntes Attribut {0}
es_es: Atributo desconocido {0}
fr_fr: Attribut inconnu {0}
it_it: Attributo sconosciuto {0}
ja_jp: 不明な属性 {0}
ko_kr: 알 수 없는 속성 {0}
pl_pl: Nieznany atrybut {0}
pt_br: Atributo desconhecido {0}
ru_ru: Неизвестный атрибут {0}
zh_cn: 未知属性 {0}
zh_tw: 不明屬性 {0}

# UseInlineConditional
source: '{0}' statement can only be used in imperative language block, consider using an inline conditional instead?
cs_cz: Výraz „{0}“ lze použít pouze na nezbytný blok jazyka, nechcete místo toho zvážit použití vložené podmínky?
de_de: Anweisung '{0}' kann nur in einem imperativen Sprachenblock verwendet werden. Stattdessen Inline-Bedingung verwenden?
es_es: La sentencia '{0}' solo se puede utilizar en bloque de lenguaje imperativo, ¿quizá se podría utilizar una sentencia inline condicional?
fr_fr: L'instruction '{0}' peut uniquement être utilisée dans un bloc de langage impératif, envisager d'utiliser une conditionnelle incluse?
it_it: L'istruzione '{0}' può essere utilizzata solo in un blocco di linguaggio imperativo. Utilizzare un'istruzione condizionale?
ja_jp: '{0}' 条件文は命令型言語ブロックにのみ使用できます。代わりにインライン条件文を使用しますか?
ko_kr: '{0}' 문은 명령형 언어 블록에서만 사용할 수 있습니다. 대신 인라인 조건문을 사용해 보십시오?
pl_pl: Instrukcja '{0}' może być używana tylko w bloku języku imperatywnego. Czy użyć zamiast tego wewnętrznego warunku?
pt_br: A declaração '{0}' somente pode ser utilizada em um bloco de linguagem imperativo, considere a possibilidade de utilizar uma Inline condicional?
ru_ru: Выражение '{0}' может использоваться только в императивном языковом блоке. Рассмотрите возможность использования встроенного условного блока.
zh_cn: '{0}' 语句只能用于命令式语言块，考虑使用联机条件句？
zh_tw: '{0}' 陳述式只能用在必要語言區塊中，請考慮改用順列條件？

# UseListJoinNode
source: Use List.Join node instead
cs_cz: Místo toho použijte uzel List.Join.
de_de: Stattdessen Block List.Join verwenden
es_es: Utilice nodo List.Join en su lugar
fr_fr: Utiliser List.Join à la place
it_it: Utilizzare il nodo List.Join
ja_jp: 代わりに List.Join ノードを使用
ko_kr: 대신 List.Join 노드를 사용하십시오
pl_pl: Zamiast tego należy użyć węzła List.Join
pt_br: Utilize o nó List.Join ao invés
ru_ru: Использовать вместо этого узел List.Join
zh_cn: 改为使用 List.Join 节点
zh_tw: 改用 List.Join 節點
