Repository: DynamoDS/Dynamo
Catalog: src/Engine/ProtoCore/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# kInvalidContinueForFunction
source: Internal error, please report: Statement continue cause function to abnormally return null. (fd67aaee)
cs_cz: Nahlaste vnitřní chybu: Příkaz bude i nadále vykonáván, protože funkce oproti očekávání vrací hodnotu null.
de_de: Interner Fehler, bitte melden: Fortsetzung der Anweisung bewirkt unerwartete Rückgabe von Null.
es_es: Error interno, informe: la continuación de la sentencia hace que la función devuelva nulo de manera anómala.
fr_fr: Erreur interne, veuillez signaler: en raison de l'instruction, la fonction renvoie une valeur anormale (nulle).
it_it: Errore interno, segnalare: a causa dell'istruzione, la funzione continua a restituire in maniera anomala un valore nullo.
ja_jp: 内部エラーです。次の内容を報告してください。continue ステートメントにより関数が誤って NULL を返しました
ko_kr: 내부 오류. 신고하십시오. continue 문으로 인해 함수에서 비정상적으로 null을 반환합니다.
pl_pl: Błąd wewnętrzny, raportuj: Instrukcja Kontynuuj powoduje, że funkcja błędnie zwraca pustą wartość.
pt_br: Erro interno, reporte: a declaração continua fazendo com que a função retorne nulo de forma anormal.
ru_ru: Внутренняя ошибка. Отправьте отчет: из-за выражения функция продолжает возвращать нулевое значение, что в данном случае неправильно.
zh_cn: 内部错误，请报告: 语句继续导致函数异常返回空值。
zh_tw: 內部錯誤，請報告：陳述式繼續會導致異常傳回空值。

# kInvalidStaticCyclicDependency
source: A cyclic dependency exists between '{0}' and '{1}'
cs_cz: Mezi dvěma proměnnými existuje cyklická závislost.
de_de: Zwischen zwei Variablen besteht eine zyklische Abhängigkeit.
es_es: Hay una dependencia cíclica entre dos variables
fr_fr: Une dépendance cyclique existe entre deux variables
it_it: È presente una dipendenza ciclica tra due variabili
ja_jp: 2 つの変数間に循環従属関係が存在します
ko_kr: 두 변수 사이에 존재하는 주기적 의존성
pl_pl: Istnieje cykliczna zależność między dwiema zmiennymi
pt_br: Existe uma dependência cíclica entre duas variáveis
ru_ru: Между двумя переменными существует циклическая зависимость
zh_cn: 两个变量之间存在循环从属关系
zh_tw: 存在於兩個變數之間的循環相依性

# kInvalidThis
source: 'this' can only be used in methods that are members of a class
cs_cz: Hodnotu „this“ lze použít pouze v metodách, které jsou členy třídy.
de_de: 'this' kann nur in Methoden verwendet werden, die einer Klasse angehören.
es_es: 'this' solo puede utilizarse en métodos que sean elementos de una clase
fr_fr: 'this' peut uniquement être utilisé dans des méthodes qui sont des éléments d'une classe
it_it: 'this' può essere utilizzato solo nei metodi che appartengono ad una classe
ja_jp: 'this' はクラスのメンバーであるメソッドのみに使用できます
ko_kr: '이' 항목은 클래스의 구성원인 방법에서만 사용할 수 있습니다
pl_pl: 'ten' może być używany wyłącznie w metodach, które są elementami klasy
pt_br: 'este' pode ser utilizado somente em métodos que são membros de uma classe
ru_ru: 'это' может использоваться только в методах, относящихся к классам
zh_cn: “this”只能用于属于类别成员的方法函数
zh_tw: 'this' 只能用在屬於類別的方法

# kInvokeMethodOnInvalidObject
source: Internal error, please report: Method '{0}()' is invoked on an invalid object. (fa006d2b)
cs_cz: Metoda '{0}()' není vyvolána u neplatného objektu.
de_de: Methode '{0}()' wurde für ein ungültiges Objekt aufgerufen.
es_es: El método '{0}()' se invoca en un objeto no válido.
fr_fr: La méthode '{0}()' est appelée sur un objet incorrect.
it_it: Il metodo '{0}()' è richiamato per un oggetto non valido.
ja_jp: メソッド '{0}() ' が無効なオブジェクトに関して呼び出されています。
ko_kr: '{0}()' 방법이 잘못된 객체에서 호출되었습니다.
pl_pl: Metoda '{0}()' jest wywoływana na nieprawidłowym obiekcie.
pt_br: O método '{0}()' é chamado em um objeto inválido.
ru_ru: Метод '{0}()' используется с недопустимым объектом.
zh_cn: 调用方法函数“{0}()”的对象无效。
zh_tw: 在無效物件上呼叫方法 '{0}()'。

# kMethodAlreadyDefined
source: Method '{0}()' is already defined
cs_cz: Metoda „{0}()“ je již definována.
de_de: Methode '{0}()' ist bereits definiert.
es_es: El método '{0}()' ya se ha definido
fr_fr: Méthode '{0}()' déjà définie
it_it: Il metodo '{0}()' è già definito
ja_jp: メソッド '{0}()' は既に設定されています
ko_kr: '{0}()' 방법이 이미 정의되어 있습니다
pl_pl: Metoda '{0}()' jest już zdefiniowana
pt_br: Método '{0}() ' já definido
ru_ru: Метод '{0}()' уже определен
zh_cn: 方法函数 '{0}()' 已定义
zh_tw: 已定義方法 '{0}()'

# kMethodHasInvalidArguments
source: '{0}()' has some invalid arguments
cs_cz: '{0}()' has some invalid arguments href=kMethodHasInvalidArguments
de_de: '{0}()' has some invalid arguments href=kMethodHasInvalidArguments
es_es: '{0}()' presenta algunos argumentos no válidos: href=kMethodHasInvalidArguments
fr_fr: '{0}()' a des arguments non valides href=kMethodHasInvalidArguments
it_it: '{0}()' presenta alcuni argomenti non validi href=kMethodHasInvalidArguments
ja_jp: '{0}()' has some invalid arguments href=kMethodHasInvalidArguments
ko_kr: '{0}()' has some invalid arguments href=kMethodHasInvalidArguments
pl_pl: '{0}()' ma pewne nieprawidłowe argumenty href=kMethodHasInvalidArguments
pt_br: '{0}()' tem alguns argumentos inválidos href=kMethodHasInvalidArguments
ru_ru: '{0}()' has some invalid arguments href=kMethodHasInvalidArguments
zh_cn: '{0}()' has some invalid arguments href=kMethodHasInvalidArguments
zh_tw: '{0}()' has some invalid arguments href=kMethodHasInvalidArguments

# kMethodIsInaccessible
source: Method '{0}()' can't be reached from here
cs_cz: Metody „{0}()“ zde nemůže být dosaženo.
de_de: Methode '{0}()' ist von hier nicht erreichbar.
es_es: No se puede acceder al método '{0}()' desde aquí
fr_fr: La méthode '{0}()' n'est pas accessible depuis cet emplacement
it_it: Impossibile accedere al metodo '{0}()' da questo punto
ja_jp: メソッド '{0}()' はここから利用できません
ko_kr: 여기서는 '{0}()' 방법으로 도달할 수 없습니다
pl_pl: Metoda '{0}()' nie może zostać osiągnięta z tego miejsca
pt_br: O método '{0}()' não pode ser alcançado daqui
ru_ru: Невозможно достичь выполнения метода '{0}()' здесь
zh_cn: 无法从此处达到方法函数 '{0}()'
zh_tw: 無法從此處到達方法 '{0}()'

# kMethodNotFound
source: Method '{0}()' not found
cs_cz: Metoda „{0}()“ nebyla nalezena href=kMethodNotFound.html
de_de: Methode '{0}()' nicht gefunden href=kMethodNotFound.html
es_es: No se ha encontrado el método '{0}()'. href=kMethodNotFound.html
fr_fr: Méthode '{0}()' introuvable href=kMethodNotFound.html
it_it: Metodo '{0}()' non trovato href=kMethodNotFound.html
ja_jp: メソッド '{0}()' が見つかりません href=kMethodNotFound.html
ko_kr: '{0}()' 방법을 찾을 수 없습니다. href=kMethodNotFound.html
pl_pl: Metoda „{0}()” nie została odnaleziona href=kMethodNotFound.html
pt_br: Método '{0}()' não encontrado href=kMethodNotFound.html
ru_ru: Метод «{0}()» не найден href=kMethodNotFound.html
zh_cn: 未找到方法“{0}()”href=kMethodNotFound.html
zh_tw: 找不到方法 '{0}()' href=kMethodNotFound.html

# kMethodResolutionFailure
source: Internal error, please report: Method resolution failure on: {0}() - (8bc0db87)
cs_cz: Internal error, please report: Method resolution failure on: {0}().
de_de: Internal error, please report: Method resolution failure on: {0}().
es_es: Error interno; informe: error de resolución del método: {0}().
fr_fr: Erreur interne, veuillez signaler: échec de la résolution de la méthode sur: {0}().
it_it: Errore interno, segnalare: errore di risoluzione del metodo in: {0}().
ja_jp: Internal error, please report: Method resolution failure on: {0}().
ko_kr: Internal error, please report: Method resolution failure on: {0}().
pl_pl: Błąd wewnętrzny, zgłoś: błąd rozpoznania metody na etapie: {0}().
pt_br: Erro interno. Informe: Falha na resolução do método em: {0}().
ru_ru: Internal error, please report: Method resolution failure on: {0}().
zh_cn: Internal error, please report: Method resolution failure on: {0}().
zh_tw: Internal error, please report: Method resolution failure on: {0}().

# kMethodResolutionFailureForOperator
source: Operator '{0}' cannot be applied to operands of type '{1}' and '{2}'
cs_cz: Operátor „{0}“ nelze použít pro operandy typu „{1}“ a „{2}“.
de_de: Operator '{0}' kann nicht auf Operanden von Typ '{1}' und '{2}' angewendet werden.
es_es: El operador '{0}' no se puede aplicar a operandos de tipo '{1}' y '{2}'
fr_fr: L'opérateur '{0}' ne peut pas être appliqué aux opérandes de type '{1}' et '{2}'
it_it: L'operatore '{0}' non può essere applicato agli operandi di tipo '{1}' e '{2}'
ja_jp: 演算子 '{0}' はタイプ '{1}' および '{2}' のオペランドには適用できません
ko_kr: '{0}' 연산자는 '{1}' 및 '{2}' 유형의 피연산자에 적용할 수 없습니다
pl_pl: Operator '{0}' nie może być zastosowany do argumentów typu '{1}' i '{2}'
pt_br: O operador '{0}' não pode ser aplicado para operandos do tipo '{1}' e '{2}'
ru_ru: Оператор '{0}' невозможно применить к операнду типов '{1}' и '{2}'
zh_cn: 运算符 '{0}' 无法应用于类型为 '{1}' 和 '{2}' 的运算对象
zh_tw: 運算子 '{0}' 無法套用至類型 '{1}' 和 '{2}' 的運算元

# kMethodResolutionFailureWithTypes
source: One or more of the input types are not matching. Couldn't find a version of {0} that takes arguments of type {1}
cs_cz: Neexistuje žádná verze {0}, která přijímá argumenty typu ({1}). href=NonOverloadMethodResolutionError.html
de_de: Es gibt keine Version von {0}, die Argumenttyp(en) ({1}) akzeptiert. href=NonOverloadMethodResolutionError.html
es_es: No hay ninguna versión de {0} que acepte los tipos de argumentos ({1}). href=NonOverloadMethodResolutionError.html
fr_fr: Aucune des versions de {0} n'accepte le ou les types d'argument ({1}). href=NonOverloadMethodResolutionError.html
it_it: Nessuna versione di {0} che accetta tipi di argomento ({1}). href=NonOverloadMethodResolutionError.html
ja_jp: 引数タイプ({1})を受け入れる {0} のバージョンはありません。 href=NonOverloadMethodResolutionError.html
ko_kr: 인수 유형({1})을 허용하는 {0} 버전이 없습니다. href=NonOverloadMethodResolutionError.html
pl_pl: Brak wersji {0}, która przyjmuje typ/typy argumentu ({1}). href=NonOverloadMethodResolutionError.html
pt_br: Não há nenhuma versão de {0} que aceite os tipos de argumentos ({1}). href=NonOverloadMethodResolutionError.html
ru_ru: Отсутствует версия {0}, которая принимает типы аргументы ({1}). href=NonOverloadMethodResolutionError.html
zh_cn: 没有任何一个版本的 {0} 接受参数类型({1})。href=NonOverloadMethodResolutionError.html
zh_tw: {0} 沒有版本接受引數類型 ({1})。href=NonOverloadMethodResolutionError.html

# kMethodStackOverflow
source: '{0}()' recursed until Dynamo ran out of memory, please add a base case.
cs_cz: Prováděna rekurze „{0}()“, dokud aplikaci Dynamo nedošla paměť, přidejte základní případ.
de_de: '{0}()' wurde rekursiv ausgeführt, bis der Speicherplatz für Dynamo aufgebraucht war. Bitte Basisfall hinzufügen.
es_es: '{0}()' en recursión hasta que Dynamo se quedó sin memoria, añada un caso de base
fr_fr: '{0}()' a été récursif jusqu'à ce que Dynamo manque de mémoire, ajoutez un scénario de base.
it_it: '{0}()' è stato ripetuto fino a determinare un errore di memoria insufficiente in Dynamo.
ja_jp: '{0}()' は Dynamo のメモリが不足するまで再帰的に処理されました。基本ケースを追加してください。
ko_kr: '{0}()'은(는) Dynamo에 메모리가 부족할 때까지 반복됩니다. 기준 사례를 추가하십시오.
pl_pl: '{0}()' powtarzał się, aż zabrakło pamięci w dodatku Dynamo. Należy dodać przypadek bazowy.
pt_br: A '{0}()' foi repetida até que o Dynamo ficou sem memória, adicione um caso base.
ru_ru: Рекурсия '{0}()' до тех пор, пока не кончится память Dynamo. Добавьте основной вариант.
zh_cn: '{0}()' 递归直到 Dynamo 内存溢出，请添加基础案例。
zh_tw: 遞迴 '{0}()'，直到 Dynamo 用光記憶體，請加入基準情況。

# kMultipleSymbolFound
source: Multiple definitions for '{0}' are found as {1}
cs_cz: Více definic pro „{0}“ bylo nalezeno jako {1}. href=kMultipleSymbolFound.html
de_de: Mehrere Definitionen für '{0}' gefunden als {1} href=kMultipleSymbolFound.html
es_es: Se han encontrado varias definiciones de '{0}' como {1}. href=kMultipleSymbolFound.html
fr_fr: Plusieurs définitions pour '{0}' ont été trouvées comme {1} href=kMultipleSymbolFound.html
it_it: Più definizioni di '{0}' trovate come {1} href=kMultipleSymbolFound.html
ja_jp: '{0}' の複数の設定が {1} として見つかりました href=kMultipleSymbolFound.html
ko_kr: '{0}'에 대한 여러 정의가 {1}(으)로 확인되었습니다. href=kMultipleSymbolFound.html
pl_pl: Wiele definicji dla „{0}” jest dostępnych jako {1} href=kMultipleSymbolFound.html
pt_br: Há várias definições para '{0}' como {1} href=kMultipleSymbolFound.html
ru_ru: Несколько определений для «{0}» найдены в виде {1} href=kMultipleSymbolFound.html
zh_cn: 发现“{0}”的多个定义为 {1} href=kMultipleSymbolFound.html
zh_tw: 找到 '{0}' 的多個定義，做為 {1} href=kMultipleSymbolFound.html

# kMultipleSymbolFoundFromName
source: Multiple definitions for '{0}' are found as {1}
cs_cz: Více definic pro „{0}“ bylo nalezeno jako {1}
de_de: Mehrere Definitionen für '{0}' gefunden als {1}
es_es: Se han encontrado varias definiciones de '{0}' como {1}
fr_fr: Plusieurs définitions pour '{0}' ont été trouvées comme {1}
it_it: Più definizioni di '{0}' trovate come {1}
ja_jp: '{0}' の複数の設定が {1} として見つかりました
ko_kr: '{0}'에 대한 여러 정의가 {1}(으)로 확인되었습니다
pl_pl: Wiele definicji dla '{0}' jest dostępnych jako {1}
pt_br: Múltiplas definições para '{0}' são encontrados como {1}
ru_ru: Несколько определений для '{0}' найдены в виде {1}
zh_cn: 发现 '{0}' 的多个定义为 {1}
zh_tw: 找到 '{0}' 的多個定義，做為 {1}

# kNoStepSizeInAmountRangeExpression
source: No step size is specified in amount range expression
cs_cz: Není určena žádná velikost kroku ve výrazu rozsahu množství.
de_de: Keine Schrittgröße im Ausdruck für Betragsbereich angegeben
es_es: No se ha especificado tamaño de paso en expresión de rango de cantidad
fr_fr: Aucune taille de pas n'est spécifiée dans l'expression d'intervalle de quantité
it_it: Nessuna dimensione incrementale specificata nella quantità dell'espressione di intervallo
ja_jp: 量の範囲の式にステップ サイズが指定されていません
ko_kr: 양 범위 표현식에 단계 크기가 지정되지 않았습니다
pl_pl: W wyrażeniu zakresu ilości nie jest określona wielkość kroku
pt_br: Nenhum tamanho de etapa está especificado na expressão de faixa de valor
ru_ru: Размер шага не задан в выражении диапазона объема.
zh_cn: 数量范围表达式中没有指定步长大小
zh_tw: 沒有步長大小指定在數量範圍表示式中

# kPropertyInaccessible
source: Property '{0}' is inaccessible
cs_cz: Vlastnost '{0}' je nepřístupná
de_de: Zugriff auf Eigenschaft '{0}' nicht möglich
es_es: La propiedad '{0}' es inaccesible
fr_fr: La propriété '{0}' est inaccessible
it_it: La proprietà '{0}' è inaccessibile
ja_jp: プロパティ '{0}' にアクセスできません
ko_kr: '{0}' 특성에 액세스할 수 없습니다
pl_pl: Właściwość '{0}' jest niedostępna
pt_br: A propriedade '{0}' está inacessível
ru_ru: Свойство '{0}' недоступно
zh_cn: 特性 '{0}' 无法访问
zh_tw: 無法存取性質 '{0}'

# kPropertyIsInaccessible
source: Property '{0}' is inaccessible
cs_cz: Vlastnost '{0}' je nepřístupná.
de_de: Zugriff auf Eigenschaft '{0}' nicht möglich
es_es: La propiedad '{0}' es inaccesible
fr_fr: La propriété '{0}' est inaccessible
it_it: La proprietà '{0}' è inaccessibile
ja_jp: プロパティ '{0}' にアクセスできません
ko_kr: '{0}' 특성에 액세스할 수 없습니다
pl_pl: Właściwość '{0}' jest niedostępna
pt_br: A propriedade '{0}' está inacessível
ru_ru: Свойство '{0}' недоступно
zh_cn: 特性 '{0}' 无法访问
zh_tw: 無法存取性質 '{0}'

# kPropertyNotFound
source: Property '{0}' not found
cs_cz: Vlastnost „{0}“ nebyla nalezena
de_de: Eigenschaft '{0}' nicht gefunden
es_es: Propiedad '{0}' no encontrada
fr_fr: Propriété '{0}' introuvable
it_it: Impossibile trovare la proprietà '{0}'
ja_jp: プロパティ '{0}' が見つかりません
ko_kr: '{0}' 특성을 찾을 수 없습니다
pl_pl: Właściwość '{0}' nie została odnaleziona
pt_br: A propriedade '{0}' não foi encontrada
ru_ru: Свойство '{0}' не найдено
zh_cn: 未找到特性 '{0}'
zh_tw: 找不到性質 '{0}'

# kPropertyOfClassNotFound
source: Class '{0}' does not have a property '{1}'
cs_cz: No property called {0} on {1} could be found href=kPropertyOfClassNotFound
de_de: No property called {0} on {1} could be found href=kPropertyOfClassNotFound
es_es: No se ha podido encontrar ninguna propiedad denominada {0} en {1} href=kPropertyOfClassNotFound.
fr_fr: Aucune propriété appelée {0} sur {1} n'a pu être trouvée href=kPropertyOfClassNotFound
it_it: Impossibile trovare la proprietà chiamata {0} in {1} href=kPropertyOfClassNotFound
ja_jp: No property called {0} on {1} could be found href=kPropertyOfClassNotFound
ko_kr: No property called {0} on {1} could be found href=kPropertyOfClassNotFound
pl_pl: Nie można znaleźć właściwości wywołanej {0} w {1} href=kPropertyOfClassNotFound
pt_br: Não foi possível localizar nenhuma propriedade chamada {0} em {1} href=kPropertyOfClassNotFound
ru_ru: No property called {0} on {1} could be found href=kPropertyOfClassNotFound
zh_cn: No property called {0} on {1} could be found href=kPropertyOfClassNotFound
zh_tw: No property called {0} on {1} could be found href=kPropertyOfClassNotFound

# kRangeExpressionConflictOperator
source: An amount operator cannot be used together with a step operator
cs_cz: Operátor množství nelze použít společně s operátorem kroku.
de_de: Ein Betragsoperator kann nicht zusammen mit einem Schrittoperator verwendet werden.
es_es: No se puede utilizar un operador de totales junto con un operador de pasos
fr_fr: Un opérateur de quantité ne peut pas être utilisé avec un opérateur de pas
it_it: Impossibile utilizzare un operatore di quantità con un operatore di incremento
ja_jp: 数量の演算子を昇降演算子とともに使用することはできません
ko_kr: 양 연산자는 단계 연산자와 함께 사용할 수 없습니다
pl_pl: Operator ilości nie może być użyty razem z operatorem kroku
pt_br: Um operador de quantidade não pode ser usado junto com um operador de etapa
ru_ru: Оператор количества не может использоваться вместе с оператором шага
zh_cn: 数量运算符不能与步长运算符一起使用
zh_tw: 數量運算子無法與步長運算子搭配使用

# kRangeExpressionWithInvalidAmount
source: The amount of step is invalid.
cs_cz: Velikost kroku je neplatná.
de_de: Der Betrag des Schritts ist ungültig.
es_es: La cantidad de paso no es válida
fr_fr: Quantité de pas incorrecte.
it_it: La quantità incrementale non è valida.
ja_jp: ステップの数量が無効です。
ko_kr: 단계의 수가 잘못되었습니다.
pl_pl: Wielkość kroku jest nieprawidłowa.
pt_br: A quantidade da etapa é inválida.
ru_ru: Числовое значение шага недопустимо.
zh_cn: 步长数量无效。
zh_tw: 步長數量無效。

# kRangeExpressionWithInvalidStepSize
source: The step size of range expression is invalid.
cs_cz: Velikost kroku výrazu rozsahu je neplatná.
de_de: Die Schrittgröße des Bereichsausdrucks ist ungültig.
es_es: El tamaño de paso de expresión de rango no es válido
fr_fr: La taille de pas de l'expression d'intervalle est incorrecte.
it_it: L'incremento dell'espressione di intervallo non è valido.
ja_jp: 範囲式のステップ サイズが無効です。
ko_kr: 범위 표현식의 단계 크기가 잘못되었습니다.
pl_pl: Wielkość kroku wyrażenia przedziału jest nieprawidłowa.
pt_br: O tamanho da etapa da expressão da faixa é inválido.
ru_ru: Значение шага в выражении диапазона имеет недопустимое значение.
zh_cn: 范围表达式的步长大小无效。
zh_tw: 範圍表示式的步長大小無效。

# kRangeExpressionWithNegativeStepNumber
source: The step number of range expression should be greater than 0
cs_cz: Číslo kroku výrazu rozsahu musí být větší než 0.
de_de: Die Schrittnummer des Bereichsausdrucks muss größer als 0 sein.
es_es: El número de paso de expresión de rango debe ser mayor que 0
fr_fr: Le nombre de pas de l'expression d'intervalle doit être supérieur à 0
it_it: Il numero di incremento dell'espressione di intervallo deve essere maggiore di 0
ja_jp: 範囲式のステップ数は 0 より大きくする必要があります
ko_kr: 범위 표현식의 단계 수는 0보다 커야 합니다
pl_pl: Numer kroku wyrażenia zakresu powinien być większy niż 0
pt_br: O número de etapas da expressão de faixa deve ser maior do que 0
ru_ru: Значение шага в выражении диапазона должно быть больше 0
zh_cn: 范围表达式的步长数应大于 0
zh_tw: 範圍表示式的步長號碼應大於 0

# kRangeExpressionWithNonIntegerStepNumber
source: The step number of range expression should be integer
cs_cz: Číslo kroku výrazu rozsahu musí být celé číslo.
de_de: Schrittnummer des Bereichsausdrucks muss Ganzzahl sein.
es_es: El número de paso de expresión de rango debe ser entero
fr_fr: Le nombre de pas d'une expression d'intervalle doit être un nombre entier
it_it: Il numero di incremento dell'espressione di intervallo deve essere un numero intero
ja_jp: 範囲式のステップ数は整数にする必要があります
ko_kr: 범위 표현식의 단계 수는 정수여야 합니다
pl_pl: Liczba kroku wyrażenia zakresu powinna być liczbą całkowitą
pt_br: O número de etapas da expressão de faixa deve ser um número inteiro
ru_ru: Число шагов в выражении диапазона должно быть целым числом
zh_cn: 范围表达式的步长数应为整数
zh_tw: 範圍表示式的步長號碼應為整數

# kRangeExpressionWithStepSizeZero
source: The step size of range expression should not be 0
cs_cz: Velikost kroku výraz rozsahu by neměla být 0.
de_de: Die Schrittgröße des Bereichsausdrucks darf nicht 0 sein.
es_es: El tamaño de paso de expresión de rango no debe ser 0
fr_fr: La taille de pas d'une expression d'intervalle ne doit pas être 0
it_it: La dimensione di incremento dell'espressione di intervallo non può essere 0
ja_jp: 範囲式のステップ サイズを 0 にすることはできません
ko_kr: 범위 표현식의 단계 크기는 0이 아니어야 합니다
pl_pl: Rozmiar kroku wyrażenia zakresu powinien być inny niż 0.
pt_br: O tamanho da etapa da expressão da faixa não deve ser 0
ru_ru: Значение шага в выражении диапазона не должно быть равно 0.
zh_cn: 范围表达式的步长不应为 0
zh_tw: 範圍表示式的步長大小不應為 0

# kReturnTypeUndefined
source: Return type '{0}' of method '{1}()' is not defined
cs_cz: Návratový typ „{0}“ metody „{1}()“ není definován.
de_de: Rückgabetyp '{0}' von Methode '{1}()' ist nicht definiert.
es_es: El tipo de retorno '{0}' de método '{1}()' no está definido
fr_fr: Le type de retour '{0}' de la méthode '{1}()' n'est pas défini
it_it: Tipo di restituzione '{0}' del metodo '{1}()' non definito
ja_jp: メソッド '{1}()' の戻り値のタイプ '{0}' が設定されていません
ko_kr: '{1}()' 방법의 반환 유형 '{0}'이(가) 정의되지 않았습니다
pl_pl: Typ zwrotny '{0}' metody '{1}()' nie jest zdefiniowany
pt_br: O tipo de retorno '{0}' do método '{1}() ' não está definido
ru_ru: Возвращаемый тип '{0}' метода '{1}()' не определен
zh_cn: 方法函数 '{1}()' 的返回类型 '{0}' 未定义
zh_tw: 未定義方法 '{1}()' 的返回類型 '{0}'

# kStaticMethodNotFound
source: Cannot find static method or constructor {0}.{1}()
cs_cz: Nelze nalézt statickou metodu nebo konstruktor {0}.{1}().
de_de: Statische Methode oder Konstruktor {0}.{1}() nicht gefunden
es_es: No se puede encontrar constructor o método estático {0}.{1}()
fr_fr: Impossible de trouver la méthode ou le constructeur statique {0}.{1}()
it_it: Impossibile trovare il metodo statico o il costruttore {0}.{1}()
ja_jp: 静的メソッドまたはコンストラクタ {0}.{1}() が見つかりません
ko_kr: 정적 방법 또는 생성자 {0}.{1}()을(를) 찾을 수 없습니다
pl_pl: Nie można znaleźć metody statycznej lub konstruktora. {0}.{1}()
pt_br: Não é possível localizar o método estático ou o construtor. {0}{1}()
ru_ru: Не удалось найти статический метод или конструктор {0}.{1}()
zh_cn: 找不到静态方法函数或构造函数 {0}.{1}()
zh_tw: 找不到靜態方法或建構函式 {0}.{1}()

# kStringIndexingCannotBeAssigned
source: String indexing cannot be assigned to, it is read only
cs_cz: Nelze přiřadit indexování řetězce, položka je pouze ke čtení.
de_de: Zuweisung zu Zeichenfolgenindizierung nicht möglich, da schreibgeschützt
es_es: No se puede asignar indexación de cadenas, es de solo lectura
fr_fr: L'indexation de chaîne ne peut pas être affectée, car elle est en lecture seule
it_it: L'indicizzazione della stringa non può essere assegnata poiché è di sola lettura
ja_jp: 文字列インデックスを割り当てることはできません。読み込み専用です
ko_kr: 문자열 인덱싱을 지정할 수 없습니다. 읽기 전용입니다
pl_pl: Indeksowanie ciągu nie może być przypisane, jest przeznaczone tylko do odczytu
pt_br: A sequência de caracteres de indexação pode ser atribuída, ela é de somente leitura
ru_ru: Индекс строки нельзя назначить — он предназначен только для чтения
zh_cn: 不能给字符串索引赋值，因为其为只读
zh_tw: 無法指定字串檢索，它是唯讀的

# kStringIndexOutOfRange
source: The index to string is out of range
cs_cz: Index řetězce je mimo rozsah
de_de: Der Index für die Zeichenfolge liegt außerhalb des Bereichs.
es_es: El índice en cadena está fuera de rango
fr_fr: L'index dans la chaîne est hors intervalle
it_it: L'indice per la stringa non rientra nell'intervallo
ja_jp: 文字列のインデックスが範囲外です
ko_kr: 문자열에 대한 인덱스가 범위를 벗어났습니다
pl_pl: Indeks od ciągu jest poza zakresem
pt_br: O índice para a sequência de caracteres está fora da faixa
ru_ru: Индекс для строки находится вне диапазона
zh_cn: 字符串的索引超出范围
zh_tw: 字串的索引超出範圍
