Repository: DynamoDS/Dynamo
Catalog: src/Engine/ProtoCore/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# triquestionmark_expected
source: ??? expected
cs_cz: očekáváno ???
de_de: ??? erwartet
es_es: se esperaba ???
fr_fr: ??? attendu
it_it: ??? previsto
ja_jp: ??? が必要です
ko_kr: ??? 예상됨
pl_pl: oczekiwano ???
pt_br: ??? esperado
ru_ru: Ожидается ???
zh_cn: 应输入 ???
zh_tw: 預期 ???

source: "try" expected
cs_cz: očekávaná hodnota „try“
de_de: "try" erwartet
es_es: se esperaba "try"
fr_fr: "try" attendu
it_it: "try" previsto
ja_jp: "try" が必要です
ko_kr: "try" 예상됨
pl_pl: oczekiwano "spróbuj"
pt_br: "testar" esperado
ru_ru: Ожидается «try»
zh_cn: 应输入“try”
zh_tw: 預期 "try"

# kInvalidType
source: The type is invalid
cs_cz: Typ není platný.
de_de: Der Typ ist ungültig.
es_es: El tipo de datos no es válido
fr_fr: Le type est incorrect
it_it: Tipo non valido
ja_jp: タイプが無効です
ko_kr: 유형이 유효하지 않습니다.
pl_pl: Typ jest nieprawidłowy
pt_br: O tipo é inválido
ru_ru: Недопустимый тип
zh_cn: 类型无效
zh_tw: 類型無效

# AlgorithmNotSupported
source: Selected algorithm not supported
cs_cz: Vybraný algoritmus není podporován.
de_de: Ausgewählter Algorithmus wird nicht unterstützt
es_es: No se admite el algoritmo seleccionado
fr_fr: L'algorithme sélectionné n'est pas pris en charge
it_it: L'algoritmo selezionato non è supportato.
ja_jp: 選択したアルゴリズムはサポートされていません
ko_kr: 선택한 알고리즘은 지원되지 않습니다
pl_pl: Wybrany algorytm nie jest obsługiwany
pt_br: O algoritmo selecionado não é suportado
ru_ru: Выбранный алгоритм не поддерживается
zh_cn: 选定的算法不受支持
zh_tw: 不支援選取的演算法

# ArrayWithNotSupported
source: Array with no common superclass not yet supported: {0}
cs_cz: Pole bez společné supertřídy není dosud podporováno: {0}
de_de: Array ohne gemeinsame Superklasse wird noch nicht unterstützt: {0}
es_es: Todavía no se admite una matriz sin una superclase común: {0}
fr_fr: Réseau sans superclasse commune pas encore pris en charge: {0}
it_it: La matrice senza superclasse comune non è ancora supportata: {0}
ja_jp: 共通のスーパークラスを持たない配列はまだサポートされていません。{0}
ko_kr: 공통 수퍼클래스가 없는 배열은 아직 지원되지 않습니다. {0}
pl_pl: Szyk bez wspólnej klasy nadrzędnej nie jest jeszcze obsługiwany: {0}
pt_br: Uma matriz com nenhuma SuperClass comum ainda não é suportada: {0}
ru_ru: Массив без общих суперклассов в данной версии не поддерживается: {0}
zh_cn: 尚不支持没有公共超级类的数组: {0}
zh_tw: 尚未支援沒有一般超類別的陣列: {0}

# FailedToResolveSortingFunction
source: Failed to resolve the comparison function for sorting, expected def sorter : int(x,y)
cs_cz: Nepodařilo se vyhodnotit srovnávací funkci ke třídění. Očekávané řazení definic: int(x,y)
de_de: Vergleichsfunktion für Sortierung konnte nicht aufgelöst werden, erwartete Def-Sortierung: int(x,y)
es_es: No se ha podido resolver la función de comparación de ordenación. Ordenador pred. esperado : int(x,y)
fr_fr: Impossible de résoudre la fonction de comparaison pour le tri, tri des définitions attendu: int(x,y)
it_it: Impossibile risolvere la funzione di confronto per l'ordinamento, gestore def previsto : int(x,y)
ja_jp: 並べ替えの比較関数の解決に失敗しました。def ソータが必要です: int(x,y)
ko_kr: 정렬에 대해 비교 기능을 해결할 수 없습니다. 예상 정의 정렬기: int(x,y)
pl_pl: Nie udało się rozwiązać funkcji porównania dla sortowania, oczekiwane narzędzie sortowania definicji: int(x,y)
pt_br: Falha ao solucionar a função de comparação para classificar, esperado a definição do classificador: int(x,y)
ru_ru: Не удалось выполнить функцию сравнения для сортировки. Ожидаемый сортировщик DEF: int(x,y)
zh_cn: 无法解析比较功能进行排序，需要定义排序器: int(x,y)
zh_tw: 無法解析比較功能進行排序，預期定義排序器: int(x,y)

# FunctionDispatchFailed
source: Function dispatch could not be completed {0}
cs_cz: Výjimku funkce nebylo možné dokončit: {0}
de_de: Funktion-Dispatch konnte nicht abgeschlossen werden {0}
es_es: No se ha podido completar el envío de la función {0}
fr_fr: La fonction de distribution n'a pas pu être terminée {0}
it_it: Impossibile completare l'invio della funzione {0}
ja_jp: 関数ディスパッチを完了できませんでした {0}
ko_kr: 함수 디스패치를 완료할 수 없습니다 {0}
pl_pl: Nie można wykonać wysyłania funkcji {0}
pt_br: A função de envio não pôde ser completada {0}
ru_ru: Невозможно завершить отправку функции {0}
zh_cn: 函数调用无法完成 {0}
zh_tw: 函數分派無法完成 {0}

# MaxDimensionExceeded
source: Replication requested exceeds the available dimensions of the array. This case is not yet supported {0}
cs_cz: Požadovaná replikace přesahuje dostupné rozměry pole. Tento případ není ještě podporován – {0}
de_de: Die angeforderte Replikation überschreitet die verfügbaren Dimensionen des Arrays. Dieser Fall wird noch nicht unterstützt {0}.
es_es: La replicación solicitada supera las dimensiones disponibles de la matriz. Todavía no se admite este caso {0}
fr_fr: La réplication demandée dépasse les dimensions du réseau. Ce cas n'est pas encore pris en charge {0}
it_it: La replica richiesta supera le dimensioni disponibili della matrice. Questo caso non è ancora supportato {0}
ja_jp: 必要な複製の数が配列で使用可能な寸法を超えています。このようなケースはまだサポートされていません {0}
ko_kr: 요청된 복제가 이용 가능한 배열 차원을 초과합니다. 이 경우에는 아직 지원되지 않습니다. {0}
pl_pl: Żądana replikacja przekracza dostępne wymiary szyku. Ten przypadek nie jest jeszcze obsługiwany {0}
pt_br: A replicação solicitada excede as dimensões disponíveis da matriz. Este caso ainda não é suportado {0}
ru_ru: Запрошенная репликация превышает доступные размеры массива. В данной версии этот случай не поддерживается {0}
zh_cn: 复制要求超出数组可用维数。本例尚不受支持 {0}
zh_tw: 要求的複製超出陣列的可用標註。尚未支援這種情況 {0}

# MultipleFunctionsFound
source: Couldn't decide which function to execute. Please provide more specific type information. Possible functions were:
cs_cz: Nebylo možné rozhodnout, která funkce má být provedena. Zadejte konkrétní informace o typu. Mezi možné funkce patří následující položky:
de_de: Die auszuführende Funktion konnte nicht ermittelt werden. Bitte geben Sie genauere Informationen zum Typ ein. Mögliche Funktionen:
es_es: No se ha podido decidir qué función ejecutar. Proporcione información de tipo más específica. Las posibles funciones son:
fr_fr: Impossible de déterminer quelle fonction exécuter. Veuillez fournir des informations plus spécifiques sur le type. Les fonctions possibles sont:
it_it: Impossibile stabilire quale funzione eseguire. Fornire informazioni più specifiche sul tipo. Le funzioni possibili sono:
ja_jp: 実行する関数を決定できませんでした。より具体的なタイプ情報を指定してください。使用可能な関数:
ko_kr: 실행할 기능을 결정할 수 없습니다. 더 구체적인 유형 정보를 제공해 주십시오. 가능한 함수는 다음과 같습니다.
pl_pl: Nie można zdecydować, którą funkcję wykonać. Podaj bardziej szczegółowe informacje o typie. Możliwe funkcje:
pt_br: Não foi possível decidir qual função executar. Forneça informações mais específicas. As funções possíveis eram:
ru_ru: Не удалось определить функцию для выполнения. Укажите больше данных. Возможные функции:
zh_cn: 无法确定要执行的功能。请提供更多特定类型信息。可能的功能有:
zh_tw: 無法決定執行哪些功能。請提供更多的特定類型資訊。 可能的功能為:

# MultipleGuidesNotSupported
source: Sorry, multiple guides on a single argument that are not in increasing order are not yet supported, please use a for loop instead.
cs_cz: Více vodítek u jednoho argumentu, které nejsou ve vzestupném pořadí, není ještě podporováno. Použijte smyčku.
de_de: Mehrere Anleitungen für dasselbe Argument, die nicht in aufsteigender Reihenfolge angegeben wurden, werden noch nicht unterstützt. Verwenden Sie stattdessen eine For-Schleife.
es_es: Todavía no se admite el uso de varias guías en un solo argumento cuando no están en orden creciente. Utilice un bucle en su lugar
fr_fr: Désolé, plusieurs guides ne sont pas encore pris en charge sur un seul argument s'ils ne sont pas en ordre croissant. Veuillez utiliser une boucle à la place.
it_it: L'utilizzo di più guide per un singolo argomento in ordine non crescente non è ancora supportato. In alternativa, utilizzare un ciclo for.
ja_jp: 1 つの引数における、昇順になっていない複数のガイドはまだサポートされていません。代わりに for ループを使用してください。
ko_kr: 죄송합니다. 오름차순이 아닌 단일 인수의 여러 가이드가 아직 지원되지 않습니다. 대신 루프를 사용하십시오.
pl_pl: Niestety, funkcja wielu prowadnic na jednym argumencie, które nie są w porządku rosnącym, nie jest jeszcze obsługiwana, zamiast tego należy użyć pętli.
pt_br: Ainda não são suportadas várias guias em um único argumento que não estejam em ordem ascendente, use uma para o contorno.
ru_ru: К сожалению, в данный момент поддержка несколько инструкций для одного аргумента, представленных не в порядке увеличения, не реализована. Используйте вместо этого функцию повтора.
zh_cn: 很抱歉，不支持非升序排列的单个参数的多个导向，请改用 for 循环。
zh_tw: 抱歉，尚未支援單一引數上不是升序的多個指南，請改用迴路。

# OneDArrayExpected
source: Both arguments were expected to be one-dimensional array type!
cs_cz: Typ obou argumentů měl původně být jednorozměrné pole.
de_de: Für beide Argumente wurden eindimensionsale Arrays erwartet.
es_es: Se esperaba que ambos argumentos fueran de tipo de matriz de una dimensión
fr_fr: Les deux arguments devaient correspondre à un type de réseau unidimensionnel.
it_it: Per entrambi gli argomenti era previsto il tipo matrice unidimensionale.
ja_jp: 両方の引数は 1 次元配列である必要があります!
ko_kr: 두 인수 모두 1차원 배열 유형인 것으로 예상되었습니다!
pl_pl: Oba argumenty powinny być typu jednowymiarowy szyk!
pt_br: Esperava-se que ambos os argumentos fossem tipo de matriz unidimensional!
ru_ru: Оба аргумента должны относиться к типу одномерного массива!
zh_cn: 两个参数应该是一维数组类型！
zh_tw: 預期兩個引數成為一維陣列類型!

# OperationFailType1
source: {0}.{1} operation failed.
cs_cz: {0}.{1} – Operace se nezdařila.
de_de: {0}.{1} fehlgeschlagen.
es_es: Error en la operación {0}.{1}.
fr_fr: Échec de l'opération {0}.{1}.
it_it: Operazione {0}.{1} non riuscita.
ja_jp: {0}{1} 操作に失敗しました。
ko_kr: {0}.{1} 작업이 실패했습니다.
pl_pl: {0}.{1} operacja nie powiodła się.
pt_br: Falha na operação do {0}.{1}.
ru_ru: Операция {0}.{1} не выполнена.
zh_cn: {0}.{1} 操作失败。
zh_tw: {0}.{1} 作業失敗。

# OperationFailType2
source: {0}.{1} operation failed. {2}
cs_cz: {0}.{1} – Operace se nezdařila. {2}
de_de: {0}.{1} fehlgeschlagen. {2}
es_es: Error en la operación {0}.{1}. {2}
fr_fr: Échec de l'opération {0}.{1}. {2}
it_it: Operazione {0}.{1} non riuscita. {2}
ja_jp: {0}{1} 操作に失敗しました。 {2}
ko_kr: {0}.{1} 작업이 실패했습니다. {2}
pl_pl: {0}.{1} operacja nie powiodła się. {2}
pt_br: Falha na operação do {0}.{1}. {2}
ru_ru: Операция {0}.{1} не выполнена. {2}
zh_cn: {0}.{1} 操作失败。 {2}
zh_tw: {0}.{1} 作業失敗。 {2}

# ZipAlgorithmError
source: Cannot support Longest and shortest zipped collections
cs_cz: Nelze podporovat nejdelší a nejkratší komprimované kolekce.
de_de: Keine Unterstützung für längste und kürzeste komprimierte Sammlungen
es_es: No se admiten las colecciones comprimidas más largas y más cortas
fr_fr: Impossible de prendre en charge des ensembles compressés plus longs et plus courts
it_it: Impossibile supportare le raccolte compresse più lunga e più corta
ja_jp: 最長および最短の圧縮されたコレクションはサポートされません
ko_kr: 압축된 Longest 및 최단 모음을 지원할 수 없습니다
pl_pl: Najdłuższe i najkrótsze spakowane kolekcje nie są obsługiwane
pt_br: Não é possível suportar a maior e menor das coleções compactadas
ru_ru: Поддержка самой длинной и самой короткой коллекций невозможно
zh_cn: 不支持最长和最短的压缩集合
zh_tw: 無法支援最長和最短的壓縮集合
