DSCore.CurveMapper.LinearCurve
CurveMapper の線形曲線を表します。
線形曲線は、2 つの制御点を結ぶ直線です。

DSCore.CurveMapper.LinearCurve.LineEquation(System.Double)
X の最小値および最大値の Y 値(キャンバス座標)を計算します

DSCore.CurveMapper.LinearCurve.SolveForXGivenY(System.Double)
Y の最小値および最大値の X 値(キャンバス座標)を計算します

DSCore.CurveMapper.LinearCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
曲線に分布する X 値と Y 値を返します。