DSCore.Properties.Resources
ローカライズされた文字列などを検索するための、厳密に型指定されたリソース クラス。

DSCore.Properties.Resources.ResourceManager
このクラスが使用する、キャッシュされた ResourceManager インスタンスを返します。

DSCore.Properties.Resources.Culture
厳密に型指定されたリソース クラスを使用して、すべてのリソース検索で
現在のスレッドの CurrentUICulture プロパティを変更します。

DSCore.Properties.Resources.BitmapOverflowError
「指定されたカラー データは大きすぎるため、イメージの境界に収まりません」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.CurveMapperEqualMinMaxWarning
「• 最小値と最大値は異なる値である必要があります。」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.CurveMapperInvalidCountWarning
「• 値は数値のリストまたは ≥ 2 の単一の数値である必要があります。」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.CurveMapperInvalidCurveWarning
「• 選択した曲線の制御点が無効です。」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.CurveMapperInvalidXYFormatWarning
「• X と Y の入力値は(リストではなく)単一の数値である必要があります。」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.DefineDataSupportedInputValueExceptionMessage
「入力は単一の値またはネストされていないリストである必要があります」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.DefineDataUnexpectedInputExceptionMessage
「このノードは {0} 入力を要求しましたが、{1} 入力を受け取りました。必要な入力を提供するか、ノードのドロップダウン メニューで新しい型を選択してください」に類似するローカライズされた文字列を検索しま’す。

DSCore.Properties.Resources.DefineDataUnsupportedCombinationOfDataTypesExceptionMessage
「このノードは、現在の入力リスト {0} 内のデータ タイプの組み合わせをサポートしていません。入力リストに同じデータ タイプの項目が含まれるようにするか、共通の親タイプを持つ型の組み合わせになるようにしてください」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.DefineDataUnsupportedDataTypeExceptionMessage
「このノードは現在の入力データ タイプ({0})をサポートしていません。ドロップダウン メニューでサポートされているデータ タイプを確認してください」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.EnumDateOfWeekFriday
「金曜日」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.EnumDateOfWeekMonday
「月曜日」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.EnumDateOfWeekSaturday
「土曜日」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.EnumDateOfWeekSunday
「日曜日」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.EnumDateOfWeekThursday
「木曜日」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.EnumDateOfWeekTuesday
「火曜日」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.EnumDateOfWeekWednesday
「水曜日」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.Exception_Deserialize_Bad_Format
「タイプ {0} の JSON の形式が正しくありません。」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.Exception_Deserialize_Unsupported_Cache
「格納されたデータをロードできません。」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.Exception_Serialize_Depth_Unsupported
「深さ {0} がパス "{2}" の MaxDepth {1} を超えています」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.Exception_Serialize_DesignScript_Unsupported
「このタイプのジオメトリはシリアル化できません。」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.Exception_Serialize_Unsupported_Type
「タイプ {0} のデータを格納できません。」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.ExportToCSVObsolete
「代わりに Data.ExportCSV ノードを使用」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.FactorialNegativeInt
「Math.Factorial に負の値を入力することはできません」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.FactorialOverflow
「Math.Factorial の戻り値が範囲外です」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.FindPointsWithinRadiusNullPointMessage
「中心点を指定する必要があります。」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.FindPointsWithinRadiusSearchRadiusMessage
「検索半径の値をゼロにすることはできません。」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.FromObjectObsolete
「このノードは使用されなくなりました。"String from Object" を使用してください」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.IntegerOverflow
「演算の結果、整数オーバーフローが発生しました。予期しない結果になる可能性があります。」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.InvalidDestinationPathErrorMessage
「コピー パスとして使用されたコピー先のファイル パスが無効です。」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.InvalidKeysErrorMessage
「1 つまたは複数の入力タイプが一致しません。リストをキーとして使用することはできません。」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.InvalidKeysLenghtErrorMessage
「項目数がキーの数に一致しません。href=InvalidKeysLenghtErrorMessage.html」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.LoadImageFromPathObsolete
「代わりに File.FromPath ->  Image.ReadFromFile ノードを使用します」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.MissingPythonEngine
「選択した Python エンジンは見つかりませんでした」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.ObjectArgumentExceptionMessage
「オブジェクトを NULL にできません。適切な値を指定してください。」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.QuadtreeConstructionEmptyUVSetMessage
「空の点のセットからはクアッドツリーを作成できません。」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.QuadtreeConstructionNullUVSetMessage
「UV の NULL セットから Quadtree を作成することはできません。」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.ReadImageObsolete
「代わりに File.FromPath ->  Image.ReadFromFile ->  Image.Pixels ノードを使用します」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.ReadTextObsolete
「代わりに File.FromPath ->  File.ReadText ノードを使用します。」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.StringRemoveCountOutOfRangeMessage
「Count が範囲外です。」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.StringRemoveStartIndexOutOfRangeMessage
「startIndex が範囲外です。」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.StringToNumberInvalidNumberMessage
「有効な数値ではありません。」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.WebRequestNullUrlMessage
「URL を null にすることはできません。」に類似するローカライズされた文字列を検索します。

DSCore.Properties.Resources.WriteImageObsolete
「代わりに Image.WriteToFile ノードを使用します」に類似するローカライズされた文字列を検索します。