DSCore.Data.DataNodeDynamoType
Dynamo でサポートされる DataType を表すクラス

DSCore.Data.DataNodeDynamoType.#ctor(System.Type,System.String,System.String)
Dynamo でサポートされる DataType を表すクラス

DSCore.Data.DataNodeDynamoType.Type
基本のタイプ

DSCore.Data.DataNodeDynamoType.Name
タイプ名を上書きする任意の名前(「長整数型」ではなく「数字」)

DSCore.Data.DataNodeDynamoType.TypeId
ワイヤ形式の $typeid (例: "autodesk.math:point3d-1.0.0")。
$typeid シリアル化を使用しないプリミティブ タイプの場合は null。

DSCore.Data.DataNodeDynamoType.Level
UI に表示される階層レベル

DSCore.Data.DataNodeDynamoType.IsLastChild
タイプが階層の最後の子である場合(UI 用)

DSCore.Data.DataNodeDynamoType.Parent
タイプの親(ある場合)