DSCore.IO.FileSystem
ファイルを操作するためのメソッド。

DSCore.IO.FileSystem.AbsolutePath(System.String,System.String)
指定したパスの絶対パスを返します。 指定したパスが
相対パスである場合は、現在のワークスペースに基づいて
パスを解決します。ファイルが相対パスではなく指定した
hintPath に存在する場合は、その hintPath を返します。
path: 相対パスまたは絶対パス
hintPath: 最後に解決されたパス
Returns: 絶対パス

DSCore.IO.FileSystem.FileFromPath(System.String)
指定したファイル パスからファイル オブジェクトを作成します。

DSCore.IO.FileSystem.ReadText(System.IO.FileInfo)
テキスト ファイルを読み込み、コンテンツを文字列として返します。
file: テキストの読み込み元のファイル オブジェクト
テキスト ファイルの内容。
read file,text,file

DSCore.IO.FileSystem.MoveFile(System.String,System.String,System.Boolean)
新しい場所に指定したファイルを移動します
path: 既存のパスの文字列表現
newPath: 新しいパスの文字列表現
overwrite: 既存のファイルを上書きするかどうかを切り替え
ノードはタスクを実行しますが、出力は生成しません

DSCore.IO.FileSystem.DeleteFile(System.String)
指定したファイルを削除します。
path: 削除するファイル パス
ノードはタスクを実行しますが、出力は生成しません

DSCore.IO.FileSystem.CopyFile(System.IO.FileInfo,System.String,System.Boolean)
ファイルをコピーします。
file: コピーするファイル オブジェクト
destinationPath: コピー先ファイル パスの文字列表現
overwrite: 既存のファイルを上書きするかどうかを切り替え
ノードはタスクを実行し、コピー アクション成功の True を返します。

DSCore.IO.FileSystem.FileExists(System.String)
指定したパスにファイルが存在するかどうかを判断します。
path: ファイル パスを表す文字列
ファイルが存在する場合は true、存在しない場合は false
filepath

DSCore.IO.FileSystem.WriteText(System.String,System.String)
パスで指定されたファイルに文字コンテンツを書き込みます
filePath: 書き込み先のパス
text: 文字コンテンツ
出力なし
write file,text,file,filepath

DSCore.IO.FileSystem.AppendText(System.String,System.String)
パスで指定されたファイルに文字コンテンツを追加します
filePath: 書き込み先のパス
text: 文字コンテンツ
ノードはタスクを実行しますが、出力は生成しません
append file,write file,text,file,filepath

DSCore.IO.FileSystem.CombinePath(System.String[])
複数の文字列を 1 つのファイル パスに組み合わせます。
strings: 組み合わせてパスにする文字列
組み合わされたファイル パス

DSCore.IO.FileSystem.FileExtension(System.String)
ファイル パスの拡張子を返します。
path: 拡張子を取得するパス
ファイルの拡張子

DSCore.IO.FileSystem.ChangePathExtension(System.String,System.String)
ファイル パスの拡張子を変更します。
path: 拡張子を変更するパス
newExtension: 新しい拡張子の文字列表現
拡張子が変更されたファイル パス

DSCore.IO.FileSystem.DirectoryName(System.String)
ファイル パスのフォルダ名を返します。
path: フォルダ情報を取得するパス
ファイル パスのフォルダ名
directorypath

DSCore.IO.FileSystem.FileName(System.String,System.Boolean)
ファイル パスのファイル名を返します。
path: ファイル名を取得するパス
withExtension: 結果に拡張子を含めるかどうかを切り替え
ファイル パスから取得されたファイル名

DSCore.IO.FileSystem.FileHasExtension(System.String)
ファイル パスに拡張子が含まれているかどうかを判断します。
path: 拡張子があるか確認するパス
ファイル パスに拡張子が含まれている場合は true、含まれていない場合は false

DSCore.IO.FileSystem.GetDirectoryContents(System.IO.DirectoryInfo,System.String,System.Boolean)
指定したフォルダ内に含まれるファイルとフォルダのリストを返します。オプションの searchString を使用すると、結果をフィルタできます。
directory: コンテンツを取得するフォルダ
searchString: 結果をフィルタするために使用される検索文字列
includeSubdirectories: サブフォルダ内のファイルとフォルダを含める(再帰的)には true に設定し、指定したフォルダの最上位レベルの結果のみを含める場合は false に設定します。
クエリーの結果のファイル
クエリーの結果のフォルダ

DSCore.IO.FileSystem.CopyDirectory(System.IO.DirectoryInfo,System.String,System.Boolean)
目的の場所にフォルダをコピーします。
directory: コピーするフォルダ
destinationPath: ディスク上のコピー先
overwriteFiles: 既存のフォルダを上書きするかどうかを切り替え
ノードはタスクを実行しますが、出力は生成しません

DSCore.IO.FileSystem.DeleteDirectory(System.String,System.Boolean)
フォルダを削除します。
path: ディスク上のフォルダへのパス
recursive: フォルダのコンテンツをすべて削除するかどうか。既定は false です。
ノードはタスクを実行しますが、出力は生成しません

DSCore.IO.FileSystem.DirectoryExists(System.String)
指定したパスにフォルダが存在するかどうかを判断します。
path: ディスク上のフォルダへのパス
フォルダが存在する場合は true、存在しない場合は false
directorypath

DSCore.IO.FileSystem.MoveDirectory(System.String,System.String,System.Boolean)
新しい場所にフォルダを移動します。
path: 既存のパスの文字列表現
newPath: 新しいパスの文字列表現
overwriteFiles: 既存のファイルを上書きするかどうかを切り替え
ノードはタスクを実行しますが、出力は生成しません