DSCore.List
リストを作成および操作するメソッド。

DSCore.List.Empty
空のリストを返します。
空のリスト。
empty list, emptylist,[]

DSCore.List.UniqueItems(System.Collections.IList)
指定したリスト内のすべてのユニークな項目を含む新しいリストを作成します。
list: 重複をフィルタして除外するリスト。
フィルタされたリスト。
removes,duplicates,remove duplicates,cull duplicates,distinct,listcontains

DSCore.List.Contains(System.Collections.IList,System.Object)
指定のリストに指定の項目が含まれているかどうかを判断します。この関数では、指定のリストに含まれているすべてのサブリストが検索されます。
list: 検索対象のリスト
item: 検索する項目
リストに項目が含まれている場合は true、含まれていない場合は false
item,search,in,listcontains

DSCore.List.IsHomogeneous(System.Collections.IList)
リスト内の項目のタイプが同じであるかどうかを確認します。
list: 均一であるかどうかを確認するリスト。
リストが均一であるかどうか。
homogeneous,allequal,same,type

DSCore.List.IsRectangular(System.Collections.IList)
リスト内のすべての行に含まれている項目の数が同じであるかどうかを確認します。
list: 行に含まれている項目の数が同じであるかどうかを確認するリスト。
リスト内のすべての行に含まれている項目の数が同じであるかどうか。
rectangular,isrectangular,same,sublist,row

DSCore.List.IsUniformDepth(System.Collections.IList)
リスト内の項目の深さが一致しているかどうかを確認します。
list: 項目の深さが一致しているかどうかを確認するリスト。
リスト内の項目の深さが一致しているかどうか。
depth,uniform,isuniformdepth,sublist,jagged

DSCore.List.SetDifference(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
リスト 1 のオブジェクトを格納し、リスト 2 のオブジェクトを除外する新しいリストを返します。
list1: 新しいリストに格納するオブジェクトが含まれているリスト
list2: 新しいリストから除外するオブジェクトが含まれているリスト
リスト 1 のオブジェクトが含まれ、リスト 2 のオブジェクトは含まれていない新しいリスト
difference,setdifference,set

DSCore.List.SetIntersection(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
リスト 1 とリスト 2 の両方に含まれているオブジェクトを格納する新しいリストを返します。
list1: リスト 2 と比較するオブジェクトが含まれているリスト
list2: リスト 1 と比較するオブジェクトが含まれているリスト
リスト 1 とリスト 2 の両方に含まれているオブジェクトが含まれている新しいリスト
intersection,setintersection,set,overlap

DSCore.List.SetUnion(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
リスト 1 とリスト 2 のいずれか一方だけに含まれているオブジェクトを格納する新しいリストを返します。
list1: 格納するオブジェクトが含まれているリスト
list2: リスト 1 に格納するオブジェクトが含まれているリスト
リスト 1 とリスト 2 のいずれか一方にのみ含まれているオブジェクトが含まれている新しいリスト
union,setunion,set

DSCore.List.IndexOf(System.Collections.IList,System.Object)
指定されたリスト内の要素のインデックスを返します。指定されたリストとターゲット要素は正確に一致している必要があります(すなわち、整数と整数、倍精度浮動小数点数と倍精度浮動小数点数、文字列と文字列、オブジェクトとオブジェクトなど)。
list: 検索対象の要素が含まれているリスト。
element: 返されるインデックスを持つ要素。
リスト内の要素のインデックス。正確な一致が見つからない場合は、無効なインデックス -1 を返します。
index,indexof

DSCore.List.CountFalse(System.Collections.IList)
指定されたリストに含まれている false ブール値の数を返します。
list: 検索対象の false ブール値が含まれているリスト。
リストに含まれている false ブール値の数。
false,count

DSCore.List.CountTrue(System.Collections.IList)
指定されたリストに含まれている true ブール値の数を返します。
list: 検索対象の true ブール値が含まれているリスト。
リスト内の true ブール値の数。
true,count

DSCore.List.Insert(System.Collections.IList,System.Object,System.Int32)
指定されたインデックス位置で、リスト内に要素を挿入します。
list: 要素の挿入先となるリスト
element: 挿入する要素
index: リスト内での要素の挿入位置を指定します
要素が挿入されたリスト
insert,add

DSCore.List.Reorder(System.Collections.IList,System.Collections.IList)
指定されたインデックス リストに基づいて、入力リスト内の項目の順序を変更します。
list: 順序を変更する項目が含まれているリスト
indices: リスト内の項目の順序を変更するためのインデックス
項目の順序が変更されたリスト
reorder,index,indices

DSCore.List.SortIndexByValue(System.Collections.Generic.List{System.Double})
リスト内の項目を並べ替え、それらの項目のインデックスを返します。
list: 並べ替える項目が含まれているリスト
リスト内で並べ替えられた項目のインデックス
sort,index,value

DSCore.List.NormalizeDepth(System.Collections.IList,System.Int32)
指定されたランクに従って多次元のリストを返します。
list: ランクに基づいて正規化される深さを持つリスト。
rank: リストを正規化するためのランク。既定値は 1 です。
ランクが正規化されたリスト。
depth,normalize

DSCore.List.Reverse(System.Collections.IList)
指定されたリスト内の項目を逆順で含む新しいリストを作成します。
list: 反転するリスト。
反転されたリスト
flip,listcontains

DSCore.List.__Create(System.Collections.IList)
指定した項目を含む新しいリストを作成します。
items: 新しいリストに格納する項目。

DSCore.List.Sublists(System.Collections.IList,System.Collections.IList,System.Int32)
DesignScript 範囲構文を使用してリストからサブリストを作成します。
list: サブリストの作成元となるリスト。
ranges: サブリストの要素のインデックス範囲。
例: \"{0..3,5,2}\"
offset: サブリストに適用するオフセット。
例: 範囲 \"0..3\"、オフセットが 2 の場合、生成される
サブリストは {0,1,2,3}{2,3,4,5}{4,5,6,7}... となります
タイプ: var[]..[]
sublists,build sublists,subset,

DSCore.List.Sort(System.Collections.Generic.IEnumerable{System.Object})
組み込みの通常の順序を使用してリストを並べ替えます。
list: 並べ替えるリスト
並べ替えられたリスト
sort,order,sorted

DSCore.List.MinimumItem(System.Collections.Generic.IEnumerable{System.Object})
リストの最小値を返します。
list: 最小値の取得元となる、比較可能な項目のリスト
リストの最小項目。
least,smallest,find min

DSCore.List.MaximumItem(System.Collections.Generic.IEnumerable{System.Object})
リストの最大値を返します。
list: 最大値の取得元となる、比較可能な項目のリスト
リストの最大項目。
greatest,largest,biggest,find max

DSCore.List.FilterByBoolMask(System.Collections.IList,System.Collections.IList)
別個のブール値を要素に持つリスト内で対応するインデックスを検索して、
シーケンスをフィルタします。
list: フィルタするリスト。
mask: マスクを表すブール値のリスト。
マスク インデックスが true の項目。
マスク インデックスが false の項目。
filter,in,out,mask,dispatch,bool filter,boolfilter,bool filter

DSCore.List.Deconstruct(System.Collections.IList)
リストの場合、リストに最初の項目を作成し、最初の項目を除くすべての項目を含む
新しいリストが作成されます。
list: 分割するリスト。
リスト内の最初の項目(タイプ: var[]..[])
リストの残りの項目(タイプ: var[]..[])
first,rest,list split,listcontains

DSCore.List.SortByKey(System.Collections.IList,System.Collections.IList)
キーに基づいてリストを並べ替え
list: 並べ替えるリスト
keys: キーのリスト。キーは並べ替え可能である必要があります(たとえば、数値、文字列など)
タイプ: var[]..[]
タイプ: var[]..[]
sort;key

DSCore.List.GroupByKey(System.Collections.IList,System.Collections.IList)
類似のキーの値に基づいて項目をサブリストにグループ化
list: サブリストとしてグループ化する項目のリスト
keys: キーの値。入力リスト内の項目ごとに 1 つ。項目のグループ化に使用
サブリストのリスト。同様のキーの値で項目をグループ化
各グループに対応するキーの値
list;group;groupbykey;

DSCore.List.GroupBySimilarity(System.Collections.IList,System.Double,System.Boolean)
インデックスの隣接関係と値の類似性に基づいてリストの要素をクラスタ化します
list: 隣接関係および類似性に基づいてサブリストとしてグループ化する項目のリスト
tolerance: 類似した項目をグループ化するためのしきい値
considerAdjacency: ノードが隣接関係を考慮するかどうかをコントロールするブール値です。
類似した値でグループ化された項目を含むサブリストのリスト
グループ化された値の元のインデックスを含むサブリストのリスト
list;group;similar;adjacent;adjacency;groupbyadjacency;groupadjacentitems;groupsimilaritems;cluster;tolerance

DSCore.List.LevenshteinDistance(System.String,System.String)
レーベンシュタイン距離は、2 つの文字列間の距離を取得するために使用されるアルゴリズムです
| ソースを参照

DSCore.List.AddItemToFront(System.Object,System.Collections.IList)
リストの先頭に項目を追加します。
item: 追加する項目。 項目にはオブジェクトまたはリストを指定できます。
list: 項目を追加するリスト。
項目を追加したリスト
insert,add,item,front,start,begin

DSCore.List.AddItemToEnd(System.Object,System.Collections.IList)
リストの最後に項目を追加します。
item: 追加する項目。項目にはオブジェクトまたはリストを指定できます。
list: 項目を追加するリスト。
項目を追加したリスト
insert,add,item,end

DSCore.List.TakeItems(System.Collections.IList,System.Int32)
リストの最初から一定の項目を取得します。
list: 項目を取得するリスト。
amount: 取得する項目の数。負の値を指定すると、項目はリストの末尾から取得されます。
抽出された項目のリスト。
get,sub,sublist,extract

DSCore.List.DropItems(System.Collections.IList,System.Int32)
リストの先頭から一定の数だけ項目を削除します。数量が負の値の場合は、
リストの末尾から項目が削除されます。
list: 項目を削除するリスト。
amount: 削除する項目の数です。負の値を指定すると、項目はリストの末尾から削除されます。
残りの項目のリスト。
drop,remove,shorten

DSCore.List.ShiftIndices(System.Collections.IList,System.Int32)
スト内のインデックスを、指定された量だけ右に移動します。
list: 移動するリスト。
amount: インデックスを移動する量。負の値を指定すると、インデックスは左に移動します。
移動したリスト。
shift,offset

DSCore.List.GetItemAtIndex(System.Collections.IList,System.Int32)
リストの、指定されたインデックスにある項目を取得します。
list: 項目を取得するリスト。
index: 取得する項目のインデックス。
リスト内の特定のインデックスの項目。
get,item,index,fetch,at,getfrom,get from,extract

DSCore.List.ReplaceItemAtIndex(System.Collections.IList,System.Int32,System.Object)
リストの、指定されたインデックスにある項目を置き換えます。
list: 項目を置換するリスト。
index: 置換する項目のインデックス。
item: 挿入する項目。
項目を置き換えた新しいリスト。
replace,switch

DSCore.List.ReplaceItemAtIndices(System.Collections.IList,System.Collections.Generic.IList{System.Int32},System.Object)
リストの、指定されたインデックスにある項目を置き換えます。
list: 項目を置換するリスト。
indices: 置換する項目のインデックス。
item: 挿入する項目。
項目を置き換えた新しいリスト。
replace,switch

DSCore.List.Slice(System.Collections.IList,System.Nullable{System.Int32},System.Nullable{System.Int32},System.Int32)
指定されたインデックスの開始値、終了値、ステップ値に基づいて、リストから
単一のサブリストを返します。
list: スライスを実行するリスト。
start: スライスを開始する位置のインデックス。
end: スライスを終了する位置のインデックス。
step: 元のリストで項目のインデックスが分割される単位。
指定したリストのスライス内の項目。
list,sub,sublist,subrange,get sublist

DSCore.List.RemoveItemAtIndex(System.Collections.IList,System.Int32[])
指定したインデックスで特定のリストから項目を削除します。
list: 項目を削除するリスト。
indices: 削除する項目のインデックス。
項目を削除したリスト。
index,indices,cull,remove,item

DSCore.List.DropEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
指定されたオフセットの後、指定された値の倍数である
インデックスの項目を、指定されたリストから削除します。
list: 項目を削除するリスト。
n: この引数の倍数であるインデックスは削除されます。
offset: リストの最初から無視する項目の数。
項目を削除したリスト。
nth,remove,cull,every

DSCore.List.TakeEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
指定されたオフセットの後、指定された値の倍数である
インデックスの項目を、指定されたリストから取得します。
list: 項目を取得するリスト。
n: この数の倍数であるインデックスが(オフセット後に)
取得されます。
offset: リストの最初から無視する項目の数。
リストからの項目。
fetch,take,every,nth

DSCore.List.IsEmpty(System.Collections.IList)
指定したリストが空かどうかを判断します。
list: 空かどうかを確認するリスト
リストが空の場合は true、違う場合は false
test,is,empty,null,count

DSCore.List.AllTrue(System.Collections.IList)
指定されたリスト内のすべての項目が true ブール値になっているかどうかを判断します。
list: すべての項目が true になっているかどうかを確認するリスト。
リストのすべての項目が true の場合は true、true ではない項目が 1 つ以上ある場合は false
test,all,true,istrue

DSCore.List.AllFalse(System.Collections.IList)
指定されたリスト内のすべての項目が false ブール値になっているかどうかを判断します。
list: すべての項目が false になっているかどうかを確認するリスト。
リストのすべての項目が false の場合は true、false ではない項目が 1 つ以上ある場合は false
test,all,false,isfalse

DSCore.List.AnyTrue(System.Collections.IList)
指定されたリスト内に true ブール値となっている項目があるかどうかを判断します。
list: true になっている項目があるかどうかを確認するリスト。
true になっている項目があるかどうか。
test,any,true,istrue

DSCore.List.AnyFalse(System.Collections.IList)
指定されたリスト内に false ブール値となっている項目があるかどうかを判断します。
list: false になっている項目があるかどうかを確認するリスト。
false になっている項目があるかどうか。
test,any,false,isfalse

DSCore.List.Count(System.Collections.IList)
定されたリストに格納されている項目の数を返します。
list: 項目の数を取得するリスト。
リストの長さ。
listlength,list length,count,size,sizeof

DSCore.List.Join(System.Collections.IList[])
指定したすべてのリストを 1 つのリストに連結します。
lists: 1 つのリストに結合するリスト。
結合されたリスト。
join lists,merge,concatenate

DSCore.List.FirstItem(System.Collections.IList)
リスト内の最初の項目を返します。
list: 最初の項目を取得するリスト。
リスト内の最初の項目。
get,fetch,first,item,start

DSCore.List.RestOfItems(System.Collections.IList)
特定のリストの最初の項目を削除します。
list: 残りの項目を取得するリスト。
リストの残りの項目。
get,fetch,rest,end,rest of list

DSCore.List.Chop(System.Collections.IList,System.Collections.Generic.List{System.Int32})
指定した長さで一連の連続したサブリストにリストを分割します。リストの分割はリストの一番上から開始されます。
list: サブリストに分割するリスト
lengths: 入力リストから作成する連続したサブリストの長さ
リストから作成したサブリスト
sublists,build sublists,slices,partitions,cut,listcontains,chop

DSCore.List.DiagonalRight(System.Collections.IList,System.Int32)
マトリックスの各対角線に沿って左下から右上に要素をリスト化します。
list: フラット リスト
subLength: 個々の新しいサブリストの長さ。
マトリックスの対角線に沿った要素のリスト。
diagonal,right,matrix,get diagonals,diagonal sublists

DSCore.List.DiagonalLeft(System.Collections.IList,System.Int32)
マトリックスの各対角線に沿って左上から右下に要素をリスト化します。
list: フラット リスト。
rowLength: 新しい各サブリストの長さ。
マトリックスの対角線に沿った要素のリスト。
diagonal,left,matrix,get diagonals,diagonal sublists

DSCore.List.Transpose(System.Collections.IList)
リストのリストの行と列を入れ替えます。
他の行よりも短い行がある場合は、作成される配列が
常に長方形になるように、プレースホルダーとして
NULL 値が挿入されます。
lists: 転置するリストのリスト
転置されたリストのリスト
transpose,flip matrix,matrix,swap,rows,columns

DSCore.List.Clean(System.Collections.IList,System.Boolean)
任意の次元の特定のリストから NULL のデータや空のリストを取り除きます
list: 取り除く NULL や空のサブリストを含むリスト
preserveIndices: 末尾以外の NULL がフィルタで除外されないように
転置されたリストのリスト
データのインデックスを保持するオプションを提供します
Returns: NULL や空のリストを取り除いたリスト

DSCore.List.OfRepeatedItem(System.Object,System.Int32)
指定した項目を指定した回数含むリストを作成します。
item: 繰り返す項目。
amount: 繰り返す回数。
繰り返された項目のリスト。
repeat,repeated,duplicate,list of item,fill list,copies,listcontains

DSCore.List.Cycle(System.Collections.IList,System.Int32)
指定したリストのコピーを連結して新しいリストを作成します。
list: 繰り返すリスト。
amount: 繰り返しの回数。
繰り返されたリストのリスト(タイプ: var[]..[])
repeat,repeated,duplicate,repeated list,concat list

DSCore.List.LastItem(System.Collections.IList)
リスト内の最後の項目を取得します。
list: 最後の項目を取得するリスト
リスト内の最後の項目
get,fetch,last,item,end of list

DSCore.List.Shuffle(System.Collections.IList)
項目の順番をランダムに設定し、リストを並べ替えます。
list: シャッフルするリスト。
ランダム化されたリスト。
random,randomize,shuffle,jitter,randomness

DSCore.List.Shuffle(System.Collections.IList,System.Int32)
項目の順番を初期シード値に基づいてランダムに設定し、リストを並べ替えます。
list: シャッフルするリスト。
seed: ランダム数ジェネレータのシード値。
ランダム化されたリスト。
random,randomize,shuffle,jitter,randomness,seed

DSCore.List.Permutations(System.Collections.IList,System.Nullable{System.Int32})
指定したリストの指定した長さのすべての順列を生成します。
list: 順番を変えるリスト。
length: 各順列の長さ。
指定した長さのリストの順列(タイプ: var[]..[])
permutation,permutations

DSCore.List.Combinations(System.Collections.IList,System.Int32,System.Boolean)
指定したリストの指定した長さのすべての組み合わせを生成します。
list: 組み合わせを生成するリスト
length: 各組み合わせの長さ
replace: 組み合わせに選択した項目を削除するかどうか。既定は false です。
特定の長さのリストの組み合わせ
combo

DSCore.List.FirstIndexOf(System.Collections.IList,System.Object)
項目を指定し、リストに最初に出現した項目のゼロから始まるインデックス
を返します。リスト内に項目がない場合は、-1 を返します。
list: 検索対象のリスト。この引数が NULL の場合、-1 が返されます。
item: 検索する項目。
Returns: リスト内の項目のゼロから始まるインデックス。項目が見つからない場合は -1。

DSCore.List.AllIndicesOf(System.Collections.IList,System.Object)
項目を指定し、リストに出現するすべての項目のゼロから始まるインデックス
を返します。リスト内に項目がない場合は、空のリストを返します。
list: 検索対象のリスト。この引数が NULL の場合、空のリストが返されます。
item: 検索する項目。
項目があった場合は、見つかったすべての項目のゼロから始まる
インデックスのリスト。項目がリストにない場合は空のリスト。

DSCore.List.Flatten(System.Collections.IList,System.Int32)
ネストされたリストのリストを、指定された量だけフラットにします。
list: フラットにするリスト。
amount: 削除するリストのネストのレイヤ(-1 でリストのネストをすべて削除)
量を指定してフラットにされたリスト
flatten,completely

DSCore.List.IndexInList(System.Collections.IList,System.Object)
IList.Contains は、対象の項目が配列である場合に、Enumerable.SequenceEqual を使用して
その項目がリストに含まれているかどうかを確認します。これとは別の方法で対象の項目を検索し、
見つかった場合はその項目のインデックスを返し、見つからなかった場合は -1 を返します。
list: 対象の項目が含まれているかどうかを確認するリスト。
item: 検索対象の項目。
リスト内の項目のインデックス。

DSCore.List.GetDepth(System.Object)
指定されたリストの最大の深さを取得します。
list: 深さの取得元となる入力リスト。
指定されたリストの深さ。

DSCore.List.CountBool(System.Collections.IList,System.Boolean)
対象となるリスト内で指定されたブール値の数を返します。
list: 検索対象のブール値が含まれているリスト。
value: 検索対象のブール値。
リスト内で指定されているブール値の数。

DSCore.List.IncreaseDepth(System.Collections.IList,System.Int32)
指定された値を使用して、対象となるリストの深さの値を大きくします。対象となるリストを
格納する新しいリストを作成することにより、深さの値が大きくなります。
list: 深さの値を大きくするリスト。
amt: 現在の深さの値を大きくするための値。
指定された値によって深さの値が大きくなった新しいリスト。

DSCore.List.DoubleConverter(System.Object)
整数を double に変換し、その他の場合は入力オブジェクトを返します。