DSCore.CurveMapper.BezierCurve
CurveMapper のベジェ曲線を表します。
ベジェ曲線は 4 つの制御点で定義され、スムーズな補間を実現します。

DSCore.CurveMapper.BezierCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
割り当てられたパラメータと範囲に基づいて、補間された Y 値を取得します。