DSCore.ColorRange1D.ByColorsAndParameters(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double})
色とパラメータのリストを指定して ColorRange1D を作成します。
colors: 色のリスト。
parameters: 0.0 と 1.0 の間のパラメータのリスト。
Returns: ColorRange1D オブジェクト。

DSCore.ColorRange1D.GetColorAtParameter(DSCore.ColorRange1D,System.Double)
指定したパラメータでこの色域内の色を返します。
parameter: 0.0 と 1.0 の間の値。
Returns: 色。

DSCore.ColorRange1D.Default
既定のカラースキームを使用して ColorRange1D を作成します。