DSCore.String
文字列を管理するためのメソッド。

DSCore.String.ToNumber(System.String)
文字列を整数または倍精度浮動小数点数に変換します。
string: 変換する文字列
整数または Double 型の数値
2number,str2number,strtonumber,string2number,stringtonumber,int,double,cast

DSCore.String.GetNumber(System.String)
ターゲット文字列からすべての数値文字列を文字列として取得します
string: 取得するターゲット文字列
文字列としての数値
getnumber,tonumber,strtonumber,numberinstring,string2number,stringtonumber,int,double,cast

DSCore.String.Concat(System.String[])
複数の文字列を 1 つの文字列に連結します。
strings: 連結する文字列のリスト。
文字列のリストから作成した文字列。
concatenate,join,combine strings

DSCore.String.Length(System.String)
指定した文字列に含まれる文字の数を返します。
string: 長さを調べる文字列
文字列内の文字の数
count,size,characters,chars,length,sizeof

DSCore.String.Split(System.String,System.String[])
1 つの文字列を文字列のリストに分割します。
指定の区切り文字によって分割場所が決定されます。
string: 分割する文字列
separators: 分割の終了と開始を指定する文字列。
入力文字列から作成した文字列のリスト
divide,separator,delimiter,cut,csv,comma,

DSCore.String.Join(System.String,System.String[])
複数の文字列を 1 つの文字列に連結し、結合されるそれぞれの
文字列の間に区切り文字を挿入します。
separator: 結合した文字列の間に挿入する文字列。
strings: 単一の文字列に結合する文字。
列区切り文字を含む文字列のリストから作成した文字列。
join,separator,build csv,concat,construct

DSCore.String.ToUpper(System.String)
指定した文字列をすべて大文字に変換します。
string: 大文字に変換する文字列
大文字の文字列
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.ToLower(System.String)
指定した文字列をすべて小文字に変換します。
string: 小文字に変換する文字列
小文字の文字列
2lowercase,to lowercase,tolowercase,lowercase

DSCore.String.ToTitle(System.String)
指定した文字列の頭文字のみ大文字に変換します。
str: 頭文字のみを大文字にする文字列
頭文字のみが大文字の文字列
2titlecase,to titlecase,to title case,totitlecase,titlecase

DSCore.String.ChangeCase(System.String,System.Boolean)
指定した文字列を、ブール パラメータに基づいて、すべて大文字
またはすべて小文字に変換します。
string: 大文字または小文字に変換する文字列。
upper: true の場合は大文字に変換し、false の場合は小文字に変換します。
大文字/小文字に変換した文字列。
2lowercase,to lowercase,tolowercase,lowercase,
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.Substring(System.String,System.Int32,System.Int32)
指定した文字列からサブストリングを取得します。サブストリングは指定した文字位置
から始まり、指定した長さを持ちます。
string: サブストリングを取得する文字列
startIndex: 元の文字列内のサブストリングの開始文字の位置
length: サブストリング内の文字の数
元の文字列から作成されたサブストリング
subset,get string,part,smaller string

DSCore.String.Contains(System.String,System.String,System.Boolean)
指定された文字列に、指定されたサブストリングが含まれているかどうかを判断します。
string: 検索対象の文字列
searchFor: 検索するサブストリング
ignoreCase: 比較で大文字と小文字の区別を考慮するかどうか
文字列がサブストリングを含むかどうか
test,within,in,is in,part of

DSCore.String.CountOccurrences(System.String,System.String,System.Boolean)
指定した文字列内での重複しないサブストリングの出現回数をカウントします。
string: 検索対象の文字列
searchFor: 検索するサブストリング
ignoreCase: 比較で大文字と小文字の区別を考慮するかどうか
文字列内のサブストリングの重複なしの出現数
count,substring,count occurrences,numberof,search,find,within

DSCore.String.Replace(System.String,System.String,System.String)
文字列内に出現するすべての文字を別の文字に置き換えます。
string: サブストリングを置き換える文字列。
searchFor: 置き換えられる文字。
replaceWith: 置き換える文字。
置き換えを行った文字列。
replace,overwrite,override,find and replace

DSCore.String.EndsWith(System.String,System.String,System.Boolean)
指定した文字列が指定したサブストリングで終わるかどうかを判断します。
string: 末尾が検索対象となる文字列
searchFor: 末尾を検索するサブストリング
ignoreCase: 比較で大文字と小文字の区別を無視する場合は true、考慮する場合は false
文字列がサブストリングで終わっている場合は true、違う場合は false
test,does end,last,str end,terminated

DSCore.String.StartsWith(System.String,System.String,System.Boolean)
指定した文字列が指定したサブストリングで始まるかどうかを判断します。
string: 先頭が検索対象となる文字列
searchFor: 先頭を検索するサブストリング。
ignoreCase: 比較で大文字と小文字の区別を無視する場合は true、考慮する場合は false
文字列がサブストリングで始まっている場合は true、違う場合は false
test,beginswith,start,string start,front

DSCore.String.TrimWhitespace(System.String)
指定した文字列の先頭と末尾の空白スペースをすべて削除します。
string: トリムする文字列。
先頭と末尾の空白スペースを削除した文字列。
trimstring,cleanstring,whitespace,blanks,spaces,string trim

DSCore.String.TrimLeadingWhitespace(System.String)
指定した文字列の先頭の空白スペースをすべて削除します。
string: トリムする文字列。
先頭の空白スペースを削除した文字列。
trim string,clean string,trim leading whitespaces,string trim

DSCore.String.TrimTrailingWhitespace(System.String)
指定した文字列の末尾の空白スペースをすべて削除します。
string: トリムする文字列。
末尾の空白スペースを削除した文字列。
trim string,clean string,trim trailing whitespaces,string trim

DSCore.String.IndexOf(System.String,System.String,System.Boolean)
文字列内のサブストリングの最初の出現のゼロから始まるインデックスを求めます。
インデックスが見つからない場合は -1 を返します。
string: 検索対象の文字列
searchFor: 検索するサブストリング
ignoreCase: 比較で大文字と小文字の区別を考慮するかどうか
最初に出現したサブストリングのインデックス。見つからない場合は -1
index of,find substring,where,search

DSCore.String.AllIndicesOf(System.String,System.String,System.Boolean)
文字列内でサブストリングが表示されるインデックスのリストを検索します。
string: 検索する文字列。
searchFor: 検索するサブストリング。
ignoreCase: 比較で大文字、小文字の区別を考慮するかどうか。
サブストリングが見つかったインデックスのリスト(タイプ: int[])
all indices of,find substring,where,search

DSCore.String.LastIndexOf(System.String,System.String,System.Boolean)
文字列内のサブストリングの最後の出現のゼロから始まるインデックスを求めます。
インデックスが見つからない場合は -1 を返します。
string: 検索対象の文字列。
searchFor: 検索するサブストリング。
ignoreCase: 比較で大文字、小文字の区別を考慮するかどうか。
最後に出現したサブストリングのインデックス。見つからない場合は -1。
last index of,find substring,where,search

DSCore.String.PadLeft(System.String,System.Int32,System.String)
指定した合計長さになるように、左側にスペースを追加して、指定した文字列の文字を右に
位置合わせします。
string: スペースを追加する文字列
newLength: 追加後の文字列の合計長さ
padChars: 追加する文字(既定はスペース)
指定した合計長さになるように空白スペースを追加して右に位置合わせした文字列。
pad left,right align,right-align,pad,string space,whitespace

DSCore.String.PadRight(System.String,System.Int32,System.String)
指定した合計長さになるように、右側にスペースを追加して、指定した文字列の文字を左に
位置合わせします。
string: スペースを追加する文字列
newLength: 追加後の文字列の合計長さ
padChars: 追加する文字(既定はスペース)
指定した合計長さになるように空白スペースを追加して左に位置合わせした文字列
pad right,left align,left-align,pad string space,whitespace

DSCore.String.Center(System.String,System.Int32,System.String)
両側にスペースを追加して元の文字を囲み、文字列の長さを増やします。
string: 中心に配置する文字列
newLength: 中心に位置合わせした後の文字列の合計長さ
padChars: 中心に位置合わせするために追加する文字(既定はスペース)
指定した合計長さになるように先頭と末尾に空白スペースを追加して
中央に位置合わせした文字列。
center align,center-align,centered,whitespace,expand string,surround

DSCore.String.Insert(System.String,System.Int32,System.String)
インデックスを指定し、文字列を別の文字列に挿入します。
string: 挿入する文字列。
index: 挿入位置のインデックス。
toInsert: 挿入する文字列。
サブストリングを挿入した文字列。
insertstring,insert string

DSCore.String.Remove(System.String,System.Int32,System.Nullable{System.Int32})
文字列から文字を削除します。
string: 文字を削除する文字列。
startIndex: 削除を開始するインデックス。
count: 削除する文字数です。
注: Count が負の値である場合、削除の処理は右から左に向かって実行されます。
文字を削除した文字列。
delete,rem,shorten