DSCore.Quadtree.ByUVs(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.UV})
(0,0)->(1,1)ドメインを囲む Quadtree を作成します。
uvs: (0,0)-&gt;(1,1) ドメインの UV のセット。
Returns: Quadtree オブジェクト。

DSCore.Quadtree.FindPointsWithinRadius(Autodesk.DesignScript.Geometry.UV,System.Double)
指定した UV 位置の半径内にあるクアッドツリーのすべてのクアッドツリー ポイント(UV)を見つけます。
center: 検索領域の中心にある UV。
radius: 検索領域の半径。
Returns: UV のリスト。