DSCore.DateTime
特定の日付と時刻を表すオブジェクト。

DSCore.DateTime.MinValue
表現可能な最も古い日付と時刻です。
DateTime 表現として可能な最小値

DSCore.DateTime.MaxValue
表現可能な最新の日付と時刻です。
DateTime 表現として可能な最大値

DSCore.DateTime.Now
現在のシステムの日付と時刻です。
現在の時刻を表現する DateTime

DSCore.DateTime.Today
現在のシステムの日付です。時刻は午前 0 時に設定されます。
今日を表現する DateTime

DSCore.DateTime.Format(System.DateTime,System.String)
指定した日時が、指定した形式の文字列で返されます。
dateTime: 形式設定する DateTime
format: 日付形式の文字列表記。InvariantCulture が使用されるため、ユーザのオペレーティング システムとは出力形式が異なります。
既定では標準形式の「F」が使用され、「2017 年 2 月 21 日(火) 23:02:43」のように出力されます。
すべての形式指定子を一覧表示するには、「MSDN·カスタム日時形式文字列」を検索してください。
文字列で表現された DateTime

DSCore.DateTime.ByDate(System.Int32,System.Int32,System.Int32)
正確な日付で新しい DateTime を作成します。
year: 正確な年(1 ～ 9999)
month: 正確な月(1～12)
day: 正確な日(1～[月の日数])
日付から作成された DateTime

DSCore.DateTime.ByDateAndTime(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
正確な日時で新しい DateTime を作成します。
year: 正確な年(1 ～ 9999)
month: 正確な月(1～12)
day: 正確な日(1～[月の日数])
hour: 正確な時間(0～23)
minute: 正確な分(0 ～ 59)
second: 正確な秒(0 ～ 59)
millisecond: 正確なミリ秒(0～999)
日時から作成された DateTime

DSCore.DateTime.SubtractTimeSpan(System.DateTime,System.TimeSpan)
DateTime から TimeSpan を減算し、新しい DateTime を作成します。
dateTime: 計算前の DateTime
timeSpan: 減算する時間の長さ
減算後の DateTime

DSCore.DateTime.AddTimeSpan(System.DateTime,System.TimeSpan)
TimeSpan を DateTime に加算し、新しい DateTime を作成します。
dateTime: 計算前の DateTime
timeSpan: DateTime に加算する時間の長さ
TimeSpan 加算後の DateTime

DSCore.DateTime.DaysInMonth(System.Int32,System.Int32)
指定した年の指定した月の日数を計算します。
year: 正確な年(1 ～ 9999)
month: 正確な月(1～12)
月の日数

DSCore.DateTime.IsDaylightSavingsTime(System.DateTime)
指定した DateTime が夏時間であるかどうかを判断します。
dateTime: 夏時間であるかどうかの判断に使用される DateTime
DateTime が夏時間の場合は true、違う場合は false

DSCore.DateTime.IsLeapYear(System.Int32)
指定した年がうるう年かどうかを判断します。
year: 正確な年(1 ～ 9999)
うるう年の場合は true、違う場合は false

DSCore.DateTime.FromString(System.String)
文字列から DateTime の解析を試みます
string: DateTime の文字列表現
解析された文字列からの DateTime

DSCore.DateTime.Date(System.DateTime)
DateTime から日付のみを抽出します。Time コンポーネントは 0 (ゼロ)に設定されます。
dateTime: DateTime。
DateTime からの日付
Date

DSCore.DateTime.Components(System.DateTime)
DateTime の個々のコンポーネントを抽出します。
dateTime: コンポーネントの取得元の DateTime
年の数値表現(1 ～ 9999)
月の数値表現(1 ～ 12)
日付の数値表現(1 ～ [月の日数])
時間の数値表現(0 ～ 23)
分の数値表現(0 ～ 59)
秒の数値表現(0 ～ 59)
ミリ秒の数値表現(0 ～ 999)

DSCore.DateTime.DayOfWeek(System.DateTime)
指定した DateTime から曜日を返します。
dateTime: 曜日の取得元の DateTime オブジェクト
曜日

DSCore.DateTime.DayOfYear(System.DateTime)
その年の何日目(0～366)かを返します
dateTime: その年の何日目かを取得する DateTime
その年の初日からの日数

DSCore.DateTime.TimeOfDay(System.DateTime)
指定した DateTime の午前 0 時からの経過時間を表す新しい TimeSpan を生成します。
dateTime: DateTime。
午前 0 時からの TimeSpan