DSCore.Compare
比較メソッド。

DSCore.Compare.GreaterThan(System.Object,System.Object)
a が b より大きい場合に true を返します。
a: 同等のオブジェクト。
b: 同等のオブジェクト。
ブール演算の結果。
larger,bigger

DSCore.Compare.GreaterThanOrEqual(System.Object,System.Object)
a が b 以上の場合に true を返します。
a: 同等のオブジェクト。
b: 同等のオブジェクト。
ブール演算の結果。
larger,bigger,equal

DSCore.Compare.LessThan(System.Object,System.Object)
a が b より小さい場合に true を返します。
a: 同等のオブジェクト。
b: 同等のオブジェクト。
ブール演算の結果。
less,smaller

DSCore.Compare.LessThanOrEqual(System.Object,System.Object)
a が b 以下の場合に true を返します。
a: 同等のオブジェクト。
b: 同等のオブジェクト。
ブール演算の結果。
smaller,equal