DSCore.ColorRange.ByColorsAndParameters(System.Collections.Generic.IList{DSCore.Color},System.Collections.Generic.IList{Autodesk.DesignScript.Geometry.UV})
色と UV のリストを指定して ColorRange を作成します。
colors: 色のリスト。
parameters: パラメータのリスト、(0.0,0.0)～(1.0,1.0)。
Returns: ColorRange オブジェクト。

DSCore.ColorRange.GetColorAtParameter(Autodesk.DesignScript.Geometry.UV)
この色域内から、指定されたパラメータの位置にある色を返します。
parameter: UV、(0.0,0.0)～(1.0,1.0)。
Returns: 色。