DSCore.CurveMapper.SquareRootCurve
CurveMapper の平方根曲線を表します。
この曲線は平方根関数に従い、2 つの制御点の影響を受けます。

DSCore.CurveMapper.SquareRootCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
曲線に分布する X 値と Y 値を返します。