DSCore.TimeSpan
経過した期間を表すオブジェクト。特定の開始日や終了日は持ちません。

DSCore.TimeSpan.ByDateDifference(System.DateTime,System.DateTime)
2 つの DateTime の時間の差から計算した新しい TimeSpan を生成します
dateTime: 減算元の DateTime
otherDateTime: 減算する DateTime
2 つの日付の差を表す TimeSpan

DSCore.TimeSpan.Zero
ゼロの経過時間を表す TimeSpan。
ゼロの経過時間を表す TimeSpan

DSCore.TimeSpan.MaxValue
表現可能な最長 TimeSpan。
TimeSpan 表現として可能な最長値

DSCore.TimeSpan.MinValue
表現可能な最短 TimeSpan。
TimeSpan 表現として可能な最短値

DSCore.TimeSpan.Create(System.Double,System.Double,System.Double,System.Double,System.Double)
時間の範囲から新しい TimeSpan を作成します。
days: 日の範囲。
hours: 時間の範囲。
minutes: 分の範囲。
seconds: 秒の範囲。
milliseconds: ミリ秒の範囲。
作成された TimeSpan

DSCore.TimeSpan.Scale(System.TimeSpan,System.Double)
TimeSpan をスケール係数で乗算します
timeSpan: 乗算する TimeSpan
scaleFactor: TimeSpan のスケールを変更する量。たとえば、スケール係数を 2 に設定すると、
時間の範囲が 2 倍になります。
TimeSpan の積

DSCore.TimeSpan.Negate(System.TimeSpan)
TimeSpan を反転します
timeSpan: 反転する TimeSpan
負の TimeSpan

DSCore.TimeSpan.Add(System.TimeSpan,System.TimeSpan)
2 つの TimeSpan を加算します
timeSpan1: 加算する TimeSpan
timeSpan2: 加算するもう一方の TimeSpan
加算後の TimeSpan

DSCore.TimeSpan.Subtract(System.TimeSpan,System.TimeSpan)
2 つの TimeSpan を減算します
timeSpan1: 減算元の TimeSpan
timeSpan2: 減算する TimeSpan
減算後の TimeSpan

DSCore.TimeSpan.FromString(System.String)
文字列から TimeSpan の解析を試みます
string: TimeSpan の文字列表現。
解析された文字列からの TimeSpan

DSCore.TimeSpan.Components(System.TimeSpan)
TimeSpan の個々のコンポーネントを抽出します。
timeSpan: コンポーネントの取得元の TimeSpan
日数(整数型)
時間数(整数型)
分数(ふんすう、整数型)
秒数(整数型)
ミリ秒数(整数型)

DSCore.TimeSpan.TotalDays(System.TimeSpan)
TimeSpan で表される合計時間をおおよその日数に
変換します。
timeSpan: 合計日数のクエリーを実行する TimeSpan
合計日数

DSCore.TimeSpan.TotalHours(System.TimeSpan)
TimeSpan で表される合計時間をおおよその時間数に
変換します。
timeSpan: 合計時間のクエリーを実行する TimeSpan
合計時間

DSCore.TimeSpan.TotalMinutes(System.TimeSpan)
TimeSpan で表される合計時間をおおよその分数(ふんすう)に
変換します。
timeSpan: 合計分数(ふんすう)のクエリーを実行する TimeSpan
合計分数(ふんすう)

DSCore.TimeSpan.TotalSeconds(System.TimeSpan)
TimeSpan で表される合計時間をおおよその秒数に
変換します。
timeSpan: 合計秒数のクエリーを実行する TimeSpan
合計秒数

DSCore.TimeSpan.TotalMilliseconds(System.TimeSpan)
TimeSpan で表される合計時間をおおよそのミリ秒数に
変換します。
timeSpan: 合計ミリ秒数のクエリーを実行する TimeSpan
合計ミリ秒数