DSCore.CurveMapper.PowerCurve
CurveMapper の指数関数曲線を表します。
この曲線は、制御点から導出された指数方程式によって定義されます。

DSCore.CurveMapper.PowerCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
曲線に分布する X 値と Y 値を返します。