DSCore.Color.Red
色の赤色成分の値(0 ～ 255)を取得します。
RGB カラー モデルの赤色成分の値、整数、0 以上 255 以下。

DSCore.Color.Green
色の緑色成分の値(0 ～ 255)を取得します。
RGB カラー モデルの緑色成分の値、整数、0 以上 255 以下。

DSCore.Color.Blue
色の青色成分の値(0 ～ 255)を取得します。
RGB カラー モデルの青色成分の値、整数、0 以上 255 以下。

DSCore.Color.Alpha
色のアルファ成分の値(0 ～ 255)を取得します。
アルファ成分の値、整数、0 以上 255 以下。

DSCore.Color.ByARGB(System.Int32,System.Int32,System.Int32,System.Int32)
アルファ、赤、緑、青の各成分から色を作成します。
alpha: アルファ成分の値(0 以上 255 以下)
red: RGB カラー モデルの赤色成分の値(0 以上 255 以下)
green: RGB カラー モデルの緑色成分の値(0 以上 255 以下)
blue: RGB カラー モデルの青色成分の値(0 以上 255 以下)
ARGB から作成された色
color

DSCore.Color.Brightness(DSCore.Color)
色の明度の値を返します。
color: 明度のクエリーを実行する色
明度の値(0 以上 1 以下)

DSCore.Color.Saturation(DSCore.Color)
色の彩度の値を返します。
彩度の値、倍精度浮動小数点数、0 以上 1 以下。

DSCore.Color.Hue(DSCore.Color)
色の色相の値を返します。
color: カラー オブジェクト
色の色相値、倍精度浮動小数点数、0 以上 1 以下。
hues

DSCore.Color.Components(DSCore.Color)
色の各成分を、アルファ、赤、緑、青の順のリストとして返します。
color: カラー オブジェクト
アルファ成分の値、整数、0 以上 255 以下。
RGB カラー モデルの赤色成分の値、整数、0 以上 255 以下。
RGB カラー モデルの緑色成分の値、整数、0 以上 255 以下。
RGB カラー モデルの青色成分の値、整数、0 以上 255 以下。
alpha,red,green,blue

DSCore.Color.BuildColorFrom1DRange(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double},System.Double)
開始色と終了色間の色のグラデーションから色を取得します。
parameters: 色をサンプリングするの範囲に沿った 0 から 1 の間の値。
指定した色域内の色。
color,range,gradient

DSCore.Color.Lerp(DSCore.Color,DSCore.Color,System.Double)
2 つの色を線形的に補間します。
start: 開始色。
end: 終了色。
t: 0.0 と 1.0 の間のパラメータ。
Returns: 補間された色または白。

DSCore.Color.Blerp(System.Collections.Generic.IList{DSCore.Color.IndexedColor2D},Autodesk.DesignScript.Geometry.UV)
一連の色の間のバイリニア補完。
Returns: 補間された色または白。
This algorithm is not the same as the solution found from wikipedia
(reference: https://en.wikipedia.org/wiki/Bilinear_interpolation)

DSCore.Color.Add(DSCore.Color,DSCore.Color)
2 つの既存の色の ARGB 値を組み合わせて 1 つの色を作成します。
color: 追加する色
otherColor: 追加するもう一方の色
2 つの色の追加による色の結果

DSCore.Color.Multiply(DSCore.Color,System.Double)
入力された色を数値の乗数で乗算し、より暗い色を作成します。入力される色のアルファ成分の値は 255 未満でなければなりません。
color: 乗算する色
multiplier: 乗数の値
乗算による色の結果

DSCore.Color.Divide(DSCore.Color,System.Double)
入力された色を数値の除数で除算し、より明るい色を作成して、色の彩度を下げます
color: 除算する色
dividend: 除数の値
除算による色の結果