DSCore.Math
数学的演算を実行するためのメソッド。

DSCore.Math.Random(System.Nullable{System.Int32})
[0, 1)の範囲内のランダムな double 値を生成します。
seed: ランダム数ジェネレータのシード値。
ランダムな数値(0～1)。
random,seed

DSCore.Math.Random(System.Double,System.Double)
範囲[lower_number, higher_number)でランダムな数値を生成します。
value1: ランダムな数値の範囲の下端。
value2: ランダムな数値の範囲の上端。
範囲[lower_number, higher_number)のランダムな数値。
random,numberrange

DSCore.Math.Random(System.Double,System.Double,System.Int32)
初期シード値に基づいて、範囲[lower_number, higher_number)のランダムな数値を生成します。
value1: ランダムな数値の範囲の下端。
value2: ランダムな数値の範囲の上端。
seed: ランダム数ジェネレータのシード値。
範囲[lower_number, higher_number)のランダムな数値。
random,numberrange,seed

DSCore.Math.RandomList(System.Int32)
特定の数量の[0, 1)の範囲のランダムな double 値を含むリストを作成
します。
amount: 結果のリストに含まれるランダムな数値の量。
ランダムな数値(0～1)のリスト。
random,listcontains

DSCore.Math.RandomList(System.Int32,System.Double,System.Double,System.Int32)
初期シード値に基づいて、定義された範囲[lower_number, higher_number)における
特定の数量のランダムな double 値を含むリストを作成します。
amount: 結果のリストに含まれるランダムな数値の量。
value1: ランダムな数値の範囲の下端。
value2: ランダムな数値の範囲の上端。
seed: ランダム数ジェネレータのシード値。
範囲[lower_number, higher_number)のランダムな数値のリスト。
random,listcontains,seed

DSCore.Math.PiTimes2
2 倍した Pi 定数
2 倍の PI です。
2pi,2*pi,twopi,two*pi

DSCore.Math.Average(System.Collections.Generic.IList{System.Double})
数値のリストを平均化します。
numbers: 平均化する数値のリスト。
数値のリストの平均。
avg,mean

DSCore.Math.Map(System.Double,System.Double,System.Double)
入力範囲に基づき、入力値を 0 から 1 までの範囲内の数値にマッピングします。
rangeMin: 入力範囲の最小値。
rangeMax: 入力範囲の最大値。
inputValue: マッピングされる数値。
マッピング後の値。
map,range,minimum,maximum,normalize,scale,remap

DSCore.Math.MapTo(System.Double,System.Double,System.Double,System.Double,System.Double)
入力値を targetRangeMin から targetRangeMax までの範囲内の値にマッピングします。
rangeMin: 入力範囲の最小値。
rangeMax: 入力範囲の最大値。
inputValue: マッピングされる数値。
targetRangeMin: 新しい範囲の最小値。
targetRangeMax: 新しい範囲の最大値。
マッピング後の値。
map,range,mapto,minimum,maximum,normalize,scale,remap

DSCore.Math.RemapRange(System.Collections.Generic.IList{System.Double},System.Double,System.Double)
分配比率を保持しながら数値のリストの範囲を
調整します。
numbers: 範囲を調整するための数値のリスト。
newMin: 範囲の新しい最小値。
newMax: 範囲の新しい最大値
新しい範囲に再マッピングされるリスト。
remap range

DSCore.Math.kRadiansToDegrees
Math.dll から DSCoreNode.dll に関数/メソッドを移動

DSCore.Math.PI
数学上の定数 Pi, 3.14159...
定数 Pi
3.141592653589793

DSCore.Math.E
数学上の定数 e、2.71828...
定数 e
exp,2.718281828459045

DSCore.Math.GoldenRatio
黄金比、(1 + sqrt(5))/2 = 1.61803...
黄金比
golden,ratio,divine,phi,tau,1.61803398875

DSCore.Math.RadiansToDegrees(System.Double)
ラジアン単位の角度を度単位の角度に変換します。
radians: 角度(ラジアン単位)。
角度(度単位)。
radians,degrees,angle

DSCore.Math.DegreesToRadians(System.Double)
度単位の角度をラジアン単位の角度に変換します。
degrees: 角度(度単位)。
角度(ラジアン単位)。
degrees,radians,angle

DSCore.Math.Abs(System.Double)
数値の絶対値を検出します。
number: 絶対値にする数値
数値の絶対値
absolute value,magnitude

DSCore.Math.Equals(System.Double,System.Double,System.Double)
このメソッドは、Equals (許容差と等しい) NodeModel ノードでのみ使用されます。

DSCore.Math.Abs(System.Int64)
数値の絶対値を検出します。
integer: 数値。
数値の絶対値。
absolute value,magnitude

DSCore.Math.Acos(System.Double)
余弦が指定した比率になる角度の、逆余弦を求めます。
ratio: 角度の余弦。[-1, 1]の範囲の数値。
余弦が入力比率となる角度。
acosine,arccosine

DSCore.Math.Asin(System.Double)
正弦が指定した比率になる角度の、逆正弦を求めます。
ratio: 角度の正弦。[-1, 1]の範囲の数値。
正弦が入力比率となる角度
asine,arcsin

DSCore.Math.Atan(System.Double)
正接が指定した比率になる、逆正接を求めます。
ratio: 角度の正接。
正接が入力比率となる角度
atangent,arctangent

DSCore.Math.Atan2(System.Double,System.Double)
2 つの数値の商の逆正接を求めます。比率が分子/分母の正接の角度を
返します。
numerator: 角度の接線の分子。
denominator: 角度の接線の分母。
正接が分子/分母となる角度
atangent,arctangent

DSCore.Math.Ceiling(System.Double)
数値よりも大きい最初の整数を返します
number: 切り上げる数値。
数値よりも大きい最初の整数
ceiling,round

DSCore.Math.Cos(System.Double)
角度の余弦を求めます。
angle: 余弦を取得する角度(度単位)。
角度の余弦
cosine

DSCore.Math.Cosh(System.Double)
角度(ラジアン単位)の双曲線余弦を求めます。
angle: 角度(ラジアン単位)。
角度の双曲線余弦
hyperbolic cosine

DSCore.Math.DivRem(System.Int64,System.Int64)
被除数を除数で割って、その余りを求めます。
dividend: 被除数(割られる数値)。
divisor: 除数(割る数値)。
除算の余り
remainder

DSCore.Math.EvaluateFormula(System.String,System.String[],System.Object[])
指定されたパラメータ マッピングで NCalc 式を評価します。
formulaString: NCalc 式
parameters: 変数名
arguments: 変数のバインド
タイプ: var[]..[] (計算式の結果)

DSCore.Math.Exp(System.Double)
数値の指数を返します。値の数値に累乗する定数 e です。
number: 数値。
数値の指数。
exponential

DSCore.Math.Floor(System.Double)
数値よりも小さい最初の整数を返します。
number: 切り捨てる数値
数値よりも小さい最初の整数
round

DSCore.Math.Log(System.Double)
範囲(0, ∞)内の数の自然対数を求めます。
number: 0 より大きな数値。
数値の自然対数。
natural,logarithm,ln

DSCore.Math.Log(System.Double,System.Double)
指定した底で数値の対数を求めます。
number: 0 より大きな数値。
logBase: 範囲 [0,1),(1, ∞) の対数の底。
数値の対数。
logarithm,ld,lg

DSCore.Math.Log10(System.Double)
数値の 10 を底とする対数を求めます。
number: 0 より大きな数値。
数値の対数。
logarithm

DSCore.Math.Max(System.Double,System.Double)
2 つの数値の大きい方の値を返します。
value1: 比較する数値。
value2: 比較する数値。
2 つの数値のうち大きなもの。
maximum,greater,larger

DSCore.Math.Max(System.Int64,System.Int64)
2 つの数値の大きい方の値を返します。
int1: 比較する数値。
int2: 比較する数値。
2 つの数値のうち大きなもの。
maximum,greater,larger

DSCore.Math.Min(System.Double,System.Double)
2 つの数字のうち小さい方を返します。
value1: 比較する数値。
value2: 比較する数値。
2 つの数値のうち小さなもの。
minimum,lesser,smaller

DSCore.Math.Min(System.Int64,System.Int64)
2 つの数字のうち小さい方を返します。
int1: 比較する数値。
int2: 比較する数値。
2 つの数値のうち小さなもの。
minimum,lesser,smaller

DSCore.Math.Pow(System.Double,System.Double)
指定された指数に対して値を累乗します。
number: 累乗する数値。
power: 数値の累乗。
累乗した数値。
^,power,raise,exponent

DSCore.Math.Rand
範囲[0, 1)でランダムな数値を生成します。
範囲[0, 1]のランダムな数値。
random,numberrange

DSCore.Math.Round(System.Double)
数値を四捨五入して最も近い整数値にします。
このメソッドは、整数型の代わりに倍精度浮動小数点数を返します。
number: 四捨五入する数値。
数値に最も近似している整数値。

DSCore.Math.Round(System.Double,System.Int32)
数値を四捨五入して小数点以下の指定された桁数にします。
number: 四捨五入する数値
digits: 戻り値の小数点以下の桁数
指定された数に等しい小数点以下の桁数を含む値に最も近い数値

DSCore.Math.Sign(System.Double)
数値の符号(-1、0、1)を返します。
number: 符号の取得元の数値
数値の符号(-1、0、1)

DSCore.Math.Sign(System.Int64)
数値の符号(-1、0、1)を返します。
int: 符号の取得元の整数
数値の符号(-1、0、1)

DSCore.Math.Sin(System.Double)
角度の正弦を求めます。
angle: 正弦を取得する角度(度単位)。
角度の正弦。
sine

DSCore.Math.Sinh(System.Double)
角度(ラジアン単位)の双曲線正弦を求めます。
angle: 角度(ラジアン単位)。
角度の双曲線正弦。
hyperbolic

DSCore.Math.Sqrt(System.Double)
範囲[0, ∞)の数値の正の平方根を求めます。
number: [0, ∞)の範囲の数。
数値の正の平方根。
square,root,radical

DSCore.Math.Tan(System.Double)
角度の正接を検索します。
angle: 角度(ラジアン単位)
角度の正接
tangent

DSCore.Math.Tanh(System.Double)
角度(ラジアン単位)の双曲線正接を求めます。
angle: 角度(ラジアン単位)
角度の双曲線正接
hyperbolic,tanh

DSCore.Math.Sum(System.Collections.Generic.IEnumerable{System.Double})
一連の数値の合計を検索
values: 追加して合計する数値
値の合計
mass addition,massadd

DSCore.Math.Factorial(System.Int64)
正の整数の階乗の結果を求めます。
number: 正の整数
整数の階乗の結果。
!

DSCore.Math.Xor(System.Boolean,System.Boolean)
ブール演算 XOR: 入力のいずれか 1 つが true の場合に true を返します。
bool: ブール値
otherBool: もう一方のブール値
ブール演算の結果
xor,exclusive,or

DSCore.Math.DoCheckedCast(System.Double)
チェックされたコンテキストで long 型への変換を行います。演算の結果オーバーフローが発生した場合は、
警告が生成され、オーバーフローした結果が返されます。
value: 実行する演算
Returns: 演算の結果