DSCore.Object
すべてのデータを操作する一般的な関数。

DSCore.Object.IsNull(System.Object)
指定したオブジェクトが null であるかどうかを判断します。
object: テストするオブジェクト。
オブジェクトが null であるかどうか。
is null

DSCore.Object.Identity(System.Object)
渡したものを返します。それ以外の操作は行いません。
object: オブジェクト。
同一オブジェクト

DSCore.Object.Type(System.Object)
文字列として表されるオブジェクトのタイプを返します。
object: タイプをクエリーするオブジェクト
Returns: オブジェクトのタイプ。