DSCore.CurveMapper.ParabolicCurve
CurveMapper の放物曲線を表します。
この曲線は、2 つの制御点に基づく二次方程式に従います。

DSCore.CurveMapper.ParabolicCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
曲線に分布する X 値と Y 値を返します。