DSCore.CurveMapper.PerlinNoiseCurve
CurveMapper のパーリン ノイズ曲線を表します。
この曲線は、制御点とパーリン ノイズ関数に基づいてプロシージャ ノイズを生成します。

DSCore.CurveMapper.PerlinNoiseCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
曲線に分布する X 値と Y 値を返します。