DSCore.IO.Image
イメージのビットマップを操作するためのメソッド。

DSCore.IO.Image.ReadFromFile(System.IO.FileInfo)
ファイルをビットマップとしてロードします。
file: イメージのロード元のファイル オブジェクト
ファイルのイメージ オブジェクト

DSCore.IO.Image.Pixels(System.Drawing.Bitmap,System.Nullable{System.Int32},System.Nullable{System.Int32})
イメージ ファイルを読み込み、指定の通芯位置の色の値を返します。
image: ピクセルの色の取得元のイメージ オブジェクト
xSamples: X 方向のサンプルの通芯の点の数。
ySamples: Y 方向のサンプルの通芯の点の数。
指定した通芯の点の色
read,image,bitmap,png,jpg,jpeg

DSCore.IO.Image.FromPixels(DSCore.Color[][])
ピクセルの 2D リストからイメージを作成します。
colors: ピクセルを表す色の 2 次元の長方形のリスト
ピクセルの 2D リストから作成されたイメージ

DSCore.IO.Image.FromPixels(DSCore.Color[],System.Int32,System.Int32)
ピクセル、幅、高さのフラット リストからイメージを作成します。
colors: ピクセルを表す色のリスト
width: 新しいイメージの幅(ピクセル単位)
height: 新しいイメージの高さ(ピクセル単位)
ピクセルのリストから作成されたイメージ

DSCore.IO.Image.Dimensions(System.Drawing.Bitmap)
画像の幅と高さを返します。
image: 寸法を取得するイメージ。
イメージの幅(ピクセル単位)
イメージの高さ(ピクセル単位)

DSCore.IO.Image.WriteToFile(System.String,System.Drawing.Bitmap)
ファイル名を指定して、イメージをパスに書き込みます。
image: 書き込むイメージ
作成されたイメージ オブジェクト
write image,image,file,filepath