DSCore.CurveMapper.SineWave
CurveMapper の正弦波曲線を表します。
正弦波は 2 つの制御点によって定義され、三角関数に従います。

DSCore.CurveMapper.SineWave.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
曲線に分布する X 値と Y 値を返します。