DSCore.Data.ParseJSON(System.String)
Parse は、任意の JSON 文字列を値に変換します。これは、JSON.Stringify の逆になります。
json: JSON 文字列
結果タイプは、入力文字列のコンテンツに依存します。結果タイプは、プリミティブ値(たとえば、文字列、ブール、倍精度浮動小数点数)、リスト、またはディクショナリにすることができます。

DSCore.Data.ToNative(Newtonsoft.Json.Linq.JToken)
JToken タイプをネイティブ .NET オブジェクトに変換するための実装を解析します。
token: N に解析する JToken

DSCore.Data.DynamoJObjectToNative(Newtonsoft.Json.Linq.JObject)
JObject タイプを特定の Dynamo オブジェクト(ジオメトリ、カラー、イメージなど)に変換するための実装を解析します
Throws System.Exception:

DSCore.Data.StringifyJSON(System.Object)
Stringify は、任意の値または任意の値のリストを JSON に変換します。複製は、リスト上の操作に適用するために使用でき、JSON 文字列のリストを生成します。
values: 値のリスト
JSON 文字列は、プリミティブ型(たとえば、倍精度浮動小数点数、整数、ブール)、リスト、ディクショナリが関連付けられた JSON 型に変換されます。

DSCore.Data.CanObjectBeCached(System.Object)
オブジェクトをキャッシュできるかどうか、またはオブジェクトが null、「null」文字列、空のリストのいずれかであることを判断するヘルパー関数です。
inputObject: 確認するオブジェクト

DSCore.Data.Remember(System.Object,System.String)
Data.Remember ノードのキャッシングを処理する関数です。
inputObject: キャッシュするオブジェクト
cachedJson: オプションの既存キャッシュ JSON

DSCore.Data.DataNodeDynamoTypeList
Dynamo がサポートしているすべてのデータ タイプの静的なリスト
Returns: サポートされているデータ タイプを含むリスト

DSCore.Data.#cctor
静的コンストラクタ

DSCore.Data.SafeExtractDictionaryValue(System.Collections.Generic.Dictionary{System.String,System.Object},System.String)
ディクショナリの値を安全に抽出するためのヘルパー関数
dict: 値を抽出するディクショナリ
key: キー/値ペアのキー

DSCore.Data.EvaluateDefineDataNode(System.Object,System.String,System.Boolean,System.Boolean,System.String)
これは、AST が DefineData ノードを評価するために使用する関数です。
検証の実行中にノード ロジックの一部を処理します
inputValue: 上流の入力値
typeString: 文字列タイプ(Todo: 直接の型比較には 'Type' タイプのオブジェクトを渡す方が良い)
isList: 入力値が `ArrayList` 型の場合
isAutoMode: ノードが自動モードの場合
playerValue: Dynamo プレーヤによってノードに投入される値(ある場合)。

DSCore.Data.FindCommonAncestor(System.Collections.ArrayList)
AutoMode でオブジェクトの ArrayList が渡された場合に、その型を見つけるのに役立つ関数
list: 入力値です。ArrayList 型である必要があります

DSCore.Data.LikelyAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
DataNodeDynamoType ノードのリストから最下位ノードを返すヘルパー関数
nodes: 評価する DataNodeDynamoType のリスト

DSCore.Data.FindClosestCommonAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
データ タイプのリスト内の共通の先祖を特定するためのヘルパー関数
nodes: 評価する DataType ノードのリスト

DSCore.Data.FindCommonAncestorBetweenTwoNodes(DSCore.Data.DataNodeDynamoType,DSCore.Data.DataNodeDynamoType)
2 つの Dynamo タイプ間で共通の先祖を検索する再帰関数です
その先祖が見つかるまで、likelyAncestor の階層ツリーを上に移動します
node: このノードが推定先祖から派生しているかどうかを確認します
likelyAncestor: ノードの派生元である可能性が高い推定先祖

DSCore.Data.GetListFromTypes(System.Collections.ArrayList)
オブジェクトの ArrayList から DataNodeDynamoTypes のリストを返します
list: 再形式化するオブジェクトの ArrayList

DSCore.Data.IsUnusedDefineDataInput(System.Object)
Define Data の入力が未使用(null または空のリスト)かどうかを確認します。
inputValue: グラフからの入力値。
Returns: 入力を未接続または未使用として扱う必要がある場合は true です。

DSCore.Data.IsSingleValueOrSingleLevelArrayList(System.Object)
入力オブジェクトが単一の値または単一レベルの ArrayList かを確認します。
obj: 評価する入力オブジェクトです

DSCore.Data.IsSupportedDataNodeDynamoType(System.Object,System.Type,System.Boolean)
サポートされている Dynamo の入力タイプに対して入力値を検証する関数
inputValue: 検証する入力データ
type: ユーザが指定する入力タイプです。inputValue タイプと一致する必要があります
isList: このブール値は、入力が単一のオブジェクトかリストかを決定します。

DSCore.Data.IsItemOfType(System.Object,System.Type)
この方法は、項目が Dynamo で要求される DataType であるかどうかを確認します。
'IsInstanceOfType' は上位への継承を再帰的に確認します
item: データ タイプをチェックする項目
dataType: 照合する DataType
Returns: チェック検証に基づく真または偽の結果

DSCore.Data.IsDerivedFrom(System.Type,System.Type)
このメソッドは、型が基本型から派生しているかどうかをチェックします
derivedType: アサートする型です
baseType: 比較対象の基本型