DSCore.ObjectComparer
次のルールを使用して 2 つのオブジェクトの Compare 関数を実装します。
1. 数値は最小であると仮定され、次にブール値、文字列、ポインタであると仮定されます。
2. 2 つのオブジェクトが IComparable で同じタイプである場合は、ネイティブの
比較メカニズムを使用します。
3. 両方の入力が値タイプで、どちらかがブール値の場合、ブール値の方が大きくなります
4. どちらもブール値でない場合、すべてを double に変換して比較します。
5. 上記に当てはまらず、1 つのオブジェクトのみが値タイプの場合、値タイプオブジェクトの方が小さくなります
6. 上記に当てはまらず、1 つのオブジェクトのみが文字列の場合、文字列の方が他の値より小さくなります
7. 上記に当てはまらない場合、比較方法を判断できず、ハッシュ値に基づいた比較が最適になります。