DSCore.CurveMapper.GaussianCurve
CurveMapper のガウス曲線を表します。
ガウス曲線は、4 つの制御点で定義される釣鐘型の分布に従います。

DSCore.CurveMapper.GaussianCurve.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
ノードが現在サイズ変更中であり、意図しない制御点の更新を防止しているかどうかを示します。

DSCore.CurveMapper.GaussianCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
曲線に分布する X 値と Y 値を返します。