DSCore.CurveMapper.CurveBase
CurveMapper のすべての曲線タイプのベース クラスを表します。
曲線の値の生成と取得に関する一般的な機能を提供します。

DSCore.CurveMapper.CurveBase.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
曲線の値を生成するための派生クラスによって実装される抽象メソッドです。

DSCore.CurveMapper.CurveBase.GetCurveXValues(System.Collections.Generic.List{System.Double},System.Boolean)
X 値を取得するための一般的な方法です。

DSCore.CurveMapper.CurveBase.GetCurveYValues(System.Collections.Generic.List{System.Double},System.Boolean)
Y 値を取得するための一般的な方法です。

DSCore.CurveMapper.CurveBase.GenerateFromDomain(System.Collections.Generic.List{System.Double},System.Func{System.Double,System.Double})
ドメイン入力をキャンバス空間にマッピングし、曲線関数を評価することで X 値と Y 値を生成します。