Repository: DynamoDS/Dynamo
Catalog: src/Libraries/CoreNodes/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# BitmapOverflowError
source: The supplied color data is too large to fit in the image bounds.
cs_cz: Zadaná data barev jsou příliš velká, aby se vešla do hranic obrázku.
de_de: Die bereitgestellten Farbdaten sind zu groß, um in die Bildumgrenzungen zu passen.
es_es: Los datos de color proporcionados son demasiado grandes para que quepan en los límites de la imagen.
fr_fr: Les données de couleur fournies sont trop grandes pour tenir dans les limites de l'image.
it_it: I dati del colore forniti sono troppo grandi per essere adattati ai limiti dell'immagine.
ja_jp: 指定されたカラー データは大きすぎるため、イメージの境界に収まりません。
ko_kr: 제공된 색상 데이터가 너무 커서 이미지 경계에 맞지 않습니다.
pl_pl: Podane dane kolorów są zbyt duże, aby zmieściły się w granicach obrazu.
pt_br: Os dados de cor fornecidos são muito grandes para caber nos limites da imagem.
ru_ru: Предоставленные данные цвета слишком велики для вписывания в границы изображения.
zh_cn: 提供的颜色数据太大，无法适应图像边界。
zh_tw: 提供的顏色資料太大，無法佈滿影像邊界。

# EnumDateOfWeekFriday
source: Friday
cs_cz: Pátek
de_de: Freitag
es_es: Viernes
fr_fr: Vendredi
it_it: Venerdì
ja_jp: 金曜日
ko_kr: 금요일
pl_pl: Piątek
pt_br: Sexta-feira
ru_ru: Пятница
zh_cn: 星期五
zh_tw: 星期五

# EnumDateOfWeekMonday
source: Monday
cs_cz: Pondělí
de_de: Montag
es_es: Lunes
fr_fr: Lundi
it_it: Lunedì
ja_jp: 月曜日
ko_kr: 월요일
pl_pl: Poniedziałek
pt_br: Segunda-feira
ru_ru: Понедельник
zh_cn: 星期一
zh_tw: 星期一

# EnumDateOfWeekSaturday
source: Saturday
cs_cz: Sobota
de_de: Samstag
es_es: Sábado
fr_fr: Samedi
it_it: Sabato
ja_jp: 土曜日
ko_kr: 토요일
pl_pl: Sobota
pt_br: Sábado
ru_ru: Суббота
zh_cn: 星期六
zh_tw: 星期六

# EnumDateOfWeekSunday
source: Sunday
cs_cz: Neděle
de_de: Sonntag
es_es: Domingo
fr_fr: Dimanche
it_it: Domenica
ja_jp: 日曜日
ko_kr: 일요일
pl_pl: Niedziela
pt_br: Domingo
ru_ru: Воскресенье
zh_cn: 星期日
zh_tw: 星期日

# EnumDateOfWeekThursday
source: Thursday
cs_cz: Čtvrtek
de_de: Donnerstag
es_es: Jueves
fr_fr: Jeudi
it_it: Giovedì
ja_jp: 木曜日
ko_kr: 목요일
pl_pl: Czwartek
pt_br: Quinta-feira
ru_ru: Четверг
zh_cn: 星期四
zh_tw: 星期四

# EnumDateOfWeekTuesday
source: Tuesday
cs_cz: Úterý
de_de: Dienstag
es_es: Martes
fr_fr: Mardi
it_it: Martedì
ja_jp: 火曜日
ko_kr: 화요일
pl_pl: Wtorek
pt_br: Terça-feira
ru_ru: Вторник
zh_cn: 星期二
zh_tw: 星期二

# EnumDateOfWeekWednesday
source: Wednesday
cs_cz: Středa
de_de: Mittwoch
es_es: Miércoles
fr_fr: Mercredi
it_it: Mercoledì
ja_jp: 水曜日
ko_kr: 수요일
pl_pl: Środa
pt_br: Quarta-feira
ru_ru: Среда
zh_cn: 星期三
zh_tw: 星期三

# Exception_Deserialize_Bad_Format
source: The json for the type {0} was not formatted correctly
cs_cz: Json pro typ {0} nebyl správně naformátován.
de_de: JSON-Datei für Typ {0} wurde nicht korrekt formatiert
es_es: El contenido json para el tipo {0} no presenta un formato correcto.
fr_fr: Le fichier JSON pour le type {0} n'a pas été formaté correctement
it_it: json per il tipo {0} non formattato correttamente
ja_jp: タイプ {0} の JSON が正しくフォーマットされませんでした
ko_kr: 유형 {0}에 대한 json 형식이 올바르게 지정되지 않았습니다.
pl_pl: Obiekt json dla typu {0} nie jest poprawnie sformatowany
pt_br: O json para o tipo {0} não foi formatado corretamente
ru_ru: Файл JSON для типа {0} был отформатирован неправильно
zh_cn: {0} 类型的 json 格式设置不正确
zh_tw: 類型 {0} 的 json 格式不正確

# Exception_Deserialize_Unsupported_Cache
source: The stored data can not be loaded.
cs_cz: Uložená data nelze načíst.
de_de: Die gespeicherten Daten können nicht geladen werden.
es_es: No se pueden cargar los datos almacenados.
fr_fr: Les données stockées ne peuvent pas être chargées.
it_it: Impossibile caricare i dati memorizzati.
ja_jp: 格納されたデータをロードできません。
ko_kr: 저장된 데이터를 로드할 수 없습니다.
pl_pl: Nie można wczytać przechowywanych danych.
pt_br: Não é possível carregar os dados armazenados.
ru_ru: Не удается загрузить сохраненные данные.
zh_cn: 无法加载存储的数据。
zh_tw: 無法載入儲存的資料。

# Exception_Serialize_Depth_Unsupported
source: Depth {0} Exceeds MaxDepth {1} at path "{2}"
cs_cz: Hloubka {0} překračuje maximální hloubku {1} v cestě "{2}".
de_de: Tiefe {0} überschreitet MaxDepth {1} bei Pfad "{2}"
es_es: La profundidad {0} supera el valor máximo {1} en la ruta "{2}".
fr_fr: La profondeur {0} dépasse la profondeur maximale {1} au niveau du chemin d'accès "{2}"
it_it: La profondità {0} supera MaxDepth {1} in corrispondenza del percorso {2}".
ja_jp: 深さ {0} がパス "{2}" の MaxDepth {1} を超えています
ko_kr: 경로 "{2}"에서 깊이 {0}이(가) 최대 깊이 {1}을(를) 초과합니다.
pl_pl: Głębokość {0} przekracza wartość MaxDepth {1} w ścieżce „{2}”
pt_br: A profundidade de {0} excede a profundidade máxima de {1} no caminho “{2}”
ru_ru: Глубина {0} превышает максимальную глубину {1} по пути {2}
zh_cn: 深度 {0} 超过路径为“{2}”的最大深度 {1}
zh_tw: 深度 {0} 超過路徑「{2}」的最大深度 {1}

# Exception_Serialize_DesignScript_Unsupported
source: This type of Geometry is not able to be serialized.
cs_cz: Tento typ geometrie nelze serializovat.
de_de: Dieser Geometrietyp kann nicht serialisiert werden.
es_es: No se puede serializar este tipo de geometría.
fr_fr: Ce type de géométrie ne peut pas être sérialisé.
it_it: Impossibile serializzare questo tipo di geometria.
ja_jp: このタイプのジオメトリはシリアル化できません。
ko_kr: 이 유형의 형상은 직렬화할 수 없습니다.
pl_pl: Nie można serializować tego typu geometrii.
pt_br: Esse tipo de geometria não pode ser serializado.
ru_ru: Невозможно сериализовать этот тип геометрии.
zh_cn: 此类几何图形无法序列化。
zh_tw: 此類型的幾何圖形無法序列化。

# Exception_Serialize_Unsupported_Type
source: Cannot store data of type {0}.
cs_cz: Nelze uložit data typu {0}.
de_de: Daten des Typs {0} können nicht gespeichert werden.
es_es: No se pueden almacenar datos del tipo {0}.
fr_fr: Impossible de stocker les données de type {0}.
it_it: Impossibile memorizzare i dati di tipo {0}.
ja_jp: タイプ {0} のデータを格納できません。
ko_kr: {0} 유형의 데이터를 저장할 수 없습니다.
pl_pl: Nie można zapisać danych typu {0}.
pt_br: Não é possível armazenar dados do tipo {0}.
ru_ru: Не удается сохранить данные типа {0}.
zh_cn: 无法存储 {0} 类型的数据。
zh_tw: 無法儲存類型為 {0} 的資料。

# ExportToCSVObsolete
source: Use Data.ExportCSV node instead
cs_cz: Použijte raději uzel Data.ExportCSV.
de_de: Verwenden Sie stattdessen den Block Data.ExportCSV.
es_es: Utilizar el nodo Data.ExportCSV en su lugar
fr_fr: Utiliser le noeud Data.ExportCSV à la place
it_it: Utilizzare invece il nodo Data.ExportCSV
ja_jp: 代わりに Data.ExportCSV ノードを使用
ko_kr: 대신 Data.ExportCSV 노드를 사용하십시오.
pl_pl: Zamiast tego użyj węzła Data.ExportCSV
pt_br: Utilizar o nó Data.ExportCSV
ru_ru: Используйте узел Data.ExportCSV
zh_cn: 而是使用 Data.ExportCSV 节点
zh_tw: 請改用 Data.ExportCSV 節點

# FactorialNegativeInt
source: The input value of Math.Factorial cannot be negative.
cs_cz: Vstupní hodnota funkce Math.Factorial nemůže být záporná.
de_de: Der Eingabewert von Math.Factorial darf nicht negativ sein.
es_es: El valor de entrada de Math.Factorial no puede ser negativo.
fr_fr: La valeur d'entrée de Math.Factorial ne peut pas être négative.
it_it: Il valore di input Math.Factorial non può essere negativo.
ja_jp: Math.Factorial に負の値を入力することはできません。
ko_kr: Math.Factorial의 입력 값은 음수일 수 없습니다.
pl_pl: Wartość danych wejściowych z Math. Factorial nie może być ujemna.
pt_br: O valor de entrada Math.Factorial não pode ser negativo.
ru_ru: Входное значение Math.Factorial не может быть отрицательным.
zh_cn: Math.Factorial 的输入值不能为负。
zh_tw: Math.Factorial 的輸入值不可為負值。

# FactorialOverflow
source: The return value of Math.Factorial is out of range.
cs_cz: Návratová hodnota funkce Math.Factorial je mimo rozsah.
de_de: Der Rückgabewert von Math.Factorial liegt außerhalb des Bereichs.
es_es: El valor de retorno de Math.Factorial está fuera de rango.
fr_fr: La valeur de retour de Math.Factorial est hors intervalle.
it_it: Il valore restituito di Math.Factorial non rientra nell'intervallo.
ja_jp: Math.Factorial の戻り値が範囲外です。
ko_kr: Math.Factorial의 반환 값이 범위를 벗어났습니다.
pl_pl: Zwracana wartość Math. Factorial jest poza zakresem.
pt_br: O valor de retorno de Math.Factorial está fora do intervalo.
ru_ru: Возвращаемое значение Math.Factorial находится вне диапазона.
zh_cn: Math.Factorial 的返回值已超出范围。
zh_tw: Math.Factorial 的傳回值超出範圍。

# FindPointsWithinRadiusNullPointMessage
source: You must provide a center point.
cs_cz: Je nutné zadat střed.
de_de: Sie müssen einen Mittelpunkt angeben.
es_es: Debe proporcionar un centro
fr_fr: Vous devez indiquer un point central.
it_it: È necessario specificare un punto centrale.
ja_jp: 中心点を指定する必要があります。
ko_kr: 중심점을 입력해야 합니다.
pl_pl: Należy podać punkt środkowy.
pt_br: Você deve fornecer um ponto central.
ru_ru: Необходимо указать центральную точку.
zh_cn: 必须提供一个中心点。
zh_tw: 您必須提供一個中心點。

# FindPointsWithinRadiusSearchRadiusMessage
source: The search radius cannot be zero.
cs_cz: Poloměr vyhledávání nemůže být nula.
de_de: Der Suchradius darf nicht null sein.
es_es: El radio de búsqueda no puede ser cero
fr_fr: Le rayon de recherche ne peut pas être égal à zéro.
it_it: Il raggio di ricerca non può essere zero.
ja_jp: 半径検索の値をゼロにすることはできません。
ko_kr: 검색 반지름은 0이 아니어야 합니다.
pl_pl: Promień wyszukiwania nie może być równy zeru.
pt_br: O raio da pesquisa não pode ser zero.
ru_ru: Радиус поиска не может быть равен нулю.
zh_cn: 搜索半径不能为零。
zh_tw: 搜尋半徑不能為零。

# FromObjectObsolete
source: This node is obsolete, please use "String from Object"
cs_cz: Tento uzel je zastaralý. Použijte řetězec String from Object.
de_de: Dieser Block ist veraltet, bitte "String from Object" verwenden.
es_es: Este nodo es obsoleto, utilice "String from Object"
fr_fr: Ce noeud est obsolète, utilisez "String from Object"
it_it: Il nodo è obsoleto, utilizzare "String from Object"
ja_jp: このノードは使用されなくなりました。"String from Object" を使用してください
ko_kr: 사용하지 않는 노드입니다. "String from Object"를 사용하십시오.
pl_pl: Węzeł ten jest przestarzały, należy użyć polecenia „Ciąg z obiektu"
pt_br: Este nó é obsoleto, utilize "String from Object"
ru_ru: Этот узел является устаревшим, используйте "String from Object"
zh_cn: 此节点已过时，请使用“String from Object”
zh_tw: 此為舊型節點，請使用「來自物件的字串」

# IntegerOverflow
source: The operation resulted in an integer overflow. Its result may be unexpected.
cs_cz: Operace vedla k přetečení celého čísla. Její výsledek může být neočekávaný.
de_de: Der Vorgang führte zu einem Ganzzahlüberlauf. Das Ergebnis ist möglicherweise unerwartet.
es_es: La operación ha generado un desbordamiento de número entero. El resultado puede ser inesperado.
fr_fr: L'opération a entraîné un dépassement de l'entier. Son résultat peut être inattendu.
it_it: L'operazione ha generato un overflow dei numeri interi. Il risultato potrebbe essere imprevisto.
ja_jp: 演算の結果、整数オーバーフローが発生しました。予期しない結果になる可能性があります。
ko_kr: 작업으로 인해 정수 오버플로우가 발생했습니다. 그 결과가 예기치 않게 발생할 수 있습니다.
pl_pl: Operacja spowodowała przepełnienie liczby całkowitej. Jej wynik może być nieoczekiwany.
pt_br: A operação resultou em um estouro de número inteiro. O resultado pode ser inesperado.
ru_ru: Операция привела к переполнению целого числа. Результат может быть непредсказуемым.
zh_cn: 该操作导致整数溢出。其结果可能异常。
zh_tw: 作業造成整數溢位。可能會產生非預期的結果。

# InvalidDestinationPathErrorMessage
source: Invalid destination file path used as copy path.
cs_cz: Jako cesta ke kopírování se používá neplatná cesta k cílovému souboru.
de_de: Ungültiger Zieldateipfad als Kopierpfad verwendet.
es_es: Ruta de archivo de destino no válida utilizada como ruta de copia.
fr_fr: Chemin d'accès au fichier de destination incorrect utilisé comme chemin de copie.
it_it: Percorso del file di destinazione non valido utilizzato come percorso di copia.
ja_jp: コピー パスとして使用されたコピー先のファイル パスが無効です。
ko_kr: 복사 경로로 사용된 대상 파일 경로가 잘못되었습니다.
pl_pl: Jako ścieżki kopii użyto niewłaściwej ścieżki pliku docelowego.
pt_br: Caminho de arquivo de destino inválido usado como caminho de cópia.
ru_ru: В качестве пути для копирования используется недопустимый путь к конечному файлу.
zh_cn: 用作复制路径的目标文件路径无效。
zh_tw: 用作複製路徑的目標檔案路徑無效。

# InvalidKeysErrorMessage
source: One or more input types are not matching. Lists as keys are not supported.
cs_cz: Jeden nebo více vstupních typů se neshoduje. Seznamy klíčů nejsou podporovány.
de_de: Ein oder mehrere Eingabetypen stimmen nicht überein. Listen werden nicht als Schlüssel unterstützt.
es_es: Uno o más tipos de entrada no coinciden. No se admiten listas como claves.
fr_fr: Un ou plusieurs types d'entrées ne correspondent pas. Les listes sous forme de clés ne sont pas prises en charge.
it_it: Uno o più tipi di input non corrispondenti. L'utilizzo di elenchi come chiavi non è supportato.
ja_jp: 1 つまたは複数の入力タイプが一致しません。リストをキーとして使用することはできません。
ko_kr: 하나 이상의 입력 유형이 일치하지 않습니다. 키로 나열한 리스트는 지원되지 않습니다.
pl_pl: Brak zgodności jednego typu danych wejściowych lub większej ich liczby. Listy jako klucze nie są obsługiwane.
pt_br: Um ou mais tipos de entrada não são coincidentes. Listas como chaves não são suportadas.
ru_ru: Один или несколько типов ввода не совпадают. Списки ключей не поддерживаются.
zh_cn: 一个或多个输入类型不匹配。用列表作关键字不受支持。
zh_tw: 一個或多個輸入類型不相符。列示為「關鍵字」不受支援。

# InvalidKeysLenghtErrorMessage
source: Number of items does not match the number of keys. href=InvalidKeysLenghtErrorMessage.html
cs_cz: Počet položek se neshoduje s počtem klíčů. href=InvalidKeysLenghtErrorMessage.html
de_de: Anzahl der Elemente stimmt nicht mit der Anzahl der Schlüssel überein. href=InvalidKeysLenghtErrorMessage.html
es_es: El número de elementos no coincide con el número de claves. href=InvalidKeysLenghtErrorMessage.html
fr_fr: Le nombre d'éléments ne correspond pas au nombre de clés. href=InvalidKeysLenghtErrorMessage.html
it_it: Il numero di elementi non corrisponde al numero di chiavi. href=InvalidKeysLenghtErrorMessage.html
ja_jp: 項目数がキーの数に一致しません。href=InvalidKeysLenghtErrorMessage.html
ko_kr: 항목 수가 키 수와 일치하지 않습니다. href=InvalidKeysLenghtErrorMessage.html
pl_pl: Liczba elementów nie odpowiada liczbie kluczy. href=InvalidKeysLenghtErrorMessage.html
pt_br: O número de itens não coincide com o número de chaves. href=InvalidKeysLenghtErrorMessage.html
ru_ru: Количество элементов не соответствует количеству ключей. href=InvalidKeysLenghtErrorMessage.html
zh_cn: 项目数与关键字数不匹配。href=InvalidKeysLenghtErrorMessage.html
zh_tw: 項目數目與鍵的數目不相符。href=InvalidKeysLenghtErrorMessage.html

# LoadImageFromPathObsolete
source: Use File.FromPath -> Image.ReadFromFile nodes instead
cs_cz: Raději použijte uzly File.FromPath -> Image.ReadFromFile.
de_de: Verwenden Sie stattdessen File.FromPath -> Image.ReadFromFile-Blöcke.
es_es: Utiliza los nodos File.FromPath - > Image.ReadFromFile en su lugar
fr_fr: Utiliser les noeuds File.FromPath -> Image.ReadFromFile à la place
it_it: In sostituzione, utilizzare i nodi File.FromPath -> Image.ReadFromFile
ja_jp: 代わりに File.FromPath -> Image.ReadFromFile ノードを使用します
ko_kr: 대신 File.FromPath -> Image.ReadFromFile 노드를 사용하십시오.
pl_pl: Zamiast tego należy użyć węzłów File.FromPath -> Image.ReadFromFile
pt_br: Utilize em seu lugar os nós File.FromPath -> Image.ReadFromFile
ru_ru: Используйте узлы File.FromPath -> Image.ReadFromFile
zh_cn: 而是使用 File.FromPath -> Image.ReadFromFile 节点
zh_tw: 使用 File.FromPath -> Image.ReadFromFile 節點

# MissingPythonEngine
source: The selected Python engine could not be found
cs_cz: Vybraný modul Python nebylo možné nalézt.
de_de: Die ausgewählte Python-Engine wurde nicht gefunden
es_es: No se ha podido encontrar el motor de Python seleccionado
fr_fr: Le moteur Python sélectionné est introuvable
it_it: Impossibile trovare il motore Python selezionato.
ja_jp: 選択した Python エンジンは見つかりませんでした
ko_kr: 선택한 Python 엔진을 찾을 수 없음
pl_pl: Nie można znaleźć wybranego silnika w języku Python
pt_br: Não foi possível localizar o mecanismo Python selecionado
ru_ru: Не удалось найти выбранный механизм Python
zh_cn: 找不到选定的 Python 引擎
zh_tw: 找不到選取的 Python 引擎

# ObjectArgumentExceptionMessage
source: Object cannot be null, please provide appropriate value.
cs_cz: Objekt nemůže mít hodnotu null, zadejte správnou hodnotu.
de_de: Objekt kann nicht Null sein, bitte geeigneten Wert eingeben
es_es: El objeto no puede ser nulo; proporcione el valor adecuado.
fr_fr: L'objet ne peut pas être nul, entrez une valeur appropriée.
it_it: L'oggetto non può essere null, specificare un valore appropriato.
ja_jp: オブジェクトを NULL にできません。適切な値を指定してください。
ko_kr: Object는 null일 수 없습니다. 적절한 값을 제공하십시오.
pl_pl: Obiekt nie może być pusty, należy podać odpowiednią wartość.
pt_br: O objeto não pode ser nulo, forneça valor apropriado.
ru_ru: Объект не может быть нулевым, введите соответствующее значение.
zh_cn: 对象不能为空，请提供适当的值。
zh_tw: 物件不能為空，請提供適當的值。

# QuadtreeConstructionEmptyUVSetMessage
source: You cannot construct a quadtree from an empty set of points.
cs_cz: Nelze sestavit objekt QuadTree z prázdné množiny bodů.
de_de: Sie können kein Quadtree aus einer leeren Punktmenge erstellen.
es_es: No se puede generar un árbol cuádruple a partir de un conjunto vacío de puntos
fr_fr: Vous ne pouvez pas créer un arbre quadratique à partir d'un jeu de points vide.
it_it: Non è possibile costruire un elemento quadtree da un gruppo di punti vuoto.
ja_jp: 空の点のセットからはクアッドツリーを作成できません。
ko_kr: 빈 점 세트에서 쿼드 트리를 구성할 수 없습니다.
pl_pl: Nie można zbudować drzewa czwórkowego z pustego zbioru punktów.
pt_br: Não é possível construir uma árvore quádrupla partir de um conjunto vazio de pontos.
ru_ru: Невозможно сформировать квадрадерево на основе пустого набора точек.
zh_cn: 无法由空点集构造四叉树。
zh_tw: 您無法從空白點集建構建置四元樹狀目錄。

# QuadtreeConstructionNullUVSetMessage
source: A Quadtree cannot be constructed from a null set of UVs.
cs_cz: Objekt QuadTree nemůže být sestaven z množiny UV s hodnotou null.
de_de: Aus einer Nullmenge von UVs kann kein Quadtree erstellt werden.
es_es: No se puede generar un árbol cuádruple a partir de un conjunto nulo de UV
fr_fr: Un arbre quadratique ne peut pas être créé à partir d'un jeu d'UV nul.
it_it: Non è possibile costruire un elemento quadtree da un gruppo di UV nullo.
ja_jp: UV の NULL セットから Quadtree を作成することはできません。
ko_kr: 빈 UV 세트에서 쿼드 트리를 구성할 수 없습니다.
pl_pl: Drzewo czwórkowe nie może być utworzone z pustego zestawu UV.
pt_br: Uma árvore quádrupla não pode ser construída a partir de um conjunto nulo de UVs.
ru_ru: Квадрадерево не может быть построено на основе пустого набора UV.
zh_cn: 无法由空 UV 集构造四叉树。
zh_tw: 無法從空值的 UV 集建置四元樹狀目錄。

# ReadImageObsolete
source: Use File.FromPath -> Image.ReadFromFile -> Image.Pixels nodes instead
cs_cz: Raději použijte uzly File.FromPath -> Image.ReadFromFile -> Image.Pixels.
de_de: Verwenden Sie stattdessen File.FromPath -> Image.ReadFromFile -> Image.Pixels-Blöcke.
es_es: Utiliza los nodos File.FromPath - > Image.ReadFromFile - > Image.Pixels en su lugar
fr_fr: Utiliser les noeuds File.FromPath -> Image.ReadFromFile -> Image.Pixels à la place
it_it: In sostituzione, utilizzare i nodi File.FromPath -> Image.ReadFromFile -> Image.Pixels
ja_jp: 代わりに File.FromPath -> Image.ReadFromFile -> Image.Pixels ノードを使用します
ko_kr: 대신 File.FromPath -> Image.ReadFromFile -> Image.Pixels 노드를 사용하십시오.
pl_pl: Zamiast tego należy użyć węzłów File.FromPath -> Image.ReadFromFile -> Image.Pixels
pt_br: Utilize em seu lugar os nós File.FromPath - > Image.ReadFromFile - > Image.Pixels
ru_ru: Используйте узлы File.FromPath -> Image.ReadFromFile -> Image.Pixels
zh_cn: 而是使用 File.FromPath -> Image.ReadFromFile -> Image.Pixels 节点
zh_tw: 使用 File.FromPath -> Image.ReadFromFile -> Image.Pixels 節點

# ReadTextObsolete
source: Use File.FromPath -> File.ReadText nodes instead.
cs_cz: Raději použijte uzly File.FromPath -> File.ReadText.
de_de: Verwenden Sie stattdessen File.FromPath -> File.ReadText-Blöcke.
es_es: Utiliza los nodos File.FromPath - > File.ReadText en su lugar.
fr_fr: Utilisez les noeuds File.FromPath -> File.ReadText à la place.
it_it: In sostituzione, utilizzare i nodi File.FromPath -> File.ReadText.
ja_jp: 代わりに File.FromPath -> File.ReadText ノードを使用します。
ko_kr: 대신 File.FromPath -> File.ReadText 노드를 사용하십시오.
pl_pl: Zamiast tego należy użyć węzłów File.FromPath -> File.ReadText.
pt_br: Utilize em seu lugar os nós File.FromPath - > File.ReadText.
ru_ru: Используйте узлы File.FromPath -> File.ReadText.
zh_cn: 而是使用 File.FromPath -> File.ReadText 节点。
zh_tw: 使用 File.FromPath -> File.ReadText 節點。

# StringRemoveCountOutOfRangeMessage
source: Count is out of range!
cs_cz: Počet je mimo rozsah.
de_de: Anzahl liegt außerhalb des Bereichs.
es_es: El recuento está fuera de rango.
fr_fr: Le nombre est hors intervalle.
it_it: Conteggio non rientra nell'intervallo.
ja_jp: Count が範囲外です。
ko_kr: 개수가 범위를 벗어났습니다!
pl_pl: Liczba jest poza zakresem!
pt_br: A contagem está fora da faixa!
ru_ru: Количество выходит за пределы диапазона!
zh_cn: 计数超出范围！
zh_tw: Count 超出範圍 ！

# StringRemoveStartIndexOutOfRangeMessage
source: StartIndex is out of range!
cs_cz: Počáteční index je mimo rozsah.
de_de: Startindex liegt außerhalb des Bereichs.
es_es: El startIndex está fuera de rango.
fr_fr: StartIndex est hors intervalle.
it_it: Il valore di startIndex non rientra nell'intervallo.
ja_jp: startIndex が範囲外です。
ko_kr: startIndex가 범위를 벗어났습니다!
pl_pl: startIndex znajduje się poza zakresem!
pt_br: O StartIndex está fora da faixa!
ru_ru: StartIndex выходит за пределы диапазона!
zh_cn: StartIndex 超出范围！
zh_tw: startIndex 超出範圍 ！

# StringToNumberInvalidNumberMessage
source: Not a valid number.
cs_cz: Číslo není platné.
de_de: Keine gültige Nummer.
es_es: No es un número válido.
fr_fr: Nombre incorrect.
it_it: Non è un numero valido.
ja_jp: 有効な数値ではありません。
ko_kr: 유효한 숫자가 아닙니다.
pl_pl: Nie jest prawidłową liczbą.
pt_br: Não é um número válido.
ru_ru: Недопустимое число.
zh_cn: 不是有效数字。
zh_tw: 不是一個有效數字。

# WebRequestNullUrlMessage
source: The url cannot be null.
cs_cz: Adresa URL nesmí mít hodnotu null.
de_de: URL darf nicht null sein.
es_es: La URL no puede ser nula.
fr_fr: L'URL ne peut pas être nulle.
it_it: L'URL non può essere Null.
ja_jp: URL を null にすることはできません。
ko_kr: URL은 Null이 될 수 없습니다.
pl_pl: URL nie może być pusty.
pt_br: O URL não pode ser nulo.
ru_ru: URL-адрес не может быть пустым.
zh_cn: url 不能为空。
zh_tw: URL 不能為空。

# WriteImageObsolete
source: Use Image.WriteToFile node instead
cs_cz: Raději použijte uzel Image.WriteToFile.
de_de: Verwenden Sie stattdessen den Block Image.WriteToFile.
es_es: Utiliza el nodo Image.WriteToFile en su lugar
fr_fr: Utiliser le noeud Image.WriteToFile à la place
it_it: In sostituzione, utilizzare il nodo Image.WriteToFile
ja_jp: 代わりに Image.WriteToFile ノードを使用します
ko_kr: 대신 Image.WriteToFile 노드를 사용하십시오.
pl_pl: Zamiast tego należy użyć węzła Image.WriteToFile
pt_br: Utilize em seu lugar o nó Image.WriteToFile
ru_ru: Используйте узел Image.WriteToFile
zh_cn: 而是使用 Image.WriteToFile 节点
zh_tw: 使用 Image.WriteToFile 節點
