Repository: DynamoDS/Dynamo
Catalog: src/Libraries/CoreNodes/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# DefineDataUnexpectedInputExceptionMessage
source: This node expected a {0} input but received a {1} input. Please provide the expected input, or pick a new type in the node’s drop-down menu.
cs_cz: Tento uzel očekával vstup {0}, ale obdržel vstup {1}. Zadejte očekávaný vstup nebo vyberte nový typ v rozevírací nabídce uzlu.
de_de: Dieser Block erwartete eine {0}-Eingabe, erhielt jedoch eine {1}-Eingabe. Geben Sie die erwartete Eingabe ein, oder wählen Sie im Dropdown-Menü des Blocks einen neuen Typ aus.
es_es: Este nodo esperaba una entrada {0}, pero ha recibido una entrada {1}. Proporcione la entrada esperada o elija un nuevo tipo en el menú desplegable del nodo.
fr_fr: Ce noeud attendait une entrée {0} mais a reçu une entrée {1}. Veuillez fournir l'entrée attendue ou choisir un nouveau type dans le menu déroulant du noeud.
it_it: Questo nodo prevedeva un input {0} ma ha ricevuto un input {1}. Fornire l'input previsto o selezionare un nuovo tipo nel menu a discesa del nodo.
ja_jp: このノードは {0} 入力を要求しましたが、{1} 入力を受け取りました。必要な入力を提供するか、ノードのドロップダウン メニューで新しい型を選択してくださ’い。
ko_kr: 이 노드는 {0} 입력을 예상했지만 {1} 입력을 수신했습니다. 예상된 입력을 제공하거나 노드의 드롭다운 메뉴에서 새 유형을 선택하십시오.
pl_pl: Ten węzeł oczekiwał danych wejściowych {0}, ale przekazano do niego dane wejściowe {1}. Podaj oczekiwane dane wejściowe lub wybierz nowy typ z menu rozwijanego węzła.
pt_br: Esse nó esperava uma entrada {0}, mas recebeu uma entrada {1}. Forneça a entrada esperada ou selecione um novo tipo no menu suspenso do nó.
ru_ru: Для этого узла ожидался ввод {0}, но получен ввод {1}. Введите ожидаемое входное значение или выберите новый тип в раскрывающемся меню узла.
zh_cn: 此节点预计需要 {0} 输入，但却收到 {1} 输入。请提供预计输入，或在节点的下拉菜单中拾取新类型。
zh_tw: 此節點應為 {0} 輸入，但收到 {1} 輸入。請提供預期的輸入，或在節點的下拉式功能表中點選新類型。

# DefineDataUnsupportedCombinationOfDataTypesExceptionMessage
source: This node does not support the combination of data types in the current input list {0}. Ensure the input list contains items of the same data type, or a mix of types with a common parent type
cs_cz: Tento uzel nepodporuje kombinaci typů dat v aktuálním seznamu vstupů {0}. Zkontrolujte, zda seznam vstupů obsahuje položky stejného typu dat nebo kombinaci typů se společným nadřazeným typem.
de_de: Dieser Block unterstützt die Kombination von Datentypen in der aktuellen Eingabeliste {0} nicht. Stellen Sie sicher, dass die Eingabeliste Elemente desselben Datentyps oder eine Kombination von Typen mit einem gemeinsamen übergeordneten Typ enthält.
es_es: Este nodo no admite la combinación de tipos de datos de la lista de entrada actual {0}. Asegúrese de que la lista de entrada contiene elementos del mismo tipo de datos o una mezcla de tipos con un tipo principal común.
fr_fr: Ce noeud ne prend pas en charge la combinaison de types de données dans la liste d'entrée actuelle {0}. Vérifiez que la liste d'entrée contient des éléments du même type de données ou une combinaison de types avec un type parent commun.
it_it: Questo nodo non supporta la combinazione di tipi di dati nell'elenco di input corrente {0}. Verificare che l'elenco di input contenga elementi dello stesso tipo di dati o una combinazione di tipi con un tipo principale comune.
ja_jp: このノードは、現在の入力リスト {0} 内のデータ タイプの組み合わせをサポートしていません。入力リストに同じデータ タイプの項目が含まれるようにするか、共通の親タイプを持つ型の組み合わせになるようにしてください
ko_kr: 이 노드는 현재 입력 리스트 {0}의 데이터 유형 조합을 지원하지 않습니다. 입력 리스트에 동일한 데이터 유형의 항목이 포함되어 있는지, 아니면 공통 상위 유형이 혼합된 유형인지 확인하십시오
pl_pl: Ten węzeł nie obsługuje kombinacji typów danych na bieżącej liście wejściowej {0}. Upewnij się, że lista wejściowa zawiera elementy tego samego typu danych lub kombinację typów ze wspólnym typem nadrzędnym
pt_br: Esse nó não oferece suporte à combinação de tipos de dados na lista de entrada atual {0}. Verifique se a lista de entrada contém itens do mesmo tipo de dados ou uma combinação de tipos com um tipo principal comum
ru_ru: Этот узел не поддерживает комбинацию типов данных в текущем списке ввода {0}. Убедитесь, что список ввода содержит элементы одного типа данных или содержит элементы разных типов с общим родительским типом
zh_cn: 此节点不支持当前输入列表 {0} 中的数据类型组合。请确保输入列表包含相同数据类型的项，或包含具有公共父类型的混合类型的项。
zh_tw: 此節點不支援在目前輸入清單 {0} 中結合不同資料類型。請確保輸入清單的項目屬於相同資料類型，或是混合共同父系類型的類型

# DefineDataUnsupportedDataTypeExceptionMessage
source: This node does not support the current input data type ({0}). View the supported data types in the drop-down menu.
cs_cz: Tento uzel nepodporuje aktuální typ vstupních dat ({0}). V rozevírací nabídce zobrazte podporované typy dat.
de_de: Dieser Block unterstützt den aktuellen Eingabedatentyp ({0}) nicht. Zeigen Sie die unterstützten Datentypen in der Dropdown-Liste an.
es_es: Este nodo no admite el tipo de datos de entrada actual ({0}). Consulte los tipos de datos admitidos en el menú desplegable.
fr_fr: Ce noeud ne prend pas en charge le type de données d'entrée actuel ({0}). Affichez les types de données pris en charge dans le menu déroulant.
it_it: Questo nodo non supporta il tipo di dati di input corrente ({0}). Visualizzare i tipi di dati supportati nel menu a discesa.
ja_jp: このノードは現在の入力データ タイプ({0})をサポートしていません。ドロップダウン メニューでサポートされているデータ タイプを確認してください。
ko_kr: 이 노드는 현재 입력 데이터 유형({0})을 지원하지 않습니다. 드롭다운 메뉴에서 지원되는 데이터 유형을 확인하십시오.
pl_pl: Ten węzeł nie obsługuje bieżącego typu danych wejściowych ({0}). Sprawdź obsługiwane typy danych w menu rozwijanym.
pt_br: Esse nó não oferece suporte ao tipo de dados de entrada atual ({0}). Visualize os tipos de dados com suporte no menu suspenso.
ru_ru: Этот узел не поддерживает текущий тип входных данных ({0}). Просмотрите поддерживаемые типы данных в раскрывающемся меню.
zh_cn: 此节点不支持当前输入数据类型({0})。请在下拉菜单中查看支持的数据类型。
zh_tw: 此節點不支援目前的輸入資料類型 ({0})。請在下拉式功能表中檢視支援的資料類型。

# DefineDataSupportedInputValueExceptionMessage
source: Input must be a single value or a non-nested list.
cs_cz: Vstup musí být jedna hodnota nebo nevnořený seznam.
de_de: Eingabe muss ein einzelner Wert oder eine nicht verschachtelte Liste sein.
es_es: La entrada debe ser un único valor o una lista no anidada.
fr_fr: L'entrée doit être une valeur unique ou une liste non imbriquée.
it_it: L'input deve essere un singolo valore o un elenco non nidificato.
ja_jp: 入力は単一の値またはネストされていないリストである必要があります。
ko_kr: 입력은 단일 값 또는 내포되지 않은 리스트여야 합니다.
pl_pl: Dane wejściowe muszą być pojedynczą wartością lub listą niezagnieżdżoną.
pt_br: A entrada deve ser um valor único ou uma lista não aninhada.
ru_ru: Входное значение должно быть одним значением или не являться вложенным списком.
zh_cn: 输入必须是单个值或非嵌套列表。
zh_tw: 輸入必須是單一值或非巢狀清單。

# CurveMapperEqualMinMaxWarning
source: • Min and Max values must not be the same.
cs_cz: • Min and Max values must be different.
es_es: • Min and Max values must be different.
it_it: • Min and Max values must be different.
ja_jp: • Min and Max values must be different.
pt_br: • Min and Max values must be different.
zh_tw: • Min and Max values must be different.
