DSCore.DateTime
Oggetto che rappresenta una determinata data e ora.

DSCore.DateTime.MinValue
Il primo valore di data/ora che può essere rappresentato.
Minima rappresentazione possibile di DateTime

DSCore.DateTime.MaxValue
L'ultimo valore di data/ora che può essere rappresentato.
Massima rappresentazione possibile di DateTime

DSCore.DateTime.Now
Data e ora del sistema corrente.
DateTime che rappresenta l'ora attuale

DSCore.DateTime.Today
Data del sistema corrente, con l'ora impostata sulla mezzanotte.
DateTime che rappresenta oggi

DSCore.DateTime.Format(System.DateTime,System.String)
Restituire un'ora e una data specifiche come stringa, nel formato specificato.
dateTime: DateTime a cui applicare il formato
format: Rappresentazione stringa del formato data. Utilizza InvariantCulture, con output indipendenti dalla lingua del sistema operativo dell'utente.
L'impostazione di default è sul formato standard "F": "Martedì, 21 febbraio 2017 23:02:43"
Cercare la sezione relativa alle stringhe di formato ora e data personalizzate MSDN per un elenco completo di identificatori di formato.
DateTime rappresentata come una stringa

DSCore.DateTime.ByDate(System.Int32,System.Int32,System.Int32)
Crea una nuova DateTime per una data specifica.
year: Anno esatto (da 1 a 9999)
month: Mese esatto (da 1 a 12)
day: Giorno esatto (da 1 a [giorni del mese])
DateTime creata dalla data

DSCore.DateTime.ByDateAndTime(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
Crea una nuova DateTime per una data e un'ora specifiche.
year: Anno esatto (da 1 a 9999)
month: Mese esatto (da 1 a 12)
day: Giorno esatto (da 1 a [giorni del mese])
hour: Ora esatta (da 0 a 23)
minute: Minuto esatto (da 0 a 59)
second: Secondo esatto (da 0 a 59)
millisecond: Millisecondo esatto (da 0 a 999)
DateTime creata dalla data e dall'ora

DSCore.DateTime.SubtractTimeSpan(System.DateTime,System.TimeSpan)
Sottrae un TimeSpan da una DateTime, fornendo una nuova data/ora.
dateTime: DateTime iniziale
timeSpan: Quantità di tempo da sottrarre
DateTime risultante dalla sottrazione

DSCore.DateTime.AddTimeSpan(System.DateTime,System.TimeSpan)
Aggiunge un TimeSpan ad una DateTime, fornendo una nuova DateTime.
dateTime: DateTime iniziale
timeSpan: Quantità di tempo da aggiungere a DateTime
DateTime risultante dall'addizione di TimeSpan

DSCore.DateTime.DaysInMonth(System.Int32,System.Int32)
Calcola il numero di giorni presenti nel mese specificato dell'anno specificato.
year: Anno esatto (da 1 a 9999)
month: Mese esatto (da 1 a 12)
Numero di giorni al mese

DSCore.DateTime.IsDaylightSavingsTime(System.DateTime)
Determina se per la DateTime specificata è attiva l'ora legale.
dateTime: DateTime utilizzata per determinare se è stata applicata l'ora legale
True se DateTime è impostata sull'ora legale, false se non lo è

DSCore.DateTime.IsLeapYear(System.Int32)
Determina se l'anno specificato è bisestile.
year: Anno esatto (da 1 a 9999)
True se l'anno è bisestile, false se non lo è

DSCore.DateTime.FromString(System.String)
Tenta di analizzare una DateTime di una stringa
string: Rappresentazione stringa di una DateTime
DateTime dalla stringa analizzata

DSCore.DateTime.Date(System.DateTime)
Estrae solo la data da un valore DateTime. I componenti di ora vengono impostati su 0.
dateTime: Una DateTime.
data da DateTime
Date

DSCore.DateTime.Components(System.DateTime)
Estrae i singoli componenti di un valore di DateTime.
dateTime: DateTime da cui ottenere componenti
Rappresentazione numerica dell'anno (1-9999)
Rappresentazione numerica del mese (1-12)
Rappresentazione numerica del giorno (1-[giorni del mese])
Rappresentazione numerica dell'ora (0-23)
Rappresentazione numerica dei minuti (0-59)
Rappresentazione numerica dei secondi (0-59)
Rappresentazione numerica dei millisecondi (0-999)

DSCore.DateTime.DayOfWeek(System.DateTime)
Restituisce il giorno della settimana da una DateTime specificata.
dateTime: Oggetto DateTime da cui ottenere il giorno della settimana
Giorno della settimana

DSCore.DateTime.DayOfYear(System.DateTime)
Restituisce il giorno dell'anno (da 0 a 366)
dateTime: DateTime per ottenere il giorno dell'anno
Numero di giorni dall'inizio dell'anno

DSCore.DateTime.TimeOfDay(System.DateTime)
Fornisce un nuovo TimeSpan, che rappresenta la quantità di tempo trascorso dalla mezzanotte del DateTime specificato.
dateTime: Una DateTime.
TimeSpan dalla mezzanotte