DSCore.CurveMapper.LinearCurve
Rappresenta una curva lineare in CurveMapper.
Una curva lineare è una linea retta tra due punti di controllo.

DSCore.CurveMapper.LinearCurve.LineEquation(System.Double)
Calcola i valori Y (coordinate nell'area di disegno) per i valori X minimo e massimo.

DSCore.CurveMapper.LinearCurve.SolveForXGivenY(System.Double)
Calcola i valori X (coordinate nell'area di disegno) per i valori Y minimo e massimo.

DSCore.CurveMapper.LinearCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Restituisce i valori X e Y distribuiti lungo la curva.