DSCore.CurveMapper.SineWave
Rappresenta una curva di onda sinusoidale in CurveMapper.
L'onda sinusoidale è definita da due punti di controllo e segue una funzione trigonometrica.

DSCore.CurveMapper.SineWave.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Restituisce i valori X e Y distribuiti lungo la curva.