DSCore.TimeSpan
Oggetto che rappresenta l'intervallo di tempo trascorso, senza una data iniziale o finale specifica.

DSCore.TimeSpan.ByDateDifference(System.DateTime,System.DateTime)
Fornisce un nuovo TimeSpan calcolato in base alla differenza temporale tra due valori di DateTime
dateTime: DateTime da cui sottrarre un valore
otherDateTime: DateTime da sottrarre
Differenza di TimeSpan tra due date

DSCore.TimeSpan.Zero
TimeSpan che rappresenta un tempo trascorso pari a zero.
TimeSpan che rappresenta un tempo trascorso pari a zero

DSCore.TimeSpan.MaxValue
Il TimeSpan massimo rappresentabile.
Massima rappresentazione possibile di TimeSpan

DSCore.TimeSpan.MinValue
Il TimeSpan minimo rappresentabile.
Minima rappresentazione possibile di TimeSpan

DSCore.TimeSpan.Create(System.Double,System.Double,System.Double,System.Double,System.Double)
Crea un nuovo TimeSpan da un periodo temporale.
days: Giorni trascorsi.
hours: Ore trascorse.
minutes: Minuti trascorsi.
seconds: Secondi trascorsi.
milliseconds: Millisecondi trascorsi.
TimeSpan creato

DSCore.TimeSpan.Scale(System.TimeSpan,System.Double)
Moltiplica un TimeSpan per un fattore di scala
timeSpan: TimeSpan da moltiplicare
scaleFactor: Valore di scala da applicare al TimeSpan. Ad esempio, un fattore di scala di 2 duplica l'intervallo di tempo trascorso.
Prodotto TimeSpan

DSCore.TimeSpan.Negate(System.TimeSpan)
Assegna il valore negativo ad un TimeSpan
timeSpan: TimeSpan a cui assegnare un valore negativo
TimeSpan negativo

DSCore.TimeSpan.Add(System.TimeSpan,System.TimeSpan)
Aggiunge due TimeSpan
timeSpan1: TimeSpan da aggiungere
timeSpan2: Altro TimeSpan da aggiungere
TimeSpan risultante dall'addizione

DSCore.TimeSpan.Subtract(System.TimeSpan,System.TimeSpan)
Sottrae due TimeSpan
timeSpan1: TimeSpan da cui sottrarre un valore
timeSpan2: TimeSpan da sottrarre
TimeSpan risultante dalla sottrazione

DSCore.TimeSpan.FromString(System.String)
Tenta di analizzare un TimeSpan di una stringa
string: Rappresentazione stringa di un TimeSpan.
TimeSpan dalla stringa analizzata

DSCore.TimeSpan.Components(System.TimeSpan)
Estrae i singoli componenti di un TimeSpan.
timeSpan: TimeSpan da cui ottenere componenti
Quantità di giorni (tipo int)
Quantità di ore (tipo int)
Quantità di minuti (tipo int)
Quantità di secondi (tipo int)
Numero di millisecondi (tipo int)

DSCore.TimeSpan.TotalDays(System.TimeSpan)
Converte la quantità di tempo totale rappresentata da un TimeSpan in un numero di giorni approssimato.
timeSpan: TimeSpan in cui eseguire query sui giorni totali
Numero totale di giorni

DSCore.TimeSpan.TotalHours(System.TimeSpan)
Converte la quantità di tempo totale rappresentata da un TimeSpan in un numero di ore approssimato.
timeSpan: TimeSpan in cui eseguire query sulle ore totali
Numero totale di ore

DSCore.TimeSpan.TotalMinutes(System.TimeSpan)
Converte la quantità di tempo totale rappresentata da un TimeSpan in un numero di minuti approssimato.
timeSpan: TimeSpan in cui eseguire query sui minuti totali
Numero totale di minuti

DSCore.TimeSpan.TotalSeconds(System.TimeSpan)
Converte la quantità di tempo totale rappresentata da un TimeSpan in un numero di secondi approssimato.
timeSpan: TimeSpan in cui eseguire query sui secondi totali
Numero totale di secondi

DSCore.TimeSpan.TotalMilliseconds(System.TimeSpan)
Converte la quantità di tempo totale rappresentata da un TimeSpan in un numero di millisecondi approssimato.
timeSpan: TimeSpan in cui eseguire query su secondi e millisecondi
Numero totale di millisecondi