DSCore.Object
Funzioni generiche che hanno effetto su tutti i dati.

DSCore.Object.IsNull(System.Object)
Determina se l'oggetto dato è nullo.
object: Oggetto da verificare.
Indica se l'oggetto è nullo.
is null

DSCore.Object.Identity(System.Object)
Restituisce ciò che viene passato, senza eseguire alcuna operazione.
object: Oggetto.
Stesso oggetto

DSCore.Object.Type(System.Object)
Restituisce il tipo di oggetto come stringa.
object: Oggetto da sottoporre a query sul tipo
Returns: Tipo di oggetto.