DSCore.Properties.Resources
Classe di risorse fortemente tipizzata per la ricerca di stringhe localizzate e così via.

DSCore.Properties.Resources.ResourceManager
Restituisce l'istanza di ResourceManager memorizzata nella cache utilizzata da questa classe.

DSCore.Properties.Resources.Culture
Sostituisce la proprietà CurrentUICulture del thread corrente per tutte le ricerche di risorse che utilizzano questa classe di risorse fortemente tipizzata.

DSCore.Properties.Resources.BitmapOverflowError
Cerca una stringa localizzata simile a I dati del colore forniti sono troppo grandi per essere adattati ai limiti dell'immagine.

DSCore.Properties.Resources.CurveMapperEqualMinMaxWarning
Cerca una stringa localizzata simile a • I valori min e max devono essere diversi.

DSCore.Properties.Resources.CurveMapperInvalidCountWarning
Cerca una stringa localizzata simile a • I valori devono essere un elenco di numeri o un numero singolo ≥ 2.

DSCore.Properties.Resources.CurveMapperInvalidCurveWarning
Cerca una stringa localizzata simile a • I punti di controllo per la curva selezionata non sono validi.

DSCore.Properties.Resources.CurveMapperInvalidXYFormatWarning
Cerca una stringa localizzata simile a • Gli input X e Y devono essere numeri singoli (non elenchi).

DSCore.Properties.Resources.DefineDataSupportedInputValueExceptionMessage
Cerca una stringa localizzata simile a L'input deve essere un valore singolo o un elenco non nidificato.

DSCore.Properties.Resources.DefineDataUnexpectedInputExceptionMessage
Cerca una stringa localizzata simile a Questo nodo prevedeva un input {0} ma ha ricevuto un input {1}. Fornire l'input previsto o selezionare un nuovo tipo nel menu a discesa del nodo.

DSCore.Properties.Resources.DefineDataUnsupportedCombinationOfDataTypesExceptionMessage
Cerca una stringa localizzata simile a Questo nodo non supporta la combinazione di tipi di dati nell'elenco di input corrente {0}. Verificare che l'elenco di input contenga elementi dello stesso tipo di dati o una combinazione di tipi con un tipo principale comune.

DSCore.Properties.Resources.DefineDataUnsupportedDataTypeExceptionMessage
Cerca una stringa localizzata simile a Questo nodo non supporta il tipo di dati di input corrente ({0}). Visualizzare i tipi di dati supportati nel menu a discesa.

DSCore.Properties.Resources.EnumDateOfWeekFriday
Cerca una stringa localizzata simile a Venerdì.

DSCore.Properties.Resources.EnumDateOfWeekMonday
Cerca una stringa localizzata simile a Lunedì.

DSCore.Properties.Resources.EnumDateOfWeekSaturday
Cerca una stringa localizzata simile a Sabato.

DSCore.Properties.Resources.EnumDateOfWeekSunday
Cerca una stringa localizzata simile a Domenica.

DSCore.Properties.Resources.EnumDateOfWeekThursday
Cerca una stringa localizzata simile a Giovedì.

DSCore.Properties.Resources.EnumDateOfWeekTuesday
Cerca una stringa localizzata simile a Martedì.

DSCore.Properties.Resources.EnumDateOfWeekWednesday
Cerca una stringa localizzata simile a Mercoledì.

DSCore.Properties.Resources.Exception_Deserialize_Bad_Format
Cerca una stringa localizzata simile a json per il tipo {0} non formattato correttamente.

DSCore.Properties.Resources.Exception_Deserialize_Unsupported_Cache
Cerca una stringa localizzata simile a Impossibile caricare i dati memorizzati.

DSCore.Properties.Resources.Exception_Serialize_Depth_Unsupported
Cerca una stringa localizzata simile a La profondità {0} supera MaxDepth {1} in corrispondenza del percorso {2}".

DSCore.Properties.Resources.Exception_Serialize_DesignScript_Unsupported
Cerca una stringa localizzata simile a Impossibile serializzare questo tipo di geometria.

DSCore.Properties.Resources.Exception_Serialize_Unsupported_Type
Cerca una stringa localizzata simile a Impossibile memorizzare i dati di tipo {0}.

DSCore.Properties.Resources.ExportToCSVObsolete
Cerca una stringa localizzata simile a Utilizzare invece nodo Data.ExportCSV.

DSCore.Properties.Resources.FactorialNegativeInt
Cerca una stringa localizzata simile a Il valore di input Math.Factorial non può essere negativo.

DSCore.Properties.Resources.FactorialOverflow
Cerca una stringa localizzata simile a Il valore restituito di Math.Factorial non rientra nell'intervallo.

DSCore.Properties.Resources.FindPointsWithinRadiusNullPointMessage
Cerca una stringa localizzata simile a È necessario specificare un punto centrale.

DSCore.Properties.Resources.FindPointsWithinRadiusSearchRadiusMessage
Cerca una stringa localizzata simile a Il raggio di ricerca non può essere zero.

DSCore.Properties.Resources.FromObjectObsolete
Cerca una stringa localizzata simile a Il nodo è obsoleto, utilizzare "String from Object".

DSCore.Properties.Resources.IntegerOverflow
Cerca una stringa localizzata simile a L'operazione ha generato un overflow dei numeri interi. Il risultato potrebbe essere imprevisto.

DSCore.Properties.Resources.InvalidDestinationPathErrorMessage
Cerca una stringa localizzata simile a Percorso del file di destinazione non valido utilizzato come percorso di copia.

DSCore.Properties.Resources.InvalidKeysErrorMessage
Cerca una stringa localizzata simile a Uno o più tipi di input non corrispondenti. L'utilizzo di elenchi come chiavi non è supportato.

DSCore.Properties.Resources.InvalidKeysLenghtErrorMessage
Cerca una stringa localizzata simile a Il numero di elementi non corrisponde al numero di chiavi. href=InvalidKeysLenghtErrorMessage.html.

DSCore.Properties.Resources.LoadImageFromPathObsolete
Cerca una stringa localizzata simile a In sostituzione, utilizzare i nodi File.FromPath -> Image.ReadFromFile.

DSCore.Properties.Resources.MissingPythonEngine
Cerca una stringa localizzata simile a Impossibile trovare il motore Python selezionato.

DSCore.Properties.Resources.ObjectArgumentExceptionMessage
Cerca una stringa localizzata simile a L'oggetto non può essere null, specificare un valore appropriato.

DSCore.Properties.Resources.QuadtreeConstructionEmptyUVSetMessage
Cerca una stringa localizzata simile a Non è possibile costruire un elemento quadtree da un gruppo di punti vuoto.

DSCore.Properties.Resources.QuadtreeConstructionNullUVSetMessage
Cerca una stringa localizzata simile a Non è possibile costruire un elemento quadtree da un gruppo di UV nullo.

DSCore.Properties.Resources.ReadImageObsolete
Cerca una stringa localizzata simile a In sostituzione, utilizzare i nodi File.FromPath -> Image.ReadFromFile -> Image.Pixels.

DSCore.Properties.Resources.ReadTextObsolete
Cerca una stringa localizzata simile a In sostituzione, utilizzare i nodi File.FromPath -> File.ReadText.

DSCore.Properties.Resources.StringRemoveCountOutOfRangeMessage
Cerca una stringa localizzata simile a Conteggio non rientra nell'intervallo.

DSCore.Properties.Resources.StringRemoveStartIndexOutOfRangeMessage
Cerca una stringa localizzata simile a startIndex non rientra nell'intervallo.

DSCore.Properties.Resources.StringToNumberInvalidNumberMessage
Cerca una stringa localizzata simile a Non è un numero valido.

DSCore.Properties.Resources.WebRequestNullUrlMessage
Cerca una stringa localizzata simile a L'URL non può essere Null.

DSCore.Properties.Resources.WriteImageObsolete
Cerca una stringa localizzata simile a In sostituzione, utilizzare il nodo Image.WriteToFile.