DSCore.List
Metodi per la creazione e la modifica di elenchi.

DSCore.List.Empty
Restituisce un elenco vuoto.
Elenco vuoto.
empty list, emptylist,[]

DSCore.List.UniqueItems(System.Collections.IList)
Crea un nuovo elenco contenente tutti gli elementi univoci nell'elenco dato.
list: Elenco dal quale escludere i duplicati.
Elenco filtrato.
removes,duplicates,remove duplicates,cull duplicates,distinct,listcontains

DSCore.List.Contains(System.Collections.IList,System.Object)
Determina se l'elenco dato contiene l'elemento specificato. Questa funzione consente di eseguire ricerche attraverso i sottoelenchi in esso contenuti.
list: Elenco in cui eseguire la ricerca
item: Elemento da ricercare
True se l'elenco contiene l'elemento, false se non lo contiene
item,search,in,listcontains

DSCore.List.IsHomogeneous(System.Collections.IList)
Controlla se gli elementi nell'elenco sono dello stesso tipo.
list: Elenco da verificare se uniforme.
Se l'elenco è uniforme.
homogeneous,allequal,same,type

DSCore.List.IsRectangular(System.Collections.IList)
Verifica se il numero di elementi in tutte le righe dell'elenco è lo stesso.
list: Elenco in cui verificare se le righe presentano lo stesso numero di elementi.
Se l'elenco ha lo stesso numero di elementi in tutte le righe.
rectangular,isrectangular,same,sublist,row

DSCore.List.IsUniformDepth(System.Collections.IList)
Verificare se gli elementi nell'elenco hanno la stessa profondità.
list: Elenco in cui verificare se gli elementi hanno la stessa profondità.
Se la profondità dell'elenco è uniforme.
depth,uniform,isuniformdepth,sublist,jagged

DSCore.List.SetDifference(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Restituisce un nuovo elenco contenente gli oggetti in List1 ma esclude gli oggetti in List2.
list1: Elenco di oggetti da includere nel nuovo elenco
list2: Elenco di oggetti da escludere nel nuovo elenco
Il nuovo elenco contenente gli oggetti in List1 ma non in List2
difference,setdifference,set

DSCore.List.SetIntersection(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Restituisce un nuovo elenco contenente gli oggetti che sono presenti sia in List1 che in List2.
list1: Elenco di oggetti da confrontare con List2
list2: Elenco di oggetti da confrontare con List1
Il nuovo elenco contenente gli oggetti che si trovano in List1 e List2
intersection,setintersection,set,overlap

DSCore.List.SetUnion(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Restituisce un nuovo elenco contenente gli oggetti presenti in List1 o List2.
list1: Elenco di oggetti da includere
list2: Elenco di oggetti da includere in List1
Il nuovo elenco contenente gli oggetti che si trovano in List1 o List2
union,setunion,set

DSCore.List.IndexOf(System.Collections.IList,System.Object)
Restituisce l'indice dell'elemento nell'elenco specificato. La corrispondenza tra l'elenco specificato e l'elemento di destinazione deve essere esatta (ossia int con int, double con double, string con string, object con object, ecc.).
list: L'elenco in cui individuare l'elemento.
element: L'elemento il cui indice deve essere restituito.
L'indice dell'elemento dell'elenco. Verrà restituito l'indice non valido -1 se non viene trovata una corrispondenza esatta.
index,indexof

DSCore.List.CountFalse(System.Collections.IList)
Restituisce il numero di valori booleani falsi nell'elenco dato.
list: L'elenco consente di individuare i valori booleani falsi.
Il numero di valori booleani falsi nell'elenco.
false,count

DSCore.List.CountTrue(System.Collections.IList)
Restituisce il numero di valori booleani veri nell'elenco dato.
list: L'elenco consente di trovare i valori booleani veri.
Il numero di valori booleani veri nell'elenco.
true,count

DSCore.List.Insert(System.Collections.IList,System.Object,System.Int32)
Inserisce un elemento in un elenco in corrispondenza dell'indice specificato.
list: L'elenco in cui verrà inserito l'elemento
element: L'elemento da inserire
index: Specifica la posizione nell'elenco dell'elemento da inserire
Elenco con l'elemento inserito
insert,add

DSCore.List.Reorder(System.Collections.IList,System.Collections.IList)
Riordina l'elenco di input in base all'elenco dato di indici.
list: L'elenco da riordinare
indices: Gli indici utilizzati per riordinare gli elementi nell'elenco
Elenco riordinato
reorder,index,indices

DSCore.List.SortIndexByValue(System.Collections.Generic.List{System.Double})
Ordina un elenco per articoli e restituisce i relativi indici.
list: Elenco di elementi da ordinare
Gli indici degli elementi nell'elenco ordinato
sort,index,value

DSCore.List.NormalizeDepth(System.Collections.IList,System.Int32)
Restituisce un elenco multidimensionale in base all'ordine dato.
list: L'elenco di cui è necessario normalizzare la profondità in base alla posizione.
rank: L'ordine in base al quale normalizzare l'elenco. Il valore di default è 1.
L'elenco con l'ordine normalizzato.
depth,normalize

DSCore.List.Reverse(System.Collections.IList)
Crea un nuovo elenco con gli elementi dell'elenco dato disposti in ordine inverso.
list: Elenco da invertire.
Elenco invertito
flip,listcontains

DSCore.List.__Create(System.Collections.IList)
Crea un nuovo elenco contenente gli elementi specificati.
items: Elementi da archiviare nel nuovo elenco.

DSCore.List.Sublists(System.Collections.IList,System.Collections.IList,System.Int32)
Crea sottoelenchi da un elenco mediante la sintassi di intervallo DesignScript.
list: Elenco dal quale creare i sottoelenchi.
ranges: Intervalli di indici degli elementi del sottoelenco.
Ad esempio \"{0..3,5,2}\"
offset: Offset da applicare al sottoelenco.
Ad esempio l'intervallo \"0..3\" con offset 2 restituisce
{0,1,2,3}{2,3,4,5}{4,5,6,7}...
tipo: var[]..[]
sublists,build sublists,subset,

DSCore.List.Sort(System.Collections.Generic.IEnumerable{System.Object})
Ordina un elenco utilizzando l'ordinamento naturale integrato.
list: Elenco da ordinare
Elenco ordinato
sort,order,sorted

DSCore.List.MinimumItem(System.Collections.Generic.IEnumerable{System.Object})
Restituisce il valore minimo presente in un elenco.
list: Elenco di elementi confrontabili da cui ottenere il valore minimo
Elemento minimo presente nell'elenco.
least,smallest,find min

DSCore.List.MaximumItem(System.Collections.Generic.IEnumerable{System.Object})
Restituisce il valore massimo presente in un elenco.
list: Elenco di elementi confrontabili da cui ottenere il valore massimo
Elemento massimo presente nell'elenco.
greatest,largest,biggest,find max

DSCore.List.FilterByBoolMask(System.Collections.IList,System.Collections.IList)
Consente di applicare un filtro ad una sequenza sulla base di indici corrispondenti in un elenco di
valori booleani separato.
list: Elenco al quale applicare il filtro.
mask: Elenco di valori booleani che rappresenta una maschera.
Elementi per i quali l'indice della maschera è true.
Elementi per i quali l'indice della maschera è false.
filter,in,out,mask,dispatch,bool filter,boolfilter,bool filter

DSCore.List.Deconstruct(System.Collections.IList)
A partire da un elenco restituisce la prima voce dell'elenco ed un nuovo elenco contenente tutte le voci dell'elenco iniziale meno la prima.
list: Elenco da dividere.
Prima voce dell'elenco (tipo: var[]..[])
Elenco rimanente (tipo: var[]..[])
first,rest,list split,listcontains

DSCore.List.SortByKey(System.Collections.IList,System.Collections.IList)
Ordina l'elenco in base alle rispettive chiavi
list: Elenco da ordinare
keys: elenco di chiavi, le chiavi devono essere ordinabili (ad es. numeri, stringhe)
tipo: var[]..[]
tipo: var[]..[]
sort;key

DSCore.List.GroupByKey(System.Collections.IList,System.Collections.IList)
Raggruppa gli elementi in sottoelenchi in base ai valori chiave
list: Elenco di elementi da raggruppare in sottoelenchi
keys: Valori chiave, uno per elemento dell'elenco di input, utilizzati per il raggruppamento degli elementi stessi
Elenco di sottoelenchi con gli elementi raggruppati in base ai valori chiave
Valore chiave corrispondente a ciascun gruppo
list;group;groupbykey;

DSCore.List.GroupBySimilarity(System.Collections.IList,System.Double,System.Boolean)
I cluster elencano elementi in base all'adiacenza dei relativi indici e alla similitudine dei relativi valori.
list: Elenco di elementi da raggruppare come sottoelenchi in base all'adiacenza e alla similitudine
tolerance: Valore di soglia per il raggruppamento di elementi simili
considerAdjacency: Valore booleano che controlla se il nodo deve considerare l'adiacenza o meno.
Elenco di sottoelenchi con voci raggruppate per valori simili
Elenco di sottoelenchi contenenti gli indici originali dei valori raggruppati
list;group;similar;adjacent;adjacency;groupbyadjacency;groupadjacentitems;groupsimilaritems;cluster;tolerance

DSCore.List.LevenshteinDistance(System.String,System.String)
La distanza di Levenshtein è l'algoritmo utilizzato per ottenere la distanza tra 2 stringhe.
| Fonte

DSCore.List.AddItemToFront(System.Object,System.Collections.IList)
Aggiunge un elemento all'inizio di un elenco.
item: Elemento da aggiungere. L'elemento potrebbe essere un oggetto o un elenco.
list: Elenco al quale effettuare l'aggiunta.
Elenco con elementi aggiunti
insert,add,item,front,start,begin

DSCore.List.AddItemToEnd(System.Object,System.Collections.IList)
Aggiunge un elemento alla fine di un elenco.
item: Elemento da aggiungere. L'elemento potrebbe essere un oggetto o un elenco.
list: Elenco al quale effettuare l'aggiunta.
Elenco con elementi aggiunti
insert,add,item,end

DSCore.List.TakeItems(System.Collections.IList,System.Int32)
Estrae un numero di voci dall'inizio dell'elenco.
list: Elenco dal quale estrarre le voci.
amount: Numero di voci da estrarre. Se negativo, le voci vengono estratte dalla fine dell'elenco.
Elenco di voci estratte.
get,sub,sublist,extract

DSCore.List.DropItems(System.Collections.IList,System.Int32)
Rimuove un numero di voci dall'inizio dell'elenco. Se il numero è negativo, le voci vengono eliminate dalla fine dell'elenco.
list: Elenco dal quale rimuovere le voci.
amount: Numero di voci da rimuovere. Se negativo, le voci vengono rimosse dalla fine dell'elenco.
Elenco delle voci rimanenti.
drop,remove,shorten

DSCore.List.ShiftIndices(System.Collections.IList,System.Int32)
Sposta indici nell'elenco verso destra, in base al valore specificato.
list: Elenco nel quale effettuare lo spostamento.
amount: Valore di spostamento degli indici. Se negativo, gli indici verranno spostati verso sinistra.
Elenco con gli indici spostati.
shift,offset

DSCore.List.GetItemAtIndex(System.Collections.IList,System.Int32)
Restituisce un elemento dall'elenco dato, situato in corrispondenza dell'indice specificato.
list: Elenco dal quale ricavare la voce.
index: Indice della voce da ricavare.
Voce dell'elenco corrispondente all'indice dato.
get,item,index,fetch,at,getfrom,get from,extract

DSCore.List.ReplaceItemAtIndex(System.Collections.IList,System.Int32,System.Object)
Sostituisce una voce posizionata in corrispondenza dell'indice specificato nell'elenco dato.
list: Elenco nel quale sostituire la voce.
index: Indice della voce da sostituire.
item: Voce da inserire.
Nuovo elenco con la voce sostituita.
replace,switch

DSCore.List.ReplaceItemAtIndices(System.Collections.IList,System.Collections.Generic.IList{System.Int32},System.Object)
Sostituisce le voci dell'elenco dato che si trovano in corrispondenza degli indici specificati.
list: Elenco nel quale sostituire la voce.
indices: Indici delle voci da sostituire.
item: Voce da inserire.
Nuovo elenco con le voci sostituite.
replace,switch

DSCore.List.Slice(System.Collections.IList,System.Nullable{System.Int32},System.Nullable{System.Int32},System.Int32)
Restituisce un singolo sottoelenco dall'elenco fornito, in base all'indice iniziale,
a quello finale e ad un valore di incremento.
list: Elenco dal quale estrarre il sottoelenco.
start: Indice della voce iniziale del sottoelenco.
end: Indice della voce finale del sottoelenco.
step: Valore di incremento che separa le voci nell'elenco originale.
Voci nel sottoelenco dell'elenco originale.
list,sub,sublist,subrange,get sublist

DSCore.List.RemoveItemAtIndex(System.Collections.IList,System.Int32[])
Rimuove una voce dall'elenco, in corrispondenza dell'indice specificato.
list: Elenco dal quale rimuovere una o più voci.
indices: Indice o indici della o delle voci da rimuovere.
Elenco con le voci rimosse.
index,indices,cull,remove,item

DSCore.List.DropEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
Rimuove voci dall'elenco in corrispondenza di indici multipli del valore dato, dopo l'offset indicato.
list: Elenco dal quale rimuovere le voci
n: Gli indici multipli di questo argomento verranno rimossi.
offset: Numero di voci da ignorare all'inizio dell'elenco.
Elenco con le voci rimosse.
nth,remove,cull,every

DSCore.List.TakeEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
Ricava voci dall'elenco in corrispondenza di indici multipli del valore dato, dopo l'offset indicato.
list: Elenco dal quale estrarre le voci.
n: Verranno estratti gli indici multipli di questo numero (dopo l'offset).
offset: Numero di voci da ignorare all'inizio dell'elenco.
Voci ricavate dall'elenco.
fetch,take,every,nth

DSCore.List.IsEmpty(System.Collections.IList)
Determina se l'elenco dato è vuoto.
list: Elenco da verificare se è vuoto
True se l'elenco è vuoto, false se non lo è
test,is,empty,null,count

DSCore.List.AllTrue(System.Collections.IList)
Determina se tutti gli elementi nell'elenco specificato sono valori booleani con valore true.
list: L'elenco in cui verificare se tutti gli elementi sono true.
True se tutti gli elementi dell'elenco sono true, false se uno o più elementi non sono false
test,all,true,istrue

DSCore.List.AllFalse(System.Collections.IList)
Determina se tutti gli elementi nell'elenco specificato sono valori booleani con un valore false.
list: Elenco in cui verificare se tutti gli elementi sono false.
True se tutti gli elementi dell'elenco sono false, false se uno o più elementi non sono false
test,all,false,isfalse

DSCore.List.AnyTrue(System.Collections.IList)
Determina se qualsiasi voce nell'elenco specificato è un valore booleano e ha un valore true.
list: Elenco in cui verificare se qualsiasi voce è true.
Indica se qualsiasi voce è true.
test,any,true,istrue

DSCore.List.AnyFalse(System.Collections.IList)
Determina se qualsiasi voce nell'elenco specificato è un valore booleano e ha un valore false.
list: Elenco in cui verificare se qualsiasi voce è falso.
Indica se qualsiasi voce è false.
test,any,false,isfalse

DSCore.List.Count(System.Collections.IList)
Restituisce il numero di elementi memorizzati nell'elenco dato.
list: Elenco del quale ottenere il numero di voci.
Lunghezza dell'elenco.
listlength,list length,count,size,sizeof

DSCore.List.Join(System.Collections.IList[])
Concatena tutti gli elenchi dati in un unico elenco.
lists: Elenchi da unire in un solo elenco.
Elenco risultante dall'unione.
join lists,merge,concatenate

DSCore.List.FirstItem(System.Collections.IList)
Restituisce la prima voce dell'elenco.
list: Elenco del quale ottenere la prima voce.
Prima voce dell'elenco.
get,fetch,first,item,start

DSCore.List.RestOfItems(System.Collections.IList)
Rimuove la prima voce dall'elenco selezionato.
list: Elenco dal quale rimuovere la prima voce.
Elenco rimanente.
get,fetch,rest,end,rest of list

DSCore.List.Chop(System.Collections.IList,System.Collections.Generic.List{System.Int32})
Ritaglia un elenco in un gruppo di sottoelenchi consecutivi di lunghezze specificate, a partire dall'inizio dell'elenco.
list: Elenco da suddividere in sottoelenchi
lengths: Lunghezze dei sottoelenchi consecutivi creati a partire dall'elenco iniziale
Sottoelenchi creati a partire dall'elenco
sublists,build sublists,slices,partitions,cut,listcontains,chop

DSCore.List.DiagonalRight(System.Collections.IList,System.Int32)
Elencare gli elementi lungo ciascuna diagonale della matrice, dall'angolo inferiore sinistro all'angolo superiore destro.
list: Elenco non strutturato
subLength: Lunghezza di ciascun nuovo sottoelenco.
Elenchi delle voci presenti lungo le diagonali della matrice.
diagonal,right,matrix,get diagonals,diagonal sublists

DSCore.List.DiagonalLeft(System.Collections.IList,System.Int32)
Elencare gli elementi lungo ciascuna diagonale della matrice, dall'angolo superiore sinistro all'angolo inferiore destro.
list: Elenco non strutturato.
rowLength: Lunghezza di ciascun nuovo sottoelenco.
Elenchi delle voci presenti lungo le diagonali della matrice.
diagonal,left,matrix,get diagonals,diagonal sublists

DSCore.List.Transpose(System.Collections.IList)
Scambia righe e colonne in una lista di elenchi.
Se alcune righe sono più corte di altre, nella matrice
risultante vengono inseriti valori null come segnaposto,
per ottenere sempre una matrice rettangolare.
lists: Elenco di elenchi da sottoporre allo scambio
Lista di elenchi sottoposti allo scambio
transpose,flip matrix,matrix,swap,rows,columns

DSCore.List.Clean(System.Collections.IList,System.Boolean)
Rimuove dati degli elenchi di valori null e vuoti da un elenco dato di dimensioni arbitrarie
list: Elenco contenente i valori null e i sottoelenchi vuoti da rimuovere
preserveIndices: Offre la possibilità di conservare gli indici dei dati
Elenco di elenchi sottoposti allo scambio
in modo che i valori null non finali non vengano esclusi tramite filtro
Returns: Elenco con elenchi di valori null e vuoti rimossi

DSCore.List.OfRepeatedItem(System.Object,System.Int32)
Crea un elenco contenente la voce data per il numero di volte specificato.
item: Voce da ripetere.
amount: Numero di ripetizioni.
Elenco di voci ripetute.
repeat,repeated,duplicate,list of item,fill list,copies,listcontains

DSCore.List.Cycle(System.Collections.IList,System.Int32)
Crea un nuovo elenco concatenando copie di un elenco dato.
list: Elenco da ripetere.
amount: Numero di ripetizioni.
Elenco costituito dalle ripetizioni di tipo: var[]..[]
repeat,repeated,duplicate,repeated list,concat list

DSCore.List.LastItem(System.Collections.IList)
Recupera l'ultima voce di un elenco.
list: Elenco del quale ottenere l'ultima voce
Ultimo elemento dell'elenco
get,fetch,last,item,end of list

DSCore.List.Shuffle(System.Collections.IList)
Modifica in modo casuale l'ordine delle voci di un elenco.
list: Elenco del quale modificare l'ordine.
Elenco con l'ordine modificato in modo casuale.
random,randomize,shuffle,jitter,randomness

DSCore.List.Shuffle(System.Collections.IList,System.Int32)
Modifica in modo casuale l'ordine delle voci di un elenco in base ad un valore seme iniziale.
list: Elenco del quale modificare l'ordine.
seed: Valore seme per il generatore di numeri casuali.
Elenco con l'ordine modificato in modo casuale.
random,randomize,shuffle,jitter,randomness,seed

DSCore.List.Permutations(System.Collections.IList,System.Nullable{System.Int32})
Produce tutte le permutazioni con la lunghezza data in un determinato elenco.
list: Elenco da sottoporre a permutazioni.
length: Lunghezza di ciascuna permutazione.
Permutazioni dell'elenco con la lunghezza specificata (tipo: var[]..[])
permutation,permutations

DSCore.List.Combinations(System.Collections.IList,System.Int32,System.Boolean)
Produce tutte le combinazioni con la lunghezza data in un determinato elenco.
list: Elenco del quale generare le combinazioni
length: Lunghezza di ciascuna combinazione
replace: Indica se le voci selezionate per la combinazione vengono rimosse. Valore di default: false.
Combinazioni dell'elenco della lunghezza specificata
combo

DSCore.List.FirstIndexOf(System.Collections.IList,System.Object)
Dato un elemento, restituisce l'indice in base zero della prima ricorrenza di
tale elemento nell'elenco. Se l'elemento non viene trovato nell'elenco, restituisce -1.
list: Elenco in cui eseguire la ricerca. Se questo argomento è null, viene restituito -1.
item: Elemento da ricercare.
Returns: Indice in base zero dell'elemento nell'elenco o -1 se l'elemento non viene trovato.

DSCore.List.AllIndicesOf(System.Collections.IList,System.Object)
Dato un elemento, restituisce gli indici in base zero di tutte le ricorrenze di
tale elemento nell'elenco. Se l'elemento non viene trovato nell'elenco, restituisce un elenco vuoto.
list: Elenco in cui eseguire la ricerca. Se questo argomento è null, viene restituito un elenco vuoto.
item: Elemento da ricercare.
Elenco di indici in base zero di tutte le ricorrenze dell'elemento se
trovato o elenco vuoto se l'elemento non esiste nell'elenco.

DSCore.List.Flatten(System.Collections.IList,System.Int32)
Riduce di un determinato numero di livelli la nidificazione di una lista di elenchi.
list: Elenco del quale ridurre la nidificazione.
amount: Livelli di nidificazione dell'elenco da rimuovere (-1 rimuoverà tutte le nidificazioni dell'elenco)
Elenco non nidificato per quantità
flatten,completely

DSCore.List.IndexInList(System.Collections.IList,System.Object)
Un'alternativa all'utilizzo di IList.Contains che utilizza Enumerable.SequenceEqual per verificare se
l'elemento è contenuto nell'elenco se l'elemento è una matrice. Restituisce l'indice se trovato,
-1 se non trovato.
list: L'elenco in cui verificare la presenza dell'elemento.
item: L'articolo che deve essere trovato.
L'indice dell'elemento nell'elenco.

DSCore.List.GetDepth(System.Object)
Ottenere la profondità massima di un elenco dato.
list: L'elenco di input da cui ottenere la profondità.
Profondità dell'elenco dato.

DSCore.List.CountBool(System.Collections.IList,System.Boolean)
Restituisce il numero di valori booleani specificati nell'elenco dato.
list: L'elenco consente di trovare i valori booleani.
value: Il valore booleano da trovare
Il numero del valore booleano specificato nell'elenco.

DSCore.List.IncreaseDepth(System.Collections.IList,System.Int32)
Aumentare la profondità di un determinato elenco in base ad un valore specificato. La profondità viene aumentata
mediante la creazione di un nuovo elenco contenente l'elenco dato.
list: L'elenco la cui profondità deve essere aumentata.
amt: Il valore a cui aumentare la profondità.
Il nuovo elenco la cui profondità è aumentata del valore definito.

DSCore.List.DoubleConverter(System.Object)
Converte un valore intero in Double o restituisce l'oggetto di input.