DSCore.CurveMapper.CurveBase
Rappresenta una classe di base per tutti i tipi di curva in CurveMapper.
Fornisce funzionalità comuni per la generazione e il recupero dei valori delle curve.

DSCore.CurveMapper.CurveBase.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Metodo astratto che deve essere implementato dalle classi derivate per la generazione di valori delle curve.

DSCore.CurveMapper.CurveBase.GetCurveXValues(System.Collections.Generic.List{System.Double},System.Boolean)
Metodo comune per il recupero di valori X.

DSCore.CurveMapper.CurveBase.GetCurveYValues(System.Collections.Generic.List{System.Double},System.Boolean)
Metodo comune per il recupero di valori Y.

DSCore.CurveMapper.CurveBase.GenerateFromDomain(System.Collections.Generic.List{System.Double},System.Func{System.Double,System.Double})
Genera valori X e Y associando gli input del dominio allo spazio dell'area di disegno e valutando una funzione curva.