DSCore.CurveMapper.BezierCurve
Rappresenta una curva di Bézier in CurveMapper.
Una curva di Bézier è definita da quattro punti di controllo e garantisce un'interpolazione uniforme.

DSCore.CurveMapper.BezierCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Consente di ottenere i valori Y interpolati in base ai parametri e ai limiti assegnati.