DSCore.CurveMapper.GaussianCurve
Rappresenta una curva gaussiana in CurveMapper.
La curva gaussiana segue una distribuzione a campana definita da quattro punti di controllo.

DSCore.CurveMapper.GaussianCurve.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Indica se il nodo è attualmente in fase di ridimensionamento, impedendo aggiornamenti imprevisti dei punti di controllo.

DSCore.CurveMapper.GaussianCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Restituisce i valori X e Y distribuiti lungo la curva.