DSCore.Sorting
Metodi utility per l'ordinamento in base a chiavi. Dovrebbe esserne soppressa la trasformazione in nodi; verranno inclusi in wrapping da implementazioni DS che accettano una funzione di mappatura chiavi.