DSCore.ColorRange.ByColorsAndParameters(System.Collections.Generic.IList{DSCore.Color},System.Collections.Generic.IList{Autodesk.DesignScript.Geometry.UV})
Creare un ColorRange fornendo elenchi di colori e valori UV.
colors: Un elenco di colori.
parameters: Un elenco di parametri compresi tra (0.0,0.0) e (1.0,1.0).
Returns: Un oggetto ColorRange.

DSCore.ColorRange.GetColorAtParameter(Autodesk.DesignScript.Geometry.UV)
Restituisce il colore in questo intervallo di colori in corrispondenza del parametro specificato.
parameter: Un valore UV compreso tra (0.0,0.0) e (1.0,1.0).
Returns: Un colore.