DSCore.Math
Metodi per l'esecuzione di operazioni matematiche.

DSCore.Math.Random(System.Nullable{System.Int32})
Genera un valore Double casuale nell'intervallo [0, 1).
seed: Valore iniziale (seme) per il generatore di numeri casuali.
Numero casuale compreso tra 0 e 1.
random,seed

DSCore.Math.Random(System.Double,System.Double)
Produce un numero casuale nell'intervallo [numero_inferiore, numero_superiore).
value1: Estremità inferiore dell'intervallo per il numero casuale.
value2: Estremità superiore dell'intervallo per il numero casuale.
Numero casuale nell'intervallo [lower_number, higher_number).
random,numberrange

DSCore.Math.Random(System.Double,System.Double,System.Int32)
Produce un numero casuale nell'intervallo [lower_number, upper_number) in base ad un valore seme iniziale.
value1: Estremità inferiore dell'intervallo per il numero casuale.
value2: Estremità superiore dell'intervallo per il numero casuale.
seed: Valore seme per il generatore di numeri casuali.
Numero casuale nell'intervallo [lower_number, higher_number).
random,numberrange,seed

DSCore.Math.RandomList(System.Int32)
Produce un elenco contenente la quantità prevista di valori Double casuali nell'intervallo [0, 1).
amount: Quantità di numeri casuali che appariranno nell'elenco di risultati.
Elenco di numeri casuali compresi tra 0 e 1.
random,listcontains

DSCore.Math.RandomList(System.Int32,System.Double,System.Double,System.Int32)
Produce un elenco contenente la quantità specificata di valori Double casuali
nell'intervallo definito di [lower_number, higher_number) in base ad un valore seme iniziale.
amount: Quantità di numeri casuali che compariranno nell'elenco di risultati.
value1: Estremità inferiore dell'intervallo per il numero casuale.
value2: Estremità superiore dell'intervallo per il numero casuale.
seed: Valore seme per il generatore di numeri casuali.
Elenco di numeri casuali nell'intervallo [lower_number, upper_number).
random,listcontains,seed

DSCore.Math.PiTimes2
Costante pi greco moltiplicata per due
Costante pi greco per due.
2pi,2*pi,twopi,two*pi

DSCore.Math.Average(System.Collections.Generic.IList{System.Double})
Calcola la media di un elenco di numeri.
numbers: Elenco dei numeri tra i quali calcolare la media.
Media dell'elenco di numeri.
avg,mean

DSCore.Math.Map(System.Double,System.Double,System.Double)
Associa il valore di input a un numero compreso tra 0 e 1 in base all'intervallo di input.
rangeMin: Il valore minimo dell'intervallo di input.
rangeMax: Il valore massimo dell'intervallo di input.
inputValue: Il numero da mappare.
Il valore mappato.
map,range,minimum,maximum,normalize,scale,remap

DSCore.Math.MapTo(System.Double,System.Double,System.Double,System.Double,System.Double)
Associa il valore di input a un numero tra targetRangeMin e targetRangeMax.
rangeMin: Il valore minimo dell'intervallo di input.
rangeMax: Il valore massimo dell'intervallo di input.
inputValue: Il numero da mappare.
targetRangeMin: Il valore minimo del nuovo intervallo.
targetRangeMax: Il valore massimo del nuovo intervallo.
Il valore mappato.
map,range,mapto,minimum,maximum,normalize,scale,remap

DSCore.Math.RemapRange(System.Collections.Generic.IList{System.Double},System.Double,System.Double)
Regola l'intervallo di un elenco di numeri, mantenendo il rapporto di distribuzione.
numbers: Elenco dei numeri dell'intervallo da regolare.
newMin: Nuovo minimo dell'intervallo.
newMax: Nuovo massimo dell'intervallo
Elenco mappato sul nuovo intervallo.
remap range

DSCore.Math.kRadiansToDegrees
Sposta le funzioni/metodi da Math.dll al file DSCoreNode.dll corrente

DSCore.Math.PI
Costante matematica pi greco, 3,14159...
La costante pi greco
3.141592653589793

DSCore.Math.E
Costante matematica e, 2,71828...
La costante e
exp,2.718281828459045

DSCore.Math.GoldenRatio
Rapporto aureo, (1 + rad. quadr. (5))/2 = 1,61803...
Il rapporto aureo
golden,ratio,divine,phi,tau,1.61803398875

DSCore.Math.RadiansToDegrees(System.Double)
Converte un angolo in radianti in un angolo in gradi.
radians: Angolo in radianti.
Angolo in gradi.
radians,degrees,angle

DSCore.Math.DegreesToRadians(System.Double)
Converte un angolo in gradi in un angolo in radianti.
degrees: Angolo in gradi.
Angolo in radianti.
degrees,radians,angle

DSCore.Math.Abs(System.Double)
Determina il valore assoluto di un numero.
number: Numero da cui ottenere il valore assoluto
Valore assoluto del numero
absolute value,magnitude

DSCore.Math.Equals(System.Double,System.Double,System.Double)
Questo metodo è utilizzato SOLO dal nodo Equals (with tolerance) NodeModel.

DSCore.Math.Abs(System.Int64)
Determina il valore assoluto di un numero.
integer: Numero.
Valore assoluto del numero.
absolute value,magnitude

DSCore.Math.Acos(System.Double)
Trova il coseno inverso, l'angolo il cui coseno è il rapporto dato.
ratio: Coseno dell'angolo, numero compreso nell'intervallo [-1, 1].
Angolo il cui coseno è il rapporto di input.
acosine,arccosine

DSCore.Math.Asin(System.Double)
Trova il seno inverso, l'angolo il cui seno è il rapporto dato.
ratio: Seno dell'angolo, numero compreso nell'intervallo [-1, 1].
Angolo il cui seno è il rapporto di input
asine,arcsin

DSCore.Math.Atan(System.Double)
Trova la tangente inversa, l'angolo la cui tangente è il rapporto dato.
ratio: Tangente dell'angolo.
Angolo la cui tangente è il rapporto di input
atangent,arctangent

DSCore.Math.Atan2(System.Double,System.Double)
Trova la tangente inversa del quoziente tra due numeri. Restituisce l'angolo la cui tangente è il rapporto: numeratore/denominatore.
numerator: Numeratore della tangente dell'angolo.
denominator: Denominatore della tangente dell'angolo.
Angolo la cui tangente è numeratore/denominatore
atangent,arctangent

DSCore.Math.Ceiling(System.Double)
Restituisce il primo numero intero maggiore del numero
number: Numero da arrotondare.
Primo numero intero maggiore del numero
ceiling,round

DSCore.Math.Cos(System.Double)
Determina il coseno di un angolo.
angle: Angolo in gradi di cui prendere il coseno.
Coseno dell'angolo
cosine

DSCore.Math.Cosh(System.Double)
Determina il coseno iperbolico di un angolo (radianti).
angle: Angolo in radianti.
Coseno iperbolico dell'angolo
hyperbolic cosine

DSCore.Math.DivRem(System.Int64,System.Int64)
Trova il resto tra dividendo/divisore.
dividend: Numero da dividere.
divisor: Numero in base al quale dividere.
Resto della divisione
remainder

DSCore.Math.EvaluateFormula(System.String,System.String[],System.Object[])
Valuta una formula NCalc con mappaggi di parametri dati.
formulaString: Formula NCalc
parameters: Nomi di variabili
arguments: Binding di variabili
type: var[]..[] (risultato del calcolo della formula)

DSCore.Math.Exp(System.Double)
Restituisce il valore esponenziale del numero, la costante e elevata al numero corrispondente al valore.
number: Numero.
Valore esponenziale del numero.
exponential

DSCore.Math.Floor(System.Double)
Restituisce il primo numero intero minore del numero.
number: Numero da arrotondare per difetto
Primo numero intero minore del numero
round

DSCore.Math.Log(System.Double)
Determina il logaritmo naturale di un numero compreso nell'intervallo (0, ∞).
number: Numero maggiore di 0.
Logaritmo naturale del numero.
natural,logarithm,ln

DSCore.Math.Log(System.Double,System.Double)
Determina il logaritmo di un numero con la base specificata.
number: Numero maggiore di 0.
logBase: Base del logaritmo nell'intervallo [0, 1),(1, ∞).
Logaritmo del numero.
logarithm,ld,lg

DSCore.Math.Log10(System.Double)
Determina il logaritmo in base 10 di un numero.
number: Numero maggiore di 0.
Logaritmo del numero.
logarithm

DSCore.Math.Max(System.Double,System.Double)
Restituisce il maggiore tra due numeri.
value1: Numero da confrontare.
value2: Numero da confrontare.
Numero maggiore tra i due numeri.
maximum,greater,larger

DSCore.Math.Max(System.Int64,System.Int64)
Restituisce il maggiore tra due numeri.
int1: Numero da confrontare.
int2: Numero da confrontare.
Numero maggiore tra i due numeri.
maximum,greater,larger

DSCore.Math.Min(System.Double,System.Double)
Restituisce il minore tra due numeri.
value1: Numero da confrontare.
value2: Numero da confrontare.
Numero minore tra i due numeri.
minimum,lesser,smaller

DSCore.Math.Min(System.Int64,System.Int64)
Restituisce il minore tra due numeri.
int1: Numero da confrontare.
int2: Numero da confrontare.
Numero minore tra i due numeri.
minimum,lesser,smaller

DSCore.Math.Pow(System.Double,System.Double)
Eleva un numero alla potenza specificata.
number: Numero da elevare a potenza.
power: Potenza alla quale elevare il numero.
Numero elevato alla potenza.
^,power,raise,exponent

DSCore.Math.Rand
Produce un numero casuale nell'intervallo [0, 1).
Numero casuale nell'intervallo [0, 1).
random,numberrange

DSCore.Math.Round(System.Double)
Arrotonda un numero al valore intero più vicino.
Tenere presente che questo metodo restituisce un numero a virgola mobile a precisione doppia anziché un integrale.
number: Numero da arrotondare.
Valore integrale vicino al numero.

DSCore.Math.Round(System.Double,System.Int32)
Arrotonda un numero a un numero specificato di cifre frazionarie.
number: Numero da arrotondare
digits: Numero di cifre frazionarie nel valore restituito
Il numero più vicino al valore che contiene un numero di cifre frazionarie pari alle cifre

DSCore.Math.Sign(System.Double)
Restituisce il segno del numero: -1, 0 o 1.
number: Numero da cui ottenere il segno
Il segno del numero: -1, 0 o 1.

DSCore.Math.Sign(System.Int64)
Restituisce il segno del numero: -1, 0 o 1.
int: Numero intero da cui ottenere il segno
Il segno del numero: -1, 0 o 1

DSCore.Math.Sin(System.Double)
Determina il seno di un angolo.
angle: Angolo in gradi di cui acquisire il seno.
Seno dell'angolo.
sine

DSCore.Math.Sinh(System.Double)
Determina il seno iperbolico di un angolo (radianti).
angle: Angolo in radianti.
Seno iperbolico dell'angolo.
hyperbolic

DSCore.Math.Sqrt(System.Double)
Determina la radice quadrata positiva di un numero compreso nell'intervallo [0, ∞).
number: Numero compreso nell'intervallo [0, ∞).
Radice quadrata positiva del numero.
square,root,radical

DSCore.Math.Tan(System.Double)
Determina la tangente di un angolo.
angle: Angolo in radianti
Tangente dell'angolo
tangent

DSCore.Math.Tanh(System.Double)
Determina la tangente iperbolica di un angolo (radianti).
angle: Angolo in radianti
Tangente iperbolica dell'angolo
hyperbolic,tanh

DSCore.Math.Sum(System.Collections.Generic.IEnumerable{System.Double})
Determina la somma di una serie di numeri
values: Numeri da aggiungere alla somma
Somma dei valori
mass addition,massadd

DSCore.Math.Factorial(System.Int64)
Determina il fattoriale di un numero intero positivo.
number: Un numero intero positivo
Fattoriale del numero intero.
!

DSCore.Math.Xor(System.Boolean,System.Boolean)
XOR booleano: restituisce true soltanto se uno degli input corrisponde esattamente a true.
bool: Un valore booleano
otherBool: Altro valore booleano
Risultato booleano
xor,exclusive,or

DSCore.Math.DoCheckedCast(System.Double)
Esegue una proiezione in lungo in un contesto controllato. Se l'operazione genera un overflow,
viene generato un avviso e viene restituito il risultato di overflow.
value: Operazione da eseguire
Returns: Risultato dell'operazione