DSCore.CurveMapper.PerlinNoiseCurve
Rappresenta una curva del rumore di Perlin in CurveMapper.
La curva genera disturbo procedurale in base ai punti di controllo e alle funzioni del rumore di Perlin.

DSCore.CurveMapper.PerlinNoiseCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Restituisce i valori X e Y distribuiti lungo la curva.