DSCore.Quadtree.ByUVs(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.UV})
Costruisce un elemento Quadtree che include il dominio (0,0)->(1,1).
uvs: Set di UV nel dominio (0,0) - > (1,1).
Returns: Oggetto Quadtree.

DSCore.Quadtree.FindPointsWithinRadius(Autodesk.DesignScript.Geometry.UV,System.Double)
Trova tutti i punti quadtree (UV) dell'elemento quadtree inclusi in un raggio calcolato a partire dalla posizione UV data.
center: UV al centro dell'area di ricerca.
radius: Raggio dell'area di ricerca.
Returns: Elenco di UV.