DSCore.CurveMapper.ParabolicCurve
Rappresenta una curva parabolica in CurveMapper.
La curva segue un'equazione di secondo grado basata su due punti di controllo.

DSCore.CurveMapper.ParabolicCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Restituisce i valori X e Y distribuiti lungo la curva.