DSCore.Data.ParseJSON(System.String)
Parse converte una stringa JSON arbitraria in un valore. È l'opposto di JSON.Stringify.
json: Una stringa JSON
Il tipo di risultato dipende dal contenuto della stringa di input. Il tipo di risultato può essere un valore primitivo (ad esempio, stringa, booleano, doppio), un elenco o un dizionario.

DSCore.Data.ToNative(Newtonsoft.Json.Linq.JToken)
Analizzare l'implementazione per la conversione di tipi JToken in oggetti .NET nativi.
token: JToken da analizzare in N

DSCore.Data.DynamoJObjectToNative(Newtonsoft.Json.Linq.JObject)
Analizzare l'implementazione per la conversione di tipi JObject in oggetti di Dynamo specifici (ad esempio, Geometry, Color, Images e così via)
Throws System.Exception:

DSCore.Data.StringifyJSON(System.Object)
Stringify converte un valore arbitrario o un elenco di valori arbitrari in JSON. Per applicare l'operazione ad un elenco, può essere utilizzata la replica. In questo modo viene prodotto un elenco di stringhe JSON.
values: Un elenco di valori
Una stringa JSON in cui tipi primitivi (ad esempio, doppio, intero, booleano), elenchi e dizionari verranno convertiti nel tipo JSON associato.

DSCore.Data.CanObjectBeCached(System.Object)
Funzione di supporto per determinare se l'oggetto può essere memorizzato nella cache oppure se è null, una stringa "null" o un elenco vuoto.
inputObject: Oggetto da controllare

DSCore.Data.Remember(System.Object,System.String)
Funzione per gestire la memorizzazione nella cache per il nodo Data.Remember
inputObject: Oggetto da memorizzare nella cache
cachedJson: json cache esistente opzionale

DSCore.Data.DataNodeDynamoTypeList
Elenco statico per tutti i tipi di dati supportati da Dynamo
Returns: Elenco contenente i tipi di dati supportati

DSCore.Data.#cctor
Costruttore statico

DSCore.Data.SafeExtractDictionaryValue(System.Collections.Generic.Dictionary{System.String,System.Object},System.String)
Funzione di supporto per estrarre in modo sicuro un valore del dizionario
dict: Dizionario da cui estrarre il valore
key: Chiave della coppia chiave/valore

DSCore.Data.EvaluateDefineDataNode(System.Object,System.String,System.Boolean,System.Boolean,System.String)
Questa è la funzione utilizzata da AST per valutare il nodo Define Data.
Gestisce parte della logica del nodo durante l'esecuzione della convalida.
inputValue: Valore di input a monte
typeString: Tipo come stringa (Todo: sarebbe meglio passare un oggetto di tipo 'Type' per il confronto diretto dei tipi)
isList: Se l'input è di tipo `ArrayList`
isAutoMode: Se il nodo è in modalità Automatico
playerValue: Valore inserito nel nodo dal Lettore Dynamo, se presente.

DSCore.Data.FindCommonAncestor(System.Collections.ArrayList)
Funzione che consente di trovare il tipo nel caso in cui un oggetto ArrayList sia stato passato in AutoMode
list: Valore di input, previsto di tipo ArrayList

DSCore.Data.LikelyAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
Funzione di supporto che restituisce il nodo di livello inferiore da un elenco di nodi DataNodeDynamoType
nodes: Elenco di DataNodeDynamoType da valutare

DSCore.Data.FindClosestCommonAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
Funzione di supporto per cercare di determinare un elemento predecessore comune in un elenco di tipi di dati
nodes: Elenco di nodi DataType da valutare

DSCore.Data.FindCommonAncestorBetweenTwoNodes(DSCore.Data.DataNodeDynamoType,DSCore.Data.DataNodeDynamoType)
Funzione ricorsiva per cercare di trovare un elemento predecessore comune tra due tipi di Dynamo
Risale la struttura gerarchica dell'elemento predecessore probabile fino ad esso.
node: Verificare se questo nodo è derivato dall'elemento predecessore probabile
likelyAncestor: Elemento predecessore probabile da cui deve derivare il nodo

DSCore.Data.GetListFromTypes(System.Collections.ArrayList)
Restituisce un elenco di DataNodeDynamoTypes da un ArrayList di oggetti.
list: ArrayList di oggetti da riformattare

DSCore.Data.IsSingleValueOrSingleLevelArrayList(System.Object)
Verificare se l'oggetto di input è un valore singolo o un oggetto ArrayList a livello singolo.
obj: Oggetto di input da valutare

DSCore.Data.IsSupportedDataNodeDynamoType(System.Object,System.Type,System.Boolean)
Funzione per convalidare il tipo di input rispetto ai tipi di input di Dynamo supportati
inputValue: Dati in entrata da convalidare
type: Tipo di input fornito dall'utente. Deve corrispondere al tipo InputValue
isList: Il valore di questo valore booleano determina se l'input è un singolo oggetto o un elenco.

DSCore.Data.IsItemOfType(System.Object,System.Type)
Questo metodo verifica se un elemento è di un DataType di Dynamo richiesto.
'IsInstanceOfType' verifica in modo ricorsivo l'eredità verso l'alto.
item: Elemento per cui verificare il tipo di dati
dataType: DataType rispetto a cui eseguire la verifica
Returns: Risultato vero o falso basato sulla convalida della verifica

DSCore.Data.IsDerivedFrom(System.Type,System.Type)
Questo metodo verifica se un tipo è derivato da un tipo di base
derivedType: Tipo che si desidera asserire
baseType: Tipo di base con cui viene eseguito il confronto