DSCore.IO.Image
Metodi per l'utilizzo di immagini bitmap.

DSCore.IO.Image.ReadFromFile(System.IO.FileInfo)
Carica il file come bitmap.
file: Oggetto del file dal quale caricare l'immagine
Oggetto dell'immagine dal file

DSCore.IO.Image.Pixels(System.Drawing.Bitmap,System.Nullable{System.Int32},System.Nullable{System.Int32})
Legge un file immagine e restituisce i valori di colore per le posizioni della griglia specificate.
image: Oggetto dell'immagine da cui ottenere i colori dei pixel
xSamples: Numero di punti della griglia di esempio nella direzione X.
ySamples: Numero di punti della griglia di esempio nella direzione Y.
Colori in corrispondenza dei punti della griglia specificati
read,image,bitmap,png,jpg,jpeg

DSCore.IO.Image.FromPixels(DSCore.Color[][])
Crea un'immagine a partire da un elenco di pixel 2D.
colors: Elenco rettangolare 2D di colori che rappresentano i pixel
Immagine dall'elenco 2D di pixel

DSCore.IO.Image.FromPixels(DSCore.Color[],System.Int32,System.Int32)
Crea un'immagine a partire da un elenco di pixel semplice, una larghezza e un'altezza.
colors: Elenco dei colori che rappresentano i pixel
width: Larghezza della nuova immagine in pixel
height: Altezza della nuova immagine, in pixel
Immagine dall'elenco di pixel

DSCore.IO.Image.Dimensions(System.Drawing.Bitmap)
Restituisce la larghezza e l'altezza di un'immagine.
image: Immagine della quale ottenere le dimensioni.
larghezza dell'immagine in pixel
altezza dell'immagine in pixel

DSCore.IO.Image.WriteToFile(System.String,System.Drawing.Bitmap)
Salva l'immagine in un percorso, con il nome file specificato.
image: Immagine da salvare
Oggetto immagine creato
write image,image,file,filepath