DSCore.String
Metodi per la gestione di stringhe.

DSCore.String.ToNumber(System.String)
Converte una stringa in un intero o un valore Double.
string: Stringa da convertire
Numero intero o valore Double
2number,str2number,strtonumber,string2number,stringtonumber,int,double,cast

DSCore.String.GetNumber(System.String)
Consente di ottenere tutte le stringhe numeriche dalla stringa di destinazione come stringa.
string: Stringa di destinazione da ottenere
Numero nella stringa
getnumber,tonumber,strtonumber,numberinstring,string2number,stringtonumber,int,double,cast

DSCore.String.Concat(System.String[])
Concatena più stringhe in un'unica stringa.
strings: Elenco delle stringhe da concatenare.
Stringa risultante dall'elenco di stringhe.
concatenate,join,combine strings

DSCore.String.Length(System.String)
Restituisce il numero di caratteri inclusi nella stringa data.
string: Stringa della quale si desidera trovare la lunghezza
Numero di caratteri inclusi nella stringa
count,size,characters,chars,length,sizeof

DSCore.String.Split(System.String,System.String[])
Suddivide una singola stringa in un elenco di stringhe, in corrispondenza
delle stringhe separatore date.
string: Stringa da dividere
separators: Stringhe che, se presenti, determinano la fine e l'inizio di una divisione.
Elenco di stringhe create dalla stringa di input
divide,separator,delimiter,cut,csv,comma,

DSCore.String.Join(System.String,System.String[])
Concatena più stringhe in un'unica stringa, inserendo il separatore dato tra le stringhe concatenate.
separator: Stringa da inserire tra le stringhe concatenate.
strings: Stringhe da unire in un'unica stringa.
Stringa costituita dall'elenco di stringhe, con il separatore tra le stringhe.
join,separator,build csv,concat,construct

DSCore.String.ToUpper(System.String)
Converte la stringa specificata in maiuscole.
string: Stringa da convertire in maiuscole
Stringa in maiuscole
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.ToLower(System.String)
Converte la stringa specificata in minuscole.
string: Stringa da convertire in minuscole
Stringa in minuscole
2lowercase,to lowercase,tolowercase,lowercase

DSCore.String.ToTitle(System.String)
Converte la stringa specificata in una con tutte le iniziali maiuscole.
str: Stringa da convertire in una con tutte le iniziali maiuscole
Stringa con tutte le iniziali maiuscole
2titlecase,to titlecase,to title case,totitlecase,titlecase

DSCore.String.ChangeCase(System.String,System.Boolean)
Converte la stringa specificata in maiuscole o minuscole in base ad un parametro booleano.
string: Stringa da convertire in maiuscole o minuscole.
upper: True converte la stringa in maiuscole, false in minuscole.
Stringa convertita.
2lowercase,to lowercase,tolowercase,lowercase,
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.Substring(System.String,System.Int32,System.Int32)
Recupera una sottostringa dalla stringa data. La sottostringa inizia nella posizione del carattere specificato e ha la lunghezza indicata.
string: Stringa dalla quale ottenere la sottostringa
startIndex: Posizione del carattere iniziale della sottostringa nella stringa originale
length: Numero di caratteri inclusi nella sottostringa
Sottostringa ottenuta dalla stringa originale
subset,get string,part,smaller string

DSCore.String.Contains(System.String,System.String,System.Boolean)
Determina se la stringa data contiene la sottostringa data.
string: Stringa nella quale eseguire la ricerca
searchFor: Sottostringa da ricercare
ignoreCase: Determina se il confronto tiene conto delle maiuscole e minuscole
Indica se la stringa contiene la sottostringa
test,within,in,is in,part of

DSCore.String.CountOccurrences(System.String,System.String,System.Boolean)
Conta il numero di ricorrenze non sovrapposte di una sottostringa in una determinata stringa.
string: Stringa nella quale eseguire la ricerca
searchFor: Sottostringa da ricercare
ignoreCase: Determina se il confronto tiene conto delle maiuscole e minuscole.
Numero di ricorrenze non sovrapposte della sottostringa nella stringa
count,substring,count occurrences,numberof,search,find,within

DSCore.String.Replace(System.String,System.String,System.String)
Sostituisce tutte le ricorrenze di un testo in una stringa con altro testo.
string: Stringa nella quale sostituire le sottostringhe.
searchFor: Testo da sostituire.
replaceWith: Testo sostitutivo.
Stringa con le sostituzioni effettuate.
replace,overwrite,override,find and replace

DSCore.String.EndsWith(System.String,System.String,System.Boolean)
Determina se una stringa termina con la sottostringa data.
string: Stringa nella quale ricercare alla fine
searchFor: Sottostringa da ricercare alla fine
ignoreCase: True per ignorare maiuscole e minuscole nel confronto, false per tenerne conto
True se la stringa inizia con la sottostringa, false se non lo fa
test,does end,last,str end,terminated

DSCore.String.StartsWith(System.String,System.String,System.Boolean)
Determina se una stringa inizia con la sottostringa data.
string: Stringa nella quale ricercare all'inizio
searchFor: Sottostringa da ricercare all'inizio della stringa.
ignoreCase: True per ignorare maiuscole e minuscole nel confronto, false per tenerne conto
True se la stringa inizia con la sottostringa, false se non lo fa
test,beginswith,start,string start,front

DSCore.String.TrimWhitespace(System.String)
Rimuove tutti gli spazi all'inizio e alla fine della stringa data.
string: Stringa da tagliare.
Stringa con spazi iniziali e finali rimossi.
trimstring,cleanstring,whitespace,blanks,spaces,string trim

DSCore.String.TrimLeadingWhitespace(System.String)
Rimuove tutti gli spazi all'inizio della stringa data.
string: Stringa da tagliare.
Stringa con spazi iniziali rimossi.
trim string,clean string,trim leading whitespaces,string trim

DSCore.String.TrimTrailingWhitespace(System.String)
Rimuove tutti gli spazi alla fine della stringa data.
string: Stringa da tagliare.
Stringa con spazi finali rimossi.
trim string,clean string,trim trailing whitespaces,string trim

DSCore.String.IndexOf(System.String,System.String,System.Boolean)
Trova l'indice in base zero della prima ricorrenza di una sottostringa in una stringa. Se non viene trovato alcun indice, restituisce -1.
string: Stringa nella quale eseguire la ricerca
searchFor: Sottostringa da ricercare
ignoreCase: Determina se il confronto tiene conto delle maiuscole e minuscole.
Indice della prima ricorrenza della sottostringa o -1 se non viene trovato alcun indice
index of,find substring,where,search

DSCore.String.AllIndicesOf(System.String,System.String,System.Boolean)
Trova l'elenco di indici in cui la sottostringa compare all'interno di una stringa.
string: Stringa nella quale eseguire la ricerca.
searchFor: Sottostringa da ricercare.
ignoreCase: Determina se il confronto tiene conto delle maiuscole e minuscole.
Elenco di indici in cui viene trovata la sottostringa (tipo: int[])
all indices of,find substring,where,search

DSCore.String.LastIndexOf(System.String,System.String,System.Boolean)
Trova l'indice in base zero dell'ultima ricorrenza di una sottostringa in una stringa. Se non viene trovato alcun indice, restituisce -1.
string: Stringa nella quale eseguire la ricerca.
searchFor: Sottostringa da ricercare.
ignoreCase: Determina se il confronto tiene conto delle maiuscole e minuscole.
Indice dell'ultima ricorrenza della sottostringa o -1 se non viene trovato nessun indice.
last index of,find substring,where,search

DSCore.String.PadLeft(System.String,System.Int32,System.String)
Allinea a destra i caratteri della stringa data, aggiungendo caratteri di riempimento a sinistra fino a raggiungere una lunghezza totale specificata.
string: Stringa da completare con riempimento
newLength: Lunghezza totale della stringa dopo il riempimento
padChars: Carattere da utilizzare per il riempimento (il carattere di default è lo spazio)
Stringhe allineate a destra mediante riempimento con spazi iniziali, fino ad una determinata lunghezza totale.
pad left,right align,right-align,pad,string space,whitespace

DSCore.String.PadRight(System.String,System.Int32,System.String)
Allinea a sinistra i caratteri della stringa data, aggiungendo caratteri di riempimento a sinistra fino a raggiungere una lunghezza totale specificata.
string: Stringa da completare con riempimento
newLength: Lunghezza totale della stringa dopo il riempimento
padChars: Carattere da utilizzare per il riempimento (il carattere di default è lo spazio)
Stringhe allineate a sinistra mediante riempimento con spazi finali per una lunghezza totale specificata
pad right,left align,left-align,pad string space,whitespace

DSCore.String.Center(System.String,System.Int32,System.String)
Incrementa la lunrghezza di una stringa aggiungendo ai caratteri originali spazi su entrambi i lati.
string: Stringa da centrare
newLength: Lunghezza totale della stringa dopo la centratura
padChars: Carattere da utilizzare per la centratura (il carattere di default è lo spazio)
Stringhe allineate al centro mediante riempimento con spazi iniziali e finali, fino ad una determinata lunghezza totale.
center align,center-align,centered,whitespace,expand string,surround

DSCore.String.Insert(System.String,System.Int32,System.String)
Inserisce una stringa in un'altra stringa in corrispondenza di un determinato indice.
string: Stringa nella quale effettuare l'inserimento.
index: Indice in corrispondenza del quale effettuare l'inserimento.
toInsert: Stringa da inserire.
Stringa con la sottostringa inserita.
insertstring,insert string

DSCore.String.Remove(System.String,System.Int32,System.Nullable{System.Int32})
Rimuove caratteri da una stringa.
string: Stringa dalla quale rimuovere i caratteri.
startIndex: Indice in corrispondenza del quale iniziare la rimozione.
count: Quantità di caratteri da rimuovere.
Nota: se il conteggio è negativo, il processo di rimozione va da destra a sinistra.
Stringa con i caratteri rimossi.
delete,rem,shorten