DSCore.ColorRange1D.ByColorsAndParameters(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double})
Crea un ColorRange1D fornendo elenchi di colori e parametri.
colors: Elenco di colori.
parameters: Elenco di parametri tra 0,0 e 1,0.
Returns: Oggetto ColorRange1D.

DSCore.ColorRange1D.GetColorAtParameter(DSCore.ColorRange1D,System.Double)
Restituisce il colore in questo intervallo di colori in corrispondenza del parametro specificato.
parameter: Valore compreso tra 0,0 e 1,0.
Returns: Colore.

DSCore.ColorRange1D.Default
Crea un oggetto ColorRange1D con lo schema colori di default.