DSCore.IO.FileSystem
Metodi per l'utilizzo di file.

DSCore.IO.FileSystem.AbsolutePath(System.String,System.String)
Restituisce il percorso assoluto a partire dal percorso specificato. Se si tratta
del percorso relativo, esso viene risolto rispetto all'area di lavoro corrente.
Se il file non esiste nel percorso relativo, ma esiste in corrispondenza
di un determinato hintPath, viene restituito hintPath.
path: Percorso relativo o percorso completo
hintPath: Ultimo percorso risolto
Returns: Percorso assoluto

DSCore.IO.FileSystem.FileFromPath(System.String)
Crea un oggetto file da un percorso file specificato.

DSCore.IO.FileSystem.ReadText(System.IO.FileInfo)
Legge un file di testo e restituisce il contenuto sotto forma di stringa.
file: Oggetto file da cui leggere il testo
Il contenuto del file di testo.
read file,text,file

DSCore.IO.FileSystem.MoveFile(System.String,System.String,System.Boolean)
Sposta il file specificato in una nuova posizione
path: Rappresentazione stringa del percorso esistente
newPath: Rappresentazione stringa del nuovo percorso
overwrite: Attivare/Disattivare per sovrascrivere o meno i file esistenti
Il nodo esegue un'operazione e non produce un output

DSCore.IO.FileSystem.DeleteFile(System.String)
Elimina il file specificato.
path: Percorso file da eliminare
Il nodo esegue un'operazione e non produce un output

DSCore.IO.FileSystem.CopyFile(System.IO.FileInfo,System.String,System.Boolean)
Copia un file.
file: Oggetto del file da copiare
destinationPath: Rappresentazione stringa del percorso del file di destinazione
overwrite: Attivare/Disattivare per sovrascrivere o meno i file esistenti
Il nodo esegue un'operazione, restituisce true se l'azione di copia riesce.

DSCore.IO.FileSystem.FileExists(System.String)
Determina se un file è presente nel percorso specificato.
path: Stringa che rappresenta un percorso di file
True se il file esiste, false se non esiste
filepath

DSCore.IO.FileSystem.WriteText(System.String,System.String)
Scrive il contenuto di testo nel file specificato dal percorso
filePath: Percorso per la scrittura
text: Contenuto di testo
Nessun output
write file,text,file,filepath

DSCore.IO.FileSystem.AppendText(System.String,System.String)
Aggiunge il testo contenuto in un file specificato dal percorso
filePath: Percorso per la scrittura
text: Contenuto di testo
Il nodo esegue un'operazione e non produce un output
append file,write file,text,file,filepath

DSCore.IO.FileSystem.CombinePath(System.String[])
Combina più stringhe in un unico percorso file.
strings: Stringhe da combinare in un percorso
Percorso di file combinato

DSCore.IO.FileSystem.FileExtension(System.String)
Restituisce l'estensione da un percorso file.
path: Percorso del quale ottenere l'estensione
Estensione del file

DSCore.IO.FileSystem.ChangePathExtension(System.String,System.String)
Modifica l'estensione di un percorso file.
path: Percorso del quale modificare l'estensione
newExtension: Rappresentazione stringa della nuova estensione
Percorso file con estensione modificata

DSCore.IO.FileSystem.DirectoryName(System.String)
Restituisce il nome della directory di un percorso file.
path: Percorso del quale ottenere informazioni sulla directory
Nome della directory del percorso file
directorypath

DSCore.IO.FileSystem.FileName(System.String,System.Boolean)
Restituisce il nome del file di un percorso file.
path: Percorso del quale ottenere il nome file
withExtension: Attivare/Disattivare per includere o meno l'estensione nel risultato
Nome file da percorso file

DSCore.IO.FileSystem.FileHasExtension(System.String)
Determina se un percorso file contiene o meno l'estensione.
path: Percorso per il quale verificare la presenza di un'estensione
True se il percorso file contiene l'estensione, false se non la contiene

DSCore.IO.FileSystem.GetDirectoryContents(System.IO.DirectoryInfo,System.String,System.Boolean)
Restituirà un elenco di file e directory contenuti in una directory specifica. Per filtrare i risultati, è possibile utilizzare un elemento searchString facoltativo.
directory: Directory di cui ottenere il contenuto
searchString: Stringa di ricerca utilizzata per filtrare i risultati
includeSubdirectories: Impostare su true per includere i file e le cartelle nelle sottodirectory (ricorsive) o impostare su false per includere i risultati solo dal livello superiore della directory specificata.
File risultanti dalla query
Directory risultanti dalla query

DSCore.IO.FileSystem.CopyDirectory(System.IO.DirectoryInfo,System.String,System.Boolean)
Copia una directory in una posizione di destinazione.
directory: Directory da copiare
destinationPath: Destinazione dell'operazione di copia nel disco
overwriteFiles: Attivare/Disattivare per sovrascrivere o meno la directory esistente
Il nodo esegue un'operazione e non produce un output

DSCore.IO.FileSystem.DeleteDirectory(System.String,System.Boolean)
Elimina una directory.
path: Percorso di una directory del disco
recursive: Determina se verrà eliminato tutto il contenuto della directory. Il valore di default è false.
Il nodo esegue un'operazione e non produce un output

DSCore.IO.FileSystem.DirectoryExists(System.String)
Determina se una directory è presente nel percorso specificato.
path: Percorso di una directory del disco
True se la directory esiste, false se non esiste
directorypath

DSCore.IO.FileSystem.MoveDirectory(System.String,System.String,System.Boolean)
Sposta una directory in una nuova posizione.
path: Rappresentazione stringa del percorso esistente
newPath: Rappresentazione stringa del nuovo percorso
overwriteFiles: Attivare/Disattivare per sovrascrivere o meno i file esistenti
Il nodo esegue un'operazione e non produce un output