DSCore.ObjectComparer
Implementa la funzione Compare per due oggetti in base alla seguente regola.
1. I numeri presunti sono di tipo valore minimo, quindi booleano,
stringa e puntatore.
2. Se i due oggetti sono IComparable e dello stesso tipo, si utilizza
il meccanismo di confronto nativo.
3. Se entrambi gli input sono di tipo valore ma uno dei due è booleano
l'input booleano è il maggiore.
4. In caso contrario vengono convertiti tutti in Double e confrontati.
5. Else: oppure, se un solo input è di tipo valore, l'oggetto di tipo
valore è il minore
6. Else: oppure, se un solo input è di tipo stringa, l'oggetto stringa è
il minore
7. Else: oppure la modalità di confronto non è nota, ed è consigliabile
confrontare a partire dall'HashCode.