DSCore.Data.MaxDepthJsonTextWriter
Sottoclasse di JsonTextWriter che limita una profondità massima supportata degli oggetti per evitare arresti anomali dei riferimenti circolari durante la serializzazione di tipi di oggetti .NET arbitrari.