DSCore.Compare
Metodi di confronto.

DSCore.Compare.GreaterThan(System.Object,System.Object)
Restituisce true se a è maggiore di b.
a: Oggetto confrontabile.
b: Oggetto confrontabile.
Risultato booleano.
larger,bigger

DSCore.Compare.GreaterThanOrEqual(System.Object,System.Object)
Restituisce true se a è maggiore o uguale a b.
a: Oggetto confrontabile.
b: Oggetto confrontabile.
Risultato booleano.
larger,bigger,equal

DSCore.Compare.LessThan(System.Object,System.Object)
Restituisce true se a è minore di b.
a: Oggetto confrontabile.
b: Oggetto confrontabile.
Risultato booleano.
less,smaller

DSCore.Compare.LessThanOrEqual(System.Object,System.Object)
Restituisce true se a è minore o uguale a b.
a: Oggetto confrontabile.
b: Oggetto confrontabile.
Risultato booleano.
smaller,equal