DSCore.CurveMapper.SquareRootCurve
Rappresenta una curva di radice quadrata in CurveMapper.
La curva segue una funzione di radice quadrata ed è influenzata da due punti di controllo.

DSCore.CurveMapper.SquareRootCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Restituisce i valori X e Y distribuiti lungo la curva.