DSCore.Color.Red
Individua il componente rosso di un colore, da 0 a 255.
Valore del rosso per il modello colori RGB, intero compreso tra 0 e 255, inclusi.

DSCore.Color.Green
Individua il componente verde di un colore, da 0 a 255.
Valore del verde per il modello colori RGB, intero compreso tra 0 e 255, inclusi.

DSCore.Color.Blue
Individua il componente blu di un colore, da 0 a 255.
Valore del blu per il modello colori RGB, intero compreso tra 0 e 255, inclusi.

DSCore.Color.Alpha
Individua il componente alfa di un colore, da 0 a 255.
Valore alfa, intero compreso tra 0 e 255, inclusi.

DSCore.Color.ByARGB(System.Int32,System.Int32,System.Int32,System.Int32)
Crea un colore in base ai componenti alfa, rosso, verde e blu.
alpha: Valore alfa (compreso tra 0 e 255 inclusi)
red: Valore rosso per il modello di colore RGB (compreso tra 0 e 255 inclusi)
green: Valore verde per il modello di colore RGB (compreso tra 0 e 255 inclusi)
blue: Valore blu per il modello di colore RGB (compreso tra 0 e 255 inclusi)
Colore creato da ARGB
color

DSCore.Color.Brightness(DSCore.Color)
Restituisce il valore di luminosità del colore.
color: Colore da cui eseguire query sulla luminosità
Valore di luminosità (compreso tra 0 e 1 inclusi)

DSCore.Color.Saturation(DSCore.Color)
Restituisce il valore di saturazione del colore.
Valore di saturazione come doppio compreso tra 0 e 1, inclusi.

DSCore.Color.Hue(DSCore.Color)
Restituisce il valore di tonalità del colore.
color: Oggetto colore
Valore della tonalità per il colore a precisione doppia compreso tra 0 e 1, inclusi.
hues

DSCore.Color.Components(DSCore.Color)
Elenca i componenti del colore nell'ordine seguente: alfa, rosso, verde, blu.
color: Oggetto colore
Valore alfa, intero compreso tra 0 e 255, inclusi.
Valore del rosso per il modello colori RGB, intero compreso tra 0 e 255, inclusi.
Valore del verde per il modello colori RGB, intero compreso tra 0 e 255, inclusi.
Valore del blu per il modello colori RGB, intero compreso tra 0 e 255, inclusi.
alpha,red,green,blue

DSCore.Color.BuildColorFrom1DRange(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double},System.Double)
Restituisce un colore da una sfumatura di colore compresa tra un colore iniziale e uno finale.
parameters: Valori tra 0 e 1 nell'intervallo per il quale si desidera campionare il colore.
Colori nell'intervallo specificato.
color,range,gradient

DSCore.Color.Lerp(DSCore.Color,DSCore.Color,System.Double)
Determina l'interpolazione lineare tra due colori.
start: Colore iniziale.
end: Colore finale.
t: Parametro compreso tra 0,0 e 1,0.
Returns: Colore interpolato o bianco.

DSCore.Color.Blerp(System.Collections.Generic.IList{DSCore.Color.IndexedColor2D},Autodesk.DesignScript.Geometry.UV)
Determina l'interpolazione lineare tra un gruppo di colori.
Returns: Colore interpolato o bianco.
This algorithm is not the same as the solution found from wikipedia
(reference: https://en.wikipedia.org/wiki/Bilinear_interpolation)

DSCore.Color.Add(DSCore.Color,DSCore.Color)
Creare un colore mediante la combinazione dei valori ARGB dei due colori esistenti.
color: Un colore da aggiungere
otherColor: Altro colore da aggiungere
Risultato del colore derivante dall'aggiunta di due colori

DSCore.Color.Multiply(DSCore.Color,System.Double)
Moltiplicare un colore di input con un numero moltiplicatore per produrre un colore più scuro. Il colore di input deve includere un carattere alfa inferiore a 255.
color: Colore da moltiplicare
multiplier: Valore del moltiplicatore
Risultato del colore derivante dalla moltiplicazione

DSCore.Color.Divide(DSCore.Color,System.Double)
Dividere un colore di input con un numero divisore per produrre un colore più chiaro e rimuovere la tinta colore
color: Colore da dividere
dividend: Valore del dividendo
Risultato colore derivante dalla divisione