DSCore.Data.DataNodeDynamoType
Classe che rappresenta un DataType supportato da Dynamo

DSCore.Data.DataNodeDynamoType.#ctor(System.Type,System.String,System.String)
Classe che rappresenta un DataType supportato da Dynamo

DSCore.Data.DataNodeDynamoType.Type
Tipo sottostante

DSCore.Data.DataNodeDynamoType.Name
Nome facoltativo che consente di sostituire il nome del tipo (`Number` anziché `long`)

DSCore.Data.DataNodeDynamoType.TypeId
Formato di filo $typeid (ad esempio, "autodesk.math:point3d-1.0.0").
Null per' tipi primitivi che non utilizzano la serializzazione $typeid.

DSCore.Data.DataNodeDynamoType.Level
Livello gerarchico da visualizzare nell'interfaccia utente

DSCore.Data.DataNodeDynamoType.IsLastChild
Se il tipo è l'ultimo elemento derivato di una gerarchia (per l'interfaccia utente)

DSCore.Data.DataNodeDynamoType.Parent
Elemento principale di Type, se presente