DSCore.Thread
Funzioni per la gestione di thread di valutazione.

DSCore.Thread.Pause(System.Object,System.Int32)
Interrompe il thread di valutazione corrente per un determinato intervallo di tempo.
object: Oggetto da passare.
msTimeout: Tempo di sospensione del thread, in millisecondi.
Oggetto passato.