DSCore.CurveMapper.PowerCurve
Rappresenta una curva della funzione di potenza in CurveMapper.
La curva è definita da un'equazione esponenziale derivata da un punto di controllo.

DSCore.CurveMapper.PowerCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Restituisce i valori X e Y distribuiti lungo la curva.