DSCore.DateTime.Components(System.DateTime)
Extracts the individual components of a DateTime.
dateTime: DateTime to get components from
Numeric representation of the year (1-9999)
Numeric representation of the month (1-12)
Numeric representation of the day (1-[days in month])
Numeric representation of the hour (0-23)
Numeric representation of minutes (0-59)
Numeric representation of seconds(0-59)
Numeric representation of seconds(0-999)