DSCore.DummyPythonEvaluator
Python evaluator that will only throw an error on evaluation.
Used primarily to indicate that a real Python evaluator could not be found.

DSCore.DummyPythonEvaluator.Evaluate(System.String,System.Collections.IList,System.Collections.IList)
Throws an exception with the assigned message