DSCore.List.IndexOf(System.Collections.IList,System.Object)
Returns the index of the element in the given list. Match between given list and target element must be a strict match (i.e. int to int, double to double, string to string, object to object etc.)
list: The list to find the element in.
element: The element whose index is to be returned.
The index of the element in the list. Invalid index -1 will be returned if strict match not found.
index,indexof

DSCore.List.Cycle(System.Collections.IList,System.Int32)
Creates a new list by concatenining copies of a given list.
list: List to repeat.
amount: Number of times to repeat.
List of repeated lists of type: var[]..[]
repeat,repeated,duplicate,repeated list,concat list