DSCore.Display.ByGeometryColor(Autodesk.DesignScript.Geometry.Geometry,DSCore.Color)
Display geometry using a color.
geometry: The geometry to which you would like to apply color.
color: The color.
Returns: A Display object.