DSCore.File.LoadImageFromPath(System.String)
Load a bitmap from a file path.
path: The path to the image file.
Bitmap

DSCore.File.ReadImage(System.String,System.Int32,System.Int32)
Reads an image file and returns the color values at the specified grid locations.
filePath: Path to the image file.
numX: Number of sample grid points in the X direction.
numY: Number of sample grid points in the Y direction.
Colors at the specified grid points.
read,image,bitmap,png,jpg,jpeg

DSCore.File.ReadText(System.String)
Reads a text file and returns the contents as a string.
filePath: Path to the text file.
Contents of the text file.
read file,text,file

DSCore.File.ExportToCSV(System.String,System.Double[][])
Write a list of lists into a file using a comma-separated values
format. Outer list represents rows, inner lists represent column.
filePath: Path to write to
data: List of lists to write into CSV
Contents of the text file.
write,text,file

DSCore.File.WriteText(System.String,System.String)
Write the text content to a file specified by the path
filePath: Path to write to
data: Text content
It is successful or not.
write file,text,file

DSCore.File.WriteImage(System.String,System.String,System.Drawing.Bitmap)
Write the image to a path, given the specified file name.
The file name will be appended with .png.
filePath: Path to write to
fileName: File name to save as
image: The image to write
It is successful or not.
write image,image,file