DSCore.Formula
Backend implementation for Formula node.

DSCore.Formula.Evaluate(System.String,System.String[],System.Object[])
Evaluates an NCalc formula with given parameter mappings.
formulaString: NCalc formula
parameters: Variable names
args: Variable bindings
Result of the formula calculation.