DSCore.String.FromObject(System.Object)
Converts an object to a string representation.
obj: Object to serialize.
String representation of the object.
tostring,2string,number2string,numbertostring

DSCore.String.ToNumber(System.String)
Converts a string to an integer or a double.
str: String to be converted.
Integer or double-type number.
2number,str2number,strtonumber,string2number,stringtonumber

DSCore.String.Concat(System.String[])
Concatenates multiple strings into a single string.
strings: List of strings to concatenate.
String made from list of strings.
concatenate

DSCore.String.Length(System.String)
Returns the number of characters contained in the given string.
str: String to find the length of.
Number of characters in the string.
count,size,characters

DSCore.String.Split(System.String,System.String[])
Divides a single string into a list of strings, with divisions
determined by the given separater strings.
str: String to split up.
separaters:
Strings that, if present, determine the end and start of a split.
List of strings made from the input string.
divide,separaters

DSCore.String.Join(System.String,System.String[])
Concatenates multiple strings into a single string, inserting the given
separator between each joined string.
separator: String to be inserted between joined strings.
strings: Strings to be joined into a single string.
A string made from the list of strings including the separator character.
join,separator

DSCore.String.ToUpper(System.String)
Converts the given string to all uppercase characters.
str: String to be made uppercase.
Uppercase string.
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.ToLower(System.String)
Converts the given string to all lowercase characters.
str: String to be made lowercase.
Lowercase string.
2lowercase,to lowercase,tolowercase,lowercase

DSCore.String.ChangeCase(System.String,System.Boolean)
Converts the given string to all uppercase characters or all
lowercase characters based on a boolean parameter.
str: String to be made uppercase or lowercase.
upper:
True to convert to uppercase, false to convert to lowercase.
String with converted case.
2lowercase,to lowercase,tolowercase,lowercase,
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.Substring(System.String,System.Int32,System.Int32)
Retrieves a substring from the given string. The substring starts at the given
character position and has the given length.
str: String to take substring of.
startIndex:
Starting character position of the substring in the original string.
length: Number of characters in the substring.
Substring made from the original string.

DSCore.String.Contains(System.String,System.String,System.Boolean)
Determines if the given string contains the given substring.
str: String to search in.
searchFor: Substring to search for.
ignoreCase: Whether or not comparison takes case into account.
Whether the string contains the substring.
test

DSCore.String.CountOccurrences(System.String,System.String,System.Boolean)
Counts the number of non-overlapping occurrences of a substring inside a given string.
str: String to search in.
searchFor: Substring to search for.
ignoreCase: Whether or not comparison takes case into account.
Number of non-overlapping occurrences of the substring in the string.
count,substring,count occurrences

DSCore.String.Replace(System.String,System.String,System.String)
Replaces all occurrances of text in a string with other text.
str: String to replace substrings in.
searchFor: Text to be replaced.
replaceWith: Text to replace with.
String with replacements made.
replace

DSCore.String.EndsWith(System.String,System.String,System.Boolean)
Determines if the given string ends with the given substring.
str: String to search the end of.
searchFor: Substring to search the end for.
ignoreCase: Whether or not comparison takes case into account.
Whether the string ends with the substring.
test

DSCore.String.StartsWith(System.String,System.String,System.Boolean)
Determines if the given string starts with the given substring.
str: String to search the start of.
searchFor: Substring to search the start for.
ignoreCase: Whether or not comparison takes case into account.
Whether the string starts with the substring.
test,beginswith

DSCore.String.TrimWhitespace(System.String)
Removes all whitespace from the start and end of the given string.
str: String to trim.
String with beginning and ending whitespaces removed.
trimstring,cleanstring,whitespace,blanks,spaces

DSCore.String.TrimLeadingWhitespace(System.String)
Removes all whitespace from the start of the given string.
str: String to trim.
String with leading white spaces removed.
trim string,clean string,trim leading whitespaces

DSCore.String.TrimTrailingWhitespace(System.String)
Removes all whitespace from the end of the given string.
str: String to trim.
String with white spaces at end removed.
trim string,clean string,trim trailing whitespaces

DSCore.String.IndexOf(System.String,System.String,System.Boolean)
Finds the zero-based index of the first occurrence of a sub-string inside a string.
Returns -1 if no index could be found.
str: A string to search in.
searchFor: Substring to search for.
ignoreCase: Whether or not comparison takes case into account.
Index of the first occurrence of the substring or -1 if not found.
index of

DSCore.String.LastIndexOf(System.String,System.String,System.Boolean)
Finds the zero-based index of the last occurrence of a sub-string inside a string.
Returns -1 if no index could be found.
str: A string to search in.
searchFor: Substring to search for.
ignoreCase: Whether comparison takes case into account.
Index of the last occurrence of the substring or -1 if not found.
last index of

DSCore.String.PadLeft(System.String,System.Int32,System.String)
Right-aligns the characters in the given string by padding them with spaces on the left,
for a specified total length.
str: String to pad.
newWidth: Total length of the string after padding.
padChars: Character to pad with, defaults to space.
Strings right-aligned by padding with leading whitespaces for a specified total length.
pad left,right align,right-align

DSCore.String.PadRight(System.String,System.Int32,System.String)
Left-aligns the characters in the given string by padding them with spaces on the right,
for a specified total length.
str: String to pad.
newWidth: Total length of the string after padding.
padChars: Character to pad with, defaults to space.
Strings left-aligned by padding with trailing whitespaces for a specified total length.
pad right,left align,left-align

DSCore.String.Center(System.String,System.Int32,System.String)
Increases the width of a string by encasing the original characters with spaces on
either side.
str: String to center.
newWidth: Total length of the string after centering.
padChars: Character to center with, defaults to space.
Strings center-aligned by padding them with leading and trailing
whitespaces for a specified total length.
center align,center-align,centered

DSCore.String.Insert(System.String,System.Int32,System.String)
Inserts a string into another string at a given index.
str: String to insert into.
index: Index to insert at.
toInsert: String to be inserted.
String with inserted substring.
insertstring,insert string

DSCore.String.Remove(System.String,System.Int32,System.Nullable{System.Int32})
Removes characters from a string.
str: String to remove characters from.
startIndex: Index at which to start removal.
count:
Amount of characters to remove, by default will remove all characters from
the given startIndex to the end of the string.
String with characters removed.