DSCore.Thread.Pause(System.Object,System.Int32)
Pauses the current evaluation thread for a given amount of time.
x: Object to pass through.
msTimeout:
Amount of time to pause the thread, in milliseconds.
Object passed through.