DSCore.Object.IsNull(System.Object)
Determines the if the given object is null.
obj: Object to test.
Whether object is null.
is null

DSCore.Object.Identity(System.Object)
Returns what is passed in, doing nothing.
obj: An object.