DSCore.Logic
Boolean logic methods.

DSCore.Logic.Xor(System.Boolean,System.Boolean)
Boolean XOR: Returns true if and only if exactly one of the inputs is true.
a: A boolean.
b: A boolean.
Boolean result.
xor,exclusive,or