DSCore.Color.ByARGB(System.Int32,System.Int32,System.Int32,System.Int32)
Construct a color by alpha, red, green, and blue components.
a: The alpha value.
r: The red value.
g: The green value.
b: The blue value.
Color.
color

DSCore.Color.Brightness(DSCore.Color)
Gets the brightness value for this color.
Brightness value for the color.

DSCore.Color.Saturation(DSCore.Color)
Gets the saturation value for this color.
Saturation value for the color.

DSCore.Color.Hue(DSCore.Color)
Gets the hue value for this color.
Hue value for the color.

DSCore.Color.Components(DSCore.Color)
Lists the components for the color in the order: alpha, red, green, blue.
Saturation value for the color.
alpha,red,green,blue

DSCore.Color.BuildColorFromRange(DSCore.Color,DSCore.Color,System.Double)
Get a color from a color gradient between a start color and an end color.
start: The starting color of the range.
end: The end color of the range.
value: The value between 0 and 1 along the range for which you would like to sample the color.
Color in the given range.
color,range,gradient

DSCore.Color.Red
Find the red component of a color, 0 to 255.
Value of the red component.

DSCore.Color.Green
Find the green component of a color, 0 to 255.
Value of the green component.

DSCore.Color.Blue
Find the blue component of a color, 0 to 255.
Value of the blue component.

DSCore.Color.Alpha
Find the alpha component of a color, 0 to 255.
Value of the alpha component.