DSCore.Math.Random(System.Double,System.Double)
Produce a random number in the range [lower_number, higher_number).
value1: One end of the range for the random number.
value2: One end of the range for the random number.
Random number in the range [lowValue, highValue).
random

DSCore.Math.RandomList(System.Int32)
Produces a list containing the given amount of random doubles
in the range of [0, 1).
amount: Amount of random numbers the result list will contain.
List of random numbers between 0 and 1.
random

DSCore.Math.Abs(System.Double)
Finds the absolute value of a number.
number: A number.
Absolute value of the number.
absolute value,magnitude

DSCore.Math.Asin(System.Double)
Finds the inverse sine, the angle whose sine is the given ratio.
ratio: The sine of the angle, a number in the range [-1, 1].
The angle whose cosine is the input ratio.
asine,arcsin

DSCore.Math.Atan(System.Double)
Finds the inverse tangent, the angle whose tangent is the given ratio.
ratio: The tangent of the angle.
The angle whose tangent is the input ratio.
atangent,arctangent

DSCore.Math.Atan2(System.Double,System.Double)
Finds the inverse tangent of quotient of two numbers. Returns the angle
whose tangent is the ratio: numerator/denominator.
numerator: The numerator of the tangent of the angle.
denominator: The denominator of the tangent of the angle.
The angle whose tangent is numerator/denominator.
atangent,arctangent

DSCore.Math.Ceiling(System.Double)
Returns the first integer greater than the number
number: Number to round up.
First integer greater than the number.
ceiling,round

DSCore.Math.Cos(System.Double)
Finds the cosine of an angle.
angle: Angle in degrees to take the cosine of.
Cosine of the angle.
cosine

DSCore.Math.Cosh(System.Double)
Finds the hyperbolic cosine of an angle (radians).
angle: An angle in radians.
Hyperbolic cosine of the angle.
hyperbolic cosine

DSCore.Math.DivRem(System.Int64,System.Int64)
Finds the remainder of dividend/divisor.
dividend: The number to be divided.
divisor: The number to be divided by.
The remainder of the division.
remainder

DSCore.Math.Floor(System.Double)
Returns the first integer smaller than the number.
number: Number to round up.
First integer greater than the number.
round

DSCore.Math.Rand
Produce a random number in the range [0, 1).
Random number in the range [0, 1).
random

DSCore.Math.Round(System.Double)
Rounds a number to the nearest integer.
number: Number to round.
Integer closest to the number.

DSCore.Math.Round(System.Double,System.Int32)
Rounds a number to the specified number of decimal places.
number: Number to round.
digits: Number of digits beyond the decimal to round to.
Rounded number.

DSCore.Math.Sign(System.Double)
Returns the sign of the number: -1, 0, or 1.
number: A number.
The sign of the number: -1, 0, or 1.

DSCore.Math.Sign(System.Int64)
Returns the sign of the number: -1, 0, or 1.
integer: A number.
The sign of the number: -1, 0, or 1.

DSCore.Math.Sin(System.Double)
Finds the sine of an angle.
angle: Angle in degrees to take the cosine of.
Sine of the angle.
sine

DSCore.Math.Tan(System.Double)
Finds the tangent of an angle.
angle: Angle in degrees to take the tangent of.
Tangent of the angle.
tangent

DSCore.Math.Tanh(System.Double)
Finds the hyperbolic tangent of an angle (radians).
angle: An angle in radians.
Hyperbolic tangent of the angle.
hyperbolic,tanh

DSCore.Math.Sum(System.Collections.Generic.IEnumerable{System.Double})
Find the sum of a series of numbers
values: The numbers to sum
The sum of the values
mass addition,massadd

DSCore.Math.Factorial(System.Int64)
Finds the factorial result of a positive integer.
number: A positive integer.
The factorial result of the integer.
!

DSCore.Math.PI
The mathematical constant Pi, 3.14159...
The constant Pi.
3.141592653589793

DSCore.Math.E
The mathematical constant e, 2.71828...
The constant e.
exp,2.718281828459045

DSCore.Math.GoldenRatio
The golden ratio, (1 + sqrt(5))/2 = 1.61803...
The golden ratio.
golden,ratio,divine,phi,tau,1.61803398875