Repository: DynamoDS/Dynamo
Catalog: src/Libraries/CoreNodeModels/Properties/Resources.*.resx
Languages: cs_cz, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# AndDescription
source: Boolean AND: Returns true only if both of the inputs are true. If either is false, returns false.
cs_cz: Booleovské AND: vrací hodnotu true, pouze pokud oba vstupy mají hodnotu true. Pokud má kterýkoli z nich hodnotu false, vrací false.
es_es: Valor booleano AND: devuelve "True" (verdadera) solo si todas las entradas son verdaderas. Si cualquiera de ellas es falsa, devuelve "False" (falsa).
fr_fr: Opérateur booléen ET: renvoie True si toutes les entrées sont vraies. Si l'une d'elles est fausse, renvoie False.
it_it: AND booleano: restituisce True solo se entrambi gli input sono true. Se uno dei due è false, restituisce False.
ja_jp: ブール演算 AND: すべての入力が True の場合にのみ True を返します。いずれかが False の場合は、False を返します。
ko_kr: 부울 AND: 모든 입력이 true인 경우에만 True를 반환합니다. 하나라도 false면 False를 반환합니다.
pl_pl: Logiczne I: zwraca wartość prawda (True), tylko jeśli wszystkie wartości wejściowe są prawdziwe. Jeżeli któraś z nich jest fałszywa, zwraca wartość fałsz (False).
pt_br: Booleano E: Retornará True somente se ambas as entradas forem verdadeiras. Se uma for falsa, retorna False.
ru_ru: Логическое И: возвращается значение True, только если оба ввода истинны. Если один из вводов является ложным, возвращается значение False.
zh_cn: 布尔 AND: 仅当所有输入内容都为 True 时才返回 True。如果其中任一为 False，则返回 False。
zh_tw: 布林 AND: 只有當所有輸入皆為 true 時，才傳回 True。如果任何一個為 false，則傳回 False。

# ApplyPortDataFuncArgToolTip
source: Result of application.
cs_cz: Výsledek aplikace
es_es: Resultado de aplicación
fr_fr: Résultat de l'application.
it_it: Risultato dell'applicazione.
ja_jp: アプリケーションの結果。
ko_kr: 응용프로그램의 결과.
pl_pl: Wynik zastosowania.
pt_br: Resultado do aplicativo.
ru_ru: Результат применения.
zh_cn: 应用程序的结果。
zh_tw: 應用程式的結果。

# ApplyPortDataFuncToolTip
source: Function to apply.
cs_cz: Funkce, kterou chcete použít.
es_es: Función que aplicar
fr_fr: Fonction à appliquer.
it_it: Funzione da applicare.
ja_jp: 適用する関数。
ko_kr: 적용할 함수.
pl_pl: Funkcja do zastosowania.
pt_br: Função para aplicar.
ru_ru: Функция для применения.
zh_cn: 要应用的函数。
zh_tw: 要套用的函數。

# BooleanDescription
source: Selection between a true and false.
cs_cz: Umožňuje výběr mezi hodnotami true a false.
es_es: Permite la selección entre "True" (verdadero) y "False" (falso).
fr_fr: Permet une sélection entre True et False
it_it: Consente la selezione tra True e False.
ja_jp: True/False の選択を有効にします
ko_kr: True와 False 간 선택을 활성화합니다
pl_pl: Umożliwia wybór między wartością prawdziwą (True) i fałszywą (False)
pt_br: Permite a seleção entre True e False
ru_ru: Возможность выбора между значениями True и False
zh_cn: 启用在“True”和“False”之间选择
zh_tw: 啟用在 True 與 False 之間選取

# ColorRangeDescription
source: Get a color given a color range.
cs_cz: Vrací barvu z daného barevného rozsahu.
es_es: Devuelve un color según un rango de colores.
fr_fr: Renvoie une couleur en fonction d'un intervalle de couleurs
it_it: Restituisce un colore in base ad un intervallo di colori specificato.
ja_jp: 特定の色域の色を返します
ko_kr: 지정된 색상 범위에서 색상을 반환합니다
pl_pl: Zwraca kolor z danego zakresu kolorów
pt_br: Retorna uma cor dada uma determinada faixa de cores
ru_ru: Возврат цвета на основе заданного диапазона цветов
zh_cn: 返回给定颜色范围中的颜色
zh_tw: 傳回給定顏色範圍的顏色

# ColorRangePortDataIndicesToolTip
source: A list of values between 0.0 and 1.0 which position the input colors along the range.
cs_cz: Seznam hodnot v rozsahu 0,0 až 1,0, což umístí vstupní barvy podél rozsahu
es_es: Lista de valores entre 0,0 y 1,0 que coloca los colores de entrada a lo largo del rango.
fr_fr: Liste de valeurs comprises entre 0.0 et 1.0 qui définissent la position des couleurs d'entrée le long de l'intervalle
it_it: Elenco di valori compresi tra 0,0 e 1.0, che posizionano i colori di input nell'intervallo
ja_jp: 0.0 から 1.0 の間の値のリスト。入力色を範囲に沿って配置します
ko_kr: 범위를 따라 입력 색상의 위치를 지정하는 0.0과 1.0 사이의 값 리스트
pl_pl: Lista wartości z przedziału od 0,0 do 1,0, które określają położenie kolorów wejściowych wzdłuż zakresu
pt_br: Lista de valores entre 0,0 e 1,0 na qual são posicionadas as cores de entrada ao longo do intervalo
ru_ru: Список значений в диапазоне от 0,0 до 1,0, обозначающих входные цвета по диапазону
zh_cn: 介于 0.0 和 1.0 之间的值列表，这些值沿范围定位输入颜色
zh_tw: 介於 0.0 到 1.0 之間的值清單，這些值會沿著範圍定位輸入顏色

# ColorRangePortDataResultToolTip
source: The selected colors.
cs_cz: Vybrané barvy
es_es: Colores seleccionados
fr_fr: Couleurs sélectionnées
it_it: Colori selezionati
ja_jp: 選択した色
ko_kr: 선택된 색상
pl_pl: Wybrane kolory
pt_br: Cores selecionadas
ru_ru: Выбранные цвета
zh_cn: 选定的颜色
zh_tw: 選取的顏色

# ColorRangePortDataColorsToolTip
source: A list of colors to include in the range.
cs_cz: Seznam barev, které mají být zahrnuty do rozsahu
es_es: Lista de colores que incluir en el rango.
fr_fr: Liste de couleurs à inclure dans l'intervalle
it_it: Elenco di colori da includere nell'intervallo
ja_jp: 範囲に含める色のリスト
ko_kr: 범위에 포함할 색상 리스트
pl_pl: Lista kolorów do uwzględnienia w zakresie
pt_br: Lista de cores para incluir no intervalo
ru_ru: Список цветов для включения в диапазон
zh_cn: 要包含在范围内的颜色列表
zh_tw: 要包括在範圍內的顏色清單

# ColorRangePortDataValueToolTip
source: A list of values between 0.0 and 1.0. These values are used to look up the color within the range.
cs_cz: Seznam hodnot v rozmezí 0,0 až 1,0. Tyto hodnoty definují barvy, které jsou vybrány podél rozsahu barev k vytvoření seznamu barev.
es_es: Una lista de valores entre 0,0 y 1,0. Estos valores definen los colores seleccionados a lo largo de la gama de colores para crear la lista de colores.
fr_fr: Liste de valeurs comprises entre 0.0 et 1.0. Ces valeurs définissent les couleurs sélectionnées le long de l'intervalle de couleurs pour créer la liste de couleurs.
it_it: Elenco di valori compresi tra 0,0 e 1,0. Questi valori definiscono i colori scelti nell'intervallo corrispondente per creare l'elenco di colori.
ja_jp: 0.0 から 1.0 の間の値のリスト。これらの値で、色の範囲に沿って選択される色を定義して、色のリストを作成します。
ko_kr: 0.0과 1.0 사이의 값 리스트입니다. 이러한 값은 색상 범위 내에서 선택된 색상을 정의하여 색상 리스트를 만듭니다.
pl_pl: Lista wartości z przedziału od 0,0 do 1,0. Wartości te definiują kolory wybierane z przedziału kolorów w celu utworzenia listy kolorów.
pt_br: Lista de valores entre 0,0 e 1,0. Esses valores definem as cores que são escolhidas ao longo do intervalo de cores para criar a lista de cores.
ru_ru: Список значений в диапазоне от 0,0 до 1,0. Эти значения определяют цвета, которые выбираются в диапазоне цветов для создания списка цветов.
zh_cn: 介于 0.0 和 1.0 之间的值列表。这些值定义沿颜色范围选择的颜色以创建颜色列表。
zh_tw: 介於 0.0 到 1.0 之間的值清單。這些值定義沿著顏色範圍點選的顏色以建立顏色清單。

# CombinatorPortDataCombToolTip
source: Combinator
cs_cz: Funkce, která se má použít jako kombinátor
es_es: Función que se utilizará como combinador
fr_fr: Fonction à utiliser en tant que combinateur
it_it: Funzione da utilizzare come combinatore
ja_jp: コンビネータとして使用する関数
ko_kr: 연결자로 사용할 함수
pl_pl: Funkcja do użycia jako kombinator
pt_br: Função para usar como combinador
ru_ru: Функция для использования в качестве комбинатора
zh_cn: 要用作连结符的函数
zh_tw: 要用作結合器的函數

# CombinatorPortDataResultToolTip
source: Combined lists
cs_cz: Kombinované seznamy
es_es: Listas combinadas
fr_fr: Listes combinées
it_it: Elenchi combinati
ja_jp: 結合されたリスト
ko_kr: 결합된 리스트
pl_pl: Połączone listy
pt_br: Listas combinadas
ru_ru: Объединенные списки
zh_cn: 组合列表
zh_tw: 合併的清單

# ComposePortDataFunc0ToolTip
source: Function #0
cs_cz: Funkce č. 0
es_es: Función núm.0
fr_fr: Fonction 0
it_it: Funzione 0
ja_jp: 関数 #0
ko_kr: 함수 #0
pl_pl: Funkcja #0
pt_br: Função nº 0
ru_ru: Функция #0
zh_cn: 函数 #0
zh_tw: 函數 #0

# ComposePortDataFunc1ToolTip
source: Function #1
cs_cz: Funkce č. 1
es_es: Función núm.1
fr_fr: Fonction 1
it_it: Funzione 1
ja_jp: 関数 #1
ko_kr: 함수 #1
pl_pl: Funkcja #1
pt_br: Função nº 1
ru_ru: Функция #1
zh_cn: 函数 #1
zh_tw: 函數 #1

# ComposePortDataResultToolTip
source: Composed function.
cs_cz: Vytvořená funkce
es_es: Función compuesta
fr_fr: Fonction composée.
it_it: Funzione composta.
ja_jp: 構成された関数。
ko_kr: 구성된 함수.
pl_pl: Funkcja złożona.
pt_br: Função composta.
ru_ru: Создана функция.
zh_cn: 复合函数。
zh_tw: 構成的函數。

# CreateListPortDataIndex0ToolTip
source: Item Index #0
cs_cz: Index položky č. 0
es_es: Índice de elemento núm.0
fr_fr: Index de l'élément 0
it_it: Indice elemento 0
ja_jp: 項目インデックス番号 0
ko_kr: 항목 인덱스 #0
pl_pl: Indeks elementu #0
pt_br: Índice do item nº 0
ru_ru: Индекс элемента #0
zh_cn: 项索引 #0
zh_tw: 項目索引 #0

# CreateListPortDataResultToolTip
source: A list
cs_cz: Seznam (typ: var[]..[])
es_es: Una lista (tipo: var[]..[])
fr_fr: Liste (type: var[]..[])
it_it: Elenco (tipo: var[]..[])
ja_jp: リスト(タイプ: var[]..[])
ko_kr: 리스트(유형: var[]..[])
pl_pl: Lista (typ: var[]..[])
pt_br: Uma lista (tipo: var[]..[])
ru_ru: Список (тип: var[]..[])
zh_cn: 列表(类型: var[]..[])
zh_tw: 清單 (類型: var[]..[])

# DirectoryFromPathDescription
source: Creates a directory object from a path.
cs_cz: Vytvoří objekt adresáře z dané cesty.
es_es: Crea un objeto de directorio a partir de la ruta especificada.
fr_fr: Crée un objet de répertoire à partir du chemin d'accès donné
it_it: Crea un oggetto directory dal percorso dato.
ja_jp: 特定のパスからフォルダ オブジェクトを作成します
ko_kr: 지정된 경로에서 디렉토리 객체를 작성합니다
pl_pl: Tworzy obiekt katalogu z określonej ścieżki
pt_br: Cria um objeto de diretório com base no caminho fornecido
ru_ru: Создание объекта каталога на основе указанного пути
zh_cn: 从给定路径创建目录对象
zh_tw: 從給定路徑建立目錄物件

# DirectoryNodeDescription
source: Allows you to select a directory on the system to get its path
cs_cz: Umožňuje vybrat adresář v systému a vrací jeho cestu.
es_es: Permite seleccionar un directorio del sistema y devuelve su ruta.
fr_fr: Permet de sélectionner un répertoire sur le système pour renvoyer son chemin d'accès
it_it: Consente di selezionare una directory del sistema e restituisce il relativo percorso.
ja_jp: システム上の任意のフォルダを選択して、そのパスを返すことができます
ko_kr: 시스템에서 디렉토리를 선택하여 해당 경로를 반환할 수 있습니다
pl_pl: Umożliwia wybranie katalogu w systemie i zwraca jego ścieżkę
pt_br: Permite selecionar um diretório no sistema e retornar seu caminho
ru_ru: Возможность выбрать каталог в системе и возврат пути к нему
zh_cn: 允许您选择系统上的目录并返回其路径
zh_tw: 可讓您選取系統上的目錄，並傳回其路徑

# DirectoryObjectNodeDescription
source: Creates a directory object from a path
cs_cz: Vytvoří objekt adresáře z dané cesty.
es_es: Crea un objeto de directorio a partir de la ruta especificada.
fr_fr: Crée un objet de répertoire à partir du chemin d'accès donné
it_it: Crea un oggetto directory dal percorso dato.
ja_jp: 特定のパスからフォルダ オブジェクトを作成します
ko_kr: 지정된 경로에서 디렉토리 객체를 작성합니다
pl_pl: Tworzy obiekt katalogu z określonej ścieżki
pt_br: Cria um objeto de diretório com base no caminho fornecido
ru_ru: Создание объекта каталога на основе указанного пути
zh_cn: 从给定路径创建目录对象
zh_tw: 從給定路徑建立目錄物件

# DirectoryObjectPortDataPathToolTip
source: Path to the directory.
cs_cz: Cesta k adresáři (typ: řetězec)
es_es: Ruta al directorio (tipo: cadena)
fr_fr: Chemin d'accès au répertoire (type: chaîne)
it_it: Percorso della directory (tipo: stringa)
ja_jp: フォルダへのパス(タイプ: 文字列)
ko_kr: 디렉토리 경로(유형: 문자열)
pl_pl: Ścieżka do katalogu (typ: string)
pt_br: O caminho para o diretório (tipo: string)
ru_ru: Путь к папке (тип: строка)
zh_cn: 目录路径(类型: 字符串)
zh_tw: 目錄的路徑 (類型: string)

# DirectoryObjectPortDataResultToolTip
source: Directory object.
cs_cz: Objekt adresáře
es_es: Objeto de directorio
fr_fr: Objet de répertoire.
it_it: Oggetto directory.
ja_jp: フォルダ オブジェクト。
ko_kr: 디렉토리 객체.
pl_pl: Obiekt katalogu.
pt_br: O objeto do diretório.
ru_ru: Папка объекта.
zh_cn: 目录对象。
zh_tw: 目錄物件。

# DirectoryPathDescription
source: Allows you to select a directory on the system to get its path.
cs_cz: Umožňuje vybrat adresář v systému a vrací jeho cestu.
es_es: Permite seleccionar un directorio del sistema y devuelve su ruta.
fr_fr: Permet de sélectionner un répertoire sur le système pour renvoyer son chemin d'accès
it_it: Consente di selezionare una directory del sistema e restituisce il relativo percorso.
ja_jp: システム上の任意のフォルダを選択して、そのパスを返すことができます
ko_kr: 시스템에서 디렉토리를 선택하여 해당 경로를 반환할 수 있습니다
pl_pl: Umożliwia wybranie katalogu w systemie i zwraca jego ścieżkę
pt_br: Permite selecionar um diretório no sistema e retornar seu caminho
ru_ru: Возможность выбрать каталог в системе и возврат пути к нему
zh_cn: 允许您选择系统上的目录并返回其路径
zh_tw: 可讓您選取系統上的目錄，並傳回其路徑

# DoubleInputNodeDescription
source: Creates a number.
cs_cz: Vytvoří číslo.
es_es: Crea un número.
fr_fr: Crée un nombre
it_it: Crea un numero.
ja_jp: 数値を作成します。
ko_kr: 숫자를 만듭니다.
pl_pl: Tworzy liczbę
pt_br: Cria um número
ru_ru: Создание числа.
zh_cn: 创建一个数字
zh_tw: 建立數字

# DoubleSliderDescription
source: A slider that produces double values.
cs_cz: Vytváří číselné hodnoty.
es_es: Genera valores numéricos.
fr_fr: Génère des valeurs numériques
it_it: Genera valori numerici.
ja_jp: 数値を生成します
ko_kr: 숫자 값을 생성합니다
pl_pl: Tworzy wartości liczbowe
pt_br: Produz valores numéricos
ru_ru: Создание числовых значений
zh_cn: 生成数值
zh_tw: 產生數值

# DoubleSliderNodeDescription
source: A slider that produces numeric values.
cs_cz: Vytváří číselné hodnoty.
es_es: Genera valores numéricos.
fr_fr: Génère des valeurs numériques
it_it: Genera valori numerici.
ja_jp: 数値を生成します
ko_kr: 숫자 값을 생성합니다
pl_pl: Tworzy wartości liczbowe
pt_br: Produz valores numéricos
ru_ru: Создание числовых значений
zh_cn: 生成数值
zh_tw: 產生數值

# DropDownPortDataResultToolTip
source: The selected {0}
cs_cz: Vybrané {0}
es_es: {0} seleccionado
fr_fr: {0} sélectionné
it_it: Elemento {0} selezionato
ja_jp: 選択した {0}
ko_kr: 선택된 {0}
pl_pl: Wybrany {0}
pt_br: O {0} selecionado
ru_ru: Выбрано {0}
zh_cn: 选定的 {0}
zh_tw: 選取的 {0}

# FileFromPathDescription
source: Creates a file object from a path.
cs_cz: Vytvoří objekt souboru z dané cesty.
es_es: Crea un objeto de archivo a partir de la ruta especificada.
fr_fr: Crée un objet de fichier à partir du chemin d'accès donné
it_it: Crea un oggetto file dal percorso dato.
ja_jp: 特定のパスからファイル オブジェクトを作成します
ko_kr: 지정된 경로에서 파일 객체를 작성합니다
pl_pl: Tworzy obiekt pliku z określonej ścieżki
pt_br: Cria um objeto de arquivo com base no caminho fornecido
ru_ru: Создание объекта файла на основе указанного пути
zh_cn: 从给定路径创建文件对象
zh_tw: 從給定路徑建立檔案物件

# FilenameNodeDescription
source: Allows you to select a file on the system to get its filename
cs_cz: Umožňuje vybrat soubor v systému, jehož název chcete získat.
es_es: Permite seleccionar un archivo del sistema para obtener su nombre de archivo
fr_fr: Vous permet de sélectionner un fichier sur le système de façon à obtenir son nom de fichier
it_it: Consente di selezionare un file nel sistema per ottenere il relativo nome file
ja_jp: システム上の任意のファイルを選択して、そのファイル名を取得することができます。
ko_kr: 시스템에서 파일을 선택하여 파일 이름을 가져올 수 있습니다
pl_pl: Umożliwia wybranie pliku w systemie, aby pobrać jego nazwę pliku
pt_br: Permite que você selecione um arquivo no sistema para obter seu nome de arquivo
ru_ru: Позволяет выбрать файл в системе и получить его имя
zh_cn: 允许您选择系统上的文件以获得其文件名
zh_tw: 可讓您在系統上選取一個檔案，以取得其檔名

# FileObjectNodeDescription
source: Creates a file object from a path.
cs_cz: Vytvoří objekt souboru z dané cesty.
es_es: Crea un objeto de archivo a partir de la ruta especificada.
fr_fr: Crée un objet de fichier à partir du chemin d'accès donné
it_it: Crea un oggetto file dal percorso dato.
ja_jp: 特定のパスからファイル オブジェクトを作成します
ko_kr: 지정된 경로에서 파일 객체를 작성합니다
pl_pl: Tworzy obiekt pliku z określonej ścieżki
pt_br: Cria um objeto de arquivo com base no caminho fornecido
ru_ru: Создание объекта файла на основе указанного пути
zh_cn: 从给定路径创建文件对象
zh_tw: 從給定路徑建立檔案物件

# FileObjectPortDataPathToolTip
source: Path to the file.
cs_cz: Cesta k souboru.
es_es: Ruta al archivo.
fr_fr: Chemin d'accès au fichier.
it_it: Percorso del file come stringa.
ja_jp: ファイルへのパス(文字列)。
ko_kr: 파일 경로를 문자열로.
pl_pl: Ścieżka do pliku.
pt_br: Caminho para o arquivo.
ru_ru: Путь к файлу в виде строки.
zh_cn: 文件路径。
zh_tw: 檔案路徑。

# FileObjectPortDataResultToolTip
source: File object
cs_cz: Souborový objekt
es_es: Objeto de archivo
fr_fr: Objet de fichier
it_it: Oggetto file
ja_jp: ファイル オブジェクト
ko_kr: 파일 객체
pl_pl: Obiekt pliku
pt_br: Objeto de arquivo
ru_ru: Файловый объект
zh_cn: 文件对象
zh_tw: 檔案物件

# FilePathDescription
source: Allows you to select a file on the system to get its filename.
cs_cz: Umožňuje vybrat soubor v systému a vrací cestu k tomuto souboru.
es_es: Permite seleccionar un archivo del sistema y devuelve su ruta de archivo.
fr_fr: Permet de sélectionner un fichier dans le système et renvoie son chemin
it_it: Consente di selezionare un file nel sistema e restituisce il relativo percorso file.
ja_jp: システム上の任意のファイルを選択して、そのファイル パスを返すことができます
ko_kr: 시스템에서 파일을 선택하여 해당 파일 경로를 반환할 수 있습니다
pl_pl: Umożliwia wybranie pliku w systemie i zwraca jego ścieżkę
pt_br: Permite selecionar um arquivo no sistema e retornar seu caminho
ru_ru: Возможность выбрать файл в системе и возврат пути к нему
zh_cn: 允许选择系统上某个文件以返回其文件路径
zh_tw: 可讓您選取系統上的檔案，並傳回其檔案路徑

# FilterPortDataConditionToolTip
source: Predicate used to determine if an element is filtered in or out.
cs_cz: Funkce Filtrovat, která se používá k určení, zda je prvek filtrován dovnitř nebo ven
es_es: La función de filtro se utiliza para determinar si un elemento se filtra o no
fr_fr: Fonction de filtre utilisée pour déterminer si un élément est filtré ou non
it_it: Funzione di filtro utilizzata per determinare se un elemento viene incluso o escluso da un filtro
ja_jp: 要素をフィルタで含めるか除外するかを判断するために使用するフィルタ関数
ko_kr: 요소가 필터링을 통해 포함 또는 제외되는지 확인하기 위해 사용되는 필터링 함수
pl_pl: Funkcja filtrująca służąca do ustalenia, czy element jest odfiltrowywany, czy nie
pt_br: Função de filtro usada para determinar se um elemento é ou não filtrado
ru_ru: Функция фильтрации, используемая для определения того, включается или исключается элемент путем фильтрации
zh_cn: 用于确定是否要滤除某个图元的过滤函数
zh_tw: 用來決定元素是否已被篩選的篩選函數

# FilterPortDataListToolTip
source: List to filter
cs_cz: Seznam k filtrování
es_es: Lista que filtrar
fr_fr: Liste à filtrer
it_it: Elenco al quale applicare il filtro
ja_jp: フィルタするリスト
ko_kr: 필터링할 리스트
pl_pl: Lista do filtrowania
pt_br: Lista a filtrar
ru_ru: Список, который требуется отфильтровать
zh_cn: 要过滤的列表
zh_tw: 要篩選的清單

# FilterPortDataResultInToolTip
source: List containing all elements "x" where condition(x) = True
cs_cz: Seznam, který obsahuje všechny prvky „x “, kde podmínka(x) = True
es_es: Lista que contiene todos los elementos "x" donde condition(x) = True
fr_fr: Liste contenant tous les éléments "X", où condition(x) = True
it_it: Elenco contenente tutti gli elementi X per cui condition(x) = true
ja_jp: 条件(x)が True となる、すべての要素 "x" を含むリスト
ko_kr: condition(x) = True인 모든 요소 "x"가 포함된 리스트
pl_pl: Lista zawierająca wszystkie elementy „x”, gdzie warunek(x) = prawda
pt_br: Lista que contém todos os elementos "x", onde a condição(x) = Verdadeiro
ru_ru: Список, содержащий все элементы «x», где условие(x) = True
zh_cn: 列表包含所有元素 "X"，条件 (X)= True
zh_tw: 包含所有元素 "X" 的清單，其中 condition(x) = True

# FilterPortDataResultOutToolTip
source: List containing all elements "x" where condition(x) = False
cs_cz: Seznam, který obsahuje všechny prvky „x “, kde podmínka(x) = False
es_es: Lista que contiene todos los elementos "x" donde condition(x) = False
fr_fr: Liste contenant tous les éléments "x" où condition(x) = False
it_it: Elenco contenente tutti gli elementi X per cui condition(x) = False
ja_jp: 条件(x)が False となる、すべての要素 "x" を含むリスト
ko_kr: condition(x) = False인 모든 요소 "x"가 포함된 리스트
pl_pl: Lista zawierająca wszystkie elementy „x”, gdzie warunek(x) = fałsz
pt_br: Lista que contém todos os elementos "x", onde a condição(x) = Falso
ru_ru: Список, содержащий все элементы «x», где условие(x) = False
zh_cn: 列表包含所有元素 "X"，条件 (X)= False
zh_tw: 包含所有元素 "X" 的清單，其中 condition(x) = False

# FormulaDescription
source: Evaluates mathematical formulas. Uses NCalc: http://ncalc.codeplex.com/
cs_cz: Vyhodnocuje matematické vzorce pomocí nástroje NCalc
es_es: Evalúa fórmulas matemáticas mediante NCalc.
fr_fr: Évalue des formules mathématiques avec NCalc
it_it: Valuta formule matematiche utilizzando NCalc.
ja_jp: NCalc を使用して数学式を評価します
ko_kr: NCalc를 이용하여 수학 공식을 계산합니다
pl_pl: Oblicza wzory matematyczne za pomocą NCalc
pt_br: Avalia fórmulas matemáticas usando NCalc
ru_ru: Оценка математических формул с использованием NCalc
zh_cn: 使用 NCalc 计算数学公式
zh_tw: 使用 NCalc 計算數學公式

# FormulaPortDataResultToolTip
source: Result of math computation
cs_cz: Výsledek ze vzorce
es_es: Resultado de la fórmula
fr_fr: Résultat de la formule
it_it: Risultato della formula
ja_jp: 計算式の結果
ko_kr: 수식의 결과
pl_pl: Wynik formuły
pt_br: Resultado da fórmula
ru_ru: Результат расчета по формуле
zh_cn: 公式的结果
zh_tw: 公式的結果

# FromArrayPortDataArrayToolTip
source: The array of object to be serialized
cs_cz: Pole objektů, které mají být serializovány
es_es: Matriz de objeto que serializar
fr_fr: Réseau d'objet à sérialiser
it_it: Matrice di oggetti da serializzare
ja_jp: シリアル化するオブジェクトの配列
ko_kr: 직렬화할 객체의 배열
pl_pl: Szyk obiektu, który ma być przekształcony do postaci szeregowej
pt_br: A matriz do objeto para ser serializado
ru_ru: Массив объекта для индексации
zh_cn: 要系列化的对象数组
zh_tw: 要序列化的物件陣列

# FromArrayPortDataResultToolTip
source: String representation of the array
cs_cz: Řetězcová reprezentace pole
es_es: Representación de cadena de la matriz
fr_fr: Représentation sous forme de chaîne du réseau
it_it: Rappresentazione sotto forma di stringa della matrice
ja_jp: 配列の文字列表現
ko_kr: 배열의 문자열 표현
pl_pl: Szyk przedstawiony jako ciąg znaków
pt_br: Representação da sequência de caracteres da matriz
ru_ru: Строчное представление массива
zh_cn: 数组的字符串表示
zh_tw: 陣列的字串表現法

# FromObjectPortDataObjToolTip
source: Object to be serialized
cs_cz: Objekt, který má být serializován
es_es: Objeto que serializar
fr_fr: Objet à sérialiser
it_it: Oggetto da serializzare
ja_jp: シリアル化するオブジェクト
ko_kr: 직렬화할 객체
pl_pl: Obiekt, który ma być przekształcony w postać szeregową
pt_br: O objeto a ser serializado
ru_ru: Объект индексации
zh_cn: 要系列化的对象
zh_tw: 要序列化的物件

# FromObjectPortDataResultToolTip
source: String representation of the object
cs_cz: Řetězcová reprezentace objektu
es_es: Representación de cadena del objeto
fr_fr: Représentation sous forme de chaîne de l'objet
it_it: Rappresentazione stringa dell'oggetto
ja_jp: オブジェクトの文字列表現
ko_kr: 객체의 문자열 표현
pl_pl: Obiekt przedstawiony jako ciąg znaków
pt_br: Representação da sequência de caracteres do objeto
ru_ru: Строчное представление объекта
zh_cn: 对象的字符串表示
zh_tw: 物件的字串表現法

# FunctionApplyDescription
source: Applies a function to arguments.
cs_cz: Vrací výsledek funkce se zadanými argumenty.
es_es: Devuelve el resultado de una función con los argumentos especificados.
fr_fr: Renvoie le résultat d'une fonction avec les arguments donnés
it_it: Restituisce il risultato di una funzione con gli argomenti forniti.
ja_jp: 指定した引数での関数の結果を返します
ko_kr: 지정된 인수가 있는 함수의 결과를 반환합니다
pl_pl: Zwraca wynik funkcji z podanymi argumentami
pt_br: Retorna o resultado de uma função com os argumentos fornecidos
ru_ru: Возврат результата функции с заданными аргументами
zh_cn: 使用给定的参数返回函数的结果
zh_tw: 傳回函數使用給定引數的結果

# FunctionComposeDescription
source: Compose multiple functions.
cs_cz: Vrací jednu funkci z více funkcí
es_es: Devuelve una única función a partir de varias funciones.
fr_fr: Renvoie une seule fonction à partir de plusieurs fonctions
it_it: Restituisce una funzione singola da più funzioni.
ja_jp: 複数の関数から単一の関数を返します
ko_kr: 여러 함수에서 단일 함수를 반환합니다
pl_pl: Zwraca pojedynczą funkcję z wielu funkcji
pt_br: Retorna uma única função de múltiplas funções
ru_ru: Возврат одной функции из нескольких
zh_cn: 从多个函数返回单个函数
zh_tw: 從多個函數傳回一個函數

# IfDescription
source: Conditional statement
cs_cz: Podmíněný výraz
es_es: Sentencia condicional
fr_fr: Instruction conditionnelle
it_it: Istruzione condizionale
ja_jp: 条件ステートメント
ko_kr: 조건문
pl_pl: Instrukcja warunkowa
pt_br: Declaração condicional
ru_ru: Условное выражение
zh_cn: 条件语句
zh_tw: 條件陳述式
