Repository: DynamoDS/Dynamo
Catalog: src/Libraries/CoreNodeModels/Properties/Resources.*.resx
Languages: cs_cz, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# ReplacePortDataConditionToolTip
source: Predicate used to determine if it should be replaced.
cs_cz: Funkce Nahradit, která se používá k určení, zda by měl být objekt nahrazen
es_es: Función de sustitución utilizada para determinar si un objeto debe reemplazarse.
fr_fr: Fonction de remplacement utilisée pour déterminer si un objet doit être remplacé
it_it: Funzione di sostituzione utilizzata per determinare se un oggetto deve essere sostituito
ja_jp: オブジェクトを置換するかどうかを判断するために使用する置換関数
ko_kr: 대체해야 하는지 확인하기 위해 사용되는 대체 함수
pl_pl: Funkcja zamiany służąca do ustalenia, czy obiekt powinien zostać zamieniony
pt_br: Função de substituição usada para determinar se um objeto deve ser substituído
ru_ru: Функция замены, используемая для определения того, следует ли заменить объект
zh_cn: 用于确定是否应替换某个对象的替换函数
zh_tw: 用來決定是否應取代某個物件的取代函數。

# ReplacePortDataItemToolTip
source: Item to potentially be replaced
cs_cz: Položka, které může být nahrazena.
es_es: Elemento que potencialmente se puede reemplazar
fr_fr: Elément pouvant requérir un remplacement
it_it: Elemento da sostituire potenzialmente
ja_jp: 置き換えられる可能性のある項目
ko_kr: 잠재적으로 대체될 항목
pl_pl: Element, który może być zastąpiony
pt_br: Item a ser potencialmente substituído
ru_ru: Элемент, который, возможно, потребуется заменить
zh_cn: 可能要替换的项
zh_tw: 可能取代的項目

# ReplacePortDataReplaceWithToolTip
source: Object to replace with
cs_cz: Objekt, který chcete nahradit
es_es: Objeto por el que reemplazar
fr_fr: Objet de remplacement
it_it: Oggetto sostitutivo
ja_jp: 置き換えるオブジェクト
ko_kr: 대체할 객체
pl_pl: Obiekt, który ma zastąpić dany element
pt_br: O objeto pelo qual substituir
ru_ru: Объект на замену
zh_cn: 用以替换的对象
zh_tw: 要取代為的物件

# ReplacePortDataResultToolTip
source: If condition(item) = True, then "replaceWith" is returned. Otherwise "item" is returned unaltered.
cs_cz: Položka nebo seznam položek, kde byla podmínka použita k nahrazení danou položkou v objektu replaceWith
es_es: Elemento o lista de elementos en los que se ha utilizado la condición para reemplazar por el elemento especificado en "replaceWith".
fr_fr: Élément ou liste d'éléments où la condition a été utilisée pour le remplacement par l'élément spécifié dans "replaceWith"
it_it: Elemento o elenco di elementi in cui la condizione è stata utilizzata per essere sostituita con l'elemento specificato in "replaceWith"
ja_jp: 条件を使用して "replaceWith" で指定された項目で置き換えた項目または項目のリスト
ko_kr: "replaceWith"에 지정된 항목으로 대체하기 위해 조건이 사용된 경우의 항목 또는 항목 리스트
pl_pl: Element lub lista elementów, w przypadku których zastosowano warunek w celu zamiany na element podany jako „replaceWith”
pt_br: Item ou lista de itens em que foi usada uma condição para substituir por um item determinado em “replaceWith”
ru_ru: Элемент или список элементов, в котором использовалось условие для замены на элемент, указанный в свойстве replaceWith
zh_cn: 满足条件，可用于将其替换为“replaceWith”中给定项的项目或项目列表
zh_tw: 條件是用來取代為「replaceWith」中給定項目的項目或項目清單

# ScanPortDataReductorToolTip
source: Reductor Function: accepts one item from each list being reduced, and the current accumulated value, result is the new accumulated value.
cs_cz: Funkce reduktoru: přijímá jednu položku z každého seznamu, který je redukován, a aktuální nahromaděnou hodnotu. Výsledkem je nová nahromaděná hodnota.
es_es: Función de reductor: acepta un elemento en cada lista que se reduce y el valor actual acumulado, el resultado es el nuevo valor acumulado
fr_fr: Fonction de réducteur: accepte la réduction d'un élément de chaque liste, et la valeur cumulée actuelle, le résultat est la nouvelle valeur accumulée.
it_it: Funzione di riduzione: accetta un elemento da ogni elenco in corso di riduzione e il valore accumulato corrente; il risultato rappresenta il nuovo valore accumulato.
ja_jp: Reductor 関数: 削減する各リストから項目を 1 つ受け取り、現在の累積値を使用して、新しい累積値を算出します。
ko_kr: Reductor 함수: 줄이고 있는 각 리스트에서 하나의 항목과 현재 누적된 값을 허용하며, 결과는 새로 누적된 값입니다.
pl_pl: Funkcja reduktora: przyjmuje jeden element z każdej redukowanej listy oraz bieżącą skumulowaną wartość, wynik jest nową zsumowaną wartością.
pt_br: Função Redutor: aceita um item de cada lista que está sendo reduzida e o valor atual acumulado. O resultado é o novo valor acumulado.
ru_ru: Функция «Уменьшитель»: берется один элемент из каждого списка, который требуется уменьшить, и текущее суммарное значение. В результате получается новое суммарное значение.
zh_cn: Reductor 函数: 从缩减的每个列表接受一项，加上当前累积值，结果是新的累积值。
zh_tw: Reductor 函數：從每一個清單中接受一個正在減少的項目，以及目前的累積值，結果是新的累積值。

# ScanPortDataResultToolTip
source: Scanned lists
cs_cz: Naskenované seznamy (typ: var[]..[])
es_es: Listas examinadas (tipo: var[]..[])
fr_fr: Listes analysées (type: var[]..[])
it_it: Elenchi analizzati (tipo: var[]..[])
ja_jp: スキャンされたリスト(タイプ: var[]..[])
ko_kr: 스캔된 리스트(유형: var[]..[])
pl_pl: Zeskanowane listy (typ: var[]..[])
pt_br: Listas digitalizadas (tipo: var[]..[])
ru_ru: Отсканированные списки (тип: var[]..[])
zh_cn: 扫描的列表(类型: var[]..[])
zh_tw: 掃瞄的清單 (類型: var[]..[])

# ScanPortDataSeedToolTip
source: Starting accumulated value, to be passed into the first call to the Reductor function.
cs_cz: Počáteční nahromaděná hodnota, která má být předána do prvního volání funkce reduktoru.
es_es: Iniciando valor acumulado, se transferirá a la primera llamada de la función Reductor
fr_fr: Valeur accumulée de départ, qui sera transférée dans le premier appel à la fonction Reductor.
it_it: Valore accumulato iniziale da passare alla prima chiamata alla funzione di riduzione.
ja_jp: 開始累積値。Reductor 関数の最初の呼び出しに渡されます。
ko_kr: Reductor 함수의 첫 번째 호출에 전달될 시작 누적 값.
pl_pl: Początkowa zsumowana wartość, która ma być przekazana do pierwszego wywołania funkcji reduktora.
pt_br: Iniciando o valor acumulado, a ser transferido para a primeira chamada da função Redutor.
ru_ru: Начальное суммарное значение, которое будет передано при первом вызове функции «Уменьшитель».
zh_cn: 起始累积值，将传递到 Reductor 函数的首次调用。
zh_tw: 起始累積值，要傳遞到 Reductor 函數的第一個呼叫。

# ScopeIfDescription
source: Scoped If statement
cs_cz: Vrátí hodnotu výsledku vstupu True nebo False podle toho, na co je booleovská hodnota u testovacího vstupu přepnuta. Podporuje rekurzi, která vyžaduje, aby byla spuštěna pouze jedna větev. Je velmi důležité, aby byly větve vzájemně izolované a nemohly mezi sebou interagovat.
es_es: Devuelve el resultado de la entrada "True" (verdadero) o "False" (falso) según el valor booleano que se alterne en la entrada de prueba. Admite la recursividad que requiere que solo se ejecute una ramificación. Es fundamental que las ramificaciones "True" (verdadero) y "False" (false) estén aisladas y no interactúen entre sí.
fr_fr: Renvoie le résultat de l'entrée True ou False selon que la valeur booléenne est activée dans l'entrée du test. Prend en charge la récursion qui exige l'exécution d'une seule branche. Il est absolument essentiel que les branches True et False soient isolées et n'interagissent pas entre elles.
it_it: Restituisce il risultato dell'input True o False a seconda che il valore booleano sia stato attivato/disattivato nell'input del test. Supporta la ricorsione che richiede l'esecuzione di un solo ramo. È essenziale che entrambi i rami True e False siano isolati e non interagiscano tra di loro.
ja_jp: テスト入力でどのブール値を切り替えるかに応じて、True または False のいずれかの入力の結果を返します。単一の分岐のみの実行を必要とする反復処理をサポートします。True の分岐と False の分岐が分離されており、相互に作用しないことが重要です。
ko_kr: 테스트 입력에서 전환되는 부울 값에 따라 True 또는 False 입력의 결과를 반환합니다. 하나의 분기만 실행되도록 요구하는 재귀를 지원합니다. True 및 False 브랜치 모두 분리되고 서로와 상호 작용하지 않아야 합니다.
pl_pl: Zwraca wynik wejścia true lub false w zależności od tego, jaka wartość logiczna jest przełączana na wejściu testu. Obsługuje rekursję, co wymaga, aby tylko jedna gałąź była wykonywana. Obie gałęzie, true i false, muszą być bezwzględnie odizolowane i nie mogą wchodzić ze sobą w interakcje.
pt_br: Retorna o resultado da entrada Verdadeiro ou Falso, dependendo de qual valor booleano é alternado na entrada de teste. Suporta a recursão, que requer que somente um único ramo seja executado. É muito importante que ambos os ramos Verdadeiro e Falso estejam isolados e que não interajam entre si.
ru_ru: Возврат результата для входных данных со значением True или False в зависимости от того, какое логическое значение использовалось в тестовых входных данных. Поддержка рекурсии, которая предусматривает выполнение только одного ответвления. Крайне важно, чтобы ответвления True и False были изолированы и не взаимодействовали друг с другом.
zh_cn: 返回 True 或 False 输入的结果，具体取决于在测试输入中切换的布尔值。支持只需要执行一个分支的递归。至关重要的是，True 和 False 分支保持隔离，并且不会相互交互！
zh_tw: 根據測試輸入中觸發的布林值，傳回 True 或 False 輸入的結果。支援只需執行單一分支的遞迴。關鍵在於，True 與 False 兩個分支都必須獨立，而且不能彼此互動！

# SelectionPortDataResultToolTip
source: The selected elements.
cs_cz: Vybrané prvky.
es_es: Los elementos seleccionados
fr_fr: Eléments sélectionnés.
it_it: Elementi selezionati.
ja_jp: 選択した要素。
ko_kr: 선택한 요소.
pl_pl: Wybrane elementy.
pt_br: Os elementos selecionados.
ru_ru: Выбранные элементы.
zh_cn: 选定的元素。
zh_tw: 選取的元素。

# StringfromArrayDescription
source: Convert an array to a string representation.
cs_cz: Converts an array to a string representation
es_es: Converts an array to a string representation
fr_fr: Converts an array to a string representation
it_it: Converte una matrice in una rappresentazione stringa.
ja_jp: Converts an array to a string representation
ko_kr: Converts an array to a string representation
pl_pl: Converts an array to a string representation
pt_br: Converts an array to a string representation
ru_ru: Преобразование массива в строчное представление
zh_cn: Converts an array to a string representation
zh_tw: Converts an array to a string representation

# StringfromObjectDescription
source: Convert an object to a string representation.
cs_cz: Převede objekt na řetězcovou reprezentaci.
es_es: Convierte un objeto en una representación de cadena.
fr_fr: Convertit un objet en une représentation sous forme de chaîne
it_it: Converte un oggetto in una rappresentazione stringa.
ja_jp: オブジェクトを文字列表現に変換します
ko_kr: 객체를 문자열 표현으로 변환합니다.
pl_pl: Przekształca obiekt w reprezentujący go ciąg
pt_br: Converte um objeto em uma representação de sequência de caracteres
ru_ru: Преобразование объекта в строчное представление
zh_cn: 将对象转换为字符串表示
zh_tw: 將物件轉換為字串表現法

# StringInputNodeDescription
source: Creates a string.
cs_cz: Vytvoří řetězec.
es_es: Crea una cadena.
fr_fr: Crée une chaîne
it_it: Crea una stringa.
ja_jp: 文字列を作成します。
ko_kr: 문자열을 작성합니다.
pl_pl: Tworzy ciąg
pt_br: Cria uma sequência de caracteres
ru_ru: Создание строки.
zh_cn: 创建字符串
zh_tw: 建立字串

# WatchDescription
source: Visualize the output of node.
cs_cz: Vizualizuje výstup uzlu
es_es: Muestra la salida de un nodo.
fr_fr: Visualise la sortie du noeud
it_it: Visualizza l'output di un nodo.
ja_jp: ノードの出力を可視化します
ko_kr: 노드의 출력을 시각화합니다.
pl_pl: Wizualizuje dane wyjściowe węzła
pt_br: Visualiza a saída de um nó
ru_ru: Визуализация выходных данных узла
zh_cn: 显示节点的输出内容
zh_tw: 視覺化節點的輸出

# WatchImageDescription
source: Previews an image
cs_cz: Zobrazí náhled obrázku
es_es: Muestra una vista preliminar de una imagen
fr_fr: Affiche l'aperçu d'une image
it_it: Visualizza l'anteprima di un'immagine
ja_jp: イメージをプレビューします
ko_kr: 이미지를 미리봅니다
pl_pl: Podgląd obrazu
pt_br: Visualiza uma imagem
ru_ru: Предварительный просмотр изображения
zh_cn: 预览图像
zh_tw: 預覽影像

# WatchNodeDescription
source: Visualize the output of node.
cs_cz: Vizualizuje výstup uzlu
es_es: Muestra la salida de un nodo.
fr_fr: Visualise la sortie du noeud
it_it: Visualizza l'output di un nodo.
ja_jp: ノードの出力を可視化します
ko_kr: 노드의 출력을 시각화합니다.
pl_pl: Wizualizuje dane wyjściowe węzła
pt_br: Visualiza a saída de um nó
ru_ru: Визуализация выходных данных узла
zh_cn: 显示节点的输出内容
zh_tw: 視覺化節點的輸出

# WatchPortDataInputToolTip
source: Node to evaluate.
cs_cz: Uzel k zobrazení výstupu
es_es: Nodo desde el que se mostrará la salida
fr_fr: Afficher la sortie de ce noeud
it_it: Nodo di cui mostrare l'output
ja_jp: 出力を表示するノード
ko_kr: 출력을 표시할 노드
pl_pl: Węzeł, którego dane wyjściowe mają zostać pokazane
pt_br: Nó do qual a saída é exibida
ru_ru: Узел для отображения выходных данных
zh_cn: 要显示其输出的节点
zh_tw: 要顯示其輸出的節點

# WatchPortDataResultToolTip
source: Watch contents.
cs_cz: Výstup uzlu
es_es: Salida del nodo
fr_fr: Sortie du noeud
it_it: Output del nodo
ja_jp: ノードの出力
ko_kr: 노드 출력
pl_pl: Dane wyjściowe węzła
pt_br: Saída do nó
ru_ru: Выходные данные узла
zh_cn: 节点输出
zh_tw: 節點輸出

# WebRequestDescription
source: Make a web request given a url.
cs_cz: Returns the contents of a webpage from the given URL as a string
es_es: Returns the contents of a webpage from the given URL as a string
fr_fr: Returns the contents of a webpage from the given URL as a string
it_it: Restituisce il contenuto di una pagina Web dall'URL specificato come stringa.
ja_jp: Returns the contents of a webpage from the given URL as a string
ko_kr: Returns the contents of a webpage from the given URL as a string
pl_pl: Returns the contents of a webpage from the given URL as a string
pt_br: Returns the contents of a webpage from the given URL as a string
ru_ru: Возврат содержимого веб-страницы заданного URL-адреса в виде строки
zh_cn: Returns the contents of a webpage from the given URL as a string
zh_tw: Returns the contents of a webpage from the given URL as a string

# WebRequestPortDataResultToolTip
source: The result of the web request.
cs_cz: Obsah webového požadavku jako řetězec.
es_es: El contenido de una solicitud web como cadena.
fr_fr: Résultat de la demande Web sous forme de chaîne.
it_it: Contenuto di una richiesta Web come stringa.
ja_jp: Web リクエストのコンテンツ(文字列)。
ko_kr: 웹 요청의 내용을 문자열로.
pl_pl: Zawartość żądania internetowego w postaci ciągu.
pt_br: Conteúdo de uma solicitação da Web como uma string.
ru_ru: Содержимое веб-запроса в виде строки.
zh_cn: Web 请求的内容(字符串)。
zh_tw: 網路請求的內容，以字串表示。

# WebRequestPortDataUrlToolTip
source: The url for the web request.
cs_cz: Adresa URL pro webový požadavek jako řetězec.
es_es: La dirección URL de la solicitud web como cadena.
fr_fr: URL pour la requête Web sous forme de chaîne.
it_it: URL della richiesta Web come stringa.
ja_jp: Web リクエストの URL (文字列)。
ko_kr: 웹 요청에 대한 URL을 문자열로.
pl_pl: Adres URL żądania internetowego w postaci ciągu.
pt_br: A URL da solicitação da Web como uma string.
ru_ru: URL-адрес для веб-запроса в виде строки.
zh_cn: Web 请求的 URL (字符串)。
zh_tw: 網路請求的 URL，以字串表示。

# ConversionNodeDescription
source: Convert between units of measure.
cs_cz: Převod mezi měrnými jednotkami
es_es: Convierte entre unidades de medida
fr_fr: Convertir d'une unité de mesure à une autre.
it_it: Conversione di unità di misura.
ja_jp: 計測単位を変換します。
ko_kr: 측정 단위 사이를 변환합니다.
pl_pl: Przekształć jednostkę miary na inną.
pt_br: Converta entre unidades de medida.
ru_ru: Преобразование единиц измерения.
zh_cn: 测量单位之间的转换。
zh_tw: 在測量單位之間轉換。

# SelectFromComboBoxToolTip
source: This is your Revit display unit settings
cs_cz: Toto je nastavení zobrazení jednotek vaší aplikace Revit.
es_es: Esta es la configuración de unidades de visualización de Revit
fr_fr: Il s'agit de vos paramètres d'unité d'affichage Revit
it_it: Impostazioni delle unità di visualizzazione di Revit
ja_jp: これは Revit の表示単位の設定です
ko_kr: Revit 화면표시 단위 설정입니다
pl_pl: Są to ustawienia jednostek wyświetlania programu Revit
pt_br: Estas são as suas configurações da unidade de exibição do Revit
ru_ru: Здесь находятся персональные настройки отображаемых единиц Revit
zh_cn: 这是 Revit 显示单位设置
zh_tw: 這是您的 Revit 顯示單位設定

# ListCreateInPortToolTip
source: Item Index #{0}
cs_cz: Index položky č. {0}
es_es: Índice de elemento núm.{0}
fr_fr: Index de l'élément #{0}
it_it: Indice dell'elemento #{0}
ja_jp: 項目インデックス番号 #{0}
ko_kr: 항목 Index {0}
pl_pl: Indeks elementu #{0}
pt_br: Índice do Item nº {0}
ru_ru: Индекс элемента #{0}
zh_cn: 项索引 #{0}
zh_tw: 項目索引 #{0}

# SelectionNodeNothingSelected
source: Nothing selected.
cs_cz: Není nic vybráno.
es_es: No hay nada seleccionado.
fr_fr: Aucune sélection.
it_it: Nessun elemento selezionato.
ja_jp: 何も選択されていません。
ko_kr: 선택한 항목이 없습니다.
pl_pl: Nic nie wybrano.
pt_br: Nada selecionado.
ru_ru: Нет выбранных объектов.
zh_cn: 未选择任何对象。
zh_tw: 未選取任何項目。

# SelectionNodeSugestion
source: Select something in the model.
cs_cz: Vyberte v modelu nějakou položku.
es_es: Seleccione algo en el modelo.
fr_fr: Sélectionnez un élément dans le modèle.
it_it: Selezionare un elemento nel modello.
ja_jp: モデル内の項目を選択します。
ko_kr: 모델에서 항목을 선택하십시오.
pl_pl: Wybierz element w modelu.
pt_br: Selecionar algo no modelo.
ru_ru: Выберите элемент модели.
zh_cn: 在模型中选择对象。
zh_tw: 請選取模型中的項目。

# UnitNodeFromPortTooltip
source: A numeric value for conversion.
cs_cz: Číselná hodnota k převodu
es_es: Un valor numérico para conversión.
fr_fr: Valeur numérique pour la conversion.
it_it: Valore numerico da convertire.
ja_jp: 変換する数値。
ko_kr: 변환할 숫자 값.
pl_pl: Wartość liczbowa do konwersji.
pt_br: Um valor numérico para conversão.
ru_ru: Числовое значение для преобразования.
zh_cn: 用于转换的数字值。
zh_tw: 進行轉換的數值。

# UnitNodeToPortToolTip
source: A converted numeric value.
cs_cz: Převedená číselná hodnota
es_es: Un valor numérico convertido.
fr_fr: Valeur numérique convertie.
it_it: Valore numerico convertito.
ja_jp: 変換した数値。
ko_kr: 변환된 숫자 값.
pl_pl: Przekształcona wartość liczbowa.
pt_br: Um valor numérico convertido.
ru_ru: Преобразованное числовое значение.
zh_cn: 转换后的数字值。
zh_tw: 轉換的數值。

# DateTimeDescription
source: Create a DateTime object from a formatted date and time string. Date and time must be of the format "April 12, 1977 12:00 PM"
cs_cz: Vytvoří objekt dateTime z formátovaného řetězce data a času. Datum a čas musí být ve výchozím formátu DateTime "MMMM dd, rrrr h:mm tt", tedy například "Duben 02, 1977 12:00 PM".
es_es: Crea un objeto dateTime a partir de una cadena de fecha y hora con formato. La fecha y la hora deben seguir el formato por defecto de DateTime "MMMM dd, aaaa h:mm tt", por ejemplo, "April 02, 1977 12:00 PM".
fr_fr: Créer un objet dateTime à partir d'une chaîne de date et heure formatée. La date et l'heure doivent être au format "April 12, 1977 12:00 PM"
it_it: Crea un oggetto dateTime da una stringa con formato data e ora. La data e l'ora devono essere nel formato DateTime di default "MMMM gg, aaaa h:mm tt", ad esempio "April 02, 1977 12:00 PM"
ja_jp: 書式化された日付と時刻の文字列から dateTime オブジェクトを作成します。日付と時刻は「April 12, 1977 12:00 PM」の書式で指定する必要があります
ko_kr: 형식이 지정된 날짜 및 시간 문자열에서 dateTime 객체를 작성합니다. 날짜 및 시간은 기본 DateTime 형식인 "MMMM dd, yyyy h:mm tt"(예: "April 02, 1977 12:00 PM")여야 합니다.
pl_pl: Tworzy obiekt typu dateTime ze sformatowanego ciągu daty i godziny. Data i godzina muszą mieć domyślny format DateTime „MMMM dd, yyyy h:mm tt”, na przykład „Kwiecień 12, 1977 12:00 PM”
pt_br: Cria um objeto dateTime com base em uma sequência de caracteres de data e hora formatada. A data e a hora devem estar no formato DateTime padrão “dd MMMM aaaa h:mm tt”, ex. "02 de abril de 1977 00:00"
ru_ru: Создание объекта dateTime на основе строки, содержащей дату и время в определенном формате. Формат даты и времени должен быть следующим: «MMMM dd, yyyy h:mm tt» (по умолчанию), например «April 02, 1977 12:00 PM»
zh_cn: 从格式化的日期和时间字符串创建 dateTime 对象。日期和时间必须使用默认的 DateTime 格式“MMMM dd, yyyy h:mm tt”(例如，“April 02, 1977 12:00 PM”)
zh_tw: 從已格式化的日期和時間字串建立 dateTime 物件。日期和時間的預設 DateTime 格式必須為「MMMM dd, yyyy h:mm tt」，例如「April 02, 1977 12:00 PM」

# SelectionEdgeOutputPortName
source: Curve
cs_cz: Křivka
es_es: Curva
fr_fr: Courbe
it_it: Curva
ja_jp: 曲線
ko_kr: 곡선
pl_pl: Krzywa
pt_br: Curva
ru_ru: Кривая
zh_cn: 曲线
zh_tw: 曲線

# SelectionEdgesOutputPortName
source: Curves
cs_cz: Křivky
fr_fr: Courbes
it_it: Curve
ja_jp: 曲線
ko_kr: 곡선
pl_pl: Krzywe
pt_br: Curvas
ru_ru: Кривые
zh_cn: 曲线
zh_tw: 曲線

# SelectionElementOutputPortName
source: Element
cs_cz: Prvek
fr_fr: Elément
pt_br: Elemento
zh_cn: 图元
zh_tw: 元素

# SelectionElementsOutputPortName
source: Elements
cs_cz: Prvky
fr_fr: Eléments
pl_pl: Elementy
pt_br: Elementos
zh_cn: 图元
zh_tw: 元素

# SelectionFaceOutputPortName
source: Surface
cs_cz: Povrch
es_es: Superficie
it_it: Superficie
ja_jp: サーフェス
ko_kr: 표면
pl_pl: Powierzchnia
pt_br: Superfície
ru_ru: Поверхность
zh_cn: 曲面
zh_tw: 曲面

# SelectionFacesOutputPortName
source: Surfaces
cs_cz: Povrchy
es_es: Superficies
it_it: Superfici
ja_jp: サーフェス
ko_kr: 표면
pl_pl: Powierzchnie
pt_br: Superfícies
ru_ru: Поверхности
zh_cn: 曲面
zh_tw: 表面

# SelectionPointOutputPortName
source: Point
cs_cz: Bod
es_es: Punto
it_it: Punto
ja_jp: 点
ko_kr: 점
pl_pl: Punkt
pt_br: Ponto
ru_ru: Точка
zh_cn: 点
zh_tw: 點

# SelectionPointsOutputPortName
source: Points
cs_cz: Body
es_es: Puntos
it_it: Punti
ja_jp: 点
ko_kr: 점
pl_pl: Punkty
pt_br: Pontos
ru_ru: Точки
zh_cn: 点
zh_tw: 點

# NumberNodeInputMustBeNumeric
source: The input must be numeric.
cs_cz: Vstup musí být číslo.
es_es: La entrada debe ser numérica.
fr_fr: La valeur doit être numérique.
it_it: L'input deve essere numerico.
ja_jp: 数値を入力する必要があります。
ko_kr: 숫자를 입력해야 합니다.
pl_pl: Wartość wejściowa musi być wartością numeryczną.
pt_br: A entrada deve ser numérica.
ru_ru: Ввод должен быть числовым.
zh_cn: 输入值必须为数值。
zh_tw: 輸入必須為數字。

# ColorPaletteDescription
source: Select a Color from the palette
cs_cz: Vyberte barvu z palety.
es_es: Seleccionar un color de la paleta
fr_fr: Sélectionner une couleur dans la palette
it_it: Selezionare un colore dalla tavolozza
ja_jp: パレットから色を選択します
ko_kr: 팔레트에서 색상 선택
pl_pl: Wybierz kolor z palety
pt_br: Selecione uma cor na paleta
ru_ru: Выберите цвет на палитре
zh_cn: 从选项板中选择颜色
zh_tw: 從調色板中選取顏色

# EqualsWithToleranceDescription
source: Equals with tolerance input.
cs_cz: Vrací hodnotu true v případě, že x a y jsou stejné s danou tolerancí.
es_es: Devuelve "True" (verdadero) si x e y son iguales en función de una determinada tolerancia.
fr_fr: Renvoie True si x et y sont égaux avec une certaine tolérance
it_it: Restituisce True se x e y sono uguali data una certa tolleranza.
ja_jp: 特定の許容範囲で x と y が等しい場合に True を返します
ko_kr: 특정 공차에 대해 x 및 y가 같으면 True를 반환합니다
pl_pl: Zwraca wartość prawda (True), jeśli x i y są równe, przy określonej tolerancji
pt_br: Retornará True se x e y forem iguais, dada uma certa tolerância
ru_ru: Возврат значения True, если значения x и y равны с учетом заданного допуска
zh_cn: 根据给定的特定公差，如果 x 和 y 相等，则返回 True
zh_tw: 如果 x 和 y 在給定某個公差的情況下相等，則傳回 True

# EqualsWithToleranceLhsRhsTooltip
source: Integer or double value
cs_cz: Celočíselná nebo s dvojitou přesností
es_es: Valor entero o doble
fr_fr: Entier ou valeur double
it_it: Valore intero o doppio
ja_jp: 整数値または倍精度値
ko_kr: 정수 또는 double 값
pl_pl: Liczba całkowita lub wartość podwójna
pt_br: Valor inteiro ou duplo
ru_ru: Целое число или двойное значение
zh_cn: 整数或双精度值
zh_tw: 整數或倍精度值

# EqualsWithToleranceOutportTooltip
source: Result of equality check
cs_cz: Výsledek kontroly rovnosti
es_es: Resultado de la comprobación de igualdad
fr_fr: Résultat de la vérification d'égalité
it_it: Risultato del controllo di uguaglianza
ja_jp: 等価チェックの結果
ko_kr: 동일성 검사 결과
pl_pl: Wynik kontroli równości
pt_br: Resultado da verificação de igualdade
ru_ru: Результат проверки равенства
zh_cn: 相等检查的结果
zh_tw: 相等檢查的結果

# EqualsWithToleranceTooltip
source: Tolerance Default value: {0}
cs_cz: Tolerance povolená pro kontrolu rovnosti Výchozí hodnota: {0}
es_es: Tolerancia permitida para la comprobación de igualdad Valor por defecto: {0}
fr_fr: Tolérance autorisée pour la vérification d'égalité Valeur par défaut: {0}
it_it: Tolleranza consentita per il controllo di uguaglianza Valore di default: {0}
ja_jp: 等価チェックで使用可能な許容差 既定値: {0}
ko_kr: 동일성 검사에 허용되는 허용치 기본값: {0}
pl_pl: Dopuszczalna tolerancja przy sprawdzaniu równości Wartość domyślna: {0}
pt_br: Tolerância permitida para a verificação de igualdade Valor padrão: {0}
ru_ru: Допуск для проверки равенства Значение по умолчанию: {0}
zh_cn: 相等检查所允许的公差 默认值: {0}
zh_tw: 相等檢查允許的公差 預設值: {0}
