Repository: DynamoDS/Dynamo
Catalog: src/Libraries/CoreNodeModels/Properties/Resources.*.resx
Languages: cs_cz, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# IntegerSliderDescription
source: A slider that produces integer values.
cs_cz: Vytváří celočíselné hodnoty.
es_es: Genera valores de enteros.
fr_fr: Génère des valeurs entières
it_it: Genera numeri interi.
ja_jp: 整数値を生成します
ko_kr: 정수 값을 생성합니다
pl_pl: Tworzy wartości liczb całkowitych
pt_br: Produz valores inteiros
ru_ru: Создание целых значений
zh_cn: 生成整数值
zh_tw: 產生整數值

# IntegerSliderNodeDescription
source: A slider that produces integer values.
cs_cz: Vytváří celočíselné hodnoty.
es_es: Genera valores de enteros.
fr_fr: Génère des valeurs entières
it_it: Genera numeri interi.
ja_jp: 整数値を生成します
ko_kr: 정수 값을 생성합니다
pl_pl: Tworzy wartości liczb całkowitych
pt_br: Produz valores inteiros
ru_ru: Создание целых значений
zh_cn: 生成整数值
zh_tw: 產生整數值

# LegacyNodeDescription
source: This is an obsolete node
cs_cz: Toto je zastaralý uzel.
es_es: Este es un nodo obsoleto
fr_fr: Ce noeud est obsolète
it_it: Nodo obsoleto
ja_jp: これは廃止されたノードです
ko_kr: 사용되지 않는 노드입니다
pl_pl: Ten węzeł jest nieaktualny
pt_br: Este é um nó obsoleto
ru_ru: Это устаревший узел
zh_cn: 这是过时的节点
zh_tw: 這是舊型節點

# ListCartesianProductDescription
source: Applies a combinator to each pair in the cartesian product of two sequences
cs_cz: Použije kombinátor na každý pár v kartézském součinu dvou posloupností.
es_es: Aplica un combinador a cada par del producto cartesiano de dos secuencias.
fr_fr: Applique un combinateur à chaque paire dans le produit cartésien de deux séquences
it_it: Applica un combinatore ad ogni coppia nel prodotto cartesiano di due sequenze.
ja_jp: 2 つのシーケンスのデカルト積の各ペアにコンビネータを適用します
ko_kr: 두 시퀀스의 데카르트 곱의 각 쌍에 연결자를 적용합니다
pl_pl: Stosuje kombinator do każdej pary w iloczynie kartezjańskim dwóch sekwencji
pt_br: Aplica um combinador a cada par no produto cartesiano de duas sequências
ru_ru: Применение комбинатора к каждой паре в декартовом произведении в двух последовательностях
zh_cn: 将连结符应用到两个序列内笛卡尔积中的每个对
zh_tw: 將結合器套用至兩個順序的笛卡兒積中的每一對

# ListCombineDescription
source: Applies a combinator to each element in two sequences
cs_cz: Použije kombinátor pro každý prvek ve dvou posloupnostech.
es_es: Aplica un combinador a cada elemento en dos secuencias
fr_fr: Applique un combinateur à chaque élément en deux séquences
it_it: Applica un combinatore ad ogni elemento in due sequenze
ja_jp: 2 つのシーケンスの各要素にコンビネータを適用します
ko_kr: 두 시퀀스의 각 요소에 연결자를 적용합니다
pl_pl: Stosuje kombinator do każdego elementu w dwóch sekwencjach
pt_br: Aplica um combinador para cada elemento em duas sequências
ru_ru: Применение комбинатора к каждому элементу в двух последовательностях
zh_cn: 将连结符应用到两个序列中的每个元素
zh_tw: 將結合器套用至兩個順序中的每一個元素

# ListCreateDescription
source: Makes a new list out of the given inputs
cs_cz: Vytvoří nový seznam z daných vstupů
es_es: Crea una nueva lista a partir de las entradas especificadas.
fr_fr: Permet de créer une liste des entrées indiquées
it_it: Crea un nuovo elenco in base agli input specificati.
ja_jp: 特定の入力から新しいリストを作成します
ko_kr: 지정된 입력에서 새 리스트를 만듭니다
pl_pl: Tworzy nową listę z określonych danych wejściowych
pt_br: Faz uma nova lista com base nas entradas fornecidas
ru_ru: Создание списка из заданных входных значений
zh_cn: 从给定输入内容生成新列表
zh_tw: 從給定的輸入製作新清單

# ListFilterDescription
source: Filters a sequence by a given condition such that for an arbitrary element "x," condition(x) = True or False.
cs_cz: Filtruje posloupnost podle dané podmínky. Pokud je podmínka true, jsou položky filtrovány do datové množiny. Když je false, položky jsou filtrovány z datové množiny.
es_es: Filtra los elementos de una lista para incluirlos o excluirlos en función de la condición especificada. Si la condición es "true" (verdadera), los elementos se incluyen y, si es "false" (falsa), estos se excluyen.
fr_fr: Filtre les éléments d'une liste pour les y intégrer ou les en exclure en fonction d'une condition donnée. Si la condition est True, les éléments sont intégrés. Si la condition est False, ils sont exclus.
it_it: Filtra elementi in un elenco in base ad una determinata condizione. Se la condizione è true, gli elementi vengono inclusi e se la condizione è false, gli elementi vengono esclusi.
ja_jp: 特定の条件に基づいてリストの項目をフィルタあるいはフィルタ解除します。条件が True の場合、項目はフィルタされ、False の場合はフィルタが外されます。
ko_kr: 리스트에서 지정된 조건을 기준으로 항목을 필터링하여 포함하거나 제외합니다. 조건이 true인 경우 항목을 필터링하여 포함하고, 조건이 false인 경우 항목을 필터링하여 제외합니다.
pl_pl: Filtruje elementy na liście, uwzględniając je lub wykluczając, na podstawie podanego warunku. Jeśli warunek jest spełniony (True), elementy są uwzględniane, a jeśli nie jest spełniony (False), są wykluczane, czyli odfiltrowywane.
pt_br: Filtra itens em uma lista de entrada ou saída com base na condição fornecida. Se a condição for verdadeira, os itens serão filtrados e, se a condição for falsa, os itens não serão filtrados.
ru_ru: Фильтрация элементов списка на основе заданного условия. Если условие соблюдается, элементы включаются в результаты фильтрации. Если условие не соблюдается, элементы исключаются.
zh_cn: 根据给定条件滤入或滤出列表中的项目。如果条件为 True，则滤入项目，如果条件为 False，则滤出项目。
zh_tw: 根據給定的條件篩選進或篩選掉清單中的項目。如果條件為 true，會篩選進項目，如果條件為 false，會篩選掉項目。

# ListForEachDescription
source: Performs a computation on each element of a list. Does not accumulate results.
cs_cz: Provede výpočet na každém prvku ze seznamu. Nehromadí výsledky.
es_es: Realiza un cálculo en cada elemento de una lista. No acumula resultados
fr_fr: Effectue un calcul sur chaque élément d'une liste. N'accumule pas les résultats.
it_it: Esegue un calcolo su ogni elemento di un elenco. I risultati non sono accumulati.
ja_jp: リストの各要素に対して計算を実行します。結果は累積しません。
ko_kr: 리스트의 각 요소에 대해 계산을 수행합니다. 결과를 누적하지 않습니다.
pl_pl: Wykonuje obliczenia na każdym elemencie z listy. Nie sumuje wyników.
pt_br: Executa um cálculo em cada elemento de uma lista. Não inclui os resultados acumulados.
ru_ru: Выполняется расчет для каждого элемента в списке. Результаты не суммируются.
zh_cn: 对列表的每个元素执行计算。不累加结果。
zh_tw: 對清單的每一個元素執行計算。不累積結果。

# ListLaceLongestDescription
source: Applies a combinator to each pair resulting from a longest lacing of the input lists. All lists have their last element repeated to match the length of the longest input.
cs_cz: Použije kombinátor na každý pár vzniklý z nejdelšího vázání seznamů vstupů. U všech seznamů je poslední prvek opakován tak, aby délkou odpovídaly nejdelšímu vstupu.
es_es: Aplica un combinador a cada par resultante del encaje más largo de las listas de entrada. Todas las listas tienen repetido su último elemento para que coincida con la longitud de la entrada más larga
fr_fr: Applique un combinateur à chaque paire résultant d'un entrelacement plus long des listes d'entrée. Le dernier élément de chaque liste est répété pour correspondre à la longueur de l'entrée la plus longue.
it_it: Applica un combinatore ad ogni coppia risultante dal collegamento più lungo degli elenchi di input. In tutti gli elenchi viene ripetuto l'ultimo elemento affinché la lunghezza corrisponda a quella dell'input più lungo.
ja_jp: 入力リストの最も長いレーシングから発生する各ペアにコンビネータを適用します。最も長い入力の長さに合わせて、すべてのリストの最後の要素が繰り返されます。
ko_kr: 입력 리스트의 최장 레이싱에서 생성된 각 쌍에 연결자를 적용합니다. 모든 리스트에는 가장 긴 입력의 길이와 일치하도록 반복되는 마지막 요소가 있습니다.
pl_pl: Stosuje kombinator do każdej pary powstałej z najkrótszego skratowania list danych wejściowych. Ostatni element wszystkich list jest powtarzany, tak aby odpowiadał długości najdłuższych danych wejściowych.
pt_br: Aplica um combinador para cada par resultante da treliça mais longa das listas de entrada. As listas têm seu último elemento repetido para coincidir com o comprimento da entrada mais longa.
ru_ru: Применение комбинатора к каждой паре, полученной в результате длинного переплетения входных списков. Во всех списках повторяется последний элемент для обеспечения соответствия длине самой длинной строки входных данных.
zh_cn: 将连结符应用到由输入列表最长连缀产生的每一对元素中。所有列表重复最后一个元素以匹配最长输入内容的长度。
zh_tw: 將結合器套用至從輸入清單的最長交織產生的每一對。所有清單的最後一個元素都會重複，以便與最長輸入的長度配對。

# ListLaceShortestDescription
source: Applies a combinator to each pair resulting from a shortest lacing of the input lists. All lists are truncated to the length of the shortest input.
cs_cz: Použije kombinátor na každý pár vzniklý z nejkratšího vázání seznamů vstupů. Všechny seznamy jsou zkráceny na délku nejkratšího vstupu.
es_es: Aplica un combinador a cada par resultante del encaje más corto de las listas de entrada. Todas las listas se truncan conforme a la longitud de la entrada más corta
fr_fr: Applique un combinateur pour chaque paire résultant d'un entrelacement plus court des listes d'entrée. Toutes les listes sont tronquées en fonction de la longueur de l'entrée la plus courte.
it_it: Applica un combinatore ad ogni coppia risultante dal collegamento più breve degli elenchi di input. Tutti gli elenchi vengono troncati in corrispondenza della lunghezza dell'input più breve.
ja_jp: 入力リストの最も短いレーシングから発生する各ペアにコンビネータを適用します。最も短い入力の長さに合わせて、すべてのリストが切り詰められます。
ko_kr: 입력 리스트의 최단 레이싱에서 생성된 각 쌍에 연결자를 적용합니다. 모든 리스트는 가장 짧은 입력의 길이로 잘립니다.
pl_pl: Stosuje kombinator do każdej pary powstałej z najkrótszego skratowania list danych wejściowych. Wszystkie listy są skracane do długości najkrótszych danych wejściowych.
pt_br: Aplica um combinador para cada par resultante de uma treliça menor das listas de entrada. As listas são truncadas para o comprimento da entrada mais curta.
ru_ru: Применение комбинатора к каждой паре, полученной в результате самого короткого переплетения входных списков. Все списки усекаются для обеспечения соответствия длине самой короткой строки входных данных.
zh_cn: 将连结符应用到由输入列表最短连缀产生的每一对元素中。所有列表都被截断至最短输入的长度。
zh_tw: 將結合器套用至從輸入清單的最短交織產生的每一對。所有清單都會截斷成最短輸入的長度。

# ListMapDescription
source: Applies a function over all elements of a list, generating a new list from the results.
cs_cz: Používá funkci na všechny prvky v seznamu, čím z výsledků vytvoří nový seznam.
es_es: Aplica una función a todos los elementos de una lista, lo que genera una nueva lista a partir de los resultados.
fr_fr: Applique une fonction sur tous les éléments d'une liste, ce qui génère une nouvelle liste à partir des résultats
it_it: Applica una funzione a tutti gli elementi di un elenco, generando un nuovo elenco dai risultati.
ja_jp: リストのすべての要素に関数を適用し、その結果から新しいリストを生成します。
ko_kr: 리스트의 모든 요소에 함수를 적용하고 결과에서 새 리스트를 생성합니다.
pl_pl: Stosuje funkcję do wszystkich elementów listy, generując z wyników nową listę
pt_br: Aplica uma função a todos os elementos de uma lista, gerando uma nova lista com base nos resultados.
ru_ru: Применение функции ко всем элементам списка с созданием нового списка на основе результатов.
zh_cn: 将函数应用于列表的所有元素，根据结果生成一个新列表
zh_tw: 將函數套用至清單的所有元素，從結果產生新清單

# ListReduceDescription
source: Reduces a list into a new value by combining each element with an accumulated result.
cs_cz: Snižuje seznam na novou hodnotu kombinací každého prvku s nahromaděným výsledkem.
es_es: Reduce una lista a un valor nuevo mediante la combinación de cada elemento con un resultado acumulado.
fr_fr: Réduit une liste dans une nouvelle valeur en associant chaque élément à l'aide d'un résultat cumulé
it_it: Riduce un elenco in un nuovo valore, combinando ciascun elemento con un risultato accumulato.
ja_jp: 各要素を累積した結果に組み合わせることで、リストを新しい値に削減します
ko_kr: 누적된 결과로 각 요소를 결합하여 리스트를 새 값으로 줄입니다
pl_pl: Zmniejsza listę do nowej wartości, łącząc każdy element ze zsumowanym wynikiem
pt_br: Reduz uma lista em um novo valor combinando cada elemento com um resultado acumulado
ru_ru: Приведение списка к новому значению путем объединения каждого элемента с накопленным результатом
zh_cn: 通过将每个元素与累积结果结合，将列表缩减到新值
zh_tw: 結合每一個元素與累積結果，將清單減少至一個新值

# ListScanDescription
source: Reduces a list into a new value by combining each element with an accumulated result, produces a list of successive reduced values.
cs_cz: Redukuje seznam na novou hodnotu pomocí kombinace všech prvků s narůstajícím výsledkem, čím dojde k vytvoření seznamu po sobě jdoucích redukovaných hodnot.
es_es: Reduce una lista a un valor nuevo mediante la combinación de cada elemento con un resultado acumulado, genera una lista de valores reducidos sucesivos
fr_fr: Réduit une liste dans une nouvelle valeur en combinant chaque élément à un résultat accumulé, génère une liste des valeurs réduites successives.
it_it: Riduce un elenco in un nuovo valore, combinando gli elementi con un risultato accumulato. Produce un elenco di valori ridotti consecutivi.
ja_jp: 各要素を累積した結果に組み合わせることでリストを新しい値に削減し、削減した値が連続するリストを作成します。
ko_kr: 누적된 결과로 각 요소를 결합하여 리스트를 새 값으로 줄이고 연속적으로 감소된 값의 리스트를 생성합니다.
pl_pl: Zmniejsza listę do nowej wartości, łącząc każdy element z zsumowanym wynikiem, tworzy listę kolejnych wartości zredukowanych.
pt_br: Reduz a lista para um novo valor ao combinar cada elemento com um resultado acumulado, e produz uma lista de valores reduzidos sucessivos.
ru_ru: Приведение списка к новому значению путем объединения каждого элемента с накопленным результатом и получение списка последовательных приведенных значений.
zh_cn: 通过将每个元素与累积结果结合，将列表缩减到新值，生成连续缩减值列表。
zh_tw: 結合每一個元素與累積結果，將清單減少至一個新值，進而產生連續減少值的清單。

# MapPortDataFxToolTip
source: The procedure used to map element
cs_cz: Postup použitý na prvek mapy
es_es: El procedimiento utilizado para elemento de mapa
fr_fr: Procédure permettant de mapper l'élément
it_it: Procedura utilizzata per il mappaggio dell'elemento
ja_jp: 要素のマッピングに使用するプロシージャ
ko_kr: 요소를 매핑하기 위해 사용되는 절차
pl_pl: Procedura służąca do odwzorowania elementu
pt_br: O procedimento usado para o elemento do mapa
ru_ru: Процедура, используемая для сопоставления элементов
zh_cn: 用于映射元素的步骤
zh_tw: 用來對應元素的程序

# MapPortDataListToolTip
source: The list to map over.
cs_cz: Seznam, který se má mapovat
es_es: Lista que asignar
fr_fr: Liste à mapper.
it_it: Elenco da mappare.
ja_jp: マッピングするリスト。
ko_kr: 매핑할 리스트입니다.
pl_pl: Lista do odwzorowania.
pt_br: A lista sobre a qual mapear.
ru_ru: Список для сопоставления.
zh_cn: 要映射到的列表。
zh_tw: 要對應的清單。

# MapPortDataResultToolTip
source: Mapped list
cs_cz: Mapovaný seznam typu: var[]..[]
es_es: Lista asignada de tipo: var[]..[]
fr_fr: Liste mappée de type: var[]..[]
it_it: Elenco mappato di tipo: var[]..[]
ja_jp: マッピングされたリスト(タイプ: var[]..[])
ko_kr: 유형의 매핑된 리스트: var[]..[]
pl_pl: Odwzorowana lista typu: var[]..[]
pt_br: Lista mapeada do tipo: var[]..[]
ru_ru: Список после сопоставления с типом var[]..[]
zh_cn: 映射的列表(类型: var[]..[])
zh_tw: 對映的清單，類型: var[]..[]

# RangeDescription
source: Creates a sequence of numbers or letters in the specified range.
cs_cz: Vytvoří posloupnost čísel nebo písmen v zadaném rozsahu.
es_es: Crea una secuencia de números o letras en el rango especificado.
fr_fr: Crée une séquence de nombres ou lettres dans l'intervalle donné
it_it: Crea una sequenza di numeri o lettere nell'intervallo dato.
ja_jp: 特定の範囲内で数値または文字のシーケンスを作成します
ko_kr: 지정된 범위에서 숫자 또는 문자의 시퀀스를 작성합니다
pl_pl: Tworzy sekwencję liczb lub liter w określonym zakresie
pt_br: Cria uma sequência de números ou letras no intervalo fornecido
ru_ru: Создание последовательности чисел или букв в заданном диапазоне
zh_cn: 按给定范围创建一系列数字或字母
zh_tw: 建立給定範圍內的一系列數字或字母

# SequenceDescription
source: Creates a sequence of numbers.
cs_cz: Vytvoří posloupnost čísel.
es_es: Crea una secuencia de números.
fr_fr: Crée une séquence de nombres
it_it: Crea una sequenza di numeri.
ja_jp: 数値のシーケンスを作成します。
ko_kr: 숫자의 시퀀스를 만듭니다.
pl_pl: Tworzy sekwencję liczb
pt_br: Cria uma sequência de números
ru_ru: Создание последовательности чисел.
zh_cn: 创建数字序列
zh_tw: 建立一系列數字

# OrDescription
source: Boolean OR: Returns true if either of the inputs are true. If neither are true, returns false.
cs_cz: Booleovské OR: vrací hodnotu true, pokud má hodnotu true kterýkoli ze vstupů. Pokud nemá ani jeden vstup hodnotu true, vrací hodnotu false.
es_es: Valor booleano OR: devuelve ·"True" (verdadera) si cualquiera de las entradas es verdadera. Si ninguna de ellas es verdadera, devuelve "False" (falsa).
fr_fr: Opérateur booléen OU: renvoie True si l'une des entrées est vraie. Si aucune entrée n'est vraie, renvoie False.
it_it: OR booleano: restituisce True se uno degli input è true. Se nessuno degli input è true, restituisce False.
ja_jp: ブール演算 OR: 入力のいずれかが True の場合に True を返します。いずれも True ではない場合は、False を返します。
ko_kr: 부울 OR: 입력 중 하나가 true인 경우 True를 반환합니다. 모두가 true가 아니면 False를 반환합니다.
pl_pl: Logiczne LUB: zwraca wartość prawda (True), jeśli któreś z danych wejściowych są prawdziwe. Jeśli żadne nie są prawdziwe, zwraca wartość fałsz (Fałsz).
pt_br: Booleano OU: retornará True se alguma das entradas for verdadeira. Se nenhuma for verdadeira, retornará False.
ru_ru: Логическое ИЛИ: возвращает значение True, если любой из вводов является истинным. Если ни один из них не является таковым, возвращается значение False.
zh_cn: 布尔 OR: 如果任一输入内容为 True，则返回 True。如果都不为 True，则返回 False。
zh_tw: 布林 OR: 如果任一輸入為 true，則傳回 True。如果都不是 true，則傳回 False。

# PortDataFalseBlockToolTip
source: False block
cs_cz: Vráceno, pokud je test nepravdivý
es_es: Se devuelve si la prueba es "false" (falsa).
fr_fr: Renvoyé si le test a la valeur False
it_it: Restituito se il test è false
ja_jp: テストが false の場合に返されます
ko_kr: 테스트가 false인 경우 반환됨
pl_pl: Zwracane, jeśli test ma wartość false
pt_br: Retornado se o teste for falso
ru_ru: Возвращается, если проверка дает значение False
zh_cn: 如果测试为 false，则返回
zh_tw: 傳回測試是否為 false

# PortDataImageToolTip
source: image
cs_cz: Obrázek pro vizualizaci
es_es: Imagen para visualización
fr_fr: Image pour visualisation
it_it: Immagine per la visualizzazione
ja_jp: 視覚化用のイメージ
ko_kr: 시각화를 위한 이미지
pl_pl: Obraz do wizualizacji
pt_br: Imagem para visualização
ru_ru: Изображение для визуализации
zh_cn: 可视化图像
zh_tw: 要視覺化的影像

# PortDataListToolTip
source: List
cs_cz: Seznam
es_es: Lista
fr_fr: Liste
it_it: Elenca
ja_jp: リスト
ko_kr: 리스트
pl_pl: Lista
pt_br: Lista
ru_ru: Список
zh_cn: 列表
zh_tw: 清單

# PortDataOperandToolTip
source: operand
cs_cz: Boolean #
es_es: Boolean #
fr_fr: Boolean #
it_it: Numero booleano
ja_jp: Boolean #
ko_kr: Boolean #
pl_pl: Boolean #
pt_br: Boolean #
ru_ru: Логическое число
zh_cn: Boolean #
zh_tw: Boolean #

# PortDataResultToolTip
source: result
cs_cz: Vytvořený blok výsledku
es_es: Bloque de resultados generado
fr_fr: Bloc de résultat produit
it_it: Blocco dei risultati prodotto
ja_jp: 生成された結果ブロック
ko_kr: 결과 블록이 생성됨
pl_pl: Zwracany blok wyniku
pt_br: Bloco de resultados produzido
ru_ru: Сформированный блок результата
zh_cn: 产生的结果块
zh_tw: 產生的結果區塊

# PortDataTestBlockToolTip
source: Test block
cs_cz: Test booleovské hodnoty
es_es: Prueba de valores booleanos
fr_fr: Test booléen
it_it: Test booleano
ja_jp: ブール値テスト
ko_kr: 부울 테스트
pl_pl: Test wartości logicznej
pt_br: Teste booleano
ru_ru: Логическая проверка
zh_cn: 布尔值测试
zh_tw: 布林值測試

# PortDataTrueBlockToolTip
source: True block
cs_cz: Vráceno, pokud je test pravdivý.
es_es: Se devuelve si la prueba es "true" (verdadera).
fr_fr: Renvoyé si le test a la valeur True
it_it: Restituito se il test è true
ja_jp: テストが true の場合に返されます
ko_kr: 테스트가 true인 경우 반환됨
pl_pl: Zwracane, jeśli test ma wartość true
pt_br: Retornado se o teste for verdadeiro
ru_ru: Возвращается, если проверка дает значение True
zh_cn: 如果测试为 true，则返回
zh_tw: 傳回測試是否為 true

# PortDataVariableToolTip
source: variable
cs_cz: proměnná
it_it: variabile
ja_jp: 変数
ko_kr: 변수
pl_pl: zmienna
pt_br: variável
ru_ru: переменная
zh_cn: 变量
zh_tw: 變數

# ReducePortDataReductorToolTip
source: Reductor Function: accepts one item from each list being reduced, and the current accumulated value, result is the new accumulated value.
cs_cz: Funkce reduktoru: přijímá jednu položku z každého seznamu, který je redukován, a aktuální nahromaděnou hodnotu. Výsledkem je nová nahromaděná hodnota.
es_es: Función de reductor: acepta un elemento en cada lista que se reduce y el valor actual acumulado, el resultado es el nuevo valor acumulado
fr_fr: Fonction de réducteur: accepte la réduction d'un élément de chaque liste, et la valeur cumulée actuelle, le résultat est la nouvelle valeur accumulée.
it_it: Funzione di riduzione: accetta un elemento da ogni elenco in corso di riduzione e il valore accumulato corrente; il risultato rappresenta il nuovo valore accumulato.
ja_jp: Reductor 関数: 削減する各リストから項目を 1 つ受け取り、現在の累積値を使用して、新しい累積値を算出します。
ko_kr: Reductor 함수: 줄이고 있는 각 리스트에서 하나의 항목과 현재 누적된 값을 허용하며, 결과는 새로 누적된 값입니다.
pl_pl: Funkcja reduktora: przyjmuje jeden element z każdej redukowanej listy oraz bieżącą skumulowaną wartość, wynik jest nową zsumowaną wartością.
pt_br: Função Redutor: aceita um item de cada lista que está sendo reduzida e o valor atual acumulado. O resultado é o novo valor acumulado.
ru_ru: Функция «Уменьшитель»: берется один элемент из каждого списка, который требуется уменьшить, и текущее суммарное значение. В результате получается новое суммарное значение.
zh_cn: Reductor 函数: 从缩减的每个列表接受一项，加上当前累积值，结果是新的累积值。
zh_tw: Reductor 函數：從每一個清單中接受一個正在減少的項目，以及目前的累積值，結果是新的累積值。

# ReducePortDataResultToolTip
source: Reduced lists
cs_cz: Redukované seznamy (typ: var[]..[])
es_es: Listas reducidas (tipo: var[]..[])
fr_fr: Listes réduites (type: var[]..[])
it_it: Elenchi ridotti (tipo: var[]..[])
ja_jp: 削減されたリスト(タイプ: var[]..[])
ko_kr: 줄인 리스트(유형: var[]..[])
pl_pl: Zredukowane listy (typ: var[]..[])
pt_br: Listas reduzidas (tipo: var[]..[])
ru_ru: Приведенные списки (тип: var[]..[])
zh_cn: 减少的列表(类型: var[]..[])
zh_tw: 減少的清單 (類型: var[]..[])

# ReducePortDataSeedToolTip
source: Starting accumulated value, to be passed into the first call to the Reductor function.
cs_cz: Počáteční nahromaděná hodnota, která má být předána do prvního volání funkce reduktoru.
es_es: Iniciando valor acumulado, se transferirá a la primera llamada de la función Reductor
fr_fr: Valeur accumulée de départ, qui sera transférée dans le premier appel à la fonction Reductor.
it_it: Valore accumulato iniziale da passare alla prima chiamata alla funzione di riduzione.
ja_jp: 開始累積値。Reductor 関数の最初の呼び出しに渡されます。
ko_kr: Reductor 함수의 첫 번째 호출에 전달될 시작 누적 값.
pl_pl: Początkowa zsumowana wartość, która ma być przekazana do pierwszego wywołania funkcji reduktora.
pt_br: Iniciando o valor acumulado, a ser transferido para a primeira chamada da função Redutor.
ru_ru: Начальное суммарное значение, которое будет передано при первом вызове функции «Уменьшитель».
zh_cn: 起始累积值，将传递到 Reductor 函数的首次调用。
zh_tw: 起始累積值，要傳遞到 Reductor 函數的第一個呼叫。

# ReplaceByConditionDescription
source: Replaces an object with a given substitute if the original object satisfies a given condition.
cs_cz: Nahradí objekt daným náhradním objektem, pokud původní objekt vyhovuje dané podmínce.
es_es: Reemplaza un elemento por un determinado sustituto si el elemento original cumple la condición especificada.
fr_fr: Remplace un élément par le substitut donné si l'élément d'origine répond à la condition donnée
it_it: Sostituisce un elemento con quello sostitutivo dato se l'elemento originale soddisfa la condizione specificata.
ja_jp: 元の項目が特定の条件を満たす場合に、項目を特定の別項目に置き換えます。
ko_kr: 원래 항목이 지정된 조건을 충족하는 경우 항목을 지정된 대체 항목으로 대체합니다
pl_pl: Zastępuje element podanym zamiennikiem, jeśli oryginalny element spełnia podany warunek
pt_br: Substituirá um item pelo substituto fornecido se o item original satisfizer a condição fornecida
ru_ru: Замена элемента указанным объектом для подстановки, если исходный элемент удовлетворяет заданному условию
zh_cn: 如果原始项目满足给定条件，则将项目替换为给定替换内容
zh_tw: 如果原始項目滿足給定的條件，則將該項目取代為給定的替代項目
