Repository: DynamoDS/Dynamo
Catalog: src/PythonMigrationViewExtension/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# MigrationAssistantErrorStateMessage
source: Fix all errors before attempting code migration.
cs_cz: Před migrací kódu opravte všechny chyby.
de_de: Beheben Sie vor der Code-Migration alle Fehler.
es_es: Solucione todos los problemas antes de intentar realizar la migración de código.
fr_fr: Corrigez toutes les erreurs avant d'effectuer une tentative de migration de code.
it_it: Correggere tutti gli errori prima di tentare di eseguire la migrazione del codice.
ja_jp: エラーをすべて修正してからコードのマイグレーションを行ってください。
ko_kr: 코드 마이그레이션을 시도하기 전에 모든 오류를 수정하십시오.
pl_pl: Zanim spróbujesz migrować kod, napraw wszystkie błędy.
pt_br: Corrija todos os erros antes de tentar a migração do código.
ru_ru: Перед переносом кода исправьте все ошибки.
zh_cn: 在尝试代码迁移前修复所有错误。
zh_tw: 請在嘗試移轉程式碼之前，修正所有錯誤。

# PackagedCustomNodesHeader
source: Packaged
cs_cz: Zabalené
de_de: Kompakt
es_es: Empaquetados
fr_fr: Monobloc
it_it: In pacchetto
ja_jp: パッケージ化
ko_kr: 패키지
pl_pl: Spakowane
pt_br: Empacotados
ru_ru: Запаковано
zh_cn: 已打包
zh_tw: 來自套件

# PackagedCustomNodesTooltip
source: Please notify the package author to update the package
cs_cz: Upozorněte autora balíčku na aktualizaci balíčku.
de_de: Benachrichtigen Sie den Paketersteller, um das Paket zu aktualisieren
es_es: Indique al autor del paquete que lo actualice.
fr_fr: Veuillez informer l'auteur du package qu'il doit mettre à jour le package
it_it: Inviare una notifica all'autore del pacchetto per aggiornare il pacchetto.
ja_jp: パッケージを更新するようパッケージの作成者に通知してしてください
ko_kr: 패키지 작성자에게 패키지 업데이트를 알리십시오.
pl_pl: Powiadom autora pakietu o potrzebie aktualizacji pakietu
pt_br: Notifique o autor do pacote para atualizá-lo
ru_ru: Для обновления пакета обратитесь к создателю пакета
zh_cn: 请通知软件包作者更新软件包
zh_tw: 請通知套件作者更新套件

# PythonMigrationAssistantCodeAfter
source: After
cs_cz: Za
de_de: Nachher
es_es: Después
fr_fr: Après
it_it: Dopo
ja_jp: 後
ko_kr: 이후
pl_pl: Po
pt_br: Depois
ru_ru: После
zh_cn: 之后
zh_tw: 之後

# PythonMigrationAssistantCodeBefore
source: Before
cs_cz: Před
de_de: Vorher
es_es: Antes
fr_fr: Avant
it_it: Prima
ja_jp: 前
ko_kr: 이전
pl_pl: Przed
pt_br: Antes
ru_ru: До
zh_cn: 之前
zh_tw: 之前

# PythonMigrationAssistantInlinePaneTitle
source: Before -> After
cs_cz: Před -> Za
de_de: Vorher -> Nachher
es_es: Antes -> Después
fr_fr: Avant -> Après
it_it: Prima -> Dopo
ja_jp: 前 -> 後
ko_kr: 이전 -> 이후
pl_pl: Przed -> Po
pt_br: Antes -> Depois
ru_ru: До -> После
zh_cn: 之前 -> 之后
zh_tw: 之前 -> 之後

# PythonMigrationAssistantWindowTitle
source: Migration Assistant
de_de: Migrationsassistent
es_es: Asistente de migración
fr_fr: Assistant de migration
ja_jp: マイグレーション アシスタント
ko_kr: 마이그레이션 보조 도구
pt_br: Assistente de migração
zh_cn: 移植助手
zh_tw: 移轉助理

# PythonMigrationBackupFileCreatedMessage
source: Before applying the Python code migration, a backup of this graph has been saved to the configured backup location : {0}
cs_cz: Před použitím migrace kódu jazyka Python byla záloha tohoto grafu uložena do nakonfigurovaného záložního místa: {0}
de_de: Vor dem Anwenden der Python-Codemigration wurde eine Sicherungskopie dieses Diagramms im konfigurierten Verzeichnis für Sicherungskopien gespeichert: {0}
es_es: Antes de aplicar la migración de código de Python, se ha guardado una copia de seguridad de este gráfico en la ubicación de copia de seguridad configurada: {0}
fr_fr: Avant d'appliquer la migration du code Python, une sauvegarde de ce graphique a été enregistrée à l'emplacement de sauvegarde configuré: {0}
it_it: Prima di applicare la migrazione del codice Python, è stato salvato un backup di questo grafico nel percorso di backup configurato: {0}
ja_jp: Python コードのマイグレーションを適用する前の、このグラフのバックアップが、設定済みのバックアップ場所 {0} に保存されました。
ko_kr: Python 코드 마이그레이션을 적용하기 전에 구성된 백업 위치({0})에 이 그래프의 백업을 저장했습니다.
pl_pl: Przed zastosowaniem migracji kodu języka Python zapisano kopię zapasową tego wykresu w skonfigurowanej lokalizacji kopii zapasowej: {0}
pt_br: Antes de aplicar a migração do código Python, uma cópia de segurança deste gráfico foi salva no local de backup configurado: {0}
ru_ru: Перед переносом кода Python резервная копия этого графика была сохранена в настроенную папку резервных копий: {0}
zh_cn: 在应用 Python 代码移植之前，此图形的备份已保存到配置的备份位置: {0}
zh_tw: 在套用 Python 程式碼移轉之前，此圖表的備份已儲存至規劃的備份位置: {0}

# RejectButtonTooltip
source: Reject the current code changes.
cs_cz: Zamítnout změny v aktuálním kódu.
de_de: Lehnt die aktuellen Codeänderungen ab.
es_es: Rechace los cambios de código actuales.
fr_fr: Refuser les modifications de code actuelles.
it_it: Rifiutare le modifiche del codice correnti.
ja_jp: 現在のコードの変更を拒否します。
ko_kr: 현재 코드 변경 사항을 거부합니다.
pl_pl: Odrzuć bieżące zmiany kodu.
pt_br: Rejeite as alterações atuais do código.
ru_ru: Отклонить текущие изменения кода.
zh_cn: 拒绝当前代码更改。
zh_tw: 拒絕目前的程式碼變更。

# UserDefinitionCustomNodesTooltip
source: Double-click on the custom node to open its workspace
cs_cz: Dvojitým kliknutím na vlastní uzel otevřete jeho pracovní prostor.
de_de: Doppelklicken Sie auf den benutzerdefinierten Block, um seinen Arbeitsbereich zu öffnen
es_es: Haga doble clic en el nodo personalizado para abrir su espacio de trabajo.
fr_fr: Double-cliquer sur le noeud personnalisé pour ouvrir l'espace de travail correspondant
it_it: Fare doppio clic sul nodo personalizzato per aprire la relativa area di lavoro.
ja_jp: カスタム ノードをダブルクリックして、そのワークスペースを開きます
ko_kr: 사용자 노드를 두 번 클릭하여 해당 작업공간을 엽니다.
pl_pl: Kliknij dwukrotnie węzeł niestandardowy, aby otworzyć jego obszar roboczy
pt_br: Clique duas vezes no nó personalizado para abrir seu espaço de trabalho
ru_ru: Дважды щелкните пользовательский узел, чтобы открыть его рабочее пространство
zh_cn: 双击自定义节点即可打开其工作区
zh_tw: 按兩下自訂節點以開啟其工作區

# UserDefinitionsHeader
source: Definitions
cs_cz: Definice
de_de: Definitionen
es_es: Definiciones
fr_fr: Définitions
it_it: Definizioni
ja_jp: 定義
ko_kr: 정의
pl_pl: Definicje
pt_br: Definições
ru_ru: Определения
zh_cn: 定义
zh_tw: 定義
