Repository: DynamoDS/Dynamo
Catalog: src/PythonMigrationViewExtension/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# AcceptButtonTooltip
source: Accept the current code changes.
cs_cz: Přijmout změny v aktuálním kódu.
de_de: Übernimmt die aktuellen Codeänderungen.
es_es: Acepte los cambios de código actuales.
fr_fr: Acceptez les modifications de code actuelles.
it_it: Accettare le modifiche al codice corrente.
ja_jp: 現在のコードの変更を受け入れます。
ko_kr: 현재 코드 변경 사항을 수락합니다.
pl_pl: Zaakceptuj bieżące zmiany kodu.
pt_br: Aceite as alterações do código atual.
ru_ru: Принять текущие изменения кода.
zh_cn: 接受当前代码更改。
zh_tw: 接受目前的程式碼變更。

# CustomNodesPythonDependencyHeader
source: Custom Nodes that have an IronPython2 dependency
cs_cz: Vlastní uzly, které mají závislost jazyka IronPython2
de_de: Benutzerdefinierte Blöcke mit einer IronPython2-Abhängigkeit
es_es: Nodos personalizados que tienen una dependencia de IronPython2
fr_fr: Noeuds personnalisés dotés d'une dépendance IronPython2
it_it: Nodi personalizzati con dipendenza IronPython2
ja_jp: IronPython2 依存関係のあるカスタム ノード
ko_kr: IronPython2 종속성이 있는 사용자 정의 노드
pl_pl: Węzły niestandardowe z zależnością IronPython2
pt_br: Nós personalizados que têm uma dependência IronPython2
ru_ru: Пользовательские узлы с зависимостью IronPython2
zh_cn: 具有 IronPython2 依存关系的自定义节点
zh_tw: 有 IronPython2 相依性的自訂節點

# DiffButtonTooltip
source: Change between Side-by-Side and Inline view.
cs_cz: Přepnout mezi pohledy Vedle sebe a Centrovaný.
de_de: Wechselt zwischen der parallelen und der Inline-Ansicht.
es_es: Alterne entre la vista en paralelo y en línea.
fr_fr: Basculez entre la vue Côte à côte et Aligné.
it_it: Passare dalla vista affiancata a quella in linea e viceversa.
ja_jp: サイドバイサイドとインラインのどちらかのビューで差分を表示します。
ko_kr: 나란히 뷰 및 인라인 뷰 간에 변경합니다.
pl_pl: Zmiana pomiędzy widokiem obok siebie i widokiem osadzonym.
pt_br: Altere entre vista Lado a lado e Em linha.
ru_ru: Переключение между видами «Рядом» и «Встроенный».
zh_cn: 在“并排”和“内嵌”视图之间切换。
zh_tw: 在「並排」和「內嵌」視圖之間變更。

# IronPythonDialogDescription
source: Dynamo is moving away from the old IronPython2 (Python 2) engine towards a new CPython3 (Python 3) engine. There will be a time of transition where both versions of Python node will work inside of Dynamo, but eventually the CPython3 engine will be set as default.
cs_cz: Aplikace Dynamo přechází z modulu IronPython2 (Python 2) na nový modul CPython3 (Python 3). Modul IronPython je i nadále k dispozici jako balíček v aplikaci Package Manager aplikace Dynamo, podporován však bude pouze modul CPython3.
de_de: Dynamo verwendet statt der alten IronPython2-Engine (Python 2) jetzt eine neue CPython3-Engine (Python 3). Die IronPython-Engine ist noch als Paket im Dynamo Package Manager verfügbar, allerdings wird nur noch die CPython3-Engine unterstützt.
es_es: Dynamo deja de trabajar con el antiguo motor IronPython2 (Python 2) para usar el nuevo motor CPython3 (Python 3). El motor IronPython sigue estando disponible como paquete en Package Manager de Dynamo, pero solo se admitirá el motor CPython3.
fr_fr: Dynamo remplace l'ancien moteur IronPython2 (Python 2) par un nouveau moteur CPython3 (Python 3). L'ancien moteur IronPython est toujours disponible sous forme de package dans le Package Manager Dynamo, mais seul le moteur CPython3 est pris en charge.
it_it: In Dynamo si sta passando dal vecchio motore IronPython2 (Python 2) verso un nuovo motore CPython3 (Python 3). Il motore IronPython è ancora disponibile come pacchetto in Dynamo Package Manager, ma sarà supportato solo il motore CPython3.
ja_jp: Dynamo のエンジンは、旧来の IronPython2 (Python 2)から新しい CPython3 (Python 3)に移行されました。 IronPython エンジンも 1 つのパッケージとして Dynamo Package Manager から引き続きご利用いただけますが、サポートされるのは CPython3 のみとなります。
ko_kr: Dynamo가 이전 IronPython2(Python 2) 엔진에서 새로운 CPython3(Python 3) 엔진으로 바뀌었습니다. IronPython 엔진은 여전히 Dynamo Package Manager를 통해 패키지로 제공되지만, 앞으로는 CPython3 엔진만 지원됩니다.
pl_pl: W dodatku Dynamo wycofano używanie starego aparatu IronPython2 na rzecz nowego: PythonNet3. Aparat IronPython jest nadal dostępny jako pakiet w Menedżerze pakietów dodatku Dynamo, ale obsługiwany będzie tylko aparat PythonNet3.
pt_br: O Dynamo migrou do antigo mecanismo IronPython2 (Python 2) para um novo mecanismo CPython3 (Python 3). O mecanismo IronPython ainda está disponível como um pacote no gestor de pacotes do Dynamo, mas somente o mecanismo CPython3 será suportado.
ru_ru: Программа Dynamo переведена с устаревшего механизма IronPython2 (Python 2) на новый механизм CPython3 (Python 3). Механизм IronPython по-прежнему доступен в виде пакета в Dynamo Package Manager, однако поддерживается только механизм CPython3.
zh_cn: Dynamo has moved away from the old IronPython2 engine towards a new PythonNet3 engine. The IronPython engine is still available as a package from the Dynamo package manager, but only the PythonNet3 engine will be supported.
zh_tw: Dynamo has moved away from the old IronPython2 engine towards a new PythonNet3 engine. The IronPython engine is still available as a package from the Dynamo package manager, but only the PythonNet3 engine will be supported.

# IronPythonDialogSummary
source: This graph contains nodes that reference an outdated Python engine.
cs_cz: Tento graf obsahuje uzly, které odkazují na zastaralý modul Python.
de_de: Dieses Diagramm enthält Blöcke, die auf eine veraltete Python-Engine verweisen.
es_es: Este gráfico contiene nodos que hacen referencia a un motor de Python obsoleto.
fr_fr: Ce graphique contient des noeuds qui font référence à un moteur Python obsolète.
it_it: Questo grafico contiene nodi che fanno riferimento ad un motore Python obsoleto.
ja_jp: このグラフには、古い Python エンジンを参照するノードが含まれています。
ko_kr: 이 그래프에는 오래된 Python 엔진을 참조하는 노드가 포함되어 있습니다.
pl_pl: Wykres zawiera węzły, które odnoszą się do przestarzałego silnika języka Python.
pt_br: Este gráfico contém nós que referenciam um mecanismo Python desatualizado.
ru_ru: Этот график содержит узлы, ссылающиеся на устаревший механизм Python.
zh_cn: 此图形包含引用过期 Python 引擎的节点。
zh_tw: 此圖表包含的節點參考過期的 Python 引擎。

# IronPythonDialogTitle
source: Graph contains outdated Python engine
cs_cz: Graf obsahuje zastaralý modul Python.
de_de: Diagramm enthält veraltete Python-Engine
es_es: El gráfico contiene un motor de Python obsoleto
fr_fr: Le graphique contient un moteur Python obsolète
it_it: Il grafico contiene il motore Python obsoleto
ja_jp: グラフに古い Python エンジンが含まれています
ko_kr: 그래프에 오래된 Python 엔진이 포함되어 있음
pl_pl: Wykres zawiera nieaktualny silnik języka Python
pt_br: O gráfico contém o mecanismo Python desatualizado
ru_ru: График содержит устаревший механизм Python
zh_cn: 图表包含过时的 Python 引擎
zh_tw: 圖表包含過期的 Python 引擎

# IronPythonDisableAlertMessage
source: Do not show again.
cs_cz: Nezobrazovat znovu.
de_de: Nicht mehr anzeigen.
es_es: No volver a mostrar.
fr_fr: Ne plus afficher.
it_it: Non mostrare di nuovo.
ja_jp: 次回からこのダイアログを表示しない
ko_kr: 다시 표시하지 않습니다.
pl_pl: Nie pokazuj ponownie.
pt_br: Não mostrar novamente.
ru_ru: Больше не показывать.
zh_cn: 不再显示。
zh_tw: 不要再顯示。

# IronPythonNotificationDetailedMessage
source: This graph currently contains python nodes that are using the old IronPython Engine which will be deprecated in later versions.Consider updating these nodes to use the new CPython 3.7 Engine.
cs_cz: Tento graf aktuálně obsahuje uzly jazyka Python používající starý modul IronPython, který byl vyřazen. Zvažte aktualizaci těchto uzlů tak, aby využívaly nový modul CPython 3.7.
de_de: Dieses Diagramm enthält derzeit Python-Blöcke, die die alte IronPython-Engine verwenden, die in neueren Versionen nicht mehr unterstützt wird. Aktualisieren Sie diese Blöcke ggf., um die neue CPython 3.7-Engine zu verwenden.
es_es: Este gráfico contiene actualmente nodos de Python que utilizan el anterior motor de IronPython, que se ha dejado de utilizar. Considere la posibilidad de actualizar estos nodos para utilizar el nuevo motor de CPython 3.7.
fr_fr: Ce graphique contient actuellement des noeuds Python qui utilisent l'ancien moteur IronPython, qui est obsolète. Pensez à mettre à jour ces noeuds pour utiliser le nouveau moteur CPython 3.7.
it_it: Questo grafico attualmente contiene nodi Python che utilizzano il vecchio motore IronPython, il quale è stato dichiarato obsoleto. Provare ad aggiornare questi nodi per utilizzare il nuovo motore CPython 3.7.
ja_jp: 現在このグラフには、廃止された旧式の IronPython エンジンを使用する Python ノードが含まれています。このノードを更新し、新しい CPython 3.7 エンジンを使用することをご検討ください。
ko_kr: 이 그래프에는 현재 사용되지 않는 이전 IronPython 엔진을 사용하는 Python 노드가 포함되어 있습니다. 이러한 노드를 업데이트하여 새 CPython 3.7 엔진을 사용해 보십시오.
pl_pl: Ten wykres zawiera aktualnie węzły w języku Python korzystające ze starego aparatu IronPython, który został wycofany. Rozważ zaktualizowanie tych węzłów, aby używały nowego aparatu PythonNet3.
pt_br: Esse gráfico atualmente contém nós Python que estão usando o antigo mecanismo IronPython, que se tornou obsoleto. Considere atualizar esses nós para usar o novo mecanismo CPython 3.7.
ru_ru: В настоящее время этот график содержит узлы Python, в которых используется устаревший механизм IronPython. Он выведен из использования. Обновите эти узлы для использования нового механизма CPython 3.7.
zh_cn: This graph currently contains python nodes that are using the old IronPython Engine which has been deprecated. Consider updating these nodes to use the new PythonNet3 Engine.
zh_tw: This graph currently contains python nodes that are using the old IronPython Engine which has been deprecated. Consider updating these nodes to use the new PythonNet3 Engine.

# IronPythonNotificationShortMessage
source: This graph currently contains nodes that are using the old IronPython2 (Python 2) engine which will be deprecated in later versions. A new CPython3 (Python 3) has been implemented and is accessible inside the Python editor.
cs_cz: Tento graf aktuálně obsahuje uzly používající starý modul IronPython2 (Python 2), který byl vyřazen. Byl implementován nový modul CPython3 (Python 3) a je přístupný v editoru jazyka Python.
de_de: Dieses Diagramm enthält derzeit Blöcke, die die alte IronPython2-Engine (Python 2) verwenden, die in neueren Versionen nicht mehr unterstützt wird. Eine neue CPython3-Engine (Python 3) wurde implementiert und kann im Python-Editor aufgerufen werden.
es_es: Este gráfico contiene actualmente nodos que utilizan el motor anterior de IronPython2 (Python 2), que se ha dejado de utilizar. Se ha implementado un nuevo CPython3 (Python 3), al que se puede acceder en el editor de Python.
fr_fr: Ce graphique contient actuellement des noeuds qui utilisent l'ancien moteur IronPython2 (Python 2), qui est obsolète. Un nouveau moteur CPython3 (Python 3) est disponible dans l'éditeur Python.
it_it: Questo grafico attualmente contiene nodi che utilizzano il vecchio motore IronPython2 (Python 2), il quale è stato dichiarato obsoleto. È stato implementato un nuovo motore CPython3 (Python 3), che è accessibile all'interno dell'editor di Python.
ja_jp: 現在このグラフには、廃止された旧式の IronPython2 (Python 2)エンジンを使用したノードが含まれています。新しい CPython3 (Python 3)が実装されており、Python エディタ内で利用可能です。
ko_kr: 이 그래프에는 현재 사용되지 않는 이전 IronPython2(Python 2) 엔진을 사용하는 노드가 포함되어 있습니다. 새 CPython3(Python 3)이 구현되었으며 Python 편집기 내에서 액세스 가능합니다.
pl_pl: Ten wykres zawiera aktualnie węzły korzystające ze starego aparatu IronPython2, który został wycofany. Zaimplementowano nowy aparat PythonNet3, który jest dostępny w edytorze Python.
pt_br: Esse gráfico atualmente contém nós que estão usando o antigo mecanismo IronPython2 (Python 2), que se tornou obsoleto. Um novo CPython3 (Python 3) foi implementado e está acessível dentro do editor do Python.
ru_ru: В настоящее время этот график содержит узлы, в которых используется устаревший механизм IronPython2 (Python 2). Он выведен из использования. Реализован новый механизм CPython3 (Python 3), который доступен в редакторе Python.
zh_cn: This graph currently contains nodes that are using the old IronPython2 engine which has been deprecated. A new PythonNet3 has been implemented and is accessible inside the Python editor.
zh_tw: This graph currently contains nodes that are using the old IronPython2 engine which has been deprecated. A new PythonNet3 has been implemented and is accessible inside the Python editor.

# MigrationAssistantDisclaimerContinueButtonContent
source: Continue
cs_cz: Pokračovat
de_de: Weiter
es_es: Continuar
fr_fr: Continuer
it_it: Continua
ja_jp: 続行
ko_kr: 계속
pl_pl: Kontynuuj
pt_br: Continuar
ru_ru: Продолжить
zh_cn: 继续
zh_tw: 繼續

# MigrationAssistantDisclaimerDecline
source: Decline
cs_cz: Odmítnout
de_de: Ablehnen
es_es: Rechazar
fr_fr: Refuser
it_it: Rifiuta
ja_jp: 拒否
ko_kr: 거부
pl_pl: Odmów
pt_br: Recusar
ru_ru: Отклонить
zh_cn: 拒绝
zh_tw: 拒絕

# MigrationAssistantDisclaimerDisable
source: Do not show again.
cs_cz: Nezobrazovat znovu.
de_de: Nicht mehr anzeigen.
es_es: No volver a mostrar.
fr_fr: Ne plus afficher.
it_it: Non mostrare di nuovo.
ja_jp: 次回からこれを表示しない
ko_kr: 다시 표시하지 않습니다.
pl_pl: Nie pokazuj ponownie.
pt_br: Não mostrar novamente.
ru_ru: Больше не показывать.
zh_cn: 不再显示。
zh_tw: 不要再顯示。

# MigrationAssistantDisclaimerHeader
source: You are about to make changes to your Python code
cs_cz: Chystáte se provést změny v kódu jazyka Python
de_de: Sie sind im Begriff, Änderungen am Python-Code vorzunehmen
es_es: Está a punto de realizar cambios en el código de Python.
fr_fr: Vous êtes sur le point d'apporter des modifications à votre code Python
it_it: Si stanno per apportare modifiche al codice Python
ja_jp: Python コードを変更しようとしています
ko_kr: Python 코드를 변경하려고 함
pl_pl: Zamierzasz wprowadzić zmiany w kodzie języka Python
pt_br: Você está prestes a fazer alterações no código Python
ru_ru: Вы собираетесь внести изменения в код Python
zh_cn: 您即将更改 Python 代码
zh_tw: 您即將變更您的 Python 程式碼

# MigrationAssistantDisclaimerMessage
source: The Migration Assistant helps users to update scripts from Python 2 to Python 3. By clicking “Continue”, you are agreeing to implement the syntax changes to your source code as suggested by the Migration Assistant. The Migration Assistant is a component of open source Dynamo, and as such it is licensed to you under the terms of the Apache License 2.0 (https://www.apache.org/licenses/LICENSE-2.0 ). Under the terms of the Apache License 2.0, Dynamo and the Migration Assistant are provided to you on an “AS IS” basis.
cs_cz: Nástroj Migration Assistant pomáhá uživatelům aktualizovat skripty z verze Python 2 do verze Python 3. Kliknutím na tlačítko Pokračovat souhlasíte s implementací změn syntaxe zdrojového kódu, jak je doporučeno v nástroji Migration Assistant. Nástroj Migration Assistant je komponentou Open Source aplikace Dynamo. A jako taková podléhá licenci Apache 2.0 (https://www.apache.org/licenses/LICENSE-2.0). Podle podmínek licence Apache 2.0 je pro vás software Dynamo a Migration Assistant k dispozici, tak jak je.
de_de: Der Migrationsassistent unterstützt Benutzer beim Aktualisieren von Skripten aus Python 2 auf Python 3. Durch Klicken auf Weiter erklären Sie sich damit einverstanden, die Syntaxänderungen in Ihrem Quellcode zu implementieren, die vom Migrationsassistenten vorgeschlagen wurden. Der Migrationsassistent ist eine Komponente von Dynamo (Open Source) und entsprechend unter den Bedingungen von Apache License 2.0 (https://www.apache.org/licenses/LICENSE-2.0) lizenziert. Dynamo und der Migrationsassistent werden Ihnen unter den Bedingungen von Apache License 2.0 "wie gesehen" zur Verfügung gestellt.
es_es: El Asistente de migración ayuda a los usuarios a actualizar secuencias de comandos de Python 2 a Python 3. Al hacer clic en "Continuar", acepta la implementación de los cambios de sintaxis en el código fuente según lo sugerido por el Asistente de migración. El Asistente de migración es un componente de Dynamo de código abierto, por lo que se le proporciona bajo licencia según los términos de Apache License 2.0 (https://www.apache.org/licenses/LICENSE-2.0). Según los términos de Apache License 2.0, Dynamo y el Asistente de migración se proporcionan "TAL CUAL".
fr_fr: L'assistant de migration permet aux utilisateurs de mettre à jour des scripts Python 2 vers la version Python 3. En cliquant sur "Continuer", vous acceptez d'appliquer les modifications de syntaxe à votre code source comme suggéré par l'assistant de migration. L'assistant de migration est un composant de Dynamo open source. De ce fait, il vous est accordé sous licence conformément aux conditions de la licence Apache version 2.0 (https://www.apache.org/licenses/LICENSE-2.0 ). Selon les conditions de la licence Apache version 2.0, Dynamo et l'assistant de migration vous sont fournis en l'état.
it_it: Migration Assistant consente agli utenti di aggiornare gli script da Python 2 a Python 3. Facendo clic su "Continua", si accettano di implementare le modifiche della sintassi nel codice sorgente come suggerito da Migration Assistant. Migration Assistant è un componente di Dynamo open source e, in quanto tale, viene concesso in licenza in base ai termini della licenza Apache License 2.0 (https://www.apache.org/licenses/LICENSE-2.0). Secondo i termini della licenza Apache License 2.0, Dynamo e Migration Assistant vengono forniti all'utente "COSÌ COME SONO".
ja_jp: マイグレーション アシスタントを使用すると、Python 2 から Python 3 にスクリプトを更新できます。 [続行]をクリックすると、マイグレーション アシスタントによって推奨されたソース コードへの構文変更の適用に同意したものとみなされます。マイグレーション アシスタントはオープン ソース Dynamo のコンポーネントであり、Apache License 2.0 (https://www.apache.org/licenses/LICENSE-2.0)の条件の下でユーザにライセンスされます。Apache License 2.0、Dynamo、およびマイグレーション アシスタントは「現状有姿」で提供されます。
ko_kr: 마이그레이션 보조 도구를 사용하면 사용자가 Python 2에서 Python 3으로 스크립트를 업데이트할 수 있습니다. "계속"을 클릭하면 마이그레이션 보조 도구에서 제안한 대로 소스 코드에 구문 변경 사항을 구현하는 데 동의하게 됩니다. 마이그레이션 보조 도구는 오픈 소스 Dynamo의 구성요소입니다. 따라서 Apache License 2.0(https://www.apache.org/licenses/LICENSE-2.0)의 약관에 따라 사용자에게 라이센스가 부여됩니다. Apache License 2.0의 약관에 따라 Dynamo 및 마이그레이션 보조 도구는 "그대로" 제공됩니다.
pl_pl: Program Migration Assistant ułatwia użytkownikom aktualizowanie skryptów w języku IronPython2 do wersji PythonNet3. Kliknięcie przycisku Kontynuuj oznacza zaakceptowanie wprowadzenia zmian w składni kodu źródłowego zgodnie z sugestiami programu Migration Assistant. Program ten jest elementem dodatku open source Dynamo. W związku z tym jest licencjonowany w oparciu o licencję Apache License 2.0 (https://www.apache.org/licenses/LICENSE-2.0). Zgodnie z warunkami licencji Apache License 2.0 dodatek Dynamo i program Migration Assistant są udostępniane „w stanie, w jakim się znajdują”.
pt_br: O Assistente de migração ajuda os usuários a atualizar os scripts do Python 2 para o Python 3. Ao clicar em “Continuar”, você está concordando em implementar as alterações de sintaxe para o código de origem como sugerido pelo Assistente de migração. O Assistente de migração é um componente do Dynamode de código aberto e, como tal, é licenciado nos termos da Licença do Apache 2.0 (https://www.apache.org/licenses/LICENSE-2.0). Nos termos da Licença do Apache 2.0, o Dynamo e o Assistente de migração são fornecidos “como estão”.
ru_ru: Migration Assistant позволяет обновлять сценарии версии Python 2 до версии Python 3. Нажимая кнопку «Продолжить», вы принимаете изменения синтаксиса исходного кода, предложенные Migration Assistant. Это компонент открытого исходного кода Dynamo, лицензия на который предоставляется вам в соответствии с условиями Apache License 2.0 (https://www.apache.org/licenses/LICENSE-2.0). Согласно им, Dynamo и Migration Assistant предоставляются вам по принципу КАК ЕСТЬ.
zh_cn: The Migration Assistant helps users to update scripts from IronPython2 to PythonNet3. By clicking “Continue”, you are agreeing to implement the syntax changes to your source code as suggested by the Migration Assistant. The Migration Assistant is a component of open source Dynamo, and as such it is licensed to you under the terms of the Apache License 2.0 (https://www.apache.org/licenses/LICENSE-2.0 ). Under the terms of the Apache License 2.0, Dynamo and the Migration Assistant are provided to you on an “AS IS” basis.
zh_tw: The Migration Assistant helps users to update scripts from IronPython2 to PythonNet3. By clicking “Continue”, you are agreeing to implement the syntax changes to your source code as suggested by the Migration Assistant. The Migration Assistant is a component of open source Dynamo, and as such it is licensed to you under the terms of the Apache License 2.0 (https://www.apache.org/licenses/LICENSE-2.0 ). Under the terms of the Apache License 2.0, Dynamo and the Migration Assistant are provided to you on an “AS IS” basis.

# MigrationAssistantDisclaimerWindowTitle
source: Migration Assistant Disclaimer
cs_cz: Migration Assistant – omezení odpovědnosti
de_de: Haftungsausschluss des Migrationsassistenten
es_es: Renuncia de responsabilidad del Asistente de migración
fr_fr: Limitation de responsabilité de l'assistant de migration
it_it: Declinazione di responsabilità di Migration Assistant
ja_jp: マイグレーション アシスタントの免責条項
ko_kr: 마이그레이션 보조 도구 고지 사항
pl_pl: Migration Assistant — zrzeczenie odpowiedzialności
pt_br: Aviso de isenção de responsabilidade do Assistente de migração
ru_ru: Migration Assistant: отказ от ответственности
zh_cn: 移植助手免责声明
zh_tw: 「移轉助理」免責聲明

# MigrationAssistantNoChangesStateHeader
source: Nothing to see here!
cs_cz: Zde nic není.
de_de: Keine Inhalte vorhanden!
es_es: No se ha realizado ningún cambio.
fr_fr: Rien à voir ici.
it_it: Nessun elemento da visualizzare.
ja_jp: ここに表示するものはありません
ko_kr: 여기에 표시되는 항목이 없음
pl_pl: Nie ma tu nic do oglądania!
pt_br: Nada para ver aqui.
ru_ru: Ничего нет.
zh_cn: 此处没有可供查看的内容！
zh_tw: 這裡沒有可查看的內容！

# MigrationAssistantNoChangesStateMessage
source: Your code is ready to run with the Python 3 engine. Click accept and we'll switch to the Python 3 engine for you.
cs_cz: Váš kód je připraven ke spuštění v modulu Python 3. Kliknutím na tlačítko Přijmout se přepnete do modulu Python 3.
de_de: Der Code kann jetzt mit der Python 3-Engine ausgeführt werden. Wenn Sie auf Übernehmen klicken, führen wir den Wechsel zur Python 3-Engine für Sie durch.
es_es: El código está listo para ejecutarse con el motor de Python 3. Haga clic en Aceptar y pasaremos al motor de Python 3.
fr_fr: Votre code est prêt à être exécuté avec le moteur Python 3. Cliquez sur Accepter afin que nous passions au moteur Python 3 pour vous.
it_it: Il codice è pronto per essere eseguito con il motore Python 3. Fare clic su Accetta e si passerà al motore Python 3.
ja_jp: Python 3 エンジンを使用してコードを実行する準備が整いました。[適用]をクリックすると、Python 3 エンジンに切り替わります。
ko_kr: 코드가 Python 3 엔진에서 실행될 준비가 되었습니다. 동의를 클릭하면 Python 3 엔진으로 전환됩니다.
pl_pl: Kod jest gotowy do uruchamiania za pomocą aparatu PythonNet3. Kliknij przycisk Akceptuj, a nastąpi przełączenie na aparat PythonNet3.
pt_br: O código está pronto para ser executado com o mecanismo Python 3. Clique em Aceitar para alternarmos para o mecanismo Python 3 por você.
ru_ru: Код готов к выполнению с использованием механизма Python 3. Нажмите кнопку «Принять», чтобы переключиться на механизм Python 3.
zh_cn: Your code is ready to run with the PythonNet3 engine. Click accept and we'll switch to the PythonNet3 engine for you.
zh_tw: Your code is ready to run with the PythonNet3 engine. Click accept and we'll switch to the PythonNet3 engine for you.

# MigrationAssistantErrorStateHeader
source: There is an error in your code!
cs_cz: Ve vašem kódu je chyba.
de_de: Ihr Code enthält einen Fehler!
es_es: Hay un error en el código.
fr_fr: Votre code comporte une erreur.
it_it: È presente un errore nel codice.
ja_jp: コードの中にエラーがあります!
ko_kr: 코드에 오류가 있습니다!
pl_pl: W kodzie jest błąd!
pt_br: Existe um erro no código.
ru_ru: В вашем коде содержится ошибка.
zh_cn: 您的代码中存在错误！
zh_tw: 您的程式碼有錯誤！
