DSCore.Data.DataNodeDynamoType
Klasa reprezentująca typ danych (DataType) obsługiwany przez dodatek Dynamo

DSCore.Data.DataNodeDynamoType.#ctor(System.Type,System.String,System.String)
Klasa reprezentująca typ danych (DataType) obsługiwany przez dodatek Dynamo

DSCore.Data.DataNodeDynamoType.Type
Typ podstawowy

DSCore.Data.DataNodeDynamoType.Name
Opcjonalna nazwa do zastąpienia nazwy typu (`Number` zamiast `long`)

DSCore.Data.DataNodeDynamoType.TypeId
Format przewodu $typeid (np. „autodesk.math:point3d-1.0.0”).
Ma wartość null dla typów podstawowych, w których nie występuje serializacja $typeid.

DSCore.Data.DataNodeDynamoType.Level
Poziom hierarchiczny, który ma być wyświetlany w interfejsie użytkownika

DSCore.Data.DataNodeDynamoType.IsLastChild
Czy typ jest ostatnim elementem podrzędnym hierarchii (dla celów interfejsu użytkownika)

DSCore.Data.DataNodeDynamoType.Parent
Element nadrzędny typu, jeśli istnieje