DSCore.CurveMapper.PerlinNoiseCurve
Reprezentuje krzywą szumu Perlina w węźle CurveMapper.
Krzywa generuje szum proceduralny na podstawie punktów sterujących i funkcji szumu Perlina.

DSCore.CurveMapper.PerlinNoiseCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Zwraca wartości X i Y rozłożone na krzywej.