DSCore.IO.FileSystem
Metody pracy z plikami.

DSCore.IO.FileSystem.AbsolutePath(System.String,System.String)
Zwraca ścieżkę bezwzględną określoną na podstawie podanej ścieżki. Jeśli podana ścieżka jest
ścieżką względną, jest rozwiązywana z uwzględnieniem bieżącego
obszaru roboczego. Jeśli plik nie istnieje w ścieżce względnej, ale istnieje
w danym hintPath, zwracany jest hintPath.
path: Ścieżka względna lub pełna ścieżka
hintPath: Ostatnia rozwiązana ścieżka
Returns: Ścieżka bezwzględna

DSCore.IO.FileSystem.FileFromPath(System.String)
Tworzy obiekt pliku z określonej ścieżki pliku.

DSCore.IO.FileSystem.ReadText(System.IO.FileInfo)
Odczytuje plik tekstowy i zwraca jego zawartość jako ciąg.
file: Obiekt pliku, z którego ma zostać odczytany tekst
Zawartość pliku tekstowego.
read file,text,file

DSCore.IO.FileSystem.MoveFile(System.String,System.String,System.Boolean)
Przenosi określony plik do nowej lokalizacji
path: Istniejąca ścieżka w postaci ciągu
newPath: Nowa ścieżka w postaci ciągu
overwrite: Przełącz, aby nadpisać istniejące pliki
Węzeł wykonuje zadanie, nie tworzy danych wyjściowych

DSCore.IO.FileSystem.DeleteFile(System.String)
Usuwa określony plik.
path: Ścieżka pliku do usunięcia
Węzeł wykonuje zadanie, nie tworzy danych wyjściowych

DSCore.IO.FileSystem.CopyFile(System.IO.FileInfo,System.String,System.Boolean)
Kopiuje plik.
file: Obiekt pliku do skopiowania
destinationPath: Ścieżka pliku docelowego w postaci ciągu
overwrite: Przełącz, aby nadpisać istniejące pliki
Węzeł wykonuje zadanie i zwraca wartość prawda (true) w przypadku pomyślnego wykonania kopiowania.

DSCore.IO.FileSystem.FileExists(System.String)
Określa, czy w podanej ścieżce istnieje plik.
path: Ciąg reprezentujący ścieżkę pliku
Prawda, jeśli plik istnieje, fałsz, jeśli nie
filepath

DSCore.IO.FileSystem.WriteText(System.String,System.String)
Zapisz tekst w pliku określonym przez ścieżkę
filePath: Ścieżka do zapisania
text: Zawartość tekstowa
Brak danych wyjściowych
write file,text,file,filepath

DSCore.IO.FileSystem.AppendText(System.String,System.String)
Dołącz zawartość tekstową do pliku określonego przez ścieżkę
filePath: Ścieżka do zapisania
text: Zawartość tekstowa
Węzeł wykonuje zadanie, nie tworzy danych wyjściowych
append file,write file,text,file,filepath

DSCore.IO.FileSystem.CombinePath(System.String[])
Łączy wiele ciągów w jedną ścieżkę pliku.
strings: Ciągi do połączenia w ścieżkę
Połączona ścieżka pliku

DSCore.IO.FileSystem.FileExtension(System.String)
Zwraca rozszerzenie ze ścieżki pliku.
path: Ścieżka do pobrania rozszerzenia
Rozszerzenie pliku

DSCore.IO.FileSystem.ChangePathExtension(System.String,System.String)
Zmienia rozszerzenie ścieżki pliku.
path: Ścieżka do zmiany rozszerzenia
newExtension: Nowe rozszerzenie w postaci ciągu
Ścieżka pliku ze zmienionym rozszerzeniem

DSCore.IO.FileSystem.DirectoryName(System.String)
Zwraca nazwę katalogu ścieżki pliku.
path: Ścieżka do pobrania informacji o katalogu
Nazwa katalogu ścieżki pliku
directorypath

DSCore.IO.FileSystem.FileName(System.String,System.Boolean)
Zwraca nazwę pliku ścieżki pliku.
path: Ścieżka do pobrania nazwy pliku
withExtension: Przełącz, aby uwzględnić rozszerzenie w wyniku
Nazwa pliku ze ścieżki pliku

DSCore.IO.FileSystem.FileHasExtension(System.String)
Określa, czy ścieżka pliku zawiera rozszerzenie.
path: Ścieżka do sprawdzenia rozszerzenia
Prawda, jeśli ścieżka zawiera rozszerzenie, fałsz, jeśli nie

DSCore.IO.FileSystem.GetDirectoryContents(System.IO.DirectoryInfo,System.String,System.Boolean)
Zwróci listę plików i katalogów, które znajdują się w danym katalogu. Opcjonalnego ciągu wyszukiwania (searchString) można użyć do filtrowania wyników.
directory: Katalog, którego zawartość należy pobrać
searchString: Ciąg wyszukiwania używany do filtrowania wyników
includeSubdirectories: Ustaw wartość prawda, aby uwzględnić pliki i foldery w podkatalogach (rekurencja), lub ustaw wartość fałsz, aby uwzględnić wyniki tylko z najwyższego poziomu danego katalogu.
Pliki wynikowe zapytania
Katalogi wynikowe zapytania

DSCore.IO.FileSystem.CopyDirectory(System.IO.DirectoryInfo,System.String,System.Boolean)
Kopiuje katalog do lokalizacji docelowej.
directory: Katalog do skopiowania
destinationPath: Docelowa lokalizacja operacji kopiowania na dysku
overwriteFiles: Przełącz, aby nadpisać istniejący katalog
Węzeł wykonuje zadanie, nie tworzy danych wyjściowych

DSCore.IO.FileSystem.DeleteDirectory(System.String,System.Boolean)
Usuwa katalog.
path: Ścieżka do katalogu na dysku
recursive: Czy cała zawartość katalogu ma zostać usunięta (wartość domyślna: fałsz).
Węzeł wykonuje zadanie, nie tworzy danych wyjściowych

DSCore.IO.FileSystem.DirectoryExists(System.String)
Określa, czy w podanej ścieżce istnieje katalog.
path: Ścieżka do katalogu na dysku
Prawda, jeśli katalog istnieje, fałsz, jeśli nie
directorypath

DSCore.IO.FileSystem.MoveDirectory(System.String,System.String,System.Boolean)
Przenosi katalog do nowej lokalizacji.
path: Istniejąca ścieżka w postaci ciągu
newPath: Nowa ścieżka w postaci ciągu
overwriteFiles: Przełącz, aby nadpisać istniejące pliki
Węzeł wykonuje zadanie, nie tworzy danych wyjściowych