DSCore.ColorRange1D.ByColorsAndParameters(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double})
Utwórz ColorRange1D poprzez podanie list kolorów i parametrów.
colors: Lista kolorów.
parameters: Lista parametrów w zakresie od 0.0 do 1.0.
Returns: Obiekt ColorRange1D.

DSCore.ColorRange1D.GetColorAtParameter(DSCore.ColorRange1D,System.Double)
Zwraca kolor w tym zakresie kolorów dla określonego parametru.
parameter: Wartości z zakresu od 0.0 do 1.0.
Returns: Kolor.

DSCore.ColorRange1D.Default
Utwórz ColorRange1D z domyślnym schematem kolorów.