DSCore.TimeSpan
Obiekt przedstawiający czas, jaki upłynął, bez określonego początku lub końca.

DSCore.TimeSpan.ByDateDifference(System.DateTime,System.DateTime)
Oblicza nową wartość TimeSpan na podstawie różnicy w czasie między dwiema wartościami DateTime
dateTime: Wartość DateTime, od której należy odjąć
otherDateTime: Wartość DateTime do odjęcia
Różnica TimeSpan między dwiema datami

DSCore.TimeSpan.Zero
Wartość TimeSpan reprezentująca czas, który upłynął od wartości zero.
Wartość TimeSpan reprezentująca upływ czasu równy zero

DSCore.TimeSpan.MaxValue
Największa wartość TimeSpan, jaka może być przedstawiona.
Maksymalna możliwa reprezentacja TimeSpan

DSCore.TimeSpan.MinValue
Najmniejsza wartość TimeSpan, jaka może być przedstawiona.
Minimalna możliwa reprezentacja TimeSpan

DSCore.TimeSpan.Create(System.Double,System.Double,System.Double,System.Double,System.Double)
Tworzy nową wartość TimeSpan z przedziału czasowego.
days: Dni w przedziale czasowym.
hours: Godziny w przedziale czasowym.
minutes: Minuty w przedziale czasowym.
seconds: Sekundy w przedziale czasowym.
milliseconds: Milisekundy w przedziale czasowym.
Utworzona wartość TimeSpan

DSCore.TimeSpan.Scale(System.TimeSpan,System.Double)
Mnoży wartość TimeSpan przez współczynnik skali
timeSpan: TimeSpan do pomnożenia
scaleFactor: Wartość skalowania TimeSpan. Na przykład współczynnik skali wynoszący 2
podwoi ilość czasu w przedziale czasowym.
Iloczyn TimeSpan

DSCore.TimeSpan.Negate(System.TimeSpan)
Neguje wartość TimeSpan
timeSpan: TimeSpan do zanegowania
Wartość ujemna TimeSpan

DSCore.TimeSpan.Add(System.TimeSpan,System.TimeSpan)
Dodaje dwie wartości TimeSpan
timeSpan1: TimeSpan do dodania
timeSpan2: Inna wartość TimeSpan do dodania
Wartość TimeSpan będąca wynikiem dodawania

DSCore.TimeSpan.Subtract(System.TimeSpan,System.TimeSpan)
Odejmuje dwie wartości TimeSpan
timeSpan1: Wartość TimeSpan, od której należy odjąć
timeSpan2: Wartość TimeSpan do odjęcia
Wynikowy przedział czasu odjęcia

DSCore.TimeSpan.FromString(System.String)
Próbuje przetworzyć wartość TimeSpan z ciągu
string: Wartość TimeSpan w postaci ciągu.
TimeSpan z przetworzonego ciągu

DSCore.TimeSpan.Components(System.TimeSpan)
Wyodrębnia poszczególne składowe TimeSpan.
timeSpan: Wartość TimeSpan, z której zostaną pobrane składniki
Liczba dni (typ int)
Liczba godzin (typ int)
Liczba minut (typ int)
Liczba sekund (typ int)
Liczba milisekund (typ int)

DSCore.TimeSpan.TotalDays(System.TimeSpan)
Przekształca całkowitą ilość czasu reprezentowaną przez TimeSpan na
przybliżoną liczbę dni.
timeSpan: Wartość TimeSpan, z której zostanie pobrana całkowita liczba dni
Łączna liczba dni

DSCore.TimeSpan.TotalHours(System.TimeSpan)
Przekształca całkowitą ilość czasu reprezentowaną przez TimeSpan na
przybliżoną liczbę godzin.
timeSpan: Wartość TimeSpan, z której zostanie pobrana całkowita liczba godzin
Łączna liczba godzin

DSCore.TimeSpan.TotalMinutes(System.TimeSpan)
Przekształca całkowitą ilość czasu reprezentowaną przez TimeSpan na
przybliżoną liczbę minut.
timeSpan: Wartość TimeSpan, z której zostanie pobrana całkowita liczba minut
Łączna liczba minut

DSCore.TimeSpan.TotalSeconds(System.TimeSpan)
Przekształca całkowitą ilość czasu reprezentowaną przez TimeSpan na
przybliżoną liczbę sekund.
timeSpan: Wartość TimeSpan, z której zostanie pobrana całkowita liczba sekund
Łączna liczba sekund

DSCore.TimeSpan.TotalMilliseconds(System.TimeSpan)
Przekształca całkowitą ilość czasu reprezentowaną przez TimeSpan na
przybliżoną liczbę milisekund.
timeSpan: Wartość TimeSpan, z której zostanie pobrana liczba milisekund
Łączna liczba milisekund