DSCore.Compare
Metody porównawcze.

DSCore.Compare.GreaterThan(System.Object,System.Object)
Zwraca wartość TRUE, jeśli jest większa niż B.
a: Obiekt porównywalny.
b: Obiekt porównywalny.
Wynik operacji logicznych.
larger,bigger

DSCore.Compare.GreaterThanOrEqual(System.Object,System.Object)
Zwraca wartość TRUE, jeśli A jest większa niż lub równa B.
a: Obiekt porównywalny.
b: Obiekt porównywalny.
Wynik operacji logicznych.
larger,bigger,equal

DSCore.Compare.LessThan(System.Object,System.Object)
Zwraca wartość TRUE, jeśli A jest mniejsza niż B.
a: Obiekt porównywalny.
b: Obiekt porównywalny.
Wynik operacji logicznych.
less,smaller

DSCore.Compare.LessThanOrEqual(System.Object,System.Object)
Zwraca wartość TRUE, jeśli jest mniejsza niż lub równa B.
a: Obiekt porównywalny.
b: Obiekt porównywalny.
Wynik operacji logicznych.
smaller,equal