DSCore.Object
Ogólne funkcje działające na wszystkich danych.

DSCore.Object.IsNull(System.Object)
Określa, czy podany obiekt ma wartość null.
object: Obiekt do przetestowania.
Czy obiekt jest pusty.
is null

DSCore.Object.Identity(System.Object)
Zwraca to, co zostało przekazane, nie wykonując żadnej operacji.
object: Obiekt.
Ten sam obiekt

DSCore.Object.Type(System.Object)
Zwraca typ obiektu reprezentowany jako ciąg.
object: Obiekt, którego typ należy sprawdzić
Returns: Typ obiektu.