DSCore.Thread
Funkcje do zarządzania wątkami ocen.

DSCore.Thread.Pause(System.Object,System.Int32)
Wstrzymuje bieżący wątek oceny na dany okres czasu.
object: Obiekt do przejścia.
msTimeout: Czas, na jaki zostanie wstrzymany wątek, w milisekundach.
Obiekt, przez który przeszedł element.