DSCore.ObjectComparer
Wprowadza funkcję porównania dla dwóch obiektów za pomocą następującej reguły.
1. Przyjmuje się, że liczby są najmniejsze, następnie wartości logiczne, ciągi i wskaźniki.
2. Jeśli dwa obiekty są IComparable i tego samego typu, wtedy użyj
własnego mechanizmu porównania.
3. Jeśli oba elementy wejściowe mają typ wartości, a jednym z nich jest wartość logiczna, wartość logiczna jest większa
4. Jeśli tak nie jest przekształć je w liczby podwójne i porównaj.
5. A jeśli tylko jeden jest typem wartości, wtedy obiekt typu wartości jest mniejszy
6. A jeśli tylko jeden jest ciągiem, wtedy ciąg jest mniejszy niż inne
7. A jeśli nie wiadomo, jak porównać, najlepiej jest je porównać na podstawie HashCode.