DSCore.Properties.Resources
Silnie typizowana klasa zasobów do wyszukiwania zlokalizowanych łańcuchów itp.

DSCore.Properties.Resources.ResourceManager
Zwraca buforowane wystąpienie Menedżera Zasobów używane przez tę klasę.

DSCore.Properties.Resources.Culture
Nadpisuje właściwość bieżącego wątku CurrentUICulture dla wszystkich wyszukań zasobów przy użyciu tej silnie typizowanej klasy zasobów.

DSCore.Properties.Resources.BitmapOverflowError
Wyszukuje zlokalizowany ciąg podobny do: Podane dane kolorów są zbyt duże, aby zmieściły się w granicach obrazu.

DSCore.Properties.Resources.CurveMapperEqualMinMaxWarning
Wyszukuje zlokalizowany ciąg podobny do: • Wartości minimalne i maksymalne muszą się różnić.

DSCore.Properties.Resources.CurveMapperInvalidCountWarning
Wyszukuje zlokalizowany ciąg podobny do: • Wartości muszą być listą liczb lub pojedynczą liczbą ≥ 2.

DSCore.Properties.Resources.CurveMapperInvalidCurveWarning
Wyszukuje zlokalizowany ciąg podobny do: • Punkty sterowania dla wybranej krzywej nie są prawidłowe.

DSCore.Properties.Resources.CurveMapperInvalidXYFormatWarning
Wyszukuje zlokalizowany ciąg podobny do: • Dane wejściowe X i Y muszą być pojedynczymi liczbami (nie listami).

DSCore.Properties.Resources.DefineDataSupportedInputValueExceptionMessage
Wyszukuje zlokalizowany ciąg podobny do: Dane wejściowe muszą być pojedynczą wartością lub listą niezagnieżdżoną.

DSCore.Properties.Resources.DefineDataUnexpectedInputExceptionMessage
Wyszukuje zlokalizowany ciąg podobny do: Ten węzeł oczekiwał danych wejściowych {0}, ale przekazano do niego dane wejściowe {1}. Podaj oczekiwane dane wejściowe lub wybierz nowy typ z menu rozwijanego węzła.

DSCore.Properties.Resources.DefineDataUnsupportedCombinationOfDataTypesExceptionMessage
Wyszukuje zlokalizowany ciąg podobny do: Ten węzeł nie obsługuje kombinacji typów danych na bieżącej liście wejściowej {0}. Upewnij się, że lista wejściowa zawiera elementy tego samego typu danych lub kombinację typów ze wspólnym typem nadrzędnym.

DSCore.Properties.Resources.DefineDataUnsupportedDataTypeExceptionMessage
Wyszukuje zlokalizowany ciąg podobny do: Ten węzeł nie obsługuje bieżącego typu danych wejściowych ({0}). Sprawdź obsługiwane typy danych w menu rozwijanym.

DSCore.Properties.Resources.EnumDateOfWeekFriday
Wyszukuje zlokalizowany ciąg podobny do Piątek.

DSCore.Properties.Resources.EnumDateOfWeekMonday
Wyszukuje zlokalizowany ciąg podobny do Poniedziałek.

DSCore.Properties.Resources.EnumDateOfWeekSaturday
Wyszukuje zlokalizowany ciąg podobny do Sobota.

DSCore.Properties.Resources.EnumDateOfWeekSunday
Wyszukuje zlokalizowany ciąg podobny do Niedziela.

DSCore.Properties.Resources.EnumDateOfWeekThursday
Wyszukuje zlokalizowany ciąg podobny do Czwartek.

DSCore.Properties.Resources.EnumDateOfWeekTuesday
Wyszukuje zlokalizowany ciąg podobny do Wtorek.

DSCore.Properties.Resources.EnumDateOfWeekWednesday
Wyszukuje zlokalizowany ciąg podobny do Środa.

DSCore.Properties.Resources.Exception_Deserialize_Bad_Format
Wyszukuje zlokalizowany ciąg podobny do: Obiekt json dla typu {0} nie jest poprawnie sformatowany.

DSCore.Properties.Resources.Exception_Deserialize_Unsupported_Cache
Wyszukuje zlokalizowany ciąg podobny do: Nie można wczytać przechowywanych danych.

DSCore.Properties.Resources.Exception_Serialize_Depth_Unsupported
Wyszukuje zlokalizowany ciąg podobny do: Głębokość {0} przekracza wartość MaxDepth {1} w ścieżce „{2}”.

DSCore.Properties.Resources.Exception_Serialize_DesignScript_Unsupported
Wyszukuje zlokalizowany ciąg podobny do: Nie można serializować tego typu geometrii.

DSCore.Properties.Resources.Exception_Serialize_Unsupported_Type
Wyszukuje zlokalizowany ciąg podobny do: Nie można zapisać danych typu {0}.

DSCore.Properties.Resources.ExportToCSVObsolete
Wyszukuje zlokalizowany ciąg podobny do Zamiast tego użyj węzła Data.ExportCSV.

DSCore.Properties.Resources.FactorialNegativeInt
Wyszukuje zlokalizowany ciąg podobny do Wartości wejściowej Math. Wartość Factorial nie może być ujemna.

DSCore.Properties.Resources.FactorialOverflow
Wyszukuje zlokalizowany ciąg podobny do wartości zwróconej Math. Wartość Factorial jest poza zakresem.

DSCore.Properties.Resources.FindPointsWithinRadiusNullPointMessage
Wyszukuje zlokalizowany ciąg podobny do Należy podać punkt środkowy.

DSCore.Properties.Resources.FindPointsWithinRadiusSearchRadiusMessage
Wyszukuje zlokalizowany ciąg podobny do Promień wyszukiwania nie może wynosić zero.

DSCore.Properties.Resources.FromObjectObsolete
Wyszukuje zlokalizowany ciąg podobny do Ten węzeł jest przestarzały, należy użyć polecenia „Ciąg z obiektu”.

DSCore.Properties.Resources.IntegerOverflow
Wyszukuje zlokalizowany ciąg podobny do: Operacja spowodowała przepełnienie liczby całkowitej. Jej wynik może być nieoczekiwany.

DSCore.Properties.Resources.InvalidDestinationPathErrorMessage
Wyszukuje zlokalizowany ciąg podobny do: Jako ścieżki kopii użyto niewłaściwej ścieżki pliku docelowego.

DSCore.Properties.Resources.InvalidKeysErrorMessage
Wyszukuje zlokalizowany ciąg podobny do Brak zgodności jednego typu danych wejściowych lub większej ich liczby. Listy jako klucze nie są obsługiwane.

DSCore.Properties.Resources.InvalidKeysLenghtErrorMessage
Wyszukuje zlokalizowany ciąg podobny do Liczba elementów nie odpowiada liczbie kluczy. href=InvalidKeysLenghtErrorMessage.html.

DSCore.Properties.Resources.LoadImageFromPathObsolete
Wyszukuje zlokalizowany ciąg podobny do Zamiast tego użyj węzłów File.FromPath - > Image.ReadFromFile.

DSCore.Properties.Resources.MissingPythonEngine
Wyszukuje zlokalizowany ciąg podobny do: Nie można znaleźć wybranego silnika w języku Python.

DSCore.Properties.Resources.ObjectArgumentExceptionMessage
Wyszukuje zlokalizowany ciąg podobny do Obiekt nie może być pusty, należy podać odpowiednią wartość.

DSCore.Properties.Resources.QuadtreeConstructionEmptyUVSetMessage
Wyszukuje zlokalizowany ciąg podobny do Nie można zbudować drzewa czwórkowego z pustego zbioru punktów.

DSCore.Properties.Resources.QuadtreeConstructionNullUVSetMessage
Wyszukuje zlokalizowany ciąg podobny do Drzewo czwórkowe nie może być utworzone z pustego zbioru UV.

DSCore.Properties.Resources.ReadImageObsolete
Wyszukuje zlokalizowany ciąg podobny do Zamiast tego użyj węzłów File.FromPath - > Image.ReadFromFile - > Image.Pixels.

DSCore.Properties.Resources.ReadTextObsolete
Wyszukuje zlokalizowany ciąg podobny do Zamiast tego użyj węzłów File.FromPath - > File.ReadText.

DSCore.Properties.Resources.StringRemoveCountOutOfRangeMessage
Wyszukuje zlokalizowany ciąg podobny do Liczba jest poza zakresem!.

DSCore.Properties.Resources.StringRemoveStartIndexOutOfRangeMessage
Wyszukuje zlokalizowany ciąg podobny do startIndex znajduje się poza zakresem!.

DSCore.Properties.Resources.StringToNumberInvalidNumberMessage
Wyszukuje zlokalizowany ciąg podobny do Nie jest prawidłową liczbą.

DSCore.Properties.Resources.WebRequestNullUrlMessage
Wyszukuje zlokalizowany ciąg podobny do URL nie może być pusty..

DSCore.Properties.Resources.WriteImageObsolete
Wyszukuje zlokalizowany ciąg podobny do Zamiast tego użyj węzła Image.WriteToFile.