DSCore.ColorRange.ByColorsAndParameters(System.Collections.Generic.IList{DSCore.Color},System.Collections.Generic.IList{Autodesk.DesignScript.Geometry.UV})
Utwórz ColorRange przez podanie listy kolorów i UV.
colors: Lista kolorów.
parameters: Lista parametrów w przedziale od (0,0;0,0) do (1,0;1,0).
Returns: Obiekt ColorRange.

DSCore.ColorRange.GetColorAtParameter(Autodesk.DesignScript.Geometry.UV)
Zwraca kolor w tym zakresie kolorów dla określonego parametru.
parameter: UV w przedziale od (0,0;0,0) do (1,0;1,0).
Returns: Kolor.