DSCore.Color.Red
Znajdź czerwoną składową koloru, od 0 do 255.
Wartość czerwona dla modelu kolorów RGB, liczba całkowita w przedziale od 0 do 255 włącznie.

DSCore.Color.Green
Znajdź zieloną składową koloru, od 0 do 255.
Wartość zielona dla modelu kolorów RGB, liczba całkowita w przedziale od 0 do 255 włącznie.

DSCore.Color.Blue
Znajdź niebieską składową koloru, od 0 do 255.
Wartość niebieska dla modelu kolorów RGB, liczba całkowita w przedziale od 0 do 255 włącznie.

DSCore.Color.Alpha
Znajdź składową alfa koloru, od 0 do 255.
Wartość alpha, liczba całkowita w przedziale od 0 do 255 włącznie.

DSCore.Color.ByARGB(System.Int32,System.Int32,System.Int32,System.Int32)
Utwórz kolor według składowych: alfa, czerwony, zielony i niebieski.
alpha: Wartość alfa (od 0 do 255 włącznie)
red: Wartość koloru czerwonego w modelu kolorów RGB (od 0 do 255 włącznie)
green: Wartość koloru zielonego w modelu kolorów RGB (od 0 do 255 włącznie)
blue: Wartość koloru niebieskiego w modelu kolorów RGB (od 0 do 255 włącznie)
Kolor utworzony z ARGB
color

DSCore.Color.Brightness(DSCore.Color)
Zwraca wartość jasności tego koloru.
color: Kolor, którego jasność ma zostać zbadana
Wartość jasności (w przedziale od 0 do 1 włącznie)

DSCore.Color.Saturation(DSCore.Color)
Zwraca wartość nasycenia tego koloru.
Wartość nasycenia jako liczba podwójna w przedziale od 0 do 1 włącznie.

DSCore.Color.Hue(DSCore.Color)
Zwraca wartość barwy tego koloru.
color: Obiekt koloru
Wartość odcienia koloru, liczba typu double w przedziale od 0 do 1 włącznie.
hues

DSCore.Color.Components(DSCore.Color)
Wyświetla listę składowych koloru w następującej kolejności: alfa, czerwony, zielony, niebieski.
color: Obiekt koloru
Wartość alpha, liczba całkowita w przedziale od 0 do 255 włącznie.
Wartość czerwona dla modelu kolorów RGB, liczba całkowita w przedziale od 0 do 255 włącznie.
Wartość zielona dla modelu kolorów RGB, liczba całkowita w przedziale od 0 do 255 włącznie.
Wartość niebieska dla modelu kolorów RGB, liczba całkowita w przedziale od 0 do 255 włącznie.
alpha,red,green,blue

DSCore.Color.BuildColorFrom1DRange(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double},System.Double)
Zwraca kolor w kolorze pośrednim między kolorem początkowym i końcowym.
parameters: Wartości między 0 i 1 wzdłuż zakresu, dla którego chcesz próbkować kolor.
Kolory w danym zakresie.
color,range,gradient

DSCore.Color.Lerp(DSCore.Color,DSCore.Color,System.Double)
Liniowo, interpoluj między dwoma kolorami.
start: Kolor początkowy.
end: Kolor końcowy.
t: Parametr w zakresie od 0.0 do 1.0.
Returns: Kolor interpolowany lub biały.

DSCore.Color.Blerp(System.Collections.Generic.IList{DSCore.Color.IndexedColor2D},Autodesk.DesignScript.Geometry.UV)
Interpoluj biliniowo między zestawem kolorów.
Returns: Kolor interpolowany lub biały.
This algorithm is not the same as the solution found from wikipedia
(reference: https://en.wikipedia.org/wiki/Bilinear_interpolation)

DSCore.Color.Add(DSCore.Color,DSCore.Color)
Utwórz kolor przez połączenie wartości ARGB dwóch istniejących kolorów.
color: Kolor do dodania
otherColor: Inny kolor do dodania
Kolor wynikający z dodania dwóch kolorów

DSCore.Color.Multiply(DSCore.Color,System.Double)
Mnoży kolor wejściowy z numerem, współczynnika, aby utworzyć ciemniejszy kolor. Kolor musi mieć wartość alfa mniejszą niż 255.
color: Kolor do przemnożenia
multiplier: Wartość współczynnika
Kolor wynikowy mnożenia

DSCore.Color.Divide(DSCore.Color,System.Double)
Podziel kolor wejściowy przez liczbę, aby uzyskać jaśniejszy kolor i usunąć kolor zabarwienia
color: Kolor do podzielenia
dividend: Wartość dzielnej
Kolor wynikowy dzielenia