DSCore.Math
Metody wykonywania operacji matematycznych.

DSCore.Math.Random(System.Nullable{System.Int32})
Generuje losową wartość podwojoną w zakresie [0, 1).
seed: Wartość rozrzutu dla generatora liczb losowych.
Liczba losowa między 0 i 1.
random,seed

DSCore.Math.Random(System.Double,System.Double)
Wygeneruj liczbę losową w zakresie [lower_number, higher_number).
value1: Dolna granica zakresu liczb losowych.
value2: Górna granica zakresu liczb losowych.
Liczba losowa w zakresie [dolna granica, górna granica].
random,numberrange

DSCore.Math.Random(System.Double,System.Double,System.Int32)
Wygeneruj liczbę losową w zakresie [dolna granica, górna granica] na podstawie wartości rozrzutu.
value1: Dolna granica zakresu liczb losowych.
value2: Górna granica zakresu liczb losowych.
seed: Wartość rozrzutu dla generatora liczb losowych.
Liczba losowa w zakresie [dolna granica, górna granica].
random,numberrange,seed

DSCore.Math.RandomList(System.Int32)
Generuje listę zawierającą daną liczbę podwojonych liczb losowych
w zakresie [0, 1).
amount: Ilość liczb losowych, którą będzie zawierać lista wyników.
Lista liczb losowych między 0 i 1.
random,listcontains

DSCore.Math.RandomList(System.Int32,System.Double,System.Double,System.Int32)
Tworzy listę zawierającą daną liczbę liczb losowych (typu double)
w określonym zakresie [dolna granica, górna granica] w oparciu o wartość rozrzutu.
amount: Liczba liczb losowych, które będzie zawierać lista wyników.
value1: Dolna granica zakresu liczb losowych.
value2: Górna granica zakresu liczb losowych.
seed: Wartość rozrzutu dla generatora liczb losowych.
Lista liczb losowych w zakresie [dolna granica, górna granica].
random,listcontains,seed

DSCore.Math.PiTimes2
Stała Pi pomnożona przez 2
2 razy punkt przecięcia (PP).
2pi,2*pi,twopi,two*pi

DSCore.Math.Average(System.Collections.Generic.IList{System.Double})
Uśrednia listę liczb.
numbers: Lista liczb do uśrednienia.
Średnia lista liczb.
avg,mean

DSCore.Math.Map(System.Double,System.Double,System.Double)
Przypisuje wartość wejściową liczbie od 0 do 1 w oparciu o zakres danych wejściowych.
rangeMin: Minimalna wartość zakresu danych wejściowych.
rangeMax: Maksymalna wartość zakresu danych wejściowych.
inputValue: Liczba, która ma zostać przypisana.
Przypisana wartość.
map,range,minimum,maximum,normalize,scale,remap

DSCore.Math.MapTo(System.Double,System.Double,System.Double,System.Double,System.Double)
Przypisuje wartość wejściową liczbie od targetRangeMin do targetRangeMax.
rangeMin: Minimalna wartość zakresu danych wejściowych.
rangeMax: Maksymalna wartość zakresu danych wejściowych.
inputValue: Liczba, która ma zostać przypisana.
targetRangeMin: Minimalna wartość nowego zakresu.
targetRangeMax: Maksymalna wartość nowego zakresu.
Przypisana wartość.
map,range,mapto,minimum,maximum,normalize,scale,remap

DSCore.Math.RemapRange(System.Collections.Generic.IList{System.Double},System.Double,System.Double)
Dostosowuje zakres listy liczb, zachowując
współczynnik rozkładu.
numbers: Lista liczb, których zakres ma zostać dostosowany.
newMin: Nowe minimum zakresu.
newMax: Nowe maksimum zakresu
Lista ponownie przypisana do nowego zakresu.
remap range

DSCore.Math.kRadiansToDegrees
przesuń funkcje/metody z Math.dll do tego DSCoreNode.dll

DSCore.Math.PI
Stała matematyczna Pi = 3,14159…
Stała Pi
3.141592653589793

DSCore.Math.E
Stała matematyczna e = 2,71828…
Stała e
exp,2.718281828459045

DSCore.Math.GoldenRatio
Złoty podział, (1 + pierw. kw.(5))/2 = 1,61803…
Złoty podział
golden,ratio,divine,phi,tau,1.61803398875

DSCore.Math.RadiansToDegrees(System.Double)
Przelicza wartość kąta w radianach na wartość w stopniach.
radians: Kąt w radianach.
Kąt w stopniach.
radians,degrees,angle

DSCore.Math.DegreesToRadians(System.Double)
Przelicza wartość kąta w stopniach na wartość w radianach.
degrees: Kąt w stopniach.
Kąt w radianach.
degrees,radians,angle

DSCore.Math.Abs(System.Double)
Wyznacza wartość bezwzględną liczby.
number: Liczba, z której ma zostać pobrana wartość bezwzględna
Wartość bezwzględna liczby
absolute value,magnitude

DSCore.Math.Equals(System.Double,System.Double,System.Double)
Metoda ta jest używana TYLKO przez węzeł NodeModel Equals (z tolerancją)

DSCore.Math.Abs(System.Int64)
Wyznacza wartość bezwzględną liczby.
integer: Liczba.
Wartość bezwzględna liczby.
absolute value,magnitude

DSCore.Math.Acos(System.Double)
Wyznacza odwrócony cosinus; kąt, którego cosinus jest równy podanej wartości.
ratio: Cosinus kąta, liczba w zakresie [-1, 1].
Kąt, którego cosinus jest współczynnikiem wejściowym.
acosine,arccosine

DSCore.Math.Asin(System.Double)
Wyznacza odwrócony sinus, kąt, którego sinus jest równy podanej wartości.
ratio: Sinus kąta, liczba w zakresie [-1, 1].
Kąt, którego sinus jest współczynnikiem wejściowym
asine,arcsin

DSCore.Math.Atan(System.Double)
Wyznacza odwrócony tangens, kąt, którego tangens jest równy podanej wartości.
ratio: Tangens kąta.
Kąt, którego tangens jest współczynnikiem wejściowym
atangent,arctangent

DSCore.Math.Atan2(System.Double,System.Double)
Wyznacza odwrócony tangens ilorazu dwóch liczb. Zwraca kąt,
którego tangens jest stosunkiem licznika do mianownika.
numerator: Licznik tangensa kąta.
denominator: Mianownik tangensa kąta.
Kąt, którego tangens jest licznikiem/mianownikiem
atangent,arctangent

DSCore.Math.Ceiling(System.Double)
Zwraca pierwszą liczbę całkowitą większą niż liczba
number: Liczba do zaokrąglenia.
Pierwsza liczba całkowita większa niż liczba
ceiling,round

DSCore.Math.Cos(System.Double)
Wyznacza cosinus kąta.
angle: Kąt w stopniach, dla którego zostanie obliczony cosinus.
Cosinus kąta
cosine

DSCore.Math.Cosh(System.Double)
Wyznacza cosinus hiperboliczny kąta (w radianach).
angle: Kąt w radianach.
Cosinus hiperboliczny kąta
hyperbolic cosine

DSCore.Math.DivRem(System.Int64,System.Int64)
Wyznacza resztę dzielnej/dzielnika.
dividend: Liczba, która ma zostać podzielona.
divisor: Liczba, przez którą ma zostać podzielona liczba.
Reszta z dzielenia
remainder

DSCore.Math.EvaluateFormula(System.String,System.String[],System.Object[])
Ocenia wzór NCalc z odwzorowaniami danych parametrów.
formulaString: Wzór NCalc
parameters: Zmienne nazwy
arguments: Powiązania zmiennych
type: var[]..[] (wynik obliczeń wzoru)

DSCore.Math.Exp(System.Double)
Zwraca wykładnik liczby, stałą e podniesioną do wartości liczby.
number: Liczba.
Wykładnik liczby.
exponential

DSCore.Math.Floor(System.Double)
Zwraca pierwszą liczbę całkowitą mniejszą niż liczba.
number: Liczba do zaokrąglenia w dół
Pierwsza liczba całkowita mniejsza niż liczba
round

DSCore.Math.Log(System.Double)
Wyznacza logarytm naturalny liczby w zakresie (0, ∞).
number: Liczba większa niż 0.
Logarytm naturalny liczby.
natural,logarithm,ln

DSCore.Math.Log(System.Double,System.Double)
Wyznacza logarytm liczby o określonej podstawie.
number: Liczba większa niż 0.
logBase: Podstawa logarytmu w zakresie [0,1),(1, ∞).
Logarytm liczby.
logarithm,ld,lg

DSCore.Math.Log10(System.Double)
Wyznacza logarytm dziesiętny liczby.
number: Liczba większa niż 0.
Logarytm liczby.
logarithm

DSCore.Math.Max(System.Double,System.Double)
Zwraca większą z dwóch liczb.
value1: Liczba do porównania.
value2: Liczba do porównania.
Większa z dwóch liczb.
maximum,greater,larger

DSCore.Math.Max(System.Int64,System.Int64)
Zwraca większą z dwóch liczb.
int1: Liczba do porównania.
int2: Liczba do porównania.
Większa z dwóch liczb.
maximum,greater,larger

DSCore.Math.Min(System.Double,System.Double)
Zwraca mniejszą z dwóch liczb.
value1: Liczba do porównania.
value2: Liczba do porównania.
Mniejsza z dwóch liczb.
minimum,lesser,smaller

DSCore.Math.Min(System.Int64,System.Int64)
Zwraca mniejszą z dwóch liczb.
int1: Liczba do porównania.
int2: Liczba do porównania.
Mniejsza z dwóch liczb.
minimum,lesser,smaller

DSCore.Math.Pow(System.Double,System.Double)
Podnosi liczbę do określonej potęgi.
number: Liczba, która ma zostać podniesiona do potęgi.
power: Potęga, do której ma być podniesiona liczba.
Liczba podniesiona do potęgi.
^,power,raise,exponent

DSCore.Math.Rand
Wygeneruj liczbę losową w zakresie [0, 1).
Liczba losowa w zakresie [0, 1).
random,numberrange

DSCore.Math.Round(System.Double)
Zaokrągla liczbę w dół do najbliższej wartości całkowitej.
Należy pamiętać, że ta metoda zwraca liczbę zmiennoprzecinkową podwójnej dokładności, zamiast całkowitej.
number: Liczba do zaokrąglenia.
Wartość całki jest zbliżona do wartości.

DSCore.Math.Round(System.Double,System.Int32)
Zaokrągla liczbę do określonej liczby cyfr po przecinku.
number: Liczba do zaokrąglenia
digits: Liczba cyfr po przecinku w zwracanej wartości
Liczba najbliższa wartości, która zawiera liczbę cyfr po przecinku równą liczbie cyfr

DSCore.Math.Sign(System.Double)
Zwraca znak liczby: -1, 0 lub 1.
number: Liczba, z której ma zostać pobrany znak
Znak liczby: -1, 0 lub 1

DSCore.Math.Sign(System.Int64)
Zwraca znak liczby: -1, 0 lub 1.
int: Liczba całkowita, z której ma zostać pobrany znak
Znak liczby: -1, 0 lub 1

DSCore.Math.Sin(System.Double)
Wyznacza sinus kąta.
angle: Kąt w stopniach, dla którego zostanie obliczony sinus.
Sinus kąta.
sine

DSCore.Math.Sinh(System.Double)
Wyznacza sinus hiperboliczny kąta (w radianach).
angle: Kąt w radianach.
Sinus hiperboliczny kąta.
hyperbolic

DSCore.Math.Sqrt(System.Double)
Wyznacza dodatni pierwiastek kwadratowy liczby w zakresie [0, ∞).
number: Liczba w zakresie [0, ∞).
Dodatni pierwiastek kwadratowy z liczby.
square,root,radical

DSCore.Math.Tan(System.Double)
Wyznacza tangens kąta.
angle: Kąt w radianach
Tangens kąta
tangent

DSCore.Math.Tanh(System.Double)
Wyznacza tangens hiperboliczny kąta (w radianach).
angle: Kąt w radianach
Tangens hiperboliczny kąta
hyperbolic,tanh

DSCore.Math.Sum(System.Collections.Generic.IEnumerable{System.Double})
Wyznacz sumę szeregu liczb
values: Liczby do dodania do sumy
Suma wartości
mass addition,massadd

DSCore.Math.Factorial(System.Int64)
Wyznacza wynik silni dodatniej liczby całkowitej.
number: Dodatnia liczba całkowita
Wynik silni liczby całkowitej.
!

DSCore.Math.Xor(System.Boolean,System.Boolean)
XOR Boole'a: zwraca wartość prawda wtedy i tylko wtedy, gdy dokładnie jedna z wartości jest prawdziwa.
bool: Wartość logiczna
otherBool: Inna wartość logiczna
Wynik operacji logicznych
xor,exclusive,or

DSCore.Math.DoCheckedCast(System.Double)
Wykonuje odwzorowanie na wartość long w zaznaczonym kontekście. Jeśli operacja spowoduje,
przepełnienie, zostanie wygenerowane ostrzeżenie i zwrócony zostanie przepełniony wynik.
value: Operacja do wykonania
Returns: Wynik operacji