DSCore.CurveMapper.CurveBase
Reprezentuje klasę bazową dla wszystkich typów krzywych w węźle CurveMapper.
Zapewnia wspólną funkcjonalność generowania i pobierania wartości krzywych.

DSCore.CurveMapper.CurveBase.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Abstrakcyjna metoda do zaimplementowania w klasach pochodnych na potrzeby generowania wartości krzywych.

DSCore.CurveMapper.CurveBase.GetCurveXValues(System.Collections.Generic.List{System.Double},System.Boolean)
Typowa metoda pobierania wartości X.

DSCore.CurveMapper.CurveBase.GetCurveYValues(System.Collections.Generic.List{System.Double},System.Boolean)
Typowa metoda pobierania wartości Y.

DSCore.CurveMapper.CurveBase.GenerateFromDomain(System.Collections.Generic.List{System.Double},System.Func{System.Double,System.Double})
Generuje wartości X i Y przez odwzorowanie danych wejściowych dziedziny na obszar rysunku i obliczenie funkcji krzywej.