DSCore.CurveMapper.GaussianCurve
Reprezentuje krzywą Gaussa w węźle CurveMapper.
Krzywa Gaussa ma rozkład w kształcie dzwonu zdefiniowany przez cztery punkty sterujące.

DSCore.CurveMapper.GaussianCurve.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Wskazuje, czy rozmiar węzła jest obecnie zmieniany, zapobiegając niezamierzonym aktualizacjom punktów sterujących.

DSCore.CurveMapper.GaussianCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Zwraca wartości X i Y rozłożone na krzywej.