DSCore.String
Metody zarządzania ciągami.

DSCore.String.ToNumber(System.String)
Przekształca ciąg w liczbę całkowitą lub podwojoną.
string: Ciąg do przekonwertowania
Liczba całkowita lub podwójna
2number,str2number,strtonumber,string2number,stringtonumber,int,double,cast

DSCore.String.GetNumber(System.String)
Pobierz wszystkie ciągi liczb z ciągu docelowego jako ciąg
string: Ciąg docelowy do pobrania
Liczba w ciągu
getnumber,tonumber,strtonumber,numberinstring,string2number,stringtonumber,int,double,cast

DSCore.String.Concat(System.String[])
Łączy wiele ciągów w jeden.
strings: Lista ciągów do połączenia.
Ciąg złożony z listy ciągów.
concatenate,join,combine strings

DSCore.String.Length(System.String)
Zwraca liczbę znaków zawartych w danym ciągu.
string: Ciąg, którego długość należy obliczyć
Liczba znaków w ciągu
count,size,characters,chars,length,sizeof

DSCore.String.Split(System.String,System.String[])
Dzieli pojedynczy ciąg na listę ciągów, której podziały
są wyznaczone przez podane ciągi z separatorami.
string: Ciąg do podzielenia
separators: Ciągi, które, jeśli istnieją, określają koniec i początek podziału.
Lista ciągów utworzonych z ciągu wejściowego
divide,separator,delimiter,cut,csv,comma,

DSCore.String.Join(System.String,System.String[])
Łączy wiele ciągów w jeden, wstawiając podany
separator pomiędzy każdy połączony ciąg.
separator: Ciąg do wstawienia między połączonymi ciągami.
strings: Ciągi, które mają być połączone w jeden ciąg.
Ciąg utworzony z listy ciągów wraz ze znakiem separatora.
join,separator,build csv,concat,construct

DSCore.String.ToUpper(System.String)
Zmienia wszystkie litery w podanym ciągu tekstowym na wielkie.
string: Ciąg, w którym wszystkie litery mają zostać zmienione na wielkie
Ciąg tekstowy złożony z wielkich liter
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.ToLower(System.String)
Zmienia wszystkie litery w podanym ciągu tekstowym na małe.
string: Ciąg, w którym wszystkie litery mają zostać zmienione na małe
Ciąg tekstowy złożony z małych liter
2lowercase,to lowercase,tolowercase,lowercase

DSCore.String.ToTitle(System.String)
Zmienia pierwsze litery wyrazów w ciągu na wielkie, a pozostałe na małe.
str: Ciąg, w którym należy zmienić pierwsze litery wyrazów na wielkie, a pozostałe na małe
Ciąg z wyrazami zaczynającymi się wielkimi literami
2titlecase,to titlecase,to title case,totitlecase,titlecase

DSCore.String.ChangeCase(System.String,System.Boolean)
Zmienia wszystkie litery w podanym ciągu tekstowym na wielkie lub
małe na podstawie parametru logicznego.
string: Ciąg, w którym wszystkie litery mają być zmienione na wielkie lub małe.
upper: Prawda, aby przekształcić na wielkie litery; fałsz, aby przekształcić na małe litery.
Ciąg tekstowy ze zmienioną wielkością liter.
2lowercase,to lowercase,tolowercase,lowercase,
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.Substring(System.String,System.Int32,System.Int32)
Wyodrębnia podciąg z danego ciągu tekstowego. Podciąg rozpoczyna się od podanego
położenia znaku i ma określoną długość.
string: Ciąg, z którego należy pobrać podciąg
startIndex: Położenie znaku rozpoczynającego podciąg w ciągu oryginalnym
length: Liczba znaków w podciągu
Podciąg wyodrębniony z ciągu oryginalnego
subset,get string,part,smaller string

DSCore.String.Contains(System.String,System.String,System.Boolean)
Określa, czy dany ciąg zawiera dany podciąg.
string: Ciąg do przeszukania
searchFor: Podciąg, który ma zostać wyszukany
ignoreCase: Czy porównanie uwzględnia wielkość liter
Czy ciąg zawiera podciąg
test,within,in,is in,part of

DSCore.String.CountOccurrences(System.String,System.String,System.Boolean)
Oblicza liczbę nienakładających się wystąpień podciągu wewnątrz danego ciągu.
string: Ciąg do przeszukania
searchFor: Podciąg, który ma zostać wyszukany
ignoreCase: Czy porównanie uwzględnia wielkość liter
Liczba nienakładających się wystąpień podciągu w ciągu
count,substring,count occurrences,numberof,search,find,within

DSCore.String.Replace(System.String,System.String,System.String)
Zastępuje wszystkie wystąpienia tekstu w ciągu innym tekstem.
string: Ciąg, w którym mają być zastąpione podciągi.
searchFor: Tekst do zastąpienia.
replaceWith: Tekst zastępujący.
Ciąg z zastąpieniami.
replace,overwrite,override,find and replace

DSCore.String.EndsWith(System.String,System.String,System.Boolean)
Określa, czy dany ciąg kończy się danym podciągiem.
string: Ciąg, którego koniec należy wyszukać
searchFor: Podciąg, dla którego ma być wyszukany koniec
ignoreCase: Prawda, aby zignorować wielkość liter w porównaniu, fałsz, aby ją uwzględnić
Prawda, jeśli ciąg kończy się podciągiem, fałsz, jeśli nie
test,does end,last,str end,terminated

DSCore.String.StartsWith(System.String,System.String,System.Boolean)
Określa, czy dany ciąg rozpoczyna się od danego podciągu.
string: Ciąg, którego początek należy wyszukać
searchFor: Ciąg, dla którego ma być wyszukany początek.
ignoreCase: Prawda, aby zignorować wielkość liter w porównaniu, fałsz, aby ją uwzględnić
Prawda, jeśli ciąg kończy się podciągiem, fałsz, jeśli nie
test,beginswith,start,string start,front

DSCore.String.TrimWhitespace(System.String)
Usuwa wszystkie odstępy od początku i końca danego ciągu.
string: Ciąg do przycięcia.
Ciąg z usuniętymi odstępami na początku i końcu.
trimstring,cleanstring,whitespace,blanks,spaces,string trim

DSCore.String.TrimLeadingWhitespace(System.String)
Usuwa wszystkie odstępy od początku danego ciągu.
string: Ciąg do przycięcia.
Ciąg z usuniętymi odstępami wprowadzającymi.
trim string,clean string,trim leading whitespaces,string trim

DSCore.String.TrimTrailingWhitespace(System.String)
Usuwa wszystkie odstępy od końca danego ciągu.
string: Ciąg do przycięcia.
Ciąg z usuniętymi odstępami na końcu.
trim string,clean string,trim trailing whitespaces,string trim

DSCore.String.IndexOf(System.String,System.String,System.Boolean)
Wyznacza oparty na zerze indeks pierwszego wystąpienia podciągu wewnątrz ciągu.
Zwraca wartość -1, jeśli nie znaleziono indeksu.
string: Ciąg do przeszukania
searchFor: Podciąg, który ma zostać wyszukany
ignoreCase: Czy porównanie uwzględnia wielkość liter
Indeks pierwszego wystąpienia podciągu lub -1, jeśli nie znaleziono
index of,find substring,where,search

DSCore.String.AllIndicesOf(System.String,System.String,System.Boolean)
Znajduje listę indeksów, w których dany podciąg pojawia się wewnątrz ciągu.
string: Ciąg, który ma zostać przeszukany.
searchFor: Podciąg, który ma zostać wyszukany.
ignoreCase: Czy porównanie uwzględnia wielkość liter.
Lista indeksów, w których znaleziono podciąg (typ: int[])
all indices of,find substring,where,search

DSCore.String.LastIndexOf(System.String,System.String,System.Boolean)
Wyznacza oparty na zerze indeks ostatniego podciągu wewnątrz ciągu.
Zwraca -1, jeśli nie znaleziono indeksu.
string: Ciąg, który ma zostać przeszukany.
searchFor: Podciąg, który ma zostać wyszukany.
ignoreCase: Czy porównanie uwzględnia wielkość liter.
Indeks ostatniego wystąpienia podciągu lub -1, jeśli nie znaleziono.
last index of,find substring,where,search

DSCore.String.PadLeft(System.String,System.Int32,System.String)
Wyrównuje do prawej znaki w danym ciągu, wypełniając je odstępami po lewej,
na określoną długość całkowitą.
string: Ciąg do wypełnienia
newLength: Całkowita długość ciągu po wypełnieniu
padChars: Znak, który ma zostać użyty jako wypełnienie; domyślna wartość: spacja
Ciągi wyrównane do prawej poprzez wypełnienie wprowadzającymi odstępami o określonej długości całkowitej.
pad left,right align,right-align,pad,string space,whitespace

DSCore.String.PadRight(System.String,System.Int32,System.String)
Wyrównuje do lewej znaki w danym ciągu, wypełniając je odstępami po prawej,
na określoną długość całkowitą.
string: Ciąg do wypełnienia
newLength: Całkowita długość ciągu po wypełnieniu
padChars: Znak, który ma zostać użyty jako wypełnienie; domyślna wartość: spacja
Ciągi wyrównane do lewej poprzez wypełnienie odstępami kończącymi na określoną długość całkowitą
pad right,left align,left-align,pad string space,whitespace

DSCore.String.Center(System.String,System.Int32,System.String)
Zwiększa długość ciągu, otaczając znaki ciągu oryginalnego spacjami po obu stronach.
string: Ciąg do wyśrodkowania
newLength: Całkowita długość ciągu po wyśrodkowaniu
padChars: Znak, który ma zostać użyty do wyśrodkowania; domyślna wartość: spacja
Ciągi wyrównane do środka poprzez wypełnienie ich odstępami wprowadzającymi i kończącymi
na określoną długość całkowitą.
center align,center-align,centered,whitespace,expand string,surround

DSCore.String.Insert(System.String,System.Int32,System.String)
Wstawia ciąg do innego ciągu w miejscu danego indeksu.
string: Ciąg, w którym ma zostać wykonane wstawienie.
index: Indeks, w miejscu którego ma być wykonane wstawienie.
toInsert: Ciąg do wstawienia.
Ciąg z wstawionym podciągiem.
insertstring,insert string

DSCore.String.Remove(System.String,System.Int32,System.Nullable{System.Int32})
Usuwa znaki z ciągu.
string: Ciąg, z którego mają zostać usunięte znaki.
startIndex: Indeks, od którego zostanie rozpoczęte usuwanie.
count: Liczba znaków do usunięcia.
Uwaga: jeśli liczba jest ujemna, proces usuwania przechodzi od prawej do lewej.
Ciąg z usuniętymi znakami.
delete,rem,shorten