DSCore.Data.MaxDepthJsonTextWriter
Klasa podrzędna klasy JsonTextWriter, która ogranicza maksymalną obsługiwaną głębokość obiektu, aby zapobiec awariom z powodu odwołań cyklicznych podczas serializowania dowolnych typów obiektów .NET.