DSCore.CurveMapper.LinearCurve
Reprezentuje krzywą liniową w węźle CurveMapper.
Krzywa liniowa jest linią prostą między dwoma punktami sterującymi.

DSCore.CurveMapper.LinearCurve.LineEquation(System.Double)
Oblicza wartości Y (współrzędne obszaru rysunku) dla minimalnej i maksymalnej wartości X

DSCore.CurveMapper.LinearCurve.SolveForXGivenY(System.Double)
Oblicza wartości X (współrzędne obszaru rysunku) dla minimalnej i maksymalnej wartości Y

DSCore.CurveMapper.LinearCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Zwraca wartości X i Y rozłożone na krzywej.