DSCore.CurveMapper.BezierCurve
Reprezentuje krzywą Beziera w węźle CurveMapper.
Krzywa Beziera jest definiowana przez cztery punkty sterujące i zapewnia gładką interpolację.

DSCore.CurveMapper.BezierCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Pobiera interpolowane wartości Y na podstawie przypisanych parametrów i ograniczeń.