DSCore.CurveMapper.SquareRootCurve
Reprezentuje krzywą pierwiastka kwadratowego w węźle CurveMapper.
Krzywa podąża za funkcją pierwiastka kwadratowego i zależy od dwóch punktów sterujących.

DSCore.CurveMapper.SquareRootCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Zwraca wartości X i Y rozłożone na krzywej.