DSCore.List
Metody tworzenia i zarządzania listami.

DSCore.List.Empty
Zwraca pustą listę.
Pusta lista.
empty list, emptylist,[]

DSCore.List.UniqueItems(System.Collections.IList)
Tworzy nową listę zawierającą wszystkie elementy niepowtarzalne na danej liście.
list: Lista, z której będą filtrowane wartości powielone.
Filtrowana lista.
removes,duplicates,remove duplicates,cull duplicates,distinct,listcontains

DSCore.List.Contains(System.Collections.IList,System.Object)
Określa, czy dana lista zawiera dany element. Ta funkcja przeszukuje podlisty w niej zawarte.
list: Lista do przeszukania
item: Element do wyszukania
Prawda, jeśli lista zawiera element, fałsz, jeśli nie
item,search,in,listcontains

DSCore.List.IsHomogeneous(System.Collections.IList)
Sprawdź, czy pozycje na liście są tego samego typu.
list: Lista, która ma zostać zaznaczona, jeśli jest jednorodna.
Określa, czy lista jest jednorodna.
homogeneous,allequal,same,type

DSCore.List.IsRectangular(System.Collections.IList)
Sprawdź, czy liczba elementów we wszystkich wierszach listy jest taka sama.
list: Lista, która ma zostać zaznaczona, jeśli liczba elementów w wierszach jest taka sama.
Określa, czy liczba elementów we wszystkich wierszach listy jest taka sama.
rectangular,isrectangular,same,sublist,row

DSCore.List.IsUniformDepth(System.Collections.IList)
Sprawdź, czy pozycje na liście mają tę samą głębokość.
list: Lista, która ma zostać zaznaczona, jeśli pozycje mają tę samą głębokość.
Określa, czy głębokość listy jest jednakowa.
depth,uniform,isuniformdepth,sublist,jagged

DSCore.List.SetDifference(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Zwraca nową listę, która zawiera obiekty z List1, ale nie zawiera obiektów z List2.
list1: Lista obiektów, które mają zostać dodane do nowej listy
list2: Lista obiektów, które mają zostać wykluczone z nowej listy
Nowa lista, która zawiera obiekty z List1, ale nie z List2
difference,setdifference,set

DSCore.List.SetIntersection(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Zwraca nową listę, która zawiera obiekty obecne zarówno na List1, jak i na List2.
list1: Lista obiektów do porównania z list2
list2: Lista obiektów do porównania z list1
Nowa lista, która zawiera obiekty obecne zarówno na List1, jak i List2
intersection,setintersection,set,overlap

DSCore.List.SetUnion(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Zwraca nową listę, która zawiera obiekty obecne na List1 lub List2.
list1: Lista obiektów, które mają zostać uwzględnione
list2: Lista obiektów, które mają zostać uwzględnione na List1
Nowa lista, która zawiera obiekty obecne na List1 lub List2
union,setunion,set

DSCore.List.IndexOf(System.Collections.IList,System.Object)
Zwraca indeks elementu na danej liście. Zgodność między daną listą a elementem docelowym musi być ścisła (tj. oba elementy muszą być typu int, double, string lub object itp.).
list: Lista, w której ma zostać znaleziony element.
element: Element, którego indeks ma zostać zwrócony.
Indeks elementu na liście. Jeśli nie zostanie znalezione ścisłe dopasowanie, zostanie zwrócony indeks niepoprawny: -1.
index,indexof

DSCore.List.CountFalse(System.Collections.IList)
Zwraca liczbę wartości logicznych Fałsz na danej liście.
list: Na liście znaleziono wartości logiczne Fałsz.
Liczba wartości logicznych Fałsz na liście.
false,count

DSCore.List.CountTrue(System.Collections.IList)
Zwraca liczbę wartości logicznych Prawda na danej liście.
list: Na liście znaleziono wartości logiczne Prawda.
Liczba wartości logicznych Prawda na liście.
true,count

DSCore.List.Insert(System.Collections.IList,System.Object,System.Int32)
Wstawia element do listy na wskazanym indeksie.
list: Lista, do której zostanie wstawiony element
element: Element, który ma zostać wstawiony
index: Określa położenie elementu wstawianego do listy
Lista z wstawionym elementem
insert,add

DSCore.List.Reorder(System.Collections.IList,System.Collections.IList)
Zmienia kolejność elementów listy wejściowej na podstawie danej listy indeksów.
list: Lista, której kolejność elementów ma zostać zmieniona
indices: Indeksy służące do zmiany kolejności elementów listy
Lista ze zmienioną kolejnością elementów
reorder,index,indices

DSCore.List.SortIndexByValue(System.Collections.Generic.List{System.Double})
Sortuje elementy listy i zwraca ich indeksy.
list: Lista elementów, które mają zostać posortowane
Indeksy elementów posortowanej listy
sort,index,value

DSCore.List.NormalizeDepth(System.Collections.IList,System.Int32)
Zwraca listę wielowymiarową zgodnie z podaną kolejnością.
list: Lista, której głębokość ma zostać znormalizowana zgodnie z podaną kolejnością.
rank: Kolejność, zgodnie z którą ma zostać znormalizowana lista. Wartość domyślna wynosi 1.
Lista ze znormalizowaną kolejnością.
depth,normalize

DSCore.List.Reverse(System.Collections.IList)
Tworzy nową listę zawierającą elementy z danej listy, ale w odwrotnej kolejności.
list: Lista, która ma zostać odwrócona.
Odwrócona lista
flip,listcontains

DSCore.List.__Create(System.Collections.IList)
Tworzy nową listę zawierającą dane elementy.
items: Elementy, które mają być przechowywane na nowej liście.

DSCore.List.Sublists(System.Collections.IList,System.Collections.IList,System.Int32)
Utwórz podlisty z listy ze składnią zakresu DesignScript.
list: Lista, z której zostaną utworzone podlisty.
ranges: Zakresy indeksów elementów podlisty.
Np. \"{0..3,5,2}\"
offset: Odsunięcie do zastosowania w podliście.
Np. przy zakresie \"0..3\" z odsunięciem wynoszącym 2 uzyska się
{0,1,2,3}{2,3,4,5}{4,5,6,7}...
typ: var[]..[]
sublists,build sublists,subset,

DSCore.List.Sort(System.Collections.Generic.IEnumerable{System.Object})
Sortuje listę za pomocą wbudowanej funkcji naturalnej kolejności.
list: Lista do posortowania
Posortowana lista
sort,order,sorted

DSCore.List.MinimumItem(System.Collections.Generic.IEnumerable{System.Object})
Zwraca minimalną wartość z listy.
list: Lista porównywalnych elementów, z której zostanie pobrana minimalna wartość
Minimalny element z listy.
least,smallest,find min

DSCore.List.MaximumItem(System.Collections.Generic.IEnumerable{System.Object})
Zwraca maksymalną wartość z listy.
list: Lista porównywalnych elementów, z której zostanie pobrana maksymalna wartość
Maksymalny element z listy.
greatest,largest,biggest,find max

DSCore.List.FilterByBoolMask(System.Collections.IList,System.Collections.IList)
Filtruje sekwencję, sprawdzając odpowiadające indeksy w osobnej liście
operacji logicznych.
list: Lista do filtrowania.
mask: Lista operacji logicznych reprezentujących maskę.
Elementy, których indeks maski ma wartość prawda.
Elementy, których indeks maski ma wartość fałsz.
filter,in,out,mask,dispatch,bool filter,boolfilter,bool filter

DSCore.List.Deconstruct(System.Collections.IList)
Po określeniu listy tworzy pierwszą pozycję na liście oraz nową listę zawierającą wszystkie elementy
z wyjątkiem pierwszego.
list: Lista do podzielenia.
Pierwszy element na liście (typ: var[]..[])
Pozostała część listy (typ: var[]..[])
first,rest,list split,listcontains

DSCore.List.SortByKey(System.Collections.IList,System.Collections.IList)
Sortuj listę na podstawie jej kluczy
list: lista do sortowania
keys: lista kluczy, klucze muszą być sortowalne (np. być liczbami, ciągami)
typ: var[]..[]
typ: var[]..[]
sort;key

DSCore.List.GroupByKey(System.Collections.IList,System.Collections.IList)
Grupuj elementy w podlisty na podstawie ich wartości kluczowych
list: Lista elementów do grupowania jako podlisty
keys: Wartości kluczowe, jedna na element na liście wejściowej, używane do grupowania elementów
lista podlist, z elementami pogrupowanymi według takich samych wartości kluczowych
wartość kluczowa odpowiadająca każdej grupie
list;group;groupbykey;

DSCore.List.GroupBySimilarity(System.Collections.IList,System.Double,System.Boolean)
Grupy reprezentują listy elementów zestawione na podstawie sąsiadowania ich indeksów i podobieństwa ich wartości
list: Lista elementów do zgrupowania w postaci list podrzędnych na podstawie sąsiadowania i podobieństwa
tolerance: Wartość progowa do grupowania podobnych elementów
considerAdjacency: Wartość logiczna sterująca tym, czy węzeł powinien uwzględniać sąsiadowanie, czy nie.
Lista list podrzędnych z elementami zgrupowanymi według podobnych wartości
lista list podrzędnych z oryginalnymi indeksami zgrupowanych wartości
list;group;similar;adjacent;adjacency;groupbyadjacency;groupadjacentitems;groupsimilaritems;cluster;tolerance

DSCore.List.LevenshteinDistance(System.String,System.String)
Odległość Levenshteina jest algorytmem używanym do określania odległości między 2 ciągami
| Źródło

DSCore.List.AddItemToFront(System.Object,System.Collections.IList)
Dodaje element do początku listy.
item: Element do dodania. Element może być obiektem lub listą.
list: Lista, do której zostanie dodany element.
Lista z dodanymi elementami
insert,add,item,front,start,begin

DSCore.List.AddItemToEnd(System.Object,System.Collections.IList)
Dodaje element do końca listy.
item: Element do dodania. Element może być obiektem lub listą.
list: Lista, do której zostanie dodany element.
Lista z dodanymi elementami
insert,add,item,end

DSCore.List.TakeItems(System.Collections.IList,System.Int32)
Pobiera liczbę elementów z początku listy.
list: Lista, z której zostaną pobrane elementy.
amount: Liczba elementów do pobrania. Jeśli ujemna, elementy będą pobierane z końca listy.
Lista wyodrębnionych elementów.
get,sub,sublist,extract

DSCore.List.DropItems(System.Collections.IList,System.Int32)
Usuwa liczbę elementów z początku listy. Jeśli liczba jest wartością ujemną, elementy są usuwane z końca listy.
list: Lista, z której zostaną usunięte elementy.
amount: Liczba elementów do usunięcia. Jeśli ujemna, elementy będą usuwane z końca listy.
Lista pozostałych elementów.
drop,remove,shorten

DSCore.List.ShiftIndices(System.Collections.IList,System.Int32)
Przesuwa indeksy na liście w prawo o podaną wartość.
list: Lista do przesunięcia.
amount: Wartość, o jaką zostaną przesunięte indeksy. Jeśli ujemna, indeksy zostaną przesunięte w lewo.
Przesunięta lista.
shift,offset

DSCore.List.GetItemAtIndex(System.Collections.IList,System.Int32)
Zwraca element z danej listy, która znajduje się w określonym indeksie.
list: Lista, z której zostanie pobrany element.
index: Indeks elementu do pobrania.
Element na liście o danym indeksie.
get,item,index,fetch,at,getfrom,get from,extract

DSCore.List.ReplaceItemAtIndex(System.Collections.IList,System.Int32,System.Object)
Zastąp element z danej listy, który' znajduje się w określonym indeksie.
list: Lista, na której zostanie zastąpiony element.
index: Indeks elementu, który ma zostać zastąpiony.
item: Element do wstawienia.
Nowa lista z zastąpionym elementem.
replace,switch

DSCore.List.ReplaceItemAtIndices(System.Collections.IList,System.Collections.Generic.IList{System.Int32},System.Object)
Zastępuje elementy z danej listy, które znajdują się w określonych indeksach.
list: Lista, na której zostanie zastąpiony element.
indices: Indeksy elementów do zastąpienia.
item: Element do wstawienia.
Nowa lista z zastąpionymi elementami.
replace,switch

DSCore.List.Slice(System.Collections.IList,System.Nullable{System.Int32},System.Nullable{System.Int32},System.Int32)
Zwraca pojedynczą podlistę z danej listy, w oparciu o indeks początkowy, końcowy,
i wielkości kroku.
list: Lista do pobrania wycinka.
start: Indeks, od którego ma się rozpoczynać wycinek.
end: Indeks, na którym ma się kończyć wycinek.
step: Liczba indeksów elementów oddzielonych na liście wyjściowej.
Elementy w wycinku danej listy.
list,sub,sublist,subrange,get sublist

DSCore.List.RemoveItemAtIndex(System.Collections.IList,System.Int32[])
Usuwa element z danej listy w określonym indeksie.
list: Lista, z której zostaną usunięte elementy.
indices: Indeks lub indeksy elementu (elementów) do usunięcia.
Lista z usuniętymi elementami.
index,indices,cull,remove,item

DSCore.List.DropEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
Usuwa elementy z danej listy w indeksach, które są wielokrotnością
danej wartości, po uwzględnieniu podanego odsunięcia.
list: Lista, z której zostaną usunięte elementy/
n: Indeksy, które są wielokrotnością tego argumentu, zostaną usunięte.
offset: Liczba elementów, które mają być pomijane od początku listy.
Lista z usuniętymi elementami.
nth,remove,cull,every

DSCore.List.TakeEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
Pobiera elementy z danej listy w indeksach, które są wielokrotnością
danej wartości, po uwzględnieniu podanego odsunięcia.
list: Lista, z której zostaną pobrane elementy.
n: Indeksy, które są wielokrotnością tej liczby (po odsunięciu)
zostaną pobrane.
offset: Liczba elementów, które mają być pomijane od początku listy.
Elementy z listy.
fetch,take,every,nth

DSCore.List.IsEmpty(System.Collections.IList)
Określa, czy dana lista jest pusta.
list: Lista do sprawdzenia pod kątem tego, czy nie jest pusta
Prawda, jeśli lista jest pusta, fałsz, jeśli nie
test,is,empty,null,count

DSCore.List.AllTrue(System.Collections.IList)
Określa, czy wszystkie elementy danej listy są wartościami logicznymi Prawda.
list: Lista, która ma zostać sprawdzona pod kątem tego, czy wszystkie jej elementy mają wartość Prawda.
Prawda, jeśli wszystkie elementy z listy mają wartość prawda, fałsz, jeśli co najmniej jeden element nie ma wartości prawda
test,all,true,istrue

DSCore.List.AllFalse(System.Collections.IList)
Określa, czy wszystkie elementy danej listy są wartościami logicznymi Fałsz.
list: Lista, która ma zostać sprawdzona pod kątem tego, czy wszystkie jej elementy mają wartość Fałsz.
Prawda, jeśli wszystkie elementy z listy mają wartość fałsz, fałsz, jeśli co najmniej jeden element nie ma wartości fałsz
test,all,false,isfalse

DSCore.List.AnyTrue(System.Collections.IList)
Określa, czy dowolny element na danej liście jest wartością logiczną i ma wartość prawda.
list: Lista, która ma zostać sprawdzona pod kątem tego, czy dowolny element ma wartość prawda.
Czy dowolny element ma wartość prawda.
test,any,true,istrue

DSCore.List.AnyFalse(System.Collections.IList)
Określa, czy dowolny element na danej liście jest wartością logiczną i ma wartość fałsz.
list: Lista, która ma zostać sprawdzona pod kątem tego, czy dowolny element ma wartość fałsz.
Czy dowolny element ma wartość fałsz.
test,any,false,isfalse

DSCore.List.Count(System.Collections.IList)
Zwraca liczbę elementów przechowywanych w danej liście.
list: Lista, z której zostanie pobrana liczba elementów.
Długość listy.
listlength,list length,count,size,sizeof

DSCore.List.Join(System.Collections.IList[])
Łączy wszystkie podane listy w jedną.
lists: Listy do połączenia w jedną.
Połączona lista.
join lists,merge,concatenate

DSCore.List.FirstItem(System.Collections.IList)
Zwraca pierwszy element na liście.
list: Lista, z której zostanie pobrany pierwszy element.
Pierwszy element na liście.
get,fetch,first,item,start

DSCore.List.RestOfItems(System.Collections.IList)
Usuwa pierwszy element z podanej listy.
list: Lista, z której zostanie pobrana pozostała część.
Pozostała część listy.
get,fetch,rest,end,rest of list

DSCore.List.Chop(System.Collections.IList,System.Collections.Generic.List{System.Int32})
Podziel listę na zestaw kolejnych podlist o określonej długości. Podział listy rozpoczyna się na górze listy.
list: Listy do podziału na podlisty
lengths: Długości kolejnych podlist, które utworzone zostaną z listy wejściowej
Podlisty utworzone z listy
sublists,build sublists,slices,partitions,cut,listcontains,chop

DSCore.List.DiagonalRight(System.Collections.IList,System.Int32)
Lista elementów wzdłuż każdej przekątnej w modelu od lewego dolnego do prawego górnego rogu.
list: Płaska lista
subLength: Długość każdej nowej podlisty.
Listy elementów wzdłuż przekątnych modelu.
diagonal,right,matrix,get diagonals,diagonal sublists

DSCore.List.DiagonalLeft(System.Collections.IList,System.Int32)
Lista elementów wzdłuż każdej przekątnej w modelu od górnego lewego do prawego dolnego rogu.
list: Płaska lista.
rowLength: Długość każdej nowej podlisty.
Listy elementów wzdłuż przekątnych modelu.
diagonal,left,matrix,get diagonals,diagonal sublists

DSCore.List.Transpose(System.Collections.IList)
Zamienia wiersze i kolumny na wykazie list.
Jeśli listy zawierają wiersze, które są krótsze od pozostałych,
wstawiane są wartości zerowe jako obiekty zastępcze w otrzymywanym
szyku tak, by zawsze był prostokątny.
lists: Wykaz list do przestawienia
Lista przestawionych list
transpose,flip matrix,matrix,swap,rows,columns

DSCore.List.Clean(System.Collections.IList,System.Boolean)
Czyści dane wartości zerowych oraz pustych list z podanej listy dowolnego wymiaru
list: Lista zawierająca pozycje null i puste podlisty do oczyszczenia
preserveIndices: Udostępnia opcję, aby zachować indeksy danych
Wykaz przestawionych list
tak, by niewiodące wartości zerowe nie mogły zostać odfiltrowywane
Returns: Wykaz oczyszczony z wartości zerowych i pustych list

DSCore.List.OfRepeatedItem(System.Object,System.Int32)
Tworzy listę zawierającą dany element daną liczbę razy.
item: Element do powtórzenia.
amount: Ilość powtórzeń.
Lista powtarzających się elementów.
repeat,repeated,duplicate,list of item,fill list,copies,listcontains

DSCore.List.Cycle(System.Collections.IList,System.Int32)
Tworzy nową listę przez połączenie kopii danej listy.
list: Lista do powtórzenia.
amount: Ilość powtórzeń.
Lista powtarzających się list typu: var[]..[]
repeat,repeated,duplicate,repeated list,concat list

DSCore.List.LastItem(System.Collections.IList)
Pobiera ostatni element na liście.
list: Lista, z której zostanie pobrany ostatni element
Ostatni element na liście
get,fetch,last,item,end of list

DSCore.List.Shuffle(System.Collections.IList)
Ustawia losową kolejność elementów na liście.
list: Lista do ustawienia losowej kolejności elementów.
Lista z losową kolejnością elementów.
random,randomize,shuffle,jitter,randomness

DSCore.List.Shuffle(System.Collections.IList,System.Int32)
Miesza listę listy, określając losową kolejność jej elementów na podstawie wartości rozrzutu.
list: Lista do ustawienia losowej kolejności elementów.
seed: Wartość rozrzutu dla generatora liczb losowych.
Lista z losową kolejnością elementów.
random,randomize,shuffle,jitter,randomness,seed

DSCore.List.Permutations(System.Collections.IList,System.Nullable{System.Int32})
Generuje wszystkie permutacje podanej długości z danej listy.
list: Lista do wygenerowania permutacji.
length: Długość każdej permutacji.
Permutacje z listy o danej długości (typ: var[]..[])
permutation,permutations

DSCore.List.Combinations(System.Collections.IList,System.Int32,System.Boolean)
Generuje wszystkie kombinacje danej długości z danej listy.
list: Lista, z której zostaną wygenerowane kombinacje
length: Długość każdej kombinacji
replace: Określa, czy elementy są usuwane po wybraniu do kombinacji; domyślna
wartość: fałsz.
Kombinacje listy o danej długości
combo

DSCore.List.FirstIndexOf(System.Collections.IList,System.Object)
Na podstawie podanego elementu zwraca oparty na zerze indeks pierwszego wystąpienia
na liście. Jeśli element nie zostanie znaleziony na liście, zwracana jest wartość -1.
list: Lista do przeszukania. Jeśli ten argument wynosi zero, zwracana jest wartość -1.
item: Element do wyszukania.
Returns: Oparty na zerze indeks elementu na liście lub -1, jeśli nie został znaleziony.

DSCore.List.AllIndicesOf(System.Collections.IList,System.Object)
Na podstawie podanego elementu zwraca oparte na zerze indeksy wszystkich jego wystąpień
na liście. Jeśli element nie zostanie znaleziony, zwracana jest pusta lista.
list: Lista do przeszukania. Jeśli ten argument wynosi zero, zwracana jest pusta lista.
item: Element do wyszukania.
Lista opartych na zerze indeksów wszystkich wystąpień elementu, jeśli je znaleziono lub pusta lista, jeśli elementu nie ma na liście.

DSCore.List.Flatten(System.Collections.IList,System.Int32)
Zrównuje zagnieżdżony wykaz list o określoną wartość.
list: Lista do zrównania.
amount: Warstwy zagnieżdżenia listy do usunięcia (-1 spowoduje usunięcie wszystkich zagnieżdżeń listy)
Spłaszczona lista według ilości
flatten,completely

DSCore.List.IndexInList(System.Collections.IList,System.Object)
Alternatywa dla metody IList.Contains korzystającej z metody Enumerable.SequenceEqual w celu sprawdzenia, czy
element znajduje się na liście, jeśli element jest tablicą. Zwraca indeks w przypadku znalezienia elementu,
-1 w przypadku jego nieznalezienia.
list: Lista, która ma zostać sprawdzona pod kątem obecności elementu.
item: Element, który ma zostać znaleziony.
Indeks elementu listy.

DSCore.List.GetDepth(System.Object)
Uzyskaj maksymalną głębokość danej listy.
list: Lista wejściowa, dla której ma zostać uzyskana głębokość.
Głębokość danej listy.

DSCore.List.CountBool(System.Collections.IList,System.Boolean)
Zwraca liczbę określonych wartości logicznych na danej liście.
list: Na liście znaleziono wartości logiczne.
value: Wartość logiczna, która ma zostać znaleziona
Liczba określonych wartości logicznych na liście.

DSCore.List.IncreaseDepth(System.Collections.IList,System.Int32)
Zwiększ głębokość danej listy o określoną wartość. Zwiększenie głębokości
polega na utworzeniu nowej listy, zawierającej daną listę.
list: Lista, której głębokość ma zostać zwiększona.
amt: Wartość, o którą zostanie zwiększona głębokość.
Nowa lista, której głębokość została zwiększona o wartość.

DSCore.List.DoubleConverter(System.Object)
Przekształca liczbę całkowitą na podwójną, w przeciwnym razie zwraca obiekt wejściowy.