DSCore.CurveMapper.SineWave
Reprezentuje krzywą fali sinusoidalnej w węźle CurveMapper.
Fala sinusoidalna jest definiowana przez dwa punkty sterujące i zgodna z funkcją trygonometryczną.

DSCore.CurveMapper.SineWave.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Zwraca wartości X i Y rozłożone na krzywej.