DSCore.IO.Image
Metody pracy z bitmapami obrazów.

DSCore.IO.Image.ReadFromFile(System.IO.FileInfo)
Wczytuje plik jako bitmapę.
file: Obiekt pliku, z którego zostanie wczytany obraz
Obiekt obrazu z pliku

DSCore.IO.Image.Pixels(System.Drawing.Bitmap,System.Nullable{System.Int32},System.Nullable{System.Int32})
Odczytuje plik obrazu i zwraca wartości kolorów w określonych lokalizacjach siatki.
image: Obiekt obrazu, z którego zostaną pobrane kolory pikseli
xSamples: Liczba przykładowych punktów siatki w kierunku X.
ySamples: Liczba przykładowych punktów siatki w kierunku Y.
Kolory w określonych punktach siatki
read,image,bitmap,png,jpg,jpeg

DSCore.IO.Image.FromPixels(DSCore.Color[][])
Tworzy obraz z dwuwymiarowej listy pikseli.
colors: Dwuwymiarowa lista prostokątna kolorów reprezentujących piksele
Obraz z listy dwuwymiarowej pikseli

DSCore.IO.Image.FromPixels(DSCore.Color[],System.Int32,System.Int32)
Tworzy obraz na podstawie płaskiej listy pikseli, szerokości i wysokości.
colors: Lista kolorów reprezentujących piksele
width: Szerokość nowego obrazu w pikselach
height: Wysokość nowego obrazu w pikselach
Obraz z listy pikseli

DSCore.IO.Image.Dimensions(System.Drawing.Bitmap)
Zwraca szerokość i wysokość obrazu.
image: Obraz, którego wymiary zostaną pobrane.
szerokość obrazu w pikselach
wysokość obrazu w pikselach

DSCore.IO.Image.WriteToFile(System.String,System.Drawing.Bitmap)
Zapisz obraz w ścieżce na podstawie określonej nazwy pliku.
image: Obraz do zapisania
Utworzono obiekt obrazu
write image,image,file,filepath