DSCore.CurveMapper.ParabolicCurve
Reprezentuje krzywą paraboliczną w węźle CurveMapper.
Krzywa podąża za równaniem kwadratowym opartym na dwóch punktach sterujących.

DSCore.CurveMapper.ParabolicCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Zwraca wartości X i Y rozłożone na krzywej.