DSCore.Quadtree.ByUVs(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.UV})
Skonstruuj drzewo czwórkowe obejmujące domenę(0,0) - > (1,1).
uvs: Zestaw UV w domenie (0,0)->(1,1).
Returns: Obiekt drzewa czwórkowego.

DSCore.Quadtree.FindPointsWithinRadius(Autodesk.DesignScript.Geometry.UV,System.Double)
Znajdź wszystkie punkty drzewa czwórkowego (UV) w promieniu danej lokalizacji UV.
center: UV w centrum obszaru wyszukiwania.
radius: Promień obszaru wyszukiwania.
Returns: Lista UV.