DSCore.CurveMapper.PowerCurve
Reprezentuje krzywą funkcji potęgowej w węźle CurveMapper.
Krzywa jest definiowana przez równanie potęgi wyprowadzone z punktu sterującego.

DSCore.CurveMapper.PowerCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Zwraca wartości X i Y rozłożone na krzywej.