DSCore.DateTime
Obiekt reprezentujący określoną datę i czas.

DSCore.DateTime.MinValue
Najwcześniejsza data i czas, jakie mogą być przedstawione.
Minimalna możliwa reprezentacja DateTime

DSCore.DateTime.MaxValue
Najpóźniejsza data i godzina, jakie mogą być przedstawione.
Maksymalna możliwa reprezentacja DateTime

DSCore.DateTime.Now
Bieżąca data i czas w systemie.
Wartość DateTime reprezentująca czas bieżący

DSCore.DateTime.Today
Bieżąca data w systemie, z czasem ustawionym na północ.
Wartość DateTime reprezentująca dzień dzisiejszy

DSCore.DateTime.Format(System.DateTime,System.String)
Zwróć określoną datę i godzinę jako łańcuch w określonym formacie.
dateTime: DateTime do sformatowania
format: Reprezentacja łańcucha formatu daty. Używana jest zmienna InvariantCulture, która powoduje utworzenie danych wyjściowych niezależnie od języka wybranego w systemie operacyjnym użytkownika.
Przywracany jest format standardowy "F" : "Wtorek, 21 lutego 2017 23:02:43"
Obszerna lista opcji dostosowania formatu jest dostępna po wyszukaniu ciągu "Niestandardowe łańcuchy formatowania daty godziny MSDN".
DateTime w postaci ciągu

DSCore.DateTime.ByDate(System.Int32,System.Int32,System.Int32)
Tworzy nową wartość DateTime w dokładnej dacie.
year: Dokładny rok (1-9999)
month: Dokładny miesiąc (1-12)
day: Dokładny dzień (1-[dni w miesiącu])
Wartość DateTime utworzona z daty

DSCore.DateTime.ByDateAndTime(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
Tworzy nową wartość DateTime w dokładnej dacie i czasie.
year: Dokładny rok (1-9999)
month: Dokładny miesiąc (1-12)
day: Dokładny dzień (1-[dni w miesiącu])
hour: Dokładna godzina (0-23)
minute: Dokładne minuty (0-59)
second: Dokładne sekundy (0-59)
millisecond: Dokładne milisekundy (0-999)
Wartość DateTime utworzona z daty i godziny

DSCore.DateTime.SubtractTimeSpan(System.DateTime,System.TimeSpan)
Odejmuje wartość TimeSpan od DateTime, w wyniku czego uzyskiwana jest nowa wartość DateTime.
dateTime: Wartość początkowa DateTime
timeSpan: Ilość czasu, która zostanie odjęta
Wartość DateTime będąca wynikiem odejmowania

DSCore.DateTime.AddTimeSpan(System.DateTime,System.TimeSpan)
Dodaje wartość TimeSpan do DateTime, w wyniku czego uzyskiwana jest nowa wartość DateTime.
dateTime: Wartość początkowa DateTime
timeSpan: Ilość czasu, która zostanie dodana do DateTime
Wartość DateTime będąca wynikiem dodania przedziału czasu

DSCore.DateTime.DaysInMonth(System.Int32,System.Int32)
Oblicza liczbę dni w danym miesiącu danego roku.
year: Dokładny rok (1-9999)
month: Dokładny miesiąc (1-12)
Liczba dni w miesiącu

DSCore.DateTime.IsDaylightSavingsTime(System.DateTime)
Określa, czy dla danej wartości DateTime obowiązuje czas letni.
dateTime: Wartość DateTime służąca do określenia, czy jest stosowany czas letni
Prawda, jeśli wartość DateTime przypada w czasie letnim, fałsz, jeśli nie

DSCore.DateTime.IsLeapYear(System.Int32)
Określa, czy podany rok jest rokiem przestępnym.
year: Dokładny rok (1-9999)
Prawda, jeśli rok jest przestępny, fałsz, jeśli nie

DSCore.DateTime.FromString(System.String)
Próbuje przetworzyć wartość DateTime z ciągu
string: Wartość DateTime w postaci ciągu
DateTime z przetworzonego ciągu

DSCore.DateTime.Date(System.DateTime)
Z DateTime wyodrębnia tylko datę. Składowe czasu są ustawione na 0.
dateTime: Wartość DateTime.
data od DateTime
Date

DSCore.DateTime.Components(System.DateTime)
Wyodrębnia poszczególne składowe DateTime.
dateTime: Wartość DateTime, z której zostaną pobrane składniki
Reprezentacja liczbowa roku (1–9999)
Reprezentacja liczbowa miesiąca (1–12)
Reprezentacja liczbowa dnia (1–[liczba dni w miesiącu])
Reprezentacja liczbowa godziny (0–23)
Reprezentacja liczbowa minut (0–59)
Reprezentacja liczbowa sekund (0–59)
Reprezentacja liczbowa milisekund (0–999)

DSCore.DateTime.DayOfWeek(System.DateTime)
Zwraca dzień tygodnia z danej wartości DateTime.
dateTime: Obiekt DateTime, z którego zostanie pobrany dzień tygodnia
Dzień tygodnia

DSCore.DateTime.DayOfYear(System.DateTime)
Zwraca dzień roku (0-366)
dateTime: Wartość DateTime, z której zostanie pobrany dzień roku
Liczba dni od początku roku

DSCore.DateTime.TimeOfDay(System.DateTime)
Oblicza nową wartość TimeSpan reprezentującą ilość czasu, który upłynął od północy
na podstawie wartości DateTime.
dateTime: Wartość DateTime.
TimeSpan od północy