DSCore.Data.ParseJSON(System.String)
Parse przekształca dowolny ciąg JSON w wartość. Odwrotność JSON.Stringify.
json: Ciąg JSON
Typ wyniku zależy od zawartości ciągu wejściowego. Wynik może być wartością typu prymitywnego (np. ciągiem, wartością logiczną lub liczbą o podwójnej precyzji), listą albo słownikiem.

DSCore.Data.ToNative(Newtonsoft.Json.Linq.JToken)
Implementacja analizy na potrzeby konwersji typów JToken na natywne obiekty .NET.
token: JToken do przetworzenia w N

DSCore.Data.DynamoJObjectToNative(Newtonsoft.Json.Linq.JObject)
Implementacja analizy na potrzeby konwersji typów obiektów JObject na określone obiekty Dynamo (takie jak geometria, kolor, obrazy itp.)
Throws System.Exception:

DSCore.Data.StringifyJSON(System.Object)
Stringify przekształca dowolną wartość lub listę dowolnych wartości w format JSON. Za pomocą replikacji można zastosować tę operację do listy, uzyskując listę ciągów JSON.
values: Lista wartości
Ciąg JSON, dla którego typy prymitywne (np. liczba o podwójnej precyzji, liczba całkowita lub wartość logiczna), listy i słowniki zostaną zwrócone w skojarzonym typie JSON.

DSCore.Data.CanObjectBeCached(System.Object)
Funkcja pomocnicza służąca do określenia, czy obiekt może być buforowany, czy też ma wartość null, jest ciągiem „null” albo pustą listą.
inputObject: Obiekt do sprawdzenia

DSCore.Data.Remember(System.Object,System.String)
Funkcja obsługi buforowania dla węzła Data.Remember
inputObject: Obiekt do buforowania
cachedJson: Opcjonalny istniejący obiekt json pamięci podręcznej

DSCore.Data.DataNodeDynamoTypeList
Lista statyczna dla wszystkich obsługiwanych typów danych dodatku Dynamo
Returns: Lista zawierająca obsługiwane typy danych

DSCore.Data.#cctor
Konstruktor statyczny

DSCore.Data.SafeExtractDictionaryValue(System.Collections.Generic.Dictionary{System.String,System.Object},System.String)
Funkcja pomocnicza umożliwiająca bezpieczne wyodrębnienie wartości słownika
dict: Słownik, z którego ma zostać wyodrębniona wartość
key: Klucz pary klucz/wartość

DSCore.Data.EvaluateDefineDataNode(System.Object,System.String,System.Boolean,System.Boolean,System.String)
Jest to funkcja używana przez AST do rozstrzygania węzła Define Data.
Obsługuje ona część logiki węzłów podczas sprawdzania poprawności
inputValue: Wartość wejściowa w kierunku nadrzędnym
typeString: Typ jako ciąg (do zrobienia: lepiej byłoby przekazać obiekt typu 'Type' na potrzeby bezpośredniego porównania typów)
isList: Czy dane wejściowe są typu `ArrayList`
isAutoMode: Czy węzeł jest w trybie automatycznym
playerValue: Wartość wprowadzona do węzła za pomocą Odtwarzacza Dynamo, jeśli istnieje.

DSCore.Data.FindCommonAncestor(System.Collections.ArrayList)
Funkcja ułatwiająca znalezienie typu w przypadku przekazania w trybie AutoMode obiektu ArrayList obiektów
list: Wartość wejściowa, oczekiwany typ to ArrayList

DSCore.Data.LikelyAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
Funkcja pomocnicza zwracająca węzeł najniższego poziomu z listy węzłów DataNodeDynamoType
nodes: Lista DataNodeDynamoType do sprawdzenia

DSCore.Data.FindClosestCommonAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
Funkcja pomocnicza służąca do określania wspólnego przodka na liście typów danych
nodes: Lista węzłów DataType do sprawdzenia

DSCore.Data.FindCommonAncestorBetweenTwoNodes(DSCore.Data.DataNodeDynamoType,DSCore.Data.DataNodeDynamoType)
Rekurencyjna funkcja wyszukiwania wspólnego przodka dwóch typów dodatku Dynamo
Kieruje się w górę drzewa hierarchii prawdopodobnego przodka (likelyAncestor) aż do
node: Sprawdź, czy ten węzeł pochodzi od prawdopodobnego przodka
likelyAncestor: Prawdopodobny przodek, od którego może pochodzić węzeł

DSCore.Data.GetListFromTypes(System.Collections.ArrayList)
Zwraca listę obiektów DataNodeDynamoTypes z listy ArrayList obiektów
list: Lista ArrayList obiektów do zmiany formatu

DSCore.Data.IsUnusedDefineDataInput(System.Object)
Sprawdza, czy dane wejściowe definiowania danych są nieużywane (mają wartość null lub są pustą listą).
inputValue: Wartość wejściowa pochodząca z wykresu.
Returns: Prawda, gdy dane wejściowe powinny być traktowane jako niepołączone lub nieużywane.

DSCore.Data.IsSingleValueOrSingleLevelArrayList(System.Object)
Sprawdź, czy obiekt wejściowy jest pojedynczą wartością, czy jednopoziomowym typem ArrayList.
obj: Obiekt wejściowy do sprawdzenia

DSCore.Data.IsSupportedDataNodeDynamoType(System.Object,System.Type,System.Boolean)
Funkcja umożliwiająca sprawdzenie poprawności typu danych wejściowych względem obsługiwanych typów danych wejściowych Dynamo
inputValue: Dane przychodzące do sprawdzenia
type: Typ danych wejściowych dostarczony przez użytkownika. Musi on być zgodny z typem inputValue
isList: Wartość logiczna określająca, czy dane wejściowe są pojedynczym obiektem, czy listą

DSCore.Data.IsItemOfType(System.Object,System.Type)
Ta metoda sprawdza, czy element jest wymaganym typem danych (DataType) dodatku Dynamo
'IsInstanceOfType' cyklicznie sprawdza dziedziczenie w górę
item: Element, dla którego ma zostać sprawdzony typ danych
dataType: Typ danych (DataType) do sprawdzenia
Returns: Wynik sprawdzenia: true (prawda) lub false (fałsz)

DSCore.Data.IsDerivedFrom(System.Type,System.Type)
Ta metoda sprawdza, czy typ pochodzi od typu bazowego
derivedType: Typ, który chcemy potwierdzić
baseType: Typ bazowy, z którym należy porównać