Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# InvalidTimeZoneMessage
source: Could not sign in at this moment. Check the date, time and time zone settings and try to sign in again.
cs_cz: V tomto okamžiku se nelze přihlásit. Zkontrolujte nastavení data, času a časového pásma a zkuste se přihlásit znovu.
de_de: Anmeldung war momentan nicht möglich. Überprüfen Sie die Einstellungen für Datum, Uhrzeit und Zeitzone, und versuchen Sie sich erneut anzumelden.
es_es: No se puede iniciar sesión en este momento. Compruebe la configuración de fecha, hora y zona horaria y vuelva a iniciar sesión.
fr_fr: Impossible de se connecter à ce moment. Vérifiez la date, l'heure et le fuseau horaire définis et essayez de vous connecter à nouveau.
it_it: Impossibile accedere in questo momento. Verificare le impostazioni di data, ora e fuso orario e riaccedere.
ja_jp: サイン インできませんでした。 日付、時刻、タイム ゾーンの設定を確認してから、再度サイン インしてください。
ko_kr: 현재 로그인할 수 없습니다. 날짜, 시간 및 표준 시간대를 확인하고 다시 로그인하십시오.
pl_pl: W tej chwili nie można się zalogować. Sprawdź ustawienia daty, godziny i strefy czasowej, a następnie spróbuj zalogować się ponownie.
pt_br: Não foi possível efetuar o login nesse momento. Verifique as configurações de data, hora e fuso horário e tente novamente efetuar o login.
ru_ru: Не удалось войти в систему. Проверьте настройки даты, времени, часового пояса и повторите попытку.
zh_cn: 此时无法登录。请检查日期、时间和时区设置，然后再次尝试登录。
zh_tw: 此時無法登入。請檢查日期、時間和時區設定，然後嘗試再次登入。

# LacingAutoToolTip
source: No replication guide will be added.
cs_cz: Nebudou přidána žádná vodítka replikace.
de_de: Es wird keine Replikationsanleitung hinzugefügt.
es_es: No se añadirá ninguna guía de replicación.
fr_fr: Aucun guide de réplication ne sera ajouté.
it_it: Non verrà aggiunta alcuna guida per la replica.
ja_jp: 追加される複製ガイドはありません。
ko_kr: 복제 가이드가 추가되지 않습니다.
pl_pl: Żadne prowadnice replikacji nie zostaną dodane.
pt_br: Nenhuma guia de replicação será adicionada.
ru_ru: Руководство по репликации не будет добавлено.
zh_cn: 将不会添加任何复制导向。
zh_tw: 不會加入任何複製指南。

# LacingCrossProductToolTip
source: For two lists [a,b,c][1,2,3] returns [a1,a2,a3][b1,b2,b3][c1,c2,c3].
cs_cz: Pro dva seznamy [a,b,c][1,2,3] vrací [a1,a2,a3][b1,b2,b3][c1,c2,c3].
de_de: Für zwei Listen [a,b,c][1,2,3] wird [a1,a2,a3][b1,b2,b3][c1,c2,c3] zurückgegeben.
es_es: Para dos listas [a,b,c][1,2,3] devuelve [a1,a2,a3][b1,b2,b3][c1,c2,c3].
fr_fr: Pour deux listes [a,b,c][1,2,3] renvoie [a1,a2,a3][b1,b2,b3][c1,c2,c3].
it_it: Per due elenchi [a,b,c][1,2,3] restituisce [a1,a2,a3][b1,b2,b3][c1,c2,c3].
ja_jp: 2 つのリスト[a,b,c][1,2,3]の場合は、[a1,a2,a3][b1,b2,b3][c1,c2,c3]を返します。
ko_kr: 두 리스트 {a,b,c}{1,2,3}의 경우 [a1,a2,a3][b1,b2,b3][c1,c2,c3]을 반환합니다.
pl_pl: Dla dwóch list [a, b,c][1,2,3] zwraca [a1,a2,a3][b1,b2,b3][c1,c2,c3].
pt_br: Para duas listas [a,b,c][1,2,3] retorna [a1,a2,a3][b1,b2,b3][c1,c2,c3].
ru_ru: Для двух списков [a,b,c][1,2,3] возвращается результат [a1,a2,a3][b1,b2,b3][c1,c2,c3].
zh_cn: 对于两个列表 [a,b,c][1,2,3] 返回 [a1,a2,a3][b1,b2,b3][c1,c2,c3]。
zh_tw: 若為兩個清單 [a,b,c][1,2,3]，則傳回 [a1,a2,a3][b1,b2,b3][c1,c2,c3]。

# LacingDisabledToolTip
source: Argument lacing is disabled for this node.
cs_cz: U tohoto uzlu je zakázáno vázání argumentu.
de_de: Argumentvergitterung ist für diesen Block deaktiviert.
es_es: El encaje de argumentos está desactivado en este nodo
fr_fr: L'entrelacement d'arguments est désactivé pour ce noeud.
it_it: Il collegamento di argomenti è disattivato per il nodo.
ja_jp: このノードでは引数のレーシングは無効になっています。
ko_kr: 이 노드에 대해 인수 레이싱은 비활성화됩니다.
pl_pl: Opcja skratowania argumentów jest wyłączona dla tego węzła.
pt_br: A treliça do argumento está desativada para este nó.
ru_ru: Переплетение аргументов отключено для данного узла.
zh_cn: 该节点的参数连缀已禁用。
zh_tw: 此節點的引數交織已停用。

# LacingFirstToolTip
source: For two lists [a,b,c][1,2,3] returns {a1}.
cs_cz: Pro dva seznamy [a,b,c][1,2,3] vrací {a1}.
de_de: Für zwei Listen [a,b,c][1,2,3] wird {a1} zurückgegeben.
es_es: Para dos listas [a,b,c][1,2,3] devuelve {a1}.
fr_fr: Pour deux listes [a,b,c][1,2,3] renvoie {a1}.
it_it: Per due elenchi [a,b,c][1,2,3] restituisce {a1}.
ja_jp: 2 つのリスト[a,b,c][1,2,3]の場合は、{a1}を返します。
ko_kr: 두 리스트 [a,b,c][1,2,3]의 경우 {a1}을 반환합니다.
pl_pl: Dla dwóch list [a, b,c][1,2,3] zwraca {a1}.
pt_br: Para duas listas [a,b,c][1,2,3] retorna {a1}.
ru_ru: Для двух списков [a,b,c][1,2,3] возвращается результат {a1}.
zh_cn: 对于两个列表 [a,b,c][1,2,3] 返回 {a1}。
zh_tw: 若為兩個清單 [a,b,c][1,2,3]，則傳回 {a1}。

# LacingLongestToolTip
source: For two lists [a,b,c][1,2] returns [a1,b2,c2].
cs_cz: Pro dva seznamy [a,b,c][1,2] vrací [a1,b2,c2].
de_de: Für zwei Listen [a,b,c][1,2] wird [a1,b2,c2] zurückgegeben.
es_es: Para dos listas [a,b,c][1,2] devuelve [a1,b2,c2].
fr_fr: Pour deux listes [a,b,c][1,2] renvoie [a1,b2,c2].
it_it: Per due elenchi [a,b,c][1,2] restituisce [a1,b2,c2].
ja_jp: 2 つのリスト[a,b,c][1,2]の場合は、[a1,b2,c2]を返します。
ko_kr: 두 리스트 [a,b,c][1,2]의 경우 [a1,b2,c2]를 반환합니다.
pl_pl: Dla dwóch list [a, b,c][1,2] zwraca [a1,b2,c2].
pt_br: Para duas listas [a,b,c][1,2] retorna [a1,b2,c2].
ru_ru: Для двух списков [a,b,c][1,2] возвращается результат [a1,b2,c2].
zh_cn: 对于两个列表 [a,b,c][1,2] 返回 [a1,b2,c2]。
zh_tw: 若為兩個清單 [a,b,c][1,2]，則傳回 [a1,b2,c2]。

# LacingShortestToolTip
source: For two lists [a,b,c][1,2] returns [a1,b2].
cs_cz: Pro dva seznamy [a,b,c][1,2] vrací [a1,b2].
de_de: Für zwei Listen [a,b,c][1,2] wird [a1,b2] zurückgegeben.
es_es: Para dos listas [a,b,c][1,2] devuelve [a1,b2].
fr_fr: Pour deux listes [a,b,c][1,2] renvoie [a1,b2].
it_it: Per due elenchi [a,b,c][1,2] restituisce [a1,b2].
ja_jp: 2 つのリスト[a,b,c][1,2]の場合は、[a1,b2]を返します。
ko_kr: 두 리스트 [a,b,c][1,2]의 경우 [a1,b2]를 반환합니다.
pl_pl: Dla dwóch list [a, b,c][1,2] zwraca [a1,b2].
pt_br: Para duas listas [a,b,c][1,2] retorna [a1,b2].
ru_ru: Для двух списков [a,b,c][1,2] возвращается результат [a1,b2].
zh_cn: 对于两个列表 [a,b,c][1,2] 返回 [a1,b2]。
zh_tw: 若為兩個清單 [a,b,c][1,2]，則傳回 [a1,b2]。

# LayoutIconTooltip
source: View layout
cs_cz: Zobrazit rozvržení
de_de: Layout anzeigen
es_es: Diseño de vista
fr_fr: Disposition de la vue
it_it: Visualizza layout
ja_jp: ビュー レイアウト
ko_kr: 뷰 배치
pl_pl: Podgląd układu
pt_br: Layout da vista
ru_ru: Показать компоновку
zh_cn: 查看布局
zh_tw: 檢視配置

source: Learn more
cs_cz: Další informace
de_de: Weitere Informationen
es_es: Más información
fr_fr: En savoir plus
it_it: Ulteriori informazioni
ja_jp: 詳細
ko_kr: 자세히 알아보기
pl_pl: Dowiedz się więcej
pt_br: Saiba mais
ru_ru: Подробнее
zh_cn: 了解详细信息
zh_tw: 瞭解更多

# LibraryViewContextMenuEditNode
source: Edit...
cs_cz: Upravit...
de_de: Bearbeiten...
es_es: Editar...
fr_fr: Modifier...
it_it: Modifica...
ja_jp: 編集...
ko_kr: 편집...
pl_pl: Edycja...
pt_br: Editar...
ru_ru: Редактировать...
zh_cn: 编辑...
zh_tw: 編輯...

# LibraryViewNoMatchesFound
source: No matches found
cs_cz: Nebyly nalezeny žádné shody.
de_de: Keine Übereinstimmungen gefunden
es_es: No se ha encontrado ninguna coincidencia
fr_fr: Aucun résultat trouvé
it_it: Nessuna corrispondenza trovata
ja_jp: 一致するものが見つかりませんでした
ko_kr: 일치 항목을 찾을 수 없습니다
pl_pl: Brak pasujących elementów
pt_br: Nenhuma coincidência encontrada
ru_ru: Совпадений не найдено
zh_cn: 找不到匹配项
zh_tw: 找不到相符項

# LibraryViewSearchText
source: Search
cs_cz: Vyhledávání
de_de: Suchen
es_es: Buscar
fr_fr: Rechercher
it_it: Cerca
ja_jp: 検索
ko_kr: 검색
pl_pl: Wyszukiwanie
pt_br: Pesquisar
ru_ru: Поиск
zh_cn: 搜索
zh_tw: 搜尋

# LibraryViewTitle
source: Library
cs_cz: Knihovna
de_de: Bibliothek
es_es: Biblioteca
fr_fr: Bibliothèque
it_it: Libreria
ja_jp: ライブラリ
ko_kr: 라이브러리
pl_pl: Biblioteka
pt_br: Biblioteca
ru_ru: Библиотека
zh_cn: 库
zh_tw: 資源庫

# MajorVersionNonNegative
source: You must provide a Major version as a non-negative integer.
cs_cz: Zadejte hlavní verzi, vedlejší verzi a verzi sestavení.
de_de: Geben Sie eine Nummer für Haupt- und Nebenversion sowie die Build-Version an.
es_es: Proporcione el número de versión principal, secundaria y de compilación.
fr_fr: Fournir le numéro des versions Major, Minor et Build.
it_it: Specificare un numero di versione principale, secondaria e della build.
ja_jp: メジャー、マイナー、ビルドのバージョン番号を指定します。
ko_kr: 주요, 보조, 빌드 버전 번호를 입력하십시오.
pl_pl: Podaj wersję główną, wersję pośrednią i numer kompilacji.
pt_br: Forneçar um número da versão principal, secundária e de compilação.
ru_ru: Укажите основную, вспомогательную версию и номер сборки.
zh_cn: 提供主版本号、次版本号和内部版本号。
zh_tw: 請提供主要、次要和建置版本號碼。

source: Manual
cs_cz: Ruční
de_de: Manuell
fr_fr: Manuel
it_it: Manuale
ja_jp: 手動
ko_kr: 수동
pl_pl: Ręcznie
ru_ru: Вручную
zh_cn: 手动
zh_tw: 手動

# MessageAlreadyInstallDynamo
source: Package {1} is already installed. {0} will attempt to uninstall this package before installing {2}.
cs_cz: Balíček {1} je již nainstalován. {0} se pokusí tento balíček odinstalovat před instalací {2}.
de_de: Paket {1} ist bereits installiert. {0} wird vor der Installation von {2} versuchen, dieses Paket zu deinstallieren.
es_es: El paquete {1} ya está instalado. {0} intentará desinstalar este paquete antes de instalar {2}.
fr_fr: Le package {1} est déjà installé. {0} va tenter de désinstaller ce package avant de procéder à l'installation de {2}.
it_it: Il pacchetto {1} è già stato installato. {0} tenterà di disinstallare questo pacchetto prima dell'installazione di {2}
ja_jp: パッケージ {1} は既にインストールされています。 {0} は、{2} をインストールする前にこのパッケージのアンインストールを試みます。
ko_kr: 패키지 {1}이(가) 이미 설치되어 있습니다. {0}이(가) {2}을(를) 설치하기 전에 이 패키지를 설치제거하려고 시도합니다.
pl_pl: Zainstalowano już pakiet {1}. Oprogramowanie {0} podejmie próbę odinstalowania pakietu przed zainstalowaniem {2}.
pt_br: O pacote {1} já foi instalado. O {0} vai tentar desinstalar esse pacote antes de instalar {2}.
ru_ru: Пакет {1} уже установлен. В {0} будет предпринята попытка удаления данного пакета перед установкой {2}.
zh_cn: 软件包 {1} 已安装。 {0} 将在安装 {2} 之前尝试卸载此软件包。
zh_tw: 套件 {1} 已安裝。 {0} 會先嘗試解除安裝此套件，再安裝 {2}。

# MessageConfirmToInstallPackage
source: Are you sure you want to install {0} {1} ?
cs_cz: Opravdu chcete balíček {1} aplikace {0} nainstalovat?
de_de: Möchten Sie {0} {1} wirklich installieren?
es_es: ¿Seguro que desea instalar {0} {1}?
fr_fr: Voulez-vous vraiment installer {0} {1}?
it_it: Installare {0} {1} ?
ja_jp: {0} {1} をインストールしてもよろしいですか?
ko_kr: {0}{1}을(를) 설치하시겠습니까 ?
pl_pl: Czy na pewno chcesz zainstalować {0}{1}?
pt_br: Tem certeza de que deseja instalar {0} {1}?
ru_ru: Вы уверены, что хотите установить {0} {1}?
zh_cn: 是否确实要安装 {0} {1}？
zh_tw: 您確定要安裝 {0}{1} 嗎？

# MessageConfirmToInstallPackageToFolder
source: Are you sure you want to install {0} {1} to {2} ?
cs_cz: Opravdu chcete do adresáře {2} nainstalovat balíček {1} aplikace {0}?
de_de: Möchten Sie {0} {1} wirklich in {2} installieren?
es_es: ¿Está seguro de que desea instalar {0} {1} en {2}?
fr_fr: Voulez-vous vraiment installer {0} {1} dans {2}?
it_it: Installare {0} {1} in {2} ?
ja_jp: {0} {1} を {2} にインストールしてよろしいですか?
ko_kr: {0}{1}을(를) {2}에 설치하시겠습니까?
pl_pl: Czy na pewno chcesz zainstalować {0} {1} do {2}?
pt_br: Tem certeza de que deseja instalar {0} {1} em {2}?
ru_ru: Вы уверены, что хотите установить {0} {1} в {2} ?
zh_cn: 是否确实要将 {0} {1} 安装到 {2}？
zh_tw: 您確定要將 {0} {1} 安裝至 {2} 嗎？

# MessageConfirmToSaveCustomNode
source: You have unsaved changes to custom node workspace: "{0}". Would you like to save your changes?
cs_cz: V pracovního prostoru vlastního uzlu máte neuložené změny: „{0}“. Chcete změny uložit?
de_de: Es sind nicht gespeicherte Änderungen im Arbeitsbereich für benutzerdefinierten Block vorhanden: "{0}". Möchten Sie Ihre Änderungen speichern?
es_es: En el espacio de trabajo de nodos personalizados: "{0}" hay cambios sin guardar. ¿Desea guardar los cambios?
fr_fr: Vous n'avez pas enregistré les modifications apportées à l'espace de travail de noeud personnalisé: "{0}". Voulez-vous enregistrer vos modifications?
it_it: Sono presenti modifiche non salvate nell'area di lavoro del nodo personalizzato: "{0}". Salvare le modifiche?
ja_jp: カスタム ノード ワークスペース "{0}" への変更が保存されていません。 変更を保存しますか?
ko_kr: 사용자 노드 작업 공간에 저장되지 않는 변경 사항이 있습니다. "{0}" 변경 사항을 저장하시겠습니까?
pl_pl: Istnieją niezapisane zmiany obszaru roboczego węzłów niestandardowych: „{0}”. Czy chcesz zapisać zmiany?
pt_br: Você tem alterações não salvas no espaço de trabalho do nó personalizado: "{0}". Deseja salvar as alterações?
ru_ru: Имеются несохраненные изменения в рабочем пространстве пользовательского узла: «{0}». Сохранить изменения?
zh_cn: 对自定义节点工作空间的更改未保存: "{0}"。 是否要保存更改？
zh_tw: 您有自訂節點工作區的未儲存變更："{0}"。 您要儲存您的變更嗎？

# MessageConfirmToSaveHomeWorkSpace
source: You have unsaved changes to the Home workspace. Would you like to save your changes?
cs_cz: V domovském pracovním prostoru máte neuložené změny. Chcete změny uložit?
de_de: Es sind nicht gespeicherte Änderungen im Start-Arbeitsbereich vorhanden. Möchten Sie Ihre Änderungen speichern?
es_es: En el espacio de trabajo de inicio hay cambios sin guardar. ¿Desea guardar los cambios?
fr_fr: Vous n'avez pas enregistré les modifications apportées à l'espace de travail. Voulez-vous enregistrer vos modifications?
it_it: Sono presenti modifiche non salvate nell'area di lavoro iniziale. Salvare le modifiche?
ja_jp: ホーム ワークスペースへの変更が保存されていません。 変更を保存しますか?
ko_kr: 홈 작업공간에 저장되지 않은 변경 사항이 있습니다. 변경 사항을 저장하시겠습니까?
pl_pl: Istnieją niezapisane zmiany głównego obszaru roboczego. Czy chcesz zapisać zmiany?
pt_br: Você tem alterações não salvas no espaço de trabalho da página Início. Deseja salvar as alterações?
ru_ru: Имеются несохраненные изменения на начальной странице рабочего пространства. Сохранить изменения?
zh_cn: 对主工作空间的更改未保存。 是否要保存更改？
zh_tw: 您有首頁工作區的未儲存變更。 您要儲存您的變更嗎？

# MessageConfirmToSaveNamedHomeWorkSpace
source: You have unsaved changes to {0}. Would you like to save your changes?
cs_cz: Máte neuložené změny v {0}. Chcete změny uložit?
de_de: Es sind nicht gespeicherte Änderungen an {0} vorhanden. Möchten Sie Ihre Änderungen speichern?
es_es: Hay cambios sin guardar en {0}. ¿Desea guardar los cambios?
fr_fr: Vous n'avez pas enregistré les modifications apportées à {0}. Voulez-vous enregistrer vos modifications?
it_it: Sono presenti modifiche non salvate in {0}. Salvare le modifiche?
ja_jp: {0} への変更が保存されていません。 変更を保存しますか?
ko_kr: {0}에 저장되지 않는 변경 사항이 있습니다. 변경 사항을 저장하시겠습니까?
pl_pl: Istnieją niezapisane zmiany w {0}. Czy chcesz zapisać zmiany?
pt_br: Você tem alterações não salvas para {0}. Deseja salvar as alterações?
ru_ru: Имеются несохраненные изменения в {0}. Сохранить изменения?
zh_cn: 对 {0} 的更改未保存。 是否要保存更改？
zh_tw: 您有 {0} 的未儲存變更。 您要儲存您的變更嗎？

# MessageConfirmToSaveReadOnlyCustomNode
source: We can't save "{0}" because the file is read-only or contains unresolved or invalid nodes. To keep changes, would you like to "Save As..." with a different name or path?
cs_cz: Není možné uložit "{0}", protože soubor je pouze ke čtení nebo obsahuje nevyřešené uzly. Chcete použít příkaz "Uložit jako..." s jiným názvem nebo cestou, abyste zachovali změny?
de_de: "{0}" kann nicht gespeichert werden, da die Datei schreibgeschützt ist oder ungültige Blöcke enthält. Möchten Sie die Änderungen beibehalten und die Datei mithilfe von Speichern unter... unter einem anderen Namen oder Pfad speichern?
es_es: No se puede guardar "{0}" porque el archivo es de solo lectura o contiene nodos no válidos o sin resolver. Para conservar los cambios, ¿desea "Guardar como..." con otro nombre o ruta?
fr_fr: Impossible d'enregistrer "{0}", car le fichier est en lecture seule, ou contient des noeuds non résolus ou non valides. Pour conserver les modifications, voulez-vous l'enregistrer sous un autre nom ou à un autre emplacement?
it_it: Impossibile salvare "{0}" poiché il file è di sola lettura o contiene nodi non validi o non risolti. Per mantenere le modifiche, utilizzare "Salva con nome" con un altro nome o percorso?
ja_jp: ファイルが読み取り専用であるか、未解決または無効なノードを含むため、"{0}" を保存できません。変更を保持するために、[名前を付けて保存]で別の名前またはパスに保存しますか?
ko_kr: "{0}"을(를) 저장할 수 없습니다. 파일이 읽기 전용이거나 해결되지 않은 노드 또는 잘못된 노드가 있습니다. 변경 사항을 유지할 수 있도록 "다른 이름으로 저장..."을 수행하여 다른 이름 또는 경로로 저장하시겠습니까?
pl_pl: Nie możemy zapisać pliku „{0}”, ponieważ jest on tylko do odczytu lub zawiera nierozwiązane bądź nieprawidłowe węzły. Czy chcesz go zapisać pod inną nazwą lub ścieżką przy użyciu opcji „Zapisz jako...”, aby zachować zmiany?
pt_br: Não é possível salvar “{0}” porque o arquivo é somente leitura ou contém nós inválidos ou não solucionados. Para manter as alterações, você gostaria de “Salvar como...” com um nome ou caminho diferente?
ru_ru: Не удалось сохранить файл «{0}», поскольку он доступен только для чтения либо содержит необработанные или недопустимые узлы. Использовать функцию «Сохранить как...» с указанием другого имени или пути для сохранения изменений?
zh_cn: 我们无法保存“{0}”，因为此文件是“只读”文件或者包含未解析或无效的节点。为了保留更改，是否希望使用其他名称或路径执行“另存为...”？
zh_tw: 我們無法儲存「{0}」，因為該檔案是唯讀的，或者包含未解析或無效的節點。若要保留變更，您是否要使用不同的名稱或路徑另存新檔？

# MessageConfirmToDeletePackage
source: Are you sure you want to delete {0} ? This will delete the packages root directory. You can always redownload the package.
cs_cz: Opravdu chcete odstranit {0} ? Tím odstraníte kořenový adresář balíčků. Balíček můžete kdykoli znovu stáhnout.
de_de: Möchten Sie {0} wirklich löschen? Dadurch wird das Stammverzeichnis des Pakets gelöscht. Sie können das Paket jederzeit erneut herunterladen.
es_es: ¿Está seguro de que desea suprimir {0}? Esto suprimirá el directorio raíz de paquetes. Siempre puede volver a descargar el paquete.
fr_fr: Voulez-vous vraiment supprimer {0}? Cette opération supprimera le répertoire racine des packages. Vous pouvez toujours télécharger une nouvelle fois le package.
it_it: Eliminare {0}? Questa operazione eliminerà la directory principale dei pacchetti. È sempre possibile scaricare nuovamente il pacchetto.
ja_jp: {0} を削除しますか? 削除すると、パッケージのルート フォルダが削除されます。 パッケージはいつでも再ダウンロードできます。
ko_kr: {0}을(를) 삭제하시겠습니까? 삭제하면 패키지 루트 디렉토리가 삭제됩니다. 언제든지 패키지를 다시 다운로드할 수 있습니다.
pl_pl: Czy na pewno chcesz usunąć pakiet {0}? Spowoduje to usunięcie katalogu głównego pakietu. Można później ponownie pobrać pakiet.
pt_br: Tem certeza de que deseja excluir {0}? Isso excluirá o diretório raiz dos pacotes. Sempre é possível fazer o download do pacote novamente.
ru_ru: Удалить {0}? Корневой каталог пакета будет удален. Пакет можно всегда скачать повторно.
zh_cn: 是否确定要删除 {0}？这将删除软件包根目录。 始终可以重新下载软件包。
zh_tw: 您確定要刪除 {0} 嗎？這會刪除套件根目錄。 您永遠都可以重新下載套件。

# MessageCustomNodeNameExist
source: A built-in node with the given name already exists.
cs_cz: Vestavěný uzel s daným názvem již existuje.
de_de: Es ist bereits ein integrierter Block mit dem angegebenen Namen vorhanden.
es_es: Ya existe un nodo integrado con este nombre
fr_fr: Un noeud intégré portant ce nom existe déjà.
it_it: Esiste già un nodo incorporato con il nome specificato.
ja_jp: 指定した名前の組み込みノードは既に存在しています。
ko_kr: 지정된 이름의 내장 노드가 이미 존재합니다.
pl_pl: Wbudowany węzeł o podanej nazwie już istnieje.
pt_br: Um nó incorporado com o determinado nome já existe.
ru_ru: Встроенный узел с данным именем уже существует.
zh_cn: 给定名称的内置节点已存在。
zh_tw: 給定名稱已經存在的內建節點。

# MessageCustomNodeNeedNewCategory
source: You must enter a new category or choose one from the existing categories.
cs_cz: Je nutné zadat novou kategorii nebo vybrat jednu z existujících kategorií.
de_de: Geben Sie eine neue Kategorie ein, oder wählen Sie eine der vorhandenen Kategorien.
es_es: Debe introducir una nueva categoría o seleccionar una de las categorías existentes
fr_fr: Vous devez entrer une nouvelle catégorie ou en sélectionner une dans les catégories existantes.
it_it: È necessario immettere una nuova categoria o scegliere una delle categorie esistenti.
ja_jp: 新しいカテゴリを入力するか、既存のカテゴリから 1 つ選択する必要があります。
ko_kr: 새 카테고리를 입력하거나 기존 카테고리에서 선택해야 합니다.
pl_pl: Należy wprowadzić nową kategorię lub wybrać jedną z istniejących.
pt_br: Insira uma nova categoria ou selecione uma nas categorias existentes.
ru_ru: Необходимо ввести имя новой категории или выбрать одну из имеющихся.
zh_cn: 您必须输入新类别或从现有类别中选择一个。
zh_tw: 您必須輸入一個新的品類，或從既有品類選擇一個。

# MessageCustomNodeNoName
source: You must supply a name.
cs_cz: Je nutné zadat název.
de_de: Sie müssen einen Namen angeben.
es_es: Debe proporcionar un nombre
fr_fr: Vous devez indiquer un nom.
it_it: È necessario specificare un nome.
ja_jp: 名前を指定する必要があります。
ko_kr: 이름을 제공해야 합니다.
pl_pl: Należy podać nazwę.
pt_br: Você deve fornecer um nome.
ru_ru: Необходимо указать имя.
zh_cn: 必须提供名称。
zh_tw: 您必須提供名稱。

# MessageCustomNodeNameInvalid
source: Custom Node name cannot contain any of the following special characters: # % * ? \ : or any of the non-printable characters.
cs_cz: Vlastní uzel nesmí obsahovat následující zvláštní znaky: # % * ? \ : ani netisknutelné znaky.
de_de: Benutzerdefinierter Blockname darf keines der folgenden Sonderzeichen enthalten: # % * ? \ : Ebenso wenig sind nicht druckbare Zeichen zulässig.
es_es: El nombre de nodo personalizado no puede contener ninguno de los siguientes caracteres especiales # % * ? \ : o ningún carácter no imprimible.
fr_fr: Le nom du noeud personnalisé ne peut contenir aucun des caractères spéciaux suivants: # % * ? \ : ni aucun des caractères non imprimables.
it_it: Il nome del nodo personalizzato non può contenere i seguenti caratteri speciali: # % * ? \ : o caratteri non stampabili.
ja_jp: カスタム ノードの名前に次の特殊文字を含めることはできません: # % * ? \ : または印刷できない文字
ko_kr: 사용자 노드 이름에는 # % * ? \ :과 같은 특수 문자 또는 인쇄 불가능한 문자가 포함될 수 없습니다.
pl_pl: Nazwa węzła niestandardowego nie może zawierać żadnego z następujących znaków specjalnych: # % * ? \ : ani jakichkolwiek znaków niedrukowanych.
pt_br: O nome do Nó personalizado não pode conter nenhum dos seguintes caracteres especiais: # % * ? \ : nem nenhum dos caracteres não imprimíveis.
ru_ru: Имя пользовательского узла не должно содержать следующие специальные символы: # % * ? \ : или любые непечатаемые символы.
zh_cn: 自定义节点名称中不能包含以下任何特殊字符: # % * ? \ : 或任何不可打印字符。
zh_tw: 自訂節點名稱不能包含下列任何特殊字元: # % * ? \ : 或任何不可列印的字元。

# MessageErrorOpeningFileGeneral
source: Error Opening File
cs_cz: Chyba při otevírání souboru
de_de: Fehler beim Öffnen der Datei
es_es: Error al abrir el archivo
fr_fr: Erreur lors de l'ouverture du fichier
it_it: Errore durante l'apertura del file
ja_jp: ファイルを開いているときにエラーが発生しました
ko_kr: 파일을 여는 중 오류 발생
pl_pl: Błąd otwarcia pliku
pt_br: Erro ao abrir o arquivo
ru_ru: Ошибка при открытии файла
zh_cn: 打开文件时出错
zh_tw: 開啟檔案時發生錯誤

# MessageFailedToAddFile
source: Failed to add file: {0}
cs_cz: Nepodařilo se přidat tento soubor: {0}.
de_de: Fehler beim Hinzufügen von Datei: {0}
es_es: Error al añadir el archivo: {0}
fr_fr: Echec de l'ajout de fichier: {0}
it_it: Impossibile aggiungere il file: {0}
ja_jp: ファイル {0} を追加できませんでした。
ko_kr: 파일을 추가하지 못했습니다. {0}
pl_pl: Nie można dodać pliku: {0}
pt_br: Falha ao adicionar o arquivo: {0}
ru_ru: Не удалось добавить файл: {0}
zh_cn: 无法添加文件: {0}
zh_tw: 無法加入檔案：{0}

# MessageFailedToApplyCustomization
source: Failed to apply NodeViewCustomization for {0}
cs_cz: Nepodařilo se použít NodeViewCustomization pro {0}.
de_de: NodeViewCustomization für {0} konnte nicht angewendet werden.
es_es: Error al aplicar NodeViewCustomization para {0}
fr_fr: Impossible d'appliquer NodeViewCustomization pour {0}
it_it: Impossibile applicare NodeViewCustomization a {0}
ja_jp: {0} への NodeViewCustomization の適用に失敗しました
ko_kr: {0}에 NodeViewCustomization을 적용하지 못했습니다
pl_pl: Nie udało się zastosować NodeViewCustomization dla {0}
pt_br: Falha ao aplicar NodeViewCustomization para {0}
ru_ru: Не удалось применить NodeViewCustomization для {0}
zh_cn: 无法为 {0} 应用 NodeViewCustomization
zh_tw: 無法對 {0} 套用 NodeViewCustomization
