Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# AboutWindowCannotGetVersion
source: Could not get version.
cs_cz: Nelze získat verzi.
de_de: Version konnte nicht abgerufen werden.
es_es: No se ha podido obtener la versión
fr_fr: Impossible d'obtenir la version.
it_it: Impossibile ottenere la versione.
ja_jp: バージョンを取得できませんでした。
ko_kr: 버전을 가져올 수 없습니다.
pl_pl: Nie udało się pobrać wersji.
pt_br: Não foi possível obter a versão.
ru_ru: Не удалось получить версию.
zh_cn: 无法获取版本。
zh_tw: 無法取得版本。

# AboutWindowDynamoWebsiteButton
source: {0} Website
cs_cz: Web aplikace {0}
es_es: Sitio web de {0}
fr_fr: Site Web {0}
it_it: Sito Web di {0}
ja_jp: {0} Web サイト
ko_kr: {0} 웹사이트
pl_pl: Witryna {0}
pt_br: Site do {0}
ru_ru: Веб-сайт {0}
zh_cn: {0} 网站
zh_tw: {0} 網站

# AboutWindowTitle
source: About {0}
cs_cz: O aplikaci {0}
de_de: Info über {0}
es_es: Acerca de {0}
fr_fr: A propos de {0}
it_it: Informazioni su {0}
ja_jp: {0} について
ko_kr: {0} 정보
pl_pl: Informacje o {0}
pt_br: Sobre o {0}
ru_ru: О программе {0}
zh_cn: 关于 {0}
zh_tw: 關於 {0}

# AboutWindowUpToDate
source: (Up to date)
cs_cz: (Aktuální)
de_de: (Aktuell)
es_es: (Actualizado)
fr_fr: (A jour)
it_it: (Aggiornato)
ja_jp: (最新)
ko_kr: (최신)
pl_pl: (Aktualne)
pt_br: (Atualizado)
ru_ru: (Последняя версия)
zh_cn: (最新)
zh_tw: (最新)

# ActionMember
source: Action
cs_cz: Akce
de_de: Aktion
es_es: Acción
it_it: Azione
ja_jp: アクション
ko_kr: 동작
pl_pl: Operacja
pt_br: Ação
ru_ru: Действие
zh_cn: 操作
zh_tw: 動作

# AddButton
source: Add
cs_cz: Přidat
de_de: Hinzufügen
es_es: Añadir
fr_fr: Ajouter
it_it: Aggiungi
ja_jp: 追加
ko_kr: 추가
pl_pl: Dodaj
pt_br: Adicionar
ru_ru: Добавить
zh_cn: 添加
zh_tw: 加入

# AddCustomFileToPackageDialogTitle
source: Add Custom Node, Library, or XML file to Package...
cs_cz: Přidat do balíčku vlastní uzel, knihovnu nebo soubor XML...
de_de: Benutzerdefinierten Block, Bibliothek oder XML-Datei zum Paket hinzufügen...
es_es: Añadir nodo personalizado, biblioteca o archivo XML a paquete...
fr_fr: Ajouter un noeud personnalisé, une bibliothèque ou un fichier XML au package...
it_it: Aggiungi nodo, libreria o file XML personalizzato/a al pacchetto...
ja_jp: カスタム ノード、ライブラリ、XML ファイルをパッケージに追加...
ko_kr: 패키지에 사용자 노드, 라이브러리 또는 XML 파일 추가...
pl_pl: Dodaj węzeł niestandardowy, bibliotekę lub plik XML do pakietu...
pt_br: Adicionar nó personalizado, biblioteca, ou arquivo XML ao pacote...
ru_ru: Добавить пользовательский узел, библиотеку или файл XML в пакет...
zh_cn: 将自定义节点、库或 XML 添加至软件包...
zh_tw: 將自訂節點、資源庫或 XML 檔案加入至套件...

# AddFileToPackageDialogTitle
source: Add File to Package...
cs_cz: Přidat soubor do balíčku...
de_de: Datei zu Paket hinzufügen...
es_es: Añadir archivo a paquete...
fr_fr: Ajouter un fichier au package...
it_it: Aggiungi file al pacchetto...
ja_jp: パッケージにファイルを追加...
ko_kr: 패키지에 파일 추가...
pl_pl: Dodaj plik do pakietu...
pt_br: Adicionar o arquivo ao pacote...
ru_ru: Добавить файл в пакет...
zh_cn: 将文件添加到软件包...
zh_tw: 將檔案加入至套件...

# AddToLibraryButton
source: Add
cs_cz: Přidat
de_de: Hinzufügen
es_es: Añadir
fr_fr: Ajouter
it_it: Aggiungi
ja_jp: 追加
ko_kr: 추가
pl_pl: Dodaj
pt_br: Adicionar
ru_ru: Добавить
zh_cn: 添加
zh_tw: 加入

# SignInButtonContentToolTip
source: Sign in to access online services that integrate with your desktop software.
cs_cz: Přihlaste se, abyste získali přístup k online službám integrovaným s vaším desktopovým softwarem.
de_de: Melden Sie sich an, um auf Online-Dienste zuzugreifen, die in Ihre Desktop-Software integriert werden können.
es_es: Inicie sesión para acceder a los servicios en línea que se integran con el software de escritorio.
fr_fr: Connectez-vous pour accéder aux services en ligne qui s'intègrent à votre logiciel de bureau.
it_it: Accedere per usufruire dei servizi online che si integrano con il software desktop.
ja_jp: サインインして、デスクトップソフトウェアに統合されるオンラインサービスにアクセスします。
ko_kr: 로그인하여 데스크탑 소프트웨어와 통합되는 온라인 서비스에 액세스하십시오.
pl_pl: Zaloguj się, aby uzyskać dostęp do usług online zintegrowanych z oprogramowaniem na komputerze.
pt_br: Entre para acessar serviços on-line que se integram ao software de desktop.
ru_ru: Войдите в систему, чтобы получить доступ к онлайн-службам, которые интегрируются с классическими программами.
zh_cn: 登录以访问与桌面软件集成的联机服务。
zh_tw: 登入以存取與桌面軟體整合的線上服務。

source: Autodesk Sign In
cs_cz: Přihlášení k účtu Autodesk
de_de: Anmeldung bei Autodesk
es_es: Inicio de sesión en Autodesk
fr_fr: Autodesk - Connexion
it_it: Accesso ad Autodesk
ja_jp: Autodesk サイン イン
ko_kr: Autodesk 로그인
pl_pl: Logowanie w usłudze Autodesk
pt_br: Login da Autodesk
ru_ru: Вход в систему Autodesk
zh_cn: Autodesk 登录
zh_tw: Autodesk 登入

source: Automatic
cs_cz: Automaticky
de_de: Automatisch
es_es: Automático
fr_fr: Automatique
it_it: Automatico
ja_jp: 自動
ko_kr: 자동
pl_pl: Automatycznie
pt_br: Automático
ru_ru: Автоматически
zh_cn: 自动
zh_tw: 自動

# BackgroundPreviewCreationFailureMessage
source: There was an error creating a background preview in Dynamo. This could be due to a lack of graphics resources on your machine. See the log for more information.
cs_cz: Při vytváření náhledu pozadí v aplikaci Dynamo se vyskytla chyba. Tuto situaci může způsobit nedostatek grafických zdrojů v počítači. Další informace naleznete v protokolu.
de_de: Fehler beim Erstellen einer Hintergrundvorschau in Dynamo. Auf Ihrem Computer sind eventuell nicht genügend Grafikressourcen vorhanden. Weitere Informationen finden Sie in der Protokolldatei.
es_es: Ha habido un error al crear una vista preliminar en segundo plano en Dynamo. Podría deberse a falta de recursos en el equipo. Consulte el registro para obtener más información.
fr_fr: Erreur lors de la création d'un aperçu en arrière-plan dans Dynamo. Cela peut être dû à un manque de ressources graphiques sur votre ordinateur. Consultez le fichier journal pour plus d'informations.
it_it: Si è verificato un errore durante la creazione di un'anteprima sfondo in Dynamo. Ciò può essere dovuto a risorse grafiche insufficienti nel computer in uso. Per ulteriori informazioni, vedere il file di registro.
ja_jp: Dynamo に背景プレビューを作成中にエラーが発生しました。これは、コンピュータのグラフィックス リソースが不足しているために起こる可能性があります。詳細については、ログを参照してください。
ko_kr: Dynamo에서 배경 미리보기를 작성하는 동안 오류가 발생했습니다. 컴퓨터의 그래픽 리소스가 부족하기 때문일 수 있습니다. 자세한 내용은 로그를 참조하십시오.
pl_pl: Wystąpił błąd podczas tworzenia podglądu tła w programie Dynamo. Może to być spowodowane brakiem zasobów grafik w komputerze. Zobacz plik dziennika, aby uzyskać więcej informacji.
pt_br: Ocorreu um erro ao criar uma visualização do plano de fundo no Dynamo. Isto pode ser devido à falta de recursos gráficos em sua máquina. Consulte o registro para obter mais informações.
ru_ru: Ошибка при создании режима фонового просмотра в Dynamo. Возможной причиной может служить нехватка ресурсов графической подсистемы на компьютере. Дополнительные сведения приведены в журнале.
zh_cn: 在 Dynamo 中创建背景预览时出错。这可能是由于您的计算机上缺少图形资源。请参见日志了解详细信息。
zh_tw: 在 Dynamo 中建立背景預覽時發生錯誤。這可能是因為您的電腦上缺乏圖資源。請參閱記錄，以取得更多資訊。

# BackgroundPreviewDefaultName
source: Default Background Preview
cs_cz: Výchozí náhled pozadí
de_de: Vorgegebene Hintergrundvorschau
es_es: Vista preliminar en segundo plano por defecto
fr_fr: Aperçu en arrière-plan par défaut
it_it: Anteprima sfondo di default
ja_jp: 既定の背景プレビュー
ko_kr: 기본 배경 미리보기
pl_pl: Domyślny podgląd tła
pt_br: Visualização do plano de fundo padrão
ru_ru: Фоновый просмотр по умолчанию
zh_cn: 默认背景预览
zh_tw: 預設背景預覽

# BackgroundPreviewName
source: _Background Preview
cs_cz: _Náhled pozadí
de_de: _Hintergrundvorschau
es_es: _Vista preliminar en segundo plano
fr_fr: _Aperçu en arrière-plan
it_it: _Anteprima sfondo
ja_jp: 背景プレビュー(_B)
ko_kr: 배경 미리보기(_B)
pl_pl: _Podgląd tła
pt_br: _Visualização do plano de fundo
ru_ru: _Фоновый просмотр
zh_cn: 背景预览(_B)
zh_tw: 背景預覽(_B)

# BrowserNodeButtonLabel
source: Browse...
cs_cz: Procházet...
de_de: Durchsuchen...
es_es: Examinar...
fr_fr: Parcourir...
it_it: Sfoglia...
ja_jp: 参照...
ko_kr: 찾아보기...
pl_pl: Przeglądaj...
pt_br: Procurar...
ru_ru: Обзор...
zh_cn: 浏览...
zh_tw: 瀏覽...

# BrowserNodeNoFileSelected
source: No file selected.
cs_cz: Není vybrán žádný soubor.
de_de: Keine Datei ausgewählt.
es_es: No hay ningún archivo seleccionado.
fr_fr: Aucun fichier n'est sélectionné.
it_it: Nessun file selezionato.
ja_jp: ファイルが選択されていません。
ko_kr: 선택한 파일이 없습니다.
pl_pl: Nie wybrano pliku.
pt_br: Nenhum arquivo selecionado.
ru_ru: Файл не выбран.
zh_cn: 未选择文件。
zh_tw: 未選取檔案。

# BrowserWindowLoading
source: Loading...
cs_cz: Načítání...
de_de: Laden...
es_es: Cargando...
fr_fr: Chargement...
it_it: Caricamento in corso...
ja_jp: ロード中...
ko_kr: 로드 중...
pl_pl: Wczytywanie...
pt_br: Carregando...
ru_ru: Загрузка...
zh_cn: 正在加载...
zh_tw: 載入中...

# BuildVersionNonNegative
source: You must provide a Build version as a non-negative integer.
cs_cz: Verzi Sestavení je třeba zadat jako nezáporné celé číslo.
de_de: Sie müssen eine Build-Version als nicht negative Ganzzahl angeben.
es_es: Debe proporcionar una versión de compilación como entero no negativo
fr_fr: Vous devez fournir une version Build sous la forme d’un nombre entier non négatif.
it_it: È necessario specificare una versione di build come numero intero non negativo.
ja_jp: ビルド バージョンを負ではない整数で指定する必要があります。
ko_kr: 빌드 버전을 음이 아닌 정수로 입력해야 합니다.
pl_pl: Należy podać wersję kompilacji jako nieujemną liczbę całkowitą.
pt_br: Você deve fornecer uma versão de compilação como um inteiro não negativo.
ru_ru: Необходимо ввести версию сборки в виде целого числа, не являющегося отрицательным.
zh_cn: 您必须提供一个内部版本作为非负整数。
zh_tw: 您必須提供非負整數的建置版本。

# CameraDataLoadError
source: Camera position information could not be loaded from the file.
cs_cz: Informace o poloze kamery nebylo možné ze souboru načíst.
de_de: Informationen zu Kameraposition konnten nicht aus der Datei geladen werden.
es_es: La información de posición de cámara no se ha podido cargar desde el archivo.
fr_fr: Les informations de position de la caméra n'ont pas pu être chargées à partir du fichier.
it_it: Impossibile caricare informazioni sulla posizione della cinepresa dal file.
ja_jp: カメラの位置情報をファイルからロードできませんでした。
ko_kr: 파일에서 카메라 위치 정보를 로드할 수 없습니다.
pl_pl: Informacje o położeniu kamery nie mogły zostać wczytane z pliku.
pt_br: As informações da posição da câmera puderam ser carregadas a partir do arquivo.
ru_ru: Невозможно загрузить информацию о положении камеры из файла.
zh_cn: 无法从文件加载相机位置信息。
zh_tw: 無法從檔案載入相機的位置資訊。

# CameraDataSaveError
source: Camera position information could not be saved.
cs_cz: Informace o poloze kamery nelze uložit.
de_de: Informationen zu Kameraposition konnten nicht gespeichert werden.
es_es: La información de posición de cámara no se ha podido guardar.
fr_fr: Les informations de position de la caméra n'ont pas pu être enregistrées.
it_it: Impossibile salvare informazioni sulla posizione della cinepresa.
ja_jp: カメラの位置情報を保存できませんでした。
ko_kr: 카메라 위치 정보를 저장할 수 없습니다.
pl_pl: Informacje o położeniu kamery nie mogły zostać zapisane.
pt_br: As informações da posição da câmera não puderam ser salvas.
ru_ru: Невозможно сохранить информацию о положении камеры.
zh_cn: 无法保存相机位置信息。
zh_tw: 無法儲存相機的位置資訊。

# CancelButton
source: Cancel
cs_cz: Storno
de_de: Abbrechen
es_es: Cancelar
fr_fr: Annuler
it_it: Annulla
ja_jp: キャンセル
ko_kr: 취소
pl_pl: Anuluj
pt_br: Cancelar
ru_ru: Отмена
zh_cn: 取消
zh_tw: 取消

# CannotDownloadPackageMessageBoxTitle
source: Cannot Download Package
cs_cz: Balíček nelze stáhnout
de_de: Paket kann nicht heruntergeladen werden.
es_es: No se puede descargar paquete
fr_fr: Impossible de télécharger le package
it_it: Impossibile scaricare il pacchetto
ja_jp: パッケージをダウンロードできません
ko_kr: 패키지를 다운로드할 수 없습니다
pl_pl: Nie można pobrać pakietu
pt_br: Não é possível efetuar o download do pacote
ru_ru: Не удается загрузить пакет
zh_cn: 无法下载软件包
zh_tw: 無法下載套件

# BuiltInPackageConflictMessageBoxTitle
source: Package has conflicts with one or more Built-In packages.
cs_cz: Balíček je v konfliktu s jedním nebo více vestavěnými balíčky.
de_de: Ein Paket weist Konflikte mit einem oder mehreren integrierten Paketen auf.
es_es: El paquete presenta conflictos con uno o más paquetes integrados.
fr_fr: Le package présente des conflits avec un ou plusieurs packages intégrés.
it_it: Il pacchetto presenta conflitti con uno o più pacchetti incorporati.
ja_jp: パッケージは 1 つ以上の組み込みパッケージと競合しています。
ko_kr: 패키지가 하나 이상의 내장 패키지와 충돌합니다.
pl_pl: Pakiet jest w konflikcie z co najmniej jednym pakietem wbudowanym.
pt_br: O pacote tem conflitos com um ou mais pacotes internos.
ru_ru: Пакет конфликтует с одним или несколькими встроенными пакетами.
zh_cn: 软件包与一个或多个内置软件包冲突。
zh_tw: 套件與一個或多個內建套件發生衝突。

# PackagesInUseConflictMessageBoxTitle
source: Package has conflicts with one or more packages in use.
cs_cz: Balíček je v konfliktu s jedním nebo více používanými balíčky.
de_de: Ein Paket weist Konflikte mit einem oder mehreren verwendeten Paketen auf.
es_es: El paquete presenta conflictos con uno o más paquetes en uso.
fr_fr: Le package présente des conflits avec un ou plusieurs packages en cours d'utilisation.
it_it: Il pacchetto presenta conflitti con uno o più pacchetti in uso.
ja_jp: パッケージは使用中の 1 つ以上のパッケージと競合しています。
ko_kr: 패키지가 사용 중인 하나 이상의 패키지와 충돌합니다.
pl_pl: Pakiet jest w konflikcie z co najmniej jednym używanym pakietem.
pt_br: O pacote tem conflitos com um ou mais pacotes em uso.
ru_ru: Пакет конфликтует с одним или несколькими используемыми пакетами.
zh_cn: 软件包与一个或多个正在使用的软件包冲突。
zh_tw: 套件與一個或多個使用中的套件發生衝突。

# LoadedPackagesConflictMessageBoxTitle
source: Package has conflicts with one or more loaded packages.
cs_cz: Balíček je v konfliktu s jedním nebo více načtenými balíčky.
de_de: Paket weist Konflikte mit einem oder mehreren geladenen Paketen auf.
es_es: El paquete presenta conflictos con uno o más paquetes cargados.
fr_fr: Le package a des conflits avec un ou plusieurs packages chargés.
it_it: Il pacchetto presenta conflitti con uno o più pacchetti caricati.
ja_jp: パッケージは、ロードされた 1 つ以上のパッケージと競合しています。
ko_kr: 패키지가 하나 이상의 로드된 패키지와 충돌합니다.
pl_pl: Pakiet jest w konflikcie z co najmniej jednym wczytanym pakietem.
pt_br: O pacote tem conflitos com um ou mais pacotes carregados.
ru_ru: Пакет конфликтует с одним или несколькими загруженными пакетами.
zh_cn: 软件包与一个或多个已加载的软件包冲突。
zh_tw: 套件與一個或多個載入的套件發生衝突。

# CannotSubmitPackage
source: You can't submit a package in this version of {0}. You'll need a host application, like Revit, to submit a package.
cs_cz: Nelze odeslat balíček v této verzi aplikace {0}. K odeslání balíčku budete potřebovat hostitelskou aplikaci, například aplikaci Revit.
de_de: In dieser Version von {0} können Sie kein Paket senden. Sie benötigen hierfür eine Host-Anwendung, z. B. Revit.
es_es: No se puede enviar un paquete en esta versión de {0}. Necesitará una aplicación host, como Revit, para enviar un paquete.
fr_fr: Vous ne pouvez pas soumettre un package dans cette version de {0}. Vous aurez besoin d'une application hôte, comme Revit, pour soumettre un package.
it_it: Impossibile inviare un pacchetto nella presente versione di {0}. Per inviare un pacchetto è necessario disporre di un'applicazione host, ad esempio Revit.
ja_jp: {0} のこのバージョンでは、パッケージを送信できません。パッケージを送信するには、Revit などのホスト アプリケーションが必要です。
ko_kr: 이 {0} 버전에서는 패키지를 제출할 수 없습니다. 패키지를 제출하려면 Revit과 같은 호스트 응용프로그램이 필요합니다.
pl_pl: Nie można przesłać pakietu w tej wersji {0}. Aby przesłać pakiet, potrzebna jest aplikacja hosta, na przykład programu Revit.
pt_br: Você não pode enviar um pacote nesta versão do {0}. Você precisa de um aplicativo host, como o Revit, para enviar um pacote.
ru_ru: Невозможно отправить пакет в этой версии {0}. Для этого требуется основное приложение, например Revit.
zh_cn: 该版本 {0} 无法提交软件包。若要提交软件包，您需要 Revit 等主体应用程序。
zh_tw: 您無法在此版本的 {0} 中提交套件。您將需要主體應用程式 (如 Revit) 才可提交套件。

# ChangeScaleFactorPromptCaptionText
source: To ensure accurate geometry rendering and calculation, select the range of geometry sizes that you will be working on:
cs_cz: Chcete-li zajistit přesnost výpočtu a rendrování geometrie, vyberte rozsah velikostí geometrií, ve kterém budete pracovat:
de_de: Wählen Sie den Größenbereich für Geometrie, in dem Sie arbeiten möchten, damit die Geometrie präzise gerendert und berechnet wird:
es_es: Para asegurar un cálculo y una renderización de geometría precisos, seleccione el rango de tamaños de geometría con los que trabajará:
fr_fr: Pour assurer un rendu et des calculs de géométrie précis, sélectionnez l'intervalle de tailles de géométrie dans lequel vous allez travailler:
it_it: Per garantire rendering e calcoli precisi della geometria, selezionare l'intervallo di dimensioni della geometria che verrà utilizzato:
ja_jp: ジオメトリのレンダリングと計算を正確に実行するため、操作するジオメトリ サイズの範囲を選択してください。
ko_kr: 형상을 정확하게 렌더링 및 계산하려면 작업할 형상에 대한 크기의 범위를 선택하십시오.
pl_pl: Aby zapewnić dokładne renderowanie i obliczanie geometrii, wybierz zakres rozmiaru geometrii, z jakim będziesz pracować:
pt_br: Para garantir cálculos e renderizações precisas da geometria, selecione o intervalo de tamanhos da geometria com o qual vai trabalhar:
ru_ru: Чтобы обеспечить высокое качество визуализации и расчета геометрии, выберите диапазон размеров геометрии, с которым вы работаете:
zh_cn: 为确保精确的几何图形渲染和计算，请选择要使用的几何图形大小范围:
zh_tw: 為確保精確的幾何圖形呈現和計算，請選取要處理之幾何圖形尺寸範圍：

# ChangeScaleFactorPromptDescriptionBox
source: Numerical range shown here denote numbers in the following unit:
cs_cz: Zde uvedený číselný rozsah znázorňuje čísla v následující jednotce:
de_de: Im hier gezeigten numerischen Bereich werden Zahlen mit der folgenden Einheit angezeigt:
es_es: El rango numérico que se muestra aquí indica los números en la unidad siguiente:
fr_fr: La plage numérique indiquée ici indique les nombres dans l'unité suivante:
it_it: L'intervallo numerico illustrato di seguito indica i numeri nelle seguenti unità:
ja_jp: ここに表示されている数値範囲は、次の単位の数値を示しています:
ko_kr: 여기에 표시된 숫자 범위는 다음과 같은 단위로 숫자를 나타냅니다.
pl_pl: Podany tu zakres liczbowy wskazuje liczby w następujących jednostkach:
pt_br: O intervalo numérico mostrado aqui indica números na seguinte unidade:
ru_ru: Числа в данном числовом диапазоне приведены в следующих единицах:
zh_cn: 此处显示的数值范围按以下单位表示数字:
zh_tw: 如下所示的數字範圍表示的數字採用以下單位:

# ChangeScaleFactorPromptDescriptionContent
source: Use this working range to model in values that fall between {0} to {1} units
cs_cz: Tento pracovní rozsah slouží k modelování hodnot v rozsahu od {0} do {1} jednotek.
de_de: Verwenden Sie diesen Arbeitsbereich zum Modellieren mit Werten zwischen {0} bis {1} Einheiten
es_es: Utilice este rango de trabajo para modelar en valores que van de {0} a {1} unidades
fr_fr: Utiliser cet intervalle utile pour modéliser des valeurs comprises entre les unités {0} et {1}
it_it: Utilizzare questo intervallo di lavoro per modellare valori compresi tra {0} e {1} unità
ja_jp: この動作範囲を使用して、 {0} 単位から {1} 単位までの範囲内の値でモデリングを行います
ko_kr: 이 작업 범위를 사용하여 {0}과 {1} 단위 사이의 값으로 모델링하십시오.
pl_pl: Użyj tego zakres roboczego, aby modelować w wartościach od {0} do {1} jednostek
pt_br: Utilize este intervalo de trabalho para modelar em valores compreendidos entre {0} e {1} unidades
ru_ru: Используйте этот рабочий диапазон для моделирования в значениях, которые находятся в диапазоне от {0} до {1}
zh_cn: 使用此工作范围通过 {0} 到 {1} 单位之间的值进行建模
zh_tw: 使用此工作範圍對在 {0} 至 {1} 單位之間的值進行塑型

# ChangeScaleFactorPromptDescriptionDefaultSetting
source: Default Setting:
cs_cz: Výchozí nastavení:
de_de: Vorgabeeinstellung:
es_es: Valor por defecto:
fr_fr: Paramètre par défaut:
it_it: Impostazione di default:
ja_jp: 既定の設定:
ko_kr: 기본 설정:
pl_pl: Domyślne ustawienie:
pt_br: Configuração padrão:
ru_ru: Значение по умолчанию:
zh_cn: 默认设置:
zh_tw: 預設設定:

# ChangeScaleFactorPromptUnitCm
source: Centimeters (cm)
cs_cz: Centimetry (cm)
de_de: Zentimeter (cm)
es_es: Centímetros (cm)
fr_fr: Centimètres (cm)
it_it: Centimetri (cm)
ja_jp: センチメートル(cm)
ko_kr: 센티미터(cm)
pl_pl: Centymetry (cm)
pt_br: Centímetros (cm)
ru_ru: Сантиметры (см)
zh_cn: 厘米 (cm)
zh_tw: 公分 (cm)

# ChangeScaleFactorPromptUnitM
source: Meters (m)
cs_cz: Metry (m)
de_de: Meter (m)
es_es: Metros (m)
fr_fr: Mètres (m)
it_it: Metri (m)
ja_jp: メートル(m)
ko_kr: 미터(m)
pl_pl: Metry (m)
pt_br: Metros (m)
ru_ru: Метры (м)
zh_cn: 米 (m)
zh_tw: 公尺 (m)

# ChangeScaleFactorPromptUnitMm
source: Millimeters (mm)
cs_cz: Milimetry (mm)
de_de: Millimeter (mm)
es_es: Milímetros (mm)
fr_fr: Millimètres (mm)
it_it: Millimetri (mm)
ja_jp: ミリメートル(mm)
ko_kr: 밀리미터(mm)
pl_pl: Milimetry (mm)
pt_br: Milímetros (mm)
ru_ru: Миллиметры (мм)
zh_cn: 毫米 (mm)
zh_tw: 公釐 (mm)

# ChangeScaleFactorPromptWindowTitle
source: Geometry Working Range
cs_cz: Pracovní rozsah geometrie
de_de: Arbeitsbereich für Geometrie
es_es: Rango de trabajo de geometría
fr_fr: Intervalle utile de géométrie
it_it: Intervallo di lavoro geometria
ja_jp: ジオメトリの動作範囲
ko_kr: 형상 작업 범위
pl_pl: Zakres roboczy geometrii
pt_br: Intervalo de trabalho da geometria
ru_ru: Рабочий диапазон геометрии
zh_cn: 几何图形工作范围
zh_tw: 幾何圖形工作範圍

# CompactLayoutTitle
source: Compact
cs_cz: Kompaktní
de_de: Kompakt
es_es: Compacto
it_it: Compatta
ja_jp: コンパクト
ko_kr: 압축
pl_pl: Kompresja
pt_br: Compacto
ru_ru: Компактный
zh_cn: 精简
zh_tw: 精簡

# ConsentFormADPAnalyticsCheckBoxContent
source: I agree to data collection in desktop products for Autodesk analytics programs.
cs_cz: Souhlasím se shromažďováním dat v počítačových aplikacích pro použití v analytických programech společnosti Autodesk.
de_de: Ich stimme der Datenerfassung in Desktop-Produkten für Autodesk-Analyseprogramme zu.
es_es: Acepto la recopilación de datos de los productos de escritorio para los programas de análisis de Autodesk.
fr_fr: J'accepte la collecte des données des produits de bureau pour les programmes d'analyse d'Autodesk.
it_it: Acconsento alla raccolta di dati nei prodotti desktop per i programmi di analisi Autodesk.
ja_jp: オートデスクの解析プログラムがデスクトップ製品でデータを収集することに同意します。
ko_kr: Autodesk 해석 프로그램용 데스크톱 제품의 데이터 수집에 동의합니다.
pl_pl: Wyrażam zgodę na gromadzenie danych z produktów na komputerze do programów analizy danych firmy Autodesk.
pt_br: Eu concordo com a coleta de dados em produtos de desktop de programas de análise da Autodesk.
ru_ru: Я соглашаюсь на сбор данных в версиях программ для ПК в рамках анализа использования продуктов Autodesk.
zh_cn: 我同意收集桌面产品数据以用于 Autodesk 分析计划。
zh_tw: 我同意桌面產品收集資料供 Autodesk 分析程式使用。

# ContextAddGroupFromSelection
source: Add Node To Group
cs_cz: Přidat uzel do skupiny
de_de: Block zu Gruppe hinzufügen
es_es: Añadir nodo al grupo
fr_fr: Ajouter le noeud au groupe
it_it: Aggiungi nodo al gruppo
ja_jp: グループにノードを追加
ko_kr: 그룹에 노드 추가
pl_pl: Dodaj węzeł do grupy
pt_br: Adicionar nó ao grupo
ru_ru: Добавить узел в группу
zh_cn: 将节点添加到组
zh_tw: 將節點加入群組

# ContextCreateGroupFromSelection
source: Create Group
cs_cz: Vytvořit skupinu
de_de: Gruppe erstellen
es_es: Crear grupo
fr_fr: Créer un groupe
it_it: Crea gruppo
ja_jp: グループを作成
ko_kr: 그룹 만들기
pl_pl: Utwórz grupę
pt_br: Criar grupo
ru_ru: Создать группу
zh_cn: 创建组
zh_tw: 建立群組

# ContextMenuCopy
source: Copy Contents
cs_cz: Kopírovat obsah
de_de: Inhalte kopieren
es_es: Copiar contenido
fr_fr: Copier le contenu
it_it: Copia contenuto
ja_jp: コンテンツをコピー
ko_kr: 컨텐츠 복사
pl_pl: Kopiuj zawartość
pt_br: Copiar conteúdo
ru_ru: Копировать содержимое
zh_cn: 复制内容
zh_tw: 複製內容

# ContextMenuDelete
source: Delete
cs_cz: Odstranit
de_de: Löschen
es_es: Suprimir
fr_fr: Supprimer
it_it: Elimina
ja_jp: 削除
ko_kr: 삭제
pl_pl: Usuń
pt_br: Excluir
ru_ru: Удалить
zh_cn: 删除
zh_tw: 刪除

# ContextMenuEditCustomNode
source: Edit Custom Node...
cs_cz: Upravit vlastní uzel...
de_de: Benutzerdefinierten Block bearbeiten...
es_es: Editar nodo personalizado...
fr_fr: Modifier le noeud personnalisé...
it_it: Modifica nodo personalizzato...
ja_jp: カスタム ノードを編集...
ko_kr: 사용자 노드 편집...
pl_pl: Edytuj węzeł niestandardowy...
pt_br: Editar o nó personalizado...
ru_ru: Редактировать пользовательский узел...
zh_cn: 编辑自定义节点...
zh_tw: 編輯自訂節點...
