Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# PreferencesViewDefaultRunSettingsInfoTooltip
source: Set the default run mode for your graphs. In Manual mode, graph changes are executed when you click Run. Use this mode when working in large graphs, unfamiliar graphs, or host programs. In Automatic mode, graph changes are executed in real time. This mode provides immediate feedback. In certain complex graphs or host program scenarios, Automatic mode may cause instability issues or other problems. If this happens, try switching to Manual mode.
cs_cz: Nastaví výchozí režim spuštění grafů. V ručním režimu se změny grafu provedou, když kliknete na tlačítko Spustit. Tento režim použijte při práci s velkými grafy, neznámými grafy nebo hostitelskými programy. V automatickém režimu se změny grafu provádějí v reálném čase. Tento režim poskytuje okamžitou zpětnou vazbu. V určitém kontextu složitých grafů nebo hostitelských režimů může automatický režim způsobit problémy s nestabilitou nebo jiné problémy. Pokud k tomu dojde, zkuste se přepnout do ručního režimu.
de_de: Legen Sie den vorgegebenen Ausführungsmodus für Ihre Diagramme fest. Im manuellen Modus werden Diagrammänderungen ausgeführt, wenn Sie auf Ausführen klicken. Verwenden Sie diesen Modus, wenn Sie mit großen Diagrammen, unbekannten Diagrammen oder Host-Programmen arbeiten. Im automatischen Modus werden Diagrammänderungen in Echtzeit ausgeführt. Dieser Modus bietet sofortiges Feedback. In bestimmten komplexen Diagrammen oder Host-Programmszenarien kann der automatische Modus zu Instabilität oder anderen Problemen führen. Wenn dies der Fall ist, wechseln Sie in den manuellen Modus.
es_es: Establezca el modo de ejecución por defecto para los gráficos. En el modo Manual, los cambios realizados en el gráfico se ejecutan al hacer clic en Ejecutar. Utilice este modo cuando trabaje con gráficos grandes o desconocidos, o programas anfitriones. En el modo Automático, los cambios realizados en el gráfico se ejecutan en tiempo real. Este modo proporciona información inmediata. En determinados gráficos complejos o al usar programas anfitriones, el modo Automático puede provocar inestabilidad u otros problemas. En ese caso, pruebe a cambiar al modo Manual.
fr_fr: Définissez le mode d'exécution par défaut de vos graphiques. En mode Manuel, les modifications de graphique sont exécutées lorsque vous cliquez sur Exécuter. Utilisez ce mode lorsque vous travaillez dans des graphiques volumineux, des graphiques inconnus ou des programmes hôtes. En mode Automatique, les modifications de graphique sont exécutées en temps réel. Ce mode fournit un retour immédiat. Dans certains graphiques complexes ou scénarios de programmes hôtes, le mode Automatique peut provoquer des problèmes d'instabilité ou autres.
it_it: Impostare la modalità di esecuzione di default per i grafici. In modalità Manuale, le modifiche al grafico vengono eseguite quando si fa clic su Esegui. Utilizzare questa modalità quando si lavora in grafici di grandi dimensioni, grafici non familiari o programmi host. In modalità Automatico, le modifiche al grafico vengono eseguite in tempo reale. Questa modalità fornisce un feedback immediato. In alcuni scenari complessi di programmi host o grafici, la modalità Automatico può causare problemi di instabilità o altri problemi. In tal caso, provare a passare alla modalità Manuale.
ja_jp: グラフの既定の実行モードを設定します。手動モードでは、[実行]をクリックすると、グラフの変更が実行されます。このモードは、大きなグラフ、不明なグラフ、またはホストプログラムで作業する場合に使用します。 自動モードでは、グラフの変更はリアルタイムで実行されます。 特定の複雑なグラフまたはホストプログラムの場合は、不安定や問題が発生する場合があります。そうした場合、手動モードに切り替えます。
ko_kr: 그래프의 기본 실행 모드를 설정합니다. 수동 모드에서는 실행을 클릭하면 그래프 변경 사항이 실행됩니다. 큰 그래프, 익숙하지 않은 그래프 또는 호스트 프로그램에서 작업할 때 이 모드를 사용합니다. 자동 모드에서는 그래프 변경 사항이 실시간으로 실행됩니다. 이 모드에서는 즉각적인 피드백이 제공됩니다. 복잡한 그래프 또는 호스트 프로그램 시나리오에서는 자동 모드로 인해 불안정한 문제 또는 기타 문제가 발생할 수 있습니다. 이 경우 수동 모드로 전환해 보십시오.
pl_pl: Ustaw domyślny tryb uruchamiania wykresów. W trybie ręcznym zmiany wykresów są wykonywane po kliknięciu przycisku Uruchom. Ten tryb jest odpowiedni do pracy z dużymi wykresami, nieznanymi wykresami oraz programami nadrzędnymi. W trybie automatycznym zmiany wykresów są wykonywane w czasie rzeczywistym. Ten tryb zapewnia natychmiastowe informacje zwrotne. W niektórych sytuacjach ze złożonymi wykresami lub programami nadrzędnymi tryb automatyczny może powodować problemy z niestabilnością lub inne. W takim przypadku spróbuj przełączyć się do trybu ręcznego.
pt_br: Defina o modo de execução padrão para os gráficos. No modo Manual, as alterações dos gráficos são executadas quando você clica em Executar. Use esse modo para trabalhar em gráficos grandes, gráficos desconhecidos ou programas hospedeiros. No modo Automático, as alterações dos gráficos são executadas em tempo real. Esse modo fornece feedback imediato. Em alguns gráficos complexos ou cenários de programas hospedeiros, o modo Automático pode causar problemas de instabilidade ou outros problemas. Se isso ocorrer, tente alternar para o modo Manual.
ru_ru: Выбор режима запуска по умолчанию для графиков. В режиме «Вручную» изменения графика выполняются при нажатии кнопки «Запуск». Этот режим используется при работе с большими или незнакомыми графиками и основными программами. В режиме «Автоматически» изменения графика выполняются в реальном времени. Этот режим обеспечивает мгновенную обратную связь. В некоторых сложных графиках или сценариях основных программ автоматический режим может приводить к нестабильной работе или другим проблемам. В этом случае попробуйте переключиться в ручной режим.
zh_cn: 设置图形的默认运行模式。在“手动”模式下，图形更改会在您单击“运行”时执行。在处理大型图形、不熟悉的图形或主机程序时，请使用此模式。 在“自动”模式下，图形更改会实时执行。此模式会提供即时反馈。 在某些复杂图形或主机程序场景中，“自动”模式可能会导致出现不稳定问题或其他问题。如果发生这种情况，请尝试切换到“手动”模式。
zh_tw: 為圖表設定預設執行模式。在「手動」模式下，圖表變更會在您按一下「執行」時執行。在大型圖表、不熟悉的圖表或主程式中工作時，請使用此模式。 在「自動」模式下，圖表變更會即時執行。此模式提供立即的回饋。 在某些複雜圖表或主程式案例中，「自動」模式可能會造成不穩定或其他問題。如果問題持續發生，請嘗試切換為「手動」模式。

# GroupStyleFontSizeToolTip
source: Font size
cs_cz: Velikost písma
de_de: Schriftgröße
es_es: Tamaño de tipo de letra
fr_fr: Taille de la police
it_it: Dimensioni carattere
ja_jp: フォントサイズ
ko_kr: 글꼴 크기
pl_pl: Rozmiar czcionki
pt_br: Tamanho da fonte
ru_ru: Размер шрифта
zh_cn: 字体大小
zh_tw: 字體大小

# SplashScreenImportSettings
source: Import Settings
cs_cz: Importovat nastavení
de_de: Einstellungen importieren
es_es: Importar configuración
fr_fr: Paramètres importation
it_it: Impostaz. importazione
ja_jp: 読み込み設定
ko_kr: 가져오기 설정
pl_pl: Importuj ustawienia
pt_br: Config. importação
ru_ru: Параметры импорта
zh_cn: 输入设置
zh_tw: 匯入設定

# SplashScreenImportSettingsFailDescription
source: Something went wrong when importing your custom setting file. Please try again or proceed with default settings.
cs_cz: Při importu souboru uživatelských nastavení došlo k chybě. Zkuste to znovu nebo pokračujte s výchozím nastavením.
de_de: Beim Importieren der benutzerdefinierten Einstellungsdatei ist ein Fehler aufgetreten. Versuchen Sie es erneut, oder fahren Sie mit den Vorgabeeinstellungen fort.
es_es: Se ha producido un error al importar el archivo de configuración personalizada. Inténtelo de nuevo o continúe con la configuración por defecto.
fr_fr: Une erreur s'est produite lors de l'importation de votre fichier. Réessayez ou poursuivez avec les paramètres par défaut.
it_it: Si è verificato un errore quando è stato importato il file di impostazioni personalizzate. Riprovare o continuare con le impostazioni di default.
ja_jp: カスタム設定ファイルの読み込み時に問題が発生しました。もう一度試すか、既定の設定で続行してください。
ko_kr: 사용자 설정 파일을 가져올 때 문제가 발생했습니다. 다시 시도하거나 기본 설정으로 계속하십시오.
pl_pl: Wystąpiły problemy podczas importowania pliku ustawień niestandardowych. Spróbuj ponownie lub kontynuuj z ustawieniami domyślnymi.
pt_br: Ocorreu um erro durante a importação do arquivo de configurações personalizadas. Tente novamente ou continue com as configurações padrão.
ru_ru: При импорте файла пользовательских параметров произошла ошибка. Повторите попытку или используйте параметры по умолчанию.
zh_cn: 输入自定义设置文件时出现错误。请重试或继续使用默认设置。
zh_tw: 匯入您的自訂設定檔時發生錯誤。請再試一次，或繼續使用預設設定。

# SplashScreenLaunchingDynamo
source: Launching Dynamo View...
cs_cz: Spouštění aplikace Dynamo View...
de_de: Dynamo-Ansicht wird gestartet...
es_es: Iniciando vista de Dynamo...
fr_fr: Lancement de Dynamo View…
it_it: Avvio della vista di Dynamo in corso...
ja_jp: Dynamo ビューを起動しています...
ko_kr: Dynamo 뷰를 시작하는 중...
pl_pl: Uruchamianie widoku dodatku Dynamo...
pt_br: Iniciando a vista do Dynamo...
ru_ru: Запуск вида Dynamo...
zh_cn: 正在启动 Dynamo 视图...
zh_tw: 正在啟動 Dynamo 視圖…

# SplashScreenLaunchTitle
source: Launch Dynamo
cs_cz: Spustit aplikaci Dynamo
de_de: Dynamo starten
es_es: Iniciar Dynamo
fr_fr: Lancer Dynamo
it_it: Avvia Dynamo
ja_jp: Dynamo を起動
ko_kr: Dynamo 시작
pl_pl: Uruchom Dynamo
pt_br: Iniciar o Dynamo
ru_ru: Запуск Dynamo
zh_cn: 启动 Dynamo
zh_tw: 啟動 Dynamo

# SplashScreenLoadingTimeLabel
source: Loading time
cs_cz: Čas načtení
de_de: Ladezeit
es_es: Tiempo de carga
fr_fr: Temps de chargement
it_it: Tempo di caricamento
ja_jp: ロード時間
ko_kr: 로드 시간
pl_pl: Czas ładowania
pt_br: Tempo de carregamento
ru_ru: Время загрузки
zh_cn: 载入时间
zh_tw: 載入時間

# SplashScreenShowScreenAgainLabel
source: Don't show this again
cs_cz: Toto okno již nezobrazovat
de_de: Diesen Meldung nicht mehr anzeigen
es_es: No volver a mostrar
fr_fr: Ne plus afficher ceci
it_it: Non visualizzare più questo messaggio
ja_jp: 今後この画面を表示しない
ko_kr: 다시 표시하지 않음
pl_pl: Nie pokazuj ponownie
pt_br: Não mostrar novamente
ru_ru: Больше не показывать
zh_cn: 不再显示此屏幕
zh_tw: 不再顯示此畫面

# SplashScreenSignIn
source: Sign In
cs_cz: Přihlásit
de_de: Anmelden
es_es: Iniciar sesión
fr_fr: Se connecter
it_it: Accedi
ja_jp: サインイン
ko_kr: 로그인
pl_pl: Zaloguj się
pt_br: Entrar
ru_ru: Вход
zh_cn: 登录
zh_tw: 登入

# SplashScreenSignOut
source: Sign Out
cs_cz: Odhlásit
de_de: Abmelden
es_es: Cerrar sesión
fr_fr: Se déconnecter
it_it: Esci
ja_jp: サインアウト
ko_kr: 로그아웃
pl_pl: Wyloguj się
pt_br: Sair
ru_ru: Выход
zh_cn: 注销
zh_tw: 登出

# SplashScreenWelcomeToDynamo
source: Welcome to Dynamo!
cs_cz: Vítejte v aplikaci Dynamo.
de_de: Willkommen bei Dynamo!
es_es: Le damos la bienvenida a Dynamo.
fr_fr: Bienvenue dans Dynamo!
it_it: Benvenuti a Dynamo.
ja_jp: Dynamo へようこそ!
ko_kr: Dynamo에 오신 것을 환영합니다!
pl_pl: Witamy w dodatku Dynamo!
pt_br: Bem-vindo ao Dynamo.
ru_ru: Добро пожаловать в Dynamo!
zh_cn: 欢迎使用 Dynamo！
zh_tw: 歡迎使用 Dynamo！

# SplashScreenTotalLoadingTimeLabel
source: Total loading time:
cs_cz: Celkový čas načtení:
de_de: Gesamte Ladezeit:
es_es: Tiempo total de carga:
fr_fr: Temps de chargement total:
it_it: Tempo di caricamento totale:
ja_jp: 総ロード時間:
ko_kr: 총 로드 시간:
pl_pl: Całkowity czas wczytywania:
pt_br: Tempo total de carga:
ru_ru: Общее время загрузки:
zh_cn: 总载入时间:
zh_tw: 總載入時間:

# ExportSettingsFailedMessage
source: Export Failed
cs_cz: Export se nezdařil
de_de: Export fehlgeschlagen
es_es: Error de exportación
fr_fr: Échec de l'exportation
it_it: Esportazione non riuscita
ja_jp: 書き出しに失敗しました
ko_kr: 내보내기 실패
pl_pl: Niepowodzenie eksportu
pt_br: Falha na exportação
ru_ru: Ошибка экспорта
zh_cn: 输出失败
zh_tw: 匯出失敗

# PreferencesWindowHardwareAccelerationTooltip
source: When toggled on, Dynamo benefits from hardware acceleration to improve smoothness of graphics and overall performance, as work is offloaded from central processing units (CPUs) to graphics processing units (GPUs).
cs_cz: Pokud je tato možnost zapnuta, aplikace Dynamo využívá hardwarovou akceleraci ke zlepšení hladkosti grafiky a celkového výkonu, protože výpočetní zatížení je přesměrováno z hlavních procesorů (CPU) na grafické procesory (GPU).
de_de: Wenn diese Option aktiviert ist, sorgt die Hardwarebeschleunigung für glattere Grafiken und eine bessere Gesamtleistung in Dynamo, da Arbeitsprozesse von CPUs (Central Processing Units) auf GPUs (Graphics Processing Units) verlagert werden.
es_es: Si se ha activado, Dynamo se beneficia de la aceleración de hardware para mejorar la uniformidad de los gráficos y el rendimiento general, ya que el trabajo se descarga de las unidades de procesamiento central (CPU) a las unidades de procesamiento de gráficos (GPU).
fr_fr: Lorsque cette option est activée, Dynamo bénéficie de l'accélération matérielle pour améliorer la fluidité des graphiques et les performances globales, car le travail est déchargé des unités centrales de traitement (CPU) vers les unités de traitement graphiques (GPU).
it_it: Quando l'opzione è attivata, Dynamo sfrutta l'accelerazione hardware per migliorare la levigatezza della grafica e le prestazioni generali, poiché il lavoro viene scaricato dalle unità di elaborazione centrali (CPU) alle unità di elaborazione grafica (GPU).
ja_jp: オンに切り替えると、Dynamo でハードウェア アクセラレーションを利用できるようになり、中央処理装置(CPU)からグラフィックス処理装置(GPU)に作業がオフロードされるため、グラフィックスが滑らかになって、全体的なパフォーマンスが向上します。
ko_kr: 이 옵션을 켜면 작업이 CPU(중앙 처리 장치)에서 GPU(그래픽 처리 장치)로 오프로드되므로 Dynamo는 하드웨어 가속을 통해 그래픽의 부드러움과 전체 성능을 향상시킬 수 있습니다.
pl_pl: Po włączeniu dodatek Dynamo korzysta z przyspieszenia sprzętowego, aby poprawić gładkość grafiki i ogólną wydajność, przez przeniesienie pracy z procesorów głównych (CPU) do procesorów graficznych (GPU).
pt_br: Quando ativado, o Dynamo se beneficia da aceleração por hardware para melhorar a suavidade dos gráficos e o desempenho geral, já que o trabalho é descarregado das unidades de processamento central (CPUs) para as unidades de processamento gráfico (GPUs).
ru_ru: Если этот параметр включен, то в Dynamo используется аппаратное ускорение для более плавного отображения графики и повышения производительности в целом, так как работа переносится с центральных процессоров на графические.
zh_cn: 启用后，由于工作从中央处理单元(CPU)转移到图形处理单元(GPU)，因此 Dynamo 可利用硬件加速来提高图形的平滑度和整体性能。
zh_tw: 開啟時，Dynamo 可受益於硬體加速，提升圖形的平滑度和整體效能，因為工作會從中央處理器 (CPU) 卸載到圖形處理器 (GPU)。

# PreferencesWindowIsolateSelectedGeoTooltip
source: When toggled on, selecting a geometry node will highlight the geometry it produces in the background 3D preview.
cs_cz: Pokud je tato možnost zapnuta, při výběru uzlu geometrie se zvýrazní vytvářená geometrie v 3D náhledu pozadí.
de_de: Wenn diese Option aktiviert ist, wird durch Auswahl eines Geometrieblocks die so erzeugte Geometrie in der Hintergrund-3D-Vorschau hervorgehoben.
es_es: Si se ha activado, al seleccionar un nodo de geometría, se resalta la geometría que se genera en la vista preliminar 3D en segundo plano.
fr_fr: Lorsque cette option est activée, la sélection d'un noeud de géométrie met en surbrillance la géométrie générée dans l'aperçu 3D en arrière-plan.
it_it: Quando l'opzione è attivata, la selezione di un nodo della geometria evidenzia la geometria che produce nell'anteprima 3D dello sfondo.
ja_jp: オンに切り替えると、ジオメトリ ノードを選択したときに、生成されるジオメトリが背景 3D プレビューでハイライト表示されます。
ko_kr: 이 옵션을 설정하면 형상 노드를 선택할 때 배경 3D 미리보기에서 생성된 형상이 강조 표시됩니다.
pl_pl: Po włączeniu wybranie węzła geometrii spowoduje wyróżnienie geometrii tworzonej przez niego w podglądzie 3D tła.
pt_br: Quando ativado, a seleção de um nó de geometria realçará a geometria que ele produz na visualização 3D do plano de fundo.
ru_ru: Если этот параметр включен, то при выборе узла геометрии будет выделена геометрия, воспроизводимая в фоновом режиме 3D-просмотра.
zh_cn: 启用后，选择几何图形节点时会在背景三维预览中亮显其生成的几何图形。
zh_tw: 開啟時，選取幾何圖形節點會亮顯其在背景 3D 預覽中產生的幾何圖形。

# PreferencesWindowShowCodeBlockNodeLineNumberTooltip
source: When toggled on, line numbers will be displayed in the Code Block node editor.
cs_cz: Pokud je tato možnost zapnuta, čísla řádků se zobrazí v editoru uzlů Code Block.
de_de: Wenn diese Option aktiviert ist, werden Zeilennummern im Codeblock-Blockeditor angezeigt.
es_es: Si se ha activado, los números de línea se mostrarán en el editor de nodos de bloque de código.
fr_fr: Lorsque cette option est activée, les numéros de ligne sont affichés dans l'éditeur de noeuds Code Block.
it_it: Quando l'opzione è attivata, i numeri di riga vengono visualizzati nell'editor dei nodi del blocco di codice.
ja_jp: オンに切り替えると、Code Block ノード エディタに行番号が表示されます。
ko_kr: 이 옵션을 켜면 코드 블록 노드 편집기에 선 번호가 표시됩니다.
pl_pl: Po włączeniu numery wierszy będą wyświetlane w edytorze węzłów bloku kodu.
pt_br: Quando ativado, os números de linha serão exibidos no editor de nó do bloco de código.
ru_ru: Если этот параметр включен, номера строк отображаются в редакторе узлов Code Block.
zh_cn: 启用后，线号会显示在“代码块”节点编辑器中。
zh_tw: 開啟時，Code Block 節點編輯器中會顯示行號。

# PreferencesWindowShowEdgesTooltip
source: When toggled on, more detailed edges will be displayed for geometry from topology subtypes.
cs_cz: Pokud je tato možnost zapnuta, budou pro geometrii z podtypů topologie zobrazeny podrobnější hrany.
de_de: Wenn diese Option aktiviert ist, werden detailliertere Kanten für Geometrie aus Topologie-Untertypen angezeigt.
es_es: Si se ha activado, se mostrarán aristas más detalladas para la geometría de los subtipos de topología.
fr_fr: Lorsque cette option est activée, des arêtes plus détaillées sont affichées pour la géométrie des sous-types de topologie.
it_it: Quando l'opzione è attivata, vengono visualizzati spigoli più dettagliati per la geometria dei sottotipi di topologia.
ja_jp: オンに切り替えると、トポロジのサブタイプのジオメトリに対して、より詳細なエッジが表示されます。
ko_kr: 이 옵션을 설정하면 토폴로지 하위 유형의 형상에 대해 더 자세한 모서리가 표시됩니다.
pl_pl: Po włączeniu tej opcji dla geometrii z podtypów topologii będą wyświetlane bardziej szczegółowe krawędzie.
pt_br: Quando ativado, serão exibidas arestas mais detalhadas para a geometria dos subtipos de topologia.
ru_ru: Если этот параметр включен, ребра для геометрии из подтипов топологии будут отображаться более детально.
zh_cn: 启用后，将显示拓扑子类型中的几何图形的更详细边。
zh_tw: 開啟時，拓樸子類型中的幾何圖形會顯示更詳細的邊。

# PreferencesWindowShowPreviewBubblesTooltip
source: When toggled on, a preview of the node’s output will be displayed when hovering over the bottom of a node.
cs_cz: Pokud je tato možnost zapnuta, zobrazí se náhled výstupu uzlu, když přesunete kurzor nad dolní část uzlu.
de_de: Wenn diese Option aktiviert ist, wird eine Vorschau der Blockausgabe angezeigt, wenn Sie den Mauszeiger über den unteren Teil eines Blocks bewegen.
es_es: Si se ha activado, se mostrará una vista preliminar de la salida del nodo al colocar el cursor sobre la parte inferior de un nodo.
fr_fr: Lorsque cette option est activée, un aperçu de la sortie du noeud s'affiche lorsque vous passez le curseur sur le bas d'un noeud.
it_it: Quando l'opzione è attivata, viene visualizzata un'anteprima dell'output del nodo quando si posiziona il cursore sulla parte inferiore di un nodo.
ja_jp: オンに切り替えると、ノードの下部にカーソルを合わせたときに、ノードの出力のプレビューが表示されます。
ko_kr: 이 옵션을 설정하면 노드의 맨 아래 위에 마우스를 놓을 때 노드 출력의 미리보기가 표시됩니다.
pl_pl: Po włączeniu podgląd wyniku węzła zostanie wyświetlony po umieszczeniu kursora na dole węzła.
pt_br: Quando ativado, uma visualização da saída do nó será exibida ao passar o cursor sobre a parte inferior de um nó.
ru_ru: Если этот параметр включен, при наведении курсора на нижнюю часть узла отображается предварительный просмотр выходных данных узла.
zh_cn: 启用后，当将光标悬停在节点底部时，将显示节点输出的预览。
zh_tw: 開啟時，若將游標懸停在節點底部，會顯示節點輸出的預覽。

# SplashScreenSigningIn
source: Signing In
cs_cz: Přihlášení
de_de: Anmelden
es_es: Iniciando sesión
fr_fr: Connexion en cours
it_it: Accesso
ja_jp: サインインしています
ko_kr: 로그인 중
pl_pl: Logowanie
pt_br: Entrando
ru_ru: Выполняется вход
zh_cn: 正在登录
zh_tw: 正在登入

# InCanvasGeometryScalingToolTip
source: Workspace Geometry Scaling
cs_cz: Měřítko geometrie pracovního prostoru
de_de: Arbeitsbereich Geometrieskalierung
es_es: Escala de geometría de espacio de trabajo
fr_fr: Mise à l'échelle de la géométrie de l'espace de travail
it_it: Scala della geometria area di lavoro
ja_jp: ワークスペースのジオメトリのスケーリング
ko_kr: 작업공간 형상 축척
pl_pl: Skalowanie geometrii obszaru roboczego
pt_br: Escala da geometria do espaço de trabalho
ru_ru: Масштабирование геометрии рабочего пространства
zh_cn: 工作空间几何图形缩放
zh_tw: 工作區幾何圖形比例調整

# GroupContextMenuPreview
source: Preview Geometry
cs_cz: Náhled geometrie
de_de: Geometrievorschau
es_es: Vista preliminar de geometría
fr_fr: Aperçu de la géométrie
it_it: Anteprima geometria
ja_jp: ジオメトリをプレビュー
ko_kr: 형상 미리보기
pl_pl: Podgląd geometrii
pt_br: Visualizar geometria
ru_ru: Предварительный просмотр геометрии
zh_cn: 预览几何图形
zh_tw: 預覽幾何圖形

# LibraryZoomScaleTooltipText
source: Drag to adjust Library zoom scale between 25% and 300%. You can also adjust this in Library by pressing “Ctrl” and scrolling the mouse wheel.
cs_cz: Přetažením upravte měřítko zvětšení knihovny mezi 25 % a 300 %. V knihovně můžete zvětšení upravit stisknutím klávesy Shift a otočením kolečka myši.
de_de: Passen Sie den Bibliothekszoomfaktor durch Ziehen auf einen Wert zwischen 25 % und 300 % an. Dies ist auch in der Bibliothek möglich, indem Sie die STRG-Taste drücken und das Mausrad drehen.
es_es: Arrastre para ajustar la escala de zoom de la biblioteca entre el 25 % y el 300 %. También puede ajustarla en la biblioteca si pulsa Ctrl y desplaza la rueda del ratón.
fr_fr: Faites glisser le curseur pour régler l'échelle de zoom de la bibliothèque sur une valeur entre 25 % et 300 %. Vous pouvez également modifier cette valeur dans la bibliothèque en appuyant sur "Ctrl" et en utilisant la molette de la souris.
it_it: Trascinare per regolare lo zoom in scala della libreria tra il 25% e il 300%. È inoltre possibile regolare questa impostazione nella libreria premendo MAIUSC e scorrendo la rotellina del mouse.
ja_jp: ドラッグして、ライブラリのズーム スケールを 25% ～ 300% の範囲で調整します。[Ctrl]を押しながらマウス ホイールをスクロールすると、ライブラリ内でも調整できます。
ko_kr: 끌어서 라이브러리 줌 축척을 25%에서 300% 사이로 조정합니다. 라이브러리에서 'Ctrl' 키를 누르고 마우스 휠을 스크롤하여 조정할 수도 있습니다.
pl_pl: Przeciągnij, aby dostosować skalę powiększenia biblioteki w zakresie między 25% a 300%. Można również dostosować tę wartość w bibliotece, naciskając klawisz SHIFT i przewijając kółkiem myszy.
pt_br: Arraste para ajustar a escala de zoom da Biblioteca entre 25% e 300%. Isso também pode ser ajustado na Biblioteca pressionando “Ctrl” e rolando a roda do mouse.
ru_ru: Перетащите бегунок между значениями 25 и 300 %, чтобы настроить масштаб в библиотеке. Это также можно сделать, нажав клавишу CTRL и прокрутив колесико мыши.
zh_cn: 拖动以在 25% 和 300% 范围之间调整库缩放比例。在库中，还可以通过按“Ctrl”键并滚动鼠标滚轮来调整该缩放比例。
zh_tw: 拖曳以在 25% 到 300% 之間調整「資源庫」的縮放比例。您也可以在「資源庫」中按 Ctrl 鍵並捲動滑鼠滾輪來調整。

# PreferencesViewZoomScalingSettings
source: Zoom Scaling
cs_cz: Měřítko zvětšení
de_de: Zoomfaktor
es_es: Escala de zoom
fr_fr: Échelle de zoom
it_it: Zoom scala
ja_jp: ズーム スケールの調整
ko_kr: 줌 축척
pl_pl: Skalowanie powiększenia
pt_br: Escala de zoom
ru_ru: Масштабирование
zh_cn: 缩放比例
zh_tw: 調整縮放比例

# DynamoViewSettingLibraryZoomScale
source: Library
cs_cz: Knihovna
de_de: Bibliothek
es_es: Biblioteca
fr_fr: Bibliothèque
it_it: Libreria
ja_jp: ライブラリ
ko_kr: 라이브러리
pl_pl: Biblioteka
pt_br: Biblioteca
ru_ru: Библиотека
zh_cn: 库
zh_tw: 資源庫

# PreferencesViewEnablePersistExtensions
source: On launch, remember open extensions panels from last session
cs_cz: Při spuštění si zapamatujte otevřené panely rozšíření z poslední relace.
de_de: Beim Start letzte geöffnete Erweiterungsgruppen speichern
es_es: Al iniciar, recuerde abrir los paneles de extensiones de la última sesión.
fr_fr: Ouvrir les derniers groupes de fonctions d'extensions au démarrage
it_it: All'avvio, memorizza i gruppi aperti delle estensioni dall'ultima sessione
ja_jp: 起動時に、前回のセッションで開いていた拡張機能のパネルを呼び出す
ko_kr: 시작 시 잊지 말고 마지막 세션의 확장 패널을 여십시오.
pl_pl: Uruchamiaj z otwartymi panelami rozszerzeń z ostatniej sesji
pt_br: Ao iniciar, lembre-se de abrir os painéis de extensões da última sessão
ru_ru: При запуске исп. открытые панели расширений из посл. Сеанса
zh_cn: 启动时，记住上次任务打开的扩展面板
zh_tw: 啟動時，記住上一個階段作業開啟的延伸面板

# PreferencesViewExtensions
source: Extensions
cs_cz: Rozšíření
de_de: Erweiterungen
es_es: Extensiones
it_it: Estensioni
ja_jp: 拡張機能
ko_kr: 확장
pl_pl: Rozszerzenia
pt_br: Extensões
ru_ru: Расширения
zh_cn: 扩展
zh_tw: 延伸
