Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# ContextMenuEditCustomNodeProperty
source: Edit Custom Node Properties...
cs_cz: Upravit vlastnosti vlastního uzlu...
de_de: Eigenschaften für benutzerdefinierten Block bearbeiten...
es_es: Editar propiedades de nodo personalizado...
fr_fr: Modifier les propriétés du noeud personnalisé...
it_it: Modifica proprietà nodo personalizzato...
ja_jp: カスタム ノード プロパティを編集...
ko_kr: 사용자 노드 특성 편집...
pl_pl: Edytuj właściwości węzła niestandardowego...
pt_br: Editar as propriedades do nó personalizado...
ru_ru: Редактирование пользовательских свойств узла...
zh_cn: 编辑自定义节点特性...
zh_tw: 編輯自訂節點性質...

# ContextMenuFitToScreen
source: _Fit to Screen
cs_cz: _Přizpůsobit obrazovce
de_de: _An Bildschirm anpassen
es_es: _Ajustar a tamaño de pantalla
fr_fr: _Ajuster à l'écran
it_it: A_datta allo schermo
ja_jp: 画面に合わせて表示(_F)
ko_kr: 화면에 맞추기(_F)
pl_pl: Dopasuj do _ekranu
pt_br: _Ajustar à tela
ru_ru: _Вписать в экран
zh_cn: 适应屏幕(_F)
zh_tw: 符合螢幕大小(_F)

# ContextMenuGeometryView
source: Switch to Geometry _View
cs_cz: Přepnout na _zobrazení geometrie
de_de: Zu Geometrie_ansicht wechseln
es_es: Cambiar a vista de geometría
fr_fr: Passer à la vue de géométrie
it_it: Passa alla _vista geometria
ja_jp: ジオメトリ ビューに切り替える(_V)
ko_kr: 형상 뷰로 전환(_V)
pl_pl: Przełącz na Geometria _Widok
pt_br: Alternar para a vista da geometria
ru_ru: Перейти к _Виду геометрии
zh_cn: 切换到几何图形视图(_V)
zh_tw: 切換至幾何圖形視圖(_V)

# ContextMenuHideGeometry
source: Hide geometry preview
cs_cz: Skrýt náhled geometrie
de_de: Geometrievorschau ausblenden
es_es: Ocultar vista preliminar de geometría
fr_fr: Masquer l'aperçu de la géométrie
it_it: Nascondi anteprima geometria
ja_jp: ジオメトリのプレビューを非表示
ko_kr: 형상 미리보기 숨기기
pl_pl: Ukryj podgląd geometrii
pt_br: Ocultar visualização da geometria
ru_ru: Скрыть предварительный просмотр геометрии
zh_cn: 隐藏几何体预览
zh_tw: 隱藏幾何圖形預覽

# ContextMenuHideAllTextBubble
source: Hide all text bubble
cs_cz: Skrýt všechny textové bubliny
de_de: Gesamten Text-Beschriftungsblock ausblenden
es_es: Ocultar toda la burbuja de texto
fr_fr: Masquer l'ensemble de la bulle de texte
it_it: Nascondi simbolo circolare del testo
ja_jp: すべての文字バルーンを非表示
ko_kr: 모든 텍스트 버블 숨기기
pl_pl: Ukryj wszystkie etykiety tekstowe
pt_br: Ocultar todos as bolhas de texto
ru_ru: Скрыть все текстовые марки
zh_cn: 隐藏所有文字数字
zh_tw: 隱藏所有文字標示圈

# ContextMenuInsertCodeBlock
source: Insert code block
cs_cz: Vložit blok kódu
de_de: Codeblock einfügen
es_es: Insertar bloque de código
fr_fr: Insérer un Code Block
it_it: Inserisci blocco di codice
ja_jp: コード ブロックを挿入
ko_kr: 코드 블록 삽입
pl_pl: Wstaw blok kodu
pt_br: Inserir bloco de códigos
ru_ru: Вставить блок кода
zh_cn: 插入代码块
zh_tw: 插入程式碼塊

# ContextMenuLacing
source: Lacing
cs_cz: Vázání
de_de: Vergitterung
es_es: Encaje
fr_fr: Entrelacement
it_it: Collegamento
ja_jp: レーシング
ko_kr: 레이싱
pl_pl: Skratowanie
pt_br: Treliça
ru_ru: Переплетение
zh_cn: 连缀
zh_tw: 交織

# ContextMenuLacingAuto
source: Auto
cs_cz: Automaticky
it_it: Automatico
ja_jp: 自動
ko_kr: 자동
pt_br: Automático
ru_ru: Авто
zh_cn: 自动
zh_tw: 自動

# ContextMenuLacingCrossProduct
source: Cross Product
cs_cz: Kartézský součin
de_de: Kartesisches Produkt
es_es: Producto cartesiano
fr_fr: Produit cartésien
it_it: Prodotto cartesiano
ja_jp: 外積
ko_kr: 외적
pl_pl: Iloczyn wektorowy
pt_br: Produto cartesiano
ru_ru: Векторное произведение
zh_cn: 叉积
zh_tw: 笛卡兒積

# ContextMenuLacingFirst
source: First
cs_cz: První
de_de: Erste
es_es: Primero
fr_fr: Premier
it_it: Primo
ja_jp: 最初
ko_kr: 첫 번째
pl_pl: Pierwszy
pt_br: Primeiro
ru_ru: Первый
zh_cn: 首先
zh_tw: 第一個

# ContextMenuLacingLongest
source: Longest
cs_cz: Nejdelší
de_de: Längste
es_es: Más largo
fr_fr: Le plus long
it_it: Più lungo
ja_jp: 最長
ko_kr: 최장
pl_pl: Najdłuższy
pt_br: Mais longo
ru_ru: Самый длинный
zh_cn: 最长
zh_tw: 最長

# ContextMenuLacingShortest
source: Shortest
cs_cz: Nejkratší
de_de: Kürzeste
es_es: Más corto
fr_fr: Le plus court
it_it: Più breve
ja_jp: 最短
ko_kr: 최단
pl_pl: Najkrótszy
pt_br: Mais curto
ru_ru: Кратчайший
zh_cn: 最短
zh_tw: 最短

# ContextMenuNodesFromGeometry
source: Nodes From _Selected Geometry
cs_cz: Uzly z _vybrané geometrie
de_de: Blöcke aus _ausgewählter Geometrie
es_es: Nodos de _Selected Geometry
fr_fr: Noeuds de Geometry _sélectionnée
it_it: Nodi dalla geometria _selezionata
ja_jp: 選択したジオメトリからのノード(_S)
ko_kr: 선택된 형상의 노드(_S)
pl_pl: Węzły Z _wybranej geometrii
pt_br: Nós de geometria _Selected Geometry
ru_ru: Узлы из _выбранной геометрии
zh_cn: 来自几何图形的节点(_S)
zh_tw: 來自選取的幾何圖形的節點(_S)

# ContextMenuNodesFromSelection
source: Create Custom Node
cs_cz: Vytvořit vlastní uzel
de_de: Benutzerdefinierten Block erstellen
es_es: Crear nodo personalizado
fr_fr: Créer un noeud personnalisé
it_it: Crea nodo personalizzato
ja_jp: カスタム ノードを作成
ko_kr: 사용자 노드 작성
pl_pl: Utwórz węzeł niestandardowy
pt_br: Criar nó personalizado
ru_ru: Создание пользовательского узла
zh_cn: 创建自定义节点
zh_tw: 建立自訂節點

# ContextMenuNodeToCode
source: Node to _Code
cs_cz: Uzel do _kódu
de_de: Block zu _Code
es_es: Nodo para _código
it_it: Nodo da aggiungere al _codice
ja_jp: ノードをコード化(_C)
ko_kr: 노드를 코드로(_C)
pl_pl: Konwersja węzłów na _kod
pt_br: Nó para _Code
ru_ru: Узел для _кодировки
zh_cn: 节点至代码(_C)
zh_tw: 將節點轉換為程式碼(_C)

# ContextMenuPan
source: Pa_n
cs_cz: P_řetáhnout
de_de: Schwe_nken
es_es: E_ncuadrar
ja_jp: 画面移動(_N)
ko_kr: 초점이동(_N)
pl_pl: Prze_suń
ru_ru: П_анорамировать
zh_cn: 平移(_N)
zh_tw: 平移(_N)

# ContextMenuPaste
source: Paste
cs_cz: Vložit
de_de: Einfügen
es_es: Pegar
fr_fr: Coller
it_it: Incolla
ja_jp: 貼り付け
ko_kr: 붙여넣기
pl_pl: Wklej
pt_br: Colar
ru_ru: Вставить
zh_cn: 粘贴
zh_tw: 貼上

# ContextMenuPublishCustomNode
source: Publish This Custom Node...
cs_cz: Publikovat tento vlastní uzel...
de_de: Diesen benutzerdefinierten Block veröffentlichen...
es_es: Publicar este nodo personalizado...
fr_fr: Publier ce noeud personnalisé...
it_it: Pubblica nodo personalizzato...
ja_jp: このカスタム ノードをパブリッシュ...
ko_kr: 이 사용자 노드 게시...
pl_pl: Opublikuj ten węzeł niestandardowy...
pt_br: Publicar este nó personalizado...
ru_ru: Опубликовать данный пользовательский узел...
zh_cn: 发布该自定义节点...
zh_tw: 發佈此自訂節點...

# ContextMenuShowGeometry
source: Show geometry preview
cs_cz: Zobrazit náhled geometrie
de_de: Geometrievorschau anzeigen
es_es: Mostrar vista preliminar de geometría
fr_fr: Afficher l'aperçu de la géométrie
it_it: Mostra anteprima geometria
ja_jp: ジオメトリのプレビューを表示
ko_kr: 형상 미리보기 표시
pl_pl: Pokaż podgląd geometrii
pt_br: Exibir visualização da geometria
ru_ru: Показать предварительный просмотр геометрии
zh_cn: 显示几何图形预览
zh_tw: 展示幾何圖形預覽

# ContextMenuShowAllTextBubble
source: Show all text buble
cs_cz: Zobrazit všechny textové bubliny
de_de: Gesamten Text-Beschriftungsblock anzeigen
es_es: Mostrar toda la burbuja de texto
fr_fr: Afficher l'intégralité de la bulle de texte
it_it: Mostra simbolo circolare del testo
ja_jp: すべての文字バブルを表示
ko_kr: 모든 텍스트 버블 표시
pl_pl: Pokaż wszystkie etykiety tekstowe
pt_br: Mostrar todos as bolhas de texto
ru_ru: Показать весь всплывающий текст
zh_cn: 显示所有气泡文字
zh_tw: 展示所有文字標示圈

# ContextUnGroupFromSelection
source: Remove from Group
cs_cz: Odebrat ze skupiny
de_de: Aus Gruppe entfernen
es_es: Eliminar de grupo
fr_fr: Supprimer du groupe
it_it: Rimuovi dal gruppo
ja_jp: グループから削除
ko_kr: 그룹에서 제거
pl_pl: Usuń z grupy
pt_br: Remover do grupo
ru_ru: Исключить из группы
zh_cn: 从组中删除
zh_tw: 從群組中移除

# ContinueButton
source: Continue
cs_cz: Pokračovat
de_de: Weiter
es_es: Continuar
fr_fr: Continuer
it_it: Continua
ja_jp: 続行
ko_kr: 계속
pl_pl: Kontynuuj
pt_br: Continuar
ru_ru: Продолжить
zh_cn: 继续
zh_tw: 繼續

# ConverterMessageCurrentOffset
source: Current offset X: {0}, Y: {1}
cs_cz: Aktuální odsazení X: {0}, Y: {1}
de_de: Aktueller Versatz X: {0}, Y: {1}
es_es: Desfase actual X: {0}, Y: {1}
fr_fr: Décalage actuel X: {0}, Y: {1}
it_it: Offset corrente - X: {0}, Y: {1}
ja_jp: 現在のオフセット X: {0}, Y: {1}
ko_kr: 현재 간격띄우기 X: {0}, Y: {1}
pl_pl: Bieżące odsunięcie X: {0}, Y: {1}
pt_br: Deslocamento X atual: {0}, Y: {1}
ru_ru: Текущее смещение по X: {0}, Y: {1}
zh_cn: 当前偏移 X: {0}, Y: {1}
zh_tw: 目前偏移 X：{0}，Y：{1}

# ConverterMessageTransformOrigin
source: Transform origin X: {0}, Y: {1}
cs_cz: Zdroj transformace X: {0}, Y: {1}
de_de: Ursprung für Transformation X: {0}, Y: {1}
es_es: Origen de transformación X: {0}, Y: {1}
fr_fr: Transformer l'origine X: {0}, Y: {1}
it_it: Origine trasformazione - X: {0}, Y: {1}
ja_jp: 基準点 X: {0}、Y: {1} を変換
ko_kr: 변환 원점 X: {0}, Y: {1}
pl_pl: Przekształć początek X: {0}, Y: {1}
pt_br: Transformar origem X: {0}, Y: {1}
ru_ru: Преобразование начала координат X: {0}, Y: {1}
zh_cn: 变换原点 X: {0}, Y: {1}
zh_tw: 轉換原點 X：{0}，Y: {1}

# ConverterMessageZoom
source: Zoom : {0}
cs_cz: Přiblížení: {0}
ja_jp: ズーム: {0}
ko_kr: 확대/축소 : {0}
pl_pl: Powiększ : {0}
ru_ru: Зумирование: {0}
zh_cn: 缩放: {0}
zh_tw: 縮放：{0}

# CrashPromptDialogCopyButton
source: Copy
cs_cz: Kopírovat
de_de: Kopieren
es_es: Copiar
fr_fr: Copier
it_it: Copia
ja_jp: コピー
ko_kr: 복사
pl_pl: Kopiuj
pt_br: Copiar
ru_ru: Копировать
zh_cn: 复制
zh_tw: 複製

# CrashPromptDialogCrashMessage
source: Something went wrong and Dynamo has closed unexpectedly. Don't worry, you'll have the option to save your work.
cs_cz: Vyskytla se chyba a aplikace Dynamo byla neočekávaně ukončena. Nebojte se, budete mít možnost uložit svou práci.
de_de: Ein Fehler ist aufgetreten, und Dynamo wurde unerwartet geschlossen. Keine Sorge: Sie erhalten die Möglichkeit, Ihre Arbeit zu speichern.
es_es: Se ha producido algún problema y Dynamo se ha cerrado inesperadamente. No se preocupe; tendrá la opción de guardar su trabajo.
fr_fr: Une erreur est survenue et Dynamo a cessé de fonctionner. Pas d'inquiétude, vous aurez la possibilité d'enregistrer votre travail.
it_it: Si è verificato un errore e Dynamo si è chiuso in maniera imprevista. È comunque possibile salvare il lavoro svolto.
ja_jp: 問題が発生し、Dynamo は予期せず終了しました。 しかし、作業内容を保存するためのオプションがありますのでご安心ください。
ko_kr: 문제가 발생하여 Dynamo가 예기치 않게 닫혔습니다. 걱정하지 마십시오. 작업을 저장할 수 있습니다.
pl_pl: Niestety wystąpiły problemy i nieoczekiwanie zamknięto dodatek Dynamo. Bez obaw, będziesz mieć możliwość zapisania pracy.
pt_br: Algo deu errado e o Dynamo foi fechado inesperadamente. Você terá a opção para salvar seu trabalho.
ru_ru: Произошло непредвиденное завершение работы программы Dynamo. Не волнуйтесь, у вас есть возможность сохранить данные.
zh_cn: 出现错误，Dynamo 已意外关闭。 不用担心，可以选择保存工作。
zh_tw: 發生錯誤，Dynamo 已意外關閉。 別擔心，您會有機會儲存您的工作。

# CrashPromptDialogDetailButton
source: Details
cs_cz: Podrobnosti
es_es: Detalles
fr_fr: Détails
it_it: Dettagli
ja_jp: 詳細
ko_kr: 상세정보
pl_pl: Szczegóły
pt_br: Detalhes
ru_ru: Подробности
zh_cn: 详细信息
zh_tw: 詳細資料

# CrashPromptDialogOpenFolderButton
source: Open Folder
cs_cz: Otevřít složku
de_de: Ordner öffnen
es_es: Abrir carpeta
fr_fr: Ouvrir le dossier
it_it: Apri cartella
ja_jp: フォルダを開く
ko_kr: 폴더 열기
pl_pl: Otwórz folder
pt_br: Abrir pasta
ru_ru: Открыть папку
zh_cn: 打开文件夹
zh_tw: 開啟資料夾

# CrashPromptDialogSubmitBugButton
source: Submit bug to GitHub
cs_cz: Odeslat chybu na Github
de_de: Fehler an Github senden
es_es: Enviar error a GitHub
fr_fr: Envoyer le bogue à GitHub
it_it: Invia bug a GitHub
ja_jp: バグを GitHub に送信
ko_kr: Github에 버그 제출
pl_pl: Zgłoś błąd w serwisie Github
pt_br: Enviar erro ao Github
ru_ru: Отправить ошибку в GitHub
zh_cn: 向 GitHub 提交错误
zh_tw: 將錯誤提交至 GitHub

# CrashPromptDialogTitle
source: {0} has closed unexpectedly
cs_cz: Aplikace {0} byla neočekávaně ukončena.
de_de: {0} wurde unerwartet geschlossen
es_es: {0} se ha cerrado inesperadamente
fr_fr: {0} s'est fermé de manière imprévue
it_it: {0} si è chiuso in maniera imprevista
ja_jp: {0} が予期せず終了しました
ko_kr: {0}이(가) 예기치 않게 닫혔습니다.
pl_pl: Nieoczekiwanie zamknięto {0}
pt_br: O {0} foi fechado inesperadamente.
ru_ru: Непредвиденное завершение работы {0}
zh_cn: {0} 已意外关闭
zh_tw: {0} 已意外關閉

# CreateMember
source: Create
cs_cz: Vytvořit
de_de: Erstellen
es_es: Crear
fr_fr: Créer
it_it: Crea
ja_jp: 作成
ko_kr: 작성
pl_pl: Utwórz
pt_br: Criar
ru_ru: Создать
zh_cn: 创建
zh_tw: 建立

# CustomNodePromptDescriptionTooltip
source: A description that helps people understand what the node might be used for.
cs_cz: Popis možností použití uzlu
de_de: Eine Beschreibung, mit der der Verwendungszweck des Blocks für die Benutzer erläutert wird.
es_es: Una descripción que ayuda a los usuarios a entender para qué pueden usar el nodo.
fr_fr: Description qui aide à comprendre l'utilité du noeud.
it_it: Descrizione che illustra agli utenti la finalità dell'utilizzo del nodo.
ja_jp: ユーザがノードの使用目的を理解するのに役立つ説明です。
ko_kr: 노드의 용도를 이해하는 데 도움이 되는 설명입니다.
pl_pl: Opis, który pomaga użytkownikom zrozumieć, w jakim celu można używać węzła.
pt_br: Uma descrição que ajuda as pessoas a entenderem para que o nó pode ser usado.
ru_ru: Описание, которое помогает пользователям понять, в каких целях может использоваться узел.
zh_cn: 用于帮助用户了解节点用途的相关说明。
zh_tw: 可協助使用者瞭解節點可能用途的描述。

# CustomNodePromptNameTooltip
source: A unique name for the node.
cs_cz: Jedinečný název uzlu
de_de: Ein eindeutiger Name für den Block.
es_es: Un nombre exclusivo para el nodo.
fr_fr: Un nom unique pour le noeud.
it_it: Nome univoco per il nodo.
ja_jp: ノードのユニークな名前。
ko_kr: 노드의 고유한 이름.
pl_pl: Unikatowa nazwa węzła.
pt_br: Um nome exclusivo para o nó.
ru_ru: Уникальное имя узла.
zh_cn: 节点的唯一名称。
zh_tw: 節點的唯一名稱。

# CustomNodePropertyErrorMessageBoxTitle
source: Custom Node Property Error
cs_cz: Chyba vlastnosti vlastního uzlu
de_de: Fehler: Eig. f. ben.-def. Block
es_es: Error propiedad nodo personalizado
fr_fr: Erreur de propriété de noeud personnalisé
it_it: Errore proprietà nodo personalizzata
ja_jp: カスタム ノード プロパティ エラー
ko_kr: 사용자 노드 특성 오류
pl_pl: Błąd właściwości węzła niestandardowego
pt_br: Erro de propriedade do nó personalizado
ru_ru: Ошибка свойства
zh_cn: 自定义节点特性时出错
zh_tw: 自訂節點性質錯誤

# CustomNodePropertyWindowCategory
source: Add-Ons Category
cs_cz: Kategorie doplňků
de_de: Zusatzmodul-Kategorie
es_es: Categoría de complementos
fr_fr: Catégorie des modules complémentaires
it_it: Categoria di Moduli aggiuntivi
ja_jp: アドオンのカテゴリ
ko_kr: 애드온 카테고리
pl_pl: Kategorie dodatków
pt_br: Categoria de suplementos
ru_ru: Категория «Надстройки»
zh_cn: 附加模块类别
zh_tw: 附加元件品類

# CustomNodePropertyWindowDescription
source: Description
cs_cz: Popis
de_de: Beschreibung
es_es: Descripción
it_it: Descrizione
ja_jp: 説明
ko_kr: 설명
pl_pl: Opis
pt_br: Descrição
ru_ru: Описание
zh_cn: 说明
zh_tw: 描述

# CustomNodePropertyWindowDescriptionHint
source: Description of Custom Node
cs_cz: Popis vlastního uzlu
de_de: Beschreibung für benutzerdefinierten Block
es_es: Descripción de nodo personalizado
fr_fr: Description du noeud personnalisé
it_it: Descrizione del nodo personalizzato
ja_jp: カスタム ノードの説明
ko_kr: 사용자 노드의 설명
pl_pl: Opis węzła niestandardowego
pt_br: Descrição do nó personalizado
ru_ru: Описание пользовательского узла
zh_cn: 自定义节点说明
zh_tw: 自訂節點的描述

# CustomNodePropertyWindowName
source: Name
cs_cz: Název
es_es: Nombre
fr_fr: Nom
it_it: Nome
ja_jp: 名前
ko_kr: 이름
pl_pl: Nazwa
pt_br: Nome
ru_ru: Имя
zh_cn: 名称
zh_tw: 名稱

# CustomNodePropertyWindowNameHint
source: Name of Custom Node
cs_cz: Název vlastního uzlu
de_de: Name des benutzerdefinierten Blocks
es_es: Nombre de nodo personalizado
fr_fr: Nom du noeud personnalisé
it_it: Nome del nodo personalizzato
ja_jp: カスタム ノードの名前
ko_kr: 사용자 노드의 이름
pl_pl: Nazwa węzła niestandardowego
pt_br: Nome do nó personalizado
ru_ru: Имя пользовательского узла
zh_cn: 自定义节点的名称
zh_tw: 自訂節點的名稱

# CustomNodePropertyWindowLocationNote
source: Custom Nodes will be placed in the Add-Ons section of the library.
cs_cz: Uživatelské uzly budou umístěny do části knihovny Doplňky.
de_de: Benutzerdefinierte Blöcke werden im Abschnitt Add-Ons der Bibliothek platziert.
es_es: Los nodos personalizados se incluirán en la sección Complementos de la biblioteca.
fr_fr: Des noeuds personnalisés seront placés dans la section packages complémentaires de la bibliothèque.
it_it: Verranno posizionati nodi personalizzati nella sezione Moduli aggiuntivi della libreria.
ja_jp: カスタム ノードはライブラリ内のアドオン セクションに配置されます。
ko_kr: 사용자 노드가 라이브러리의 애드온 섹션에 배치됩니다.
pl_pl: Niestandardowe węzły zostaną umieszczone w sekcji Dodatki biblioteki.
pt_br: Os nós personalizados serão colocados na seção Suplementos da biblioteca.
ru_ru: Пользовательские узлы будут размещены в библиотеке в разделе «Надстройки».
zh_cn: 自定义节点将放置在库的“附加模块”部分中。
zh_tw: 自訂節點將放在資源庫的「附加元件」區段中。

# CustomNodePropertyWindowTitle
source: Custom Node Properties
cs_cz: Vlastnosti vlastního uzlu
de_de: Eigenschaften für benutzerdefinierten Block
es_es: Propiedades de nodo personalizado
fr_fr: Propriétés du noeud personnalisé
it_it: Proprietà nodo personalizzato
ja_jp: カスタム ノード プロパティ
ko_kr: 사용자 노드 특성
pl_pl: Właściwości węzła niestandardowego
pt_br: Propriedades do nó personalizado
ru_ru: Свойства пользовательского узла
zh_cn: 自定义节点特性
zh_tw: 自訂節點性質

# DeprecatingPackageMessageBoxTitle
source: Deprecating Package
cs_cz: Odmítnutí balíčku
de_de: Paket als veraltet markieren
es_es: Declarando paquete obsoleto
fr_fr: Révocation du package
it_it: Impostazione del pacchetto come obsoleto in corso
ja_jp: パッケージの廃止
ko_kr: 패키지 사용 중단 중
pl_pl: Wycofywanie pakietu
pt_br: Pacote de obsolescência
ru_ru: Исключенный пакет
zh_cn: 弃用软件包
zh_tw: 正在棄用套件

# DescriptionNeedMoreCharacters
source: Description must be longer than 10 characters.
cs_cz: Popis musí být delší než 10 znaků.
de_de: Beschreibung muss mehr als 10 Zeichen umfassen.
es_es: La descripción debe tener más de 10 caracteres
fr_fr: La description doit être plus de 10 caractères.
it_it: La lunghezza della descrizione deve superare i 10 caratteri.
ja_jp: 説明は 10 文字より長くする必要があります。
ko_kr: 설명은 10자를 초과해야 합니다.
pl_pl: Opis musi składać się z więcej niż 10 znaków.
pt_br: A descrição deve ter mais que 10 caracteres.
ru_ru: Текст описания должен содержать больше 10 символов.
zh_cn: 说明必须超过 10 个字符。
zh_tw: 描述的長度必須超過 10 個字元。

# DetailedLayoutTitle
source: Detailed
cs_cz: Detailní
de_de: Detailliert
es_es: Detallado
fr_fr: En détail
it_it: Dettagliato
ja_jp: 詳細
ko_kr: 상세
pl_pl: Szczegółowy
pt_br: Detalhado
ru_ru: Подробный
zh_cn: 详细
zh_tw: 詳細

source: Directory Not Found
cs_cz: Adresář nenalezen
de_de: Verzeichnis wurde nicht gefunden
es_es: Directorio no encontrado
fr_fr: Répertoire introuvable
it_it: Directory non trovata
ja_jp: フォルダが見つかりません
ko_kr: 디렉토리를 찾을 수 없음
pl_pl: Nie znaleziono katalogu
pt_br: Diretório não encontrado
ru_ru: Папка не найдена
zh_cn: 未找到目录
zh_tw: 找不到目錄

# DownloadWarningMessageBoxTitle
source: Download Warning
cs_cz: Upozornění týkající se stahování
de_de: Download-Warnung
es_es: Advertencia de descarga
fr_fr: Avertissement sur le téléchargement
it_it: Avviso download
ja_jp: ダウンロードの警告
ko_kr: 다운로드 경고
pl_pl: Ostrzeżenie dotyczące pobierania
pt_br: Aviso de download
ru_ru: Предупреждение о загрузке
zh_cn: 下载警告
zh_tw: 下載警告

# DynamoUpdateAvailableToolTip
source: A Dynamo update is available. Click to install.
cs_cz: K dispozici je aktualizace aplikace Dynamo. Kliknutím ji nainstalujete.
de_de: Ein Update für Dynamo ist verfügbar. Klicken Sie, um es zu installieren.
es_es: Hay disponible una actualización de Dynamo. Haga clic para instalar.
fr_fr: Une mise à jour de Dynamo est disponible. Cliquez pour procéder à l'installation.
it_it: È disponibile un aggiornamento di Dynamo. Fare clic per installarlo.
ja_jp: Dynamo 更新プログラムを利用できます。インストールするにはクリックします。
ko_kr: Dynamo 업데이트를 사용할 수 있습니다. 설치하려면 클릭하십시오.
pl_pl: Dostępna jest aktualizacja dodatku Dynamo. Kliknij, aby zainstalować.
pt_br: A atualização do Dynamo está disponível. Clique para instalar.
ru_ru: Доступно обновление для Dynamo. Нажмите, чтобы установить его.
zh_cn: Dynamo 的更新可用，单击以安装。
zh_tw: 有一個 Dynamo 更新可用。請按一下以安裝。

# DynamoViewCancelButtonTooltip
source: Cancel Run (Shift+F5)
cs_cz: Stornovat spuštění (Shift+F5)
de_de: Ausführung abbrechen (Umschalt + F5)
es_es: Cancelar ejecución (Mayús+F5)
fr_fr: Annuler l'exécution (Maj + F5)
it_it: Annulla esecuzione (MAIUSC+F5)
ja_jp: 実行をキャンセル([Shift] + [F5])
ko_kr: 실행 취소(Shift + F5)
pl_pl: Anuluj bieg (Shift + F5)
pt_br: Cancelar Executar (Shift+F5)
ru_ru: Отмена выполнения (Shift + F5)
zh_cn: 取消运行 (Shift + F5)
zh_tw: 取消執行 (Shift + F5)

# DynamoViewContextMenuClearLog
source: Clear
cs_cz: Vymazat
de_de: Löschen
es_es: Borrar
fr_fr: Effacer
it_it: Cancella
ja_jp: クリア
ko_kr: 지우기
pl_pl: Wyczyść
pt_br: Limpar
ru_ru: Очистить
zh_cn: 清除
zh_tw: 清除

# DynamoViewDebugMenu
source: De_bug
cs_cz: Ladi_t
de_de: _Fehlerbehebung
es_es: De_purar
fr_fr: Dé_boguer
ja_jp: デバッグ(_B)
ko_kr: 디버그(B)
pl_pl: De_buguj
pt_br: De_purar
ru_ru: О_тладка
zh_cn: 调试(_B)
zh_tw: 除錯(_B)

# DynamoViewDebugMenuCheckDailyBuild
source: _Check Daily Builds
cs_cz: _Kontrola denních sestavení
de_de: T_ägliche Builds prüfen
es_es: _Comprobar compilaciones diarias
fr_fr: _Vérifier les versions quotidiennes
it_it: Verifi_ca build su base giornaliera
ja_jp: 毎日のビルドを確認(_C)
ko_kr: 일일 빌드 검사(_C)
pl_pl: _Sprawdź codziennie kompilacje
pt_br: _Verificar diariamente as compilações
ru_ru: Проверка _ежедневных сборок
zh_cn: 检查每日构建(_C)
zh_tw: 檢查每日建置(_C)

# DynamoViewDebugMenuDumpLibrary
source: _Dump Library
cs_cz: _Vypsat knihovnu
de_de: B_ibliothek ausgeben
es_es: Biblioteca de volca_dos
fr_fr: _Supprimer la bibliothèque
it_it: Rim_uovi libreria
ja_jp: ライブラリをダンプ(_D)
ko_kr: 라이브러리 덤프(_D)
pl_pl: _Zrzuć bibliotekę
pt_br: _Descarregar biblioteca
ru_ru: _Библиотека дампов
zh_cn: 转储库(_D)
zh_tw: 傾印資源庫(_D)

# DynamoViewDebugMenuForceReExecute
source: _Force Re-execute
cs_cz: _Vynutit opakované provedení
de_de: _Erneute Ausführung erzwingen
es_es: _Forzar volver a ejecutar
fr_fr: _Forcer la réexécution
it_it: _Forza riesecuzione
ja_jp: 強制再実行(_F)
ko_kr: 강제 재실행(_F)
pl_pl: _Wymuś ponowne wykonanie
pt_br: _Forçar reexecução
ru_ru: _Принудительное повторное выполнение
zh_cn: 强制重新执行(_F)
zh_tw: 強制重新執行(_F)

# DynamoViewDebugMenuForceUpdate
source: Force _Update
cs_cz: Vynutit _aktualizaci
de_de: _Update erzwingen
es_es: For_zar actualización
fr_fr: Forcer la mise à jo_ur
it_it: _Forza aggiornamento
ja_jp: 強制更新(_U)
ko_kr: 강제 업데이트(_U)
pl_pl: Wymuś _aktualizację
pt_br: _Forçar atualização
ru_ru: Пр_инудительное обновление
zh_cn: 强制更新(_U)
zh_tw: 強制更新(_U)

# DynamoViewDebugMenuRunMutationTest
source: _Run mutation test
cs_cz: _Spustit test mutace
de_de: _Umwandlungstest durchführen
es_es: _Ejecutar prueba de mutación
fr_fr: _Exécuter un test de mutation
it_it: Esegui test di muta_zione
ja_jp: ミューテーション テストを実行(_R)
ko_kr: 변경 테스트 실행(_R)
pl_pl: _Uruchom test mutacji
pt_br: _Executar teste de mutação
ru_ru: Выполнить проверку _мутаций
zh_cn: 运行变异测试(_R)
zh_tw: 執行變化測試(_R)

# DynamoViewDebugMenuShowDebugAST
source: _Show Debug ASTs
cs_cz: _Zobrazit ladicí AST
de_de: Debug-A_STs anzeigen
es_es: _Mostrar AST de depuración
fr_fr: _Afficher les AST de débogage
it_it: Mo_stra AST debug
ja_jp: デバッグ AST を表示(_S)
ko_kr: 디버그 AST 표시(_S)
pl_pl: Pokaż _AST debugowania
pt_br: _Exibir depuração ASTs
ru_ru: Показать _AST отладки
zh_cn: 显示调试 AST(_S)
zh_tw: 展示除錯 AST(_S)

# DynamoViewDebugMenuVerboseLogging
source: _Verbose Logging
cs_cz: _Podrobné přihlašování
de_de: Ausführliches _Protokoll
es_es: _Registro detallado
fr_fr: _Consignation détaillée
it_it: R_egistrazione dettagliata
ja_jp: 冗長ログ(_V)
ko_kr: 상세 로깅(_V)
pl_pl: Rejestrowanie w trybie _informacji pełnej
pt_br: _Registro detalhado
ru_ru: _Расширенная регистрация
zh_cn: 详细日志记录(_V)
zh_tw: 詳細記錄(_V)

# DynamoViewDebugMenuDebugModes
source: Debug _Modes
cs_cz: Režimy _ladění
de_de: Fe_hlerbehebungsmodi
es_es: _Modos de depuración
fr_fr: _Modes de débogage
it_it: _Modalità di debug
ja_jp: デバッグ モード(_M)
ko_kr: 디버그 모드(_M)
pl_pl: _Tryby debugowania
pt_br: _Modos de depuração
ru_ru: Режимы от_ладки
zh_cn: 调试模式(_M)
zh_tw: 除錯模式(_M)

# DynamoViewEditMenu
source: _Edit
cs_cz: _Upravit
de_de: _Bearbeiten
es_es: _Editar
fr_fr: _Modifier
it_it: _Modifica
ja_jp: 編集(_E)
ko_kr: 편집(_E)
pl_pl: _Edytuj
pt_br: _Editar
ru_ru: _Редактировать
zh_cn: 编辑(_E)
zh_tw: 編輯(_E)
