Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# MessageFailedToAttachToRowColumn
source: 'AttachmentToRowColumnConverter' expects a 'ConverterParameter' value to be either 'Row' or 'Column'
cs_cz: „AttachmentToRowColumnConverter“ očekává, že bude hodnota „ConverterParameter“ buď „Row“, nebo „Column“
de_de: 'AttachmentToRowColumnConverter' erwartet 'Row' oder 'Column' als Wert für 'ConverterParameter'.
es_es: 'AttachmentToRowColumnConverter' espera que un valor de 'ConverterParameter' sea 'Row' o 'Column'
fr_fr: 'AttachmentToRowColumnConverter' attend une valeur 'ConverterParameter' 'Row' ou 'Column'
it_it: AttachmentToRowColumnConverter prevede un valore di ConverterParameter di tipo riga o colonna
ja_jp: 'AttachmentToRowColumnConverter' の 'ConverterParameter' の値は 'Row' または 'Column' のいずれかにする必要があります
ko_kr: 'AttachmentToRowColumnConverter'에서는 'ConverterParameter' 값을 '행' 또는 '열'로 예상합니다
pl_pl: Dla 'AttachmentToRowColumnConverter' oczekiwana wartość 'ConverterParameter' to 'wiersz' albo 'kolumna'
pt_br: O 'AttachmentToRowColumnConverter' espera que o valor de 'ConverterParameter' seja 'Linha' ou 'Coluna'
ru_ru: В случае 'AttachmentToRowColumnConverter' для параметра 'ConverterParameter' ожидается значение «Строка» или «Столбец»
zh_cn: “AttachmentToRowColumnConverter”期望“ConverterParameter”值为“Row”或“Column”
zh_tw: 'AttachmentToRowColumnConverter' 預期 'ConverterParameter' 值為 'Row' 或 'Column'

# MessageFailedToDownloadPackage
source: Failed to download package with id: {0}. Please try again and report the package if you continue to have problems.
cs_cz: Stažení balíčku s ID: {0} se nezdařilo. Zkuste to znovu, a pokud budete mít nadále problémy, nahlašte balíček.
de_de: Fehler beim Herunterladen von Paket mit ID: {0}. Versuchen Sie es erneut, und melden Sie das Paket, falls weiterhin Probleme auftreten.
es_es: Error al descargar paquete con ID: {0}. Inténtelo de nuevo e informe sobre el paquete si sigue teniendo problemas
fr_fr: Echec du téléchargement du package avec l'ID: {0}. Veuillez réessayer et signalez le package si vous continuez à rencontrer des problèmes.
it_it: Impossibile scaricare il pacchetto con ID {0}. Ritentare l'operazione. Se il problema persiste, segnalare il pacchetto.
ja_jp: ID: {0} のパッケージのダウンロードに失敗しました。再度実行しても問題が発生する場合は、パッケージを報告してください。
ko_kr: ID가 {0}인 패키지를 다운로드하지 못했습니다. 다시 시도하고 계속 문제가 발생할 경우 패키지를 신고하십시오.
pl_pl: Nie można pobrać pakietu z identyfikatorem: {0}. Spróbuj ponownie i raportuj pakiet w przypadku problemów.
pt_br: Falha ao efetuar o download do pacote com a ID: {0}. Tente novamente e reporte o pacote se você continuar a ter problemas.
ru_ru: Не удалось загрузить пакет с идентификатором: {0}. Попробуйте еще раз и отправьте отчет касательно пакета, если не удается решить проблему.
zh_cn: 无法下载 ID 为 {0} 的软件包。如仍有问题，请重试和报告软件包。
zh_tw: 無法下載 ID 為 {0} 的套件。請再試一次，如果持續發生問題，則報告套件。

# MessageInvalidPackage
source: Failed to load an invalid package.
cs_cz: Nepodařilo se načíst neplatný balíček.
de_de: Ungültiges Paket konnte nicht geladen werden.
es_es: No se ha podido cargar un paquete no válido.
fr_fr: Echec du chargement d'un package incorrect.
it_it: Impossibile caricare un pacchetto non valido.
ja_jp: 無効なパッケージのロードに失敗しました。
ko_kr: 잘못된 패키지를 로드하지 못했습니다.
pl_pl: Nie można wczytać nieprawidłowego pakietu.
pt_br: Falha ao carregar um pacote inválido.
ru_ru: Не удалось загрузить недопустимый пакет.
zh_cn: 无法加载无效的软件包。
zh_tw: 無法載入無效的套件。

# MessageFailedToFindNodeById
source: No node could be found with that Id.
cs_cz: Nebyl nalezen žádný uzel s daným ID.
de_de: Kein Block mit dieser ID gefunden
es_es: No se ha podido encontrar ningún nodo con ese ID
fr_fr: Aucun noeud ne correspond à cet ID.
it_it: Nessun nodo trovato con l'ID specificato.
ja_jp: この ID のノードが見つかりませんでした。
ko_kr: 해당 ID로 노드를 찾을 수 없습니다.
pl_pl: Nie można odnaleźć węzła z tym identyfikatorem.
pt_br: Nenhum nó pôde ser encontrado com essa ID.
ru_ru: Не удается найти узел с таким идентификатором.
zh_cn: 找不到具有该 ID 的任何节点。
zh_tw: 找不到任何具有該 ID 的節點。

# MessageFailedToOpenCorruptedFile
source: Error opening corrupted file: {0}
cs_cz: Chyba při otevírání poškozeného souboru: {0}
de_de: Fehler beim Öffnen der beschädigten Datei: {0}
es_es: Error al abrir archivo dañado: {0}
fr_fr: Erreur lors de l'ouverture du fichier endommagé: {0}
it_it: Errore di apertura del file danneggiato: {0}
ja_jp: 次の破損ファイルを開くときにエラーが発生しました: {0}
ko_kr: 손상된 파일을 여는 중 오류 발생: {0}
pl_pl: Błąd podczas otwierania uszkodzonego pliku: {0}
pt_br: Erro ao abrir arquivo corrompido: {0}
ru_ru: Ошибка при открытии поврежденного файла: {0}
zh_cn: 打开已损坏文件时出错: {0}
zh_tw: 開啟損毀的檔案時發生錯誤: {0}

# MessageFailedToSaveAsImage
source: Failed to save the Workspace as image.
cs_cz: Pracovní prostor se nepodařilo uložit jako obrázek.
de_de: Arbeitsbereich konnte nicht als Bild gespeichert werden.
es_es: Error al guardar el espacio de trabajo como imagen
fr_fr: Echec de l'enregistrement de l'espace de travail en tant qu'image.
it_it: Impossibile salvare l'area di lavoro come immagine.
ja_jp: Workspace をイメージとして保存できませんでした。
ko_kr: 작업공간을 이미지로 저장하지 못했습니다.
pl_pl: Nie udało się zapisać obszaru roboczego jako obrazu.
pt_br: Falha ao salvar o espaço de trabalho como uma imagem.
ru_ru: Не удалось сохранить рабочее пространство в виде изображения.
zh_cn: 无法将工作空间另存为图像。
zh_tw: 無法將工作區儲存為影像。

# MessageFailedToDelete
source: {0} failed to delete the package. You may need to delete the package's root directory manually.
cs_cz: Aplikaci {0} se nepodařilo odstranit balíček. Pravděpodobně bude nutné odstranit kořenový adresář balíčku ručně.
de_de: Löschen des Pakets für {0} nicht möglich. Sie müssen möglicherweise das Stammverzeichnis des Pakets manuell löschen.
es_es: {0} no ha podido suprimir el paquete. Es posible que deba suprimir el directorio raíz del paquete manualmente.
fr_fr: {0} n'a pas pu supprimer le package. Vous devrez peut-être supprimer manuellement le répertoire racine du package.
it_it: Impossibile eliminare il pacchetto in {0}. Potrebbe essere necessario eliminare manualmente la directory principale del pacchetto.
ja_jp: {0} はパッケージの削除に失敗しました。パッケージのルート フォルダを手動で削除する必要がある可能性があります。
ko_kr: {0}에서 패키지를 삭제하지 못했습니다. 패키지의 루트 디렉토리를 수동으로 삭제해야 할 수 있습니다.
pl_pl: Program {0} nie może usunąć pakietu. Może być konieczne ręczne usunięcie katalogu głównego pakietu.
pt_br: Ocorreu uma falha em {0} ao excluir o pacote. Talvez seja necessário excluir o diretório raiz do pacote manualmente.
ru_ru: {0} не удалось удалить пакет. Возможно, потребуется удалить корневую папку пакета вручную.
zh_cn: {0} 无法删除软件包。可能需要手动删除软件包的根目录。
zh_tw: {0} 無法刪除套件。您可能需要手動刪除套件的根目錄。

# MessageFailToUninstallPackage
source: {0} failed to uninstall the package: {1}. The package may need to be reinstalled manually.
cs_cz: Aplikaci {0} se nepodařilo odinstalovat následující balíček: {1}. Balíček bude pravděpodobně nutné přeinstalovat ručně.
de_de: {0} konnte das Paket nicht deinstallieren: {1}. Das Paket muss eventuell manuell erneut installiert werden.
es_es: Error de {0} al desinstalar el paquete: {1}. Es posible que el paquete deba reinstalarse manualmente
fr_fr: {0} n'est pas parvenu à désinstaller le package: {1}. Le package doit peut-être être réinstallé manuellement.
it_it: {0} non ha disinstallato il pacchetto {1}. Potrebbe essere necessario reinstallare il pacchetto manualmente.
ja_jp: {0} はパッケージ {1} のアンインストールに失敗しました。パッケージの手動による再インストールが必要になる場合があります。
ko_kr: {0}은(는) {1} 패키지를 설치제거하지 못했습니다. 패키지를 수동으로 다시 설치해야 할 수 있습니다.
pl_pl: {0} nie mógł odinstalować pakietu: {1}. Może być konieczne ponowne zainstalowanie pakietu ręcznie.
pt_br: O {0} falhou ao desinstalar o pacote: {1}. Talvez seja preciso reinstalar manualmente o pacote.
ru_ru: {0} не удалось удалить пакет: {1}. Возможно, потребуется повторно установить пакет вручную.
zh_cn: {0} 无法卸载软件包: {1}。可能需要手动重新安装此软件包。
zh_tw: {0} 無法解除安裝套件：{1}。套件可能需要手動重新安裝。

# MessageGettingNodeError
source: There was a problem getting the node from the workspace.
cs_cz: Nastal problém při získávání uzlu z pracovního prostoru.
de_de: Beim Abrufen des Blocks aus dem Arbeitsbereich ist ein Problem aufgetreten.
es_es: Se ha producido un problema al obtener el nodo del espacio de trabajo
fr_fr: Un problème est survenu lors de l'obtention du noeud à partir de l'espace de travail.
it_it: Si è verificato un problema durante il caricamento del nodo dall'area di lavoro.
ja_jp: ワークスペースからのノードの取得中に問題が発生しました。
ko_kr: 작업공간에서 노드를 가져오는 중에 문제가 발생했습니다.
pl_pl: Wystąpił problem podczas pobierania węzła z obszaru roboczego.
pt_br: Houve um problema ao obter o nó do espaço de trabalho.
ru_ru: Возникла проблема при извлечении узла из рабочего пространства.
zh_cn: 从工作空间获取节点时出错。
zh_tw: 從工作區取得節點時沒有發生問題。

# MessageLoadingTime
source: {0} elapsed for loading {1} main window.
cs_cz: Čas {0} potřebný k načtení hlavního okna aplikace {1} uplynul.
de_de: {0} zum Laden des Hauptfensters von {1} verstrichen.
es_es: {0} transcurridos para cargar la ventana principal de {1}.
fr_fr: {0} écoulé(es) pour charger la fenêtre principale {1}.
it_it: {0} trascorsi per il caricamento della finestra principale di {1}.
ja_jp: {1} メイン ウィンドウのロードに {0} が経過しました。
ko_kr: {1} 주 창을 로드하는 데 {0}이(가) 경과되었습니다.
pl_pl: Okno główne pokazujące czas wczytywania {1}: {0}.
pt_br: {0} decorridos para carregar a janela principal do {1}.
ru_ru: Затрачено {0} на загрузку главного окна {1}.
zh_cn: 加载 {1} 主窗口已用时间 {0}。
zh_tw: {0} 耗用於載入 {1} 主視窗中。

# MessageNeedToRestartAfterDelete
source: {0} and its host application must restart before delete takes effect.
cs_cz: Aplikace {0} a její hostitelská aplikace musí být restartována, aby se odstranění projevilo.
de_de: {0} und die zugehörige Host-Anwendung müssen neu gestartet werden, bevor das Löschen wirksam wird.
es_es: {0} y su aplicación host deben reiniciarse antes de que se aplique la supresión.
fr_fr: {0} et son application hôte doivent redémarrer avant que la suppression ne prenne effet.
it_it: {0} e la relativa applicazione host devono essere riavviati prima che avvenga l'eliminazione.
ja_jp: {0} とそのホスト アプリケーションは、削除を有効にする前に再起動する必要があります。
ko_kr: {0} 및 해당 호스트 응용프로그램을 다시 시작해야 삭제가 적용됩니다.
pl_pl: Aby usunięcie zostało uwzględnione, należy ponownie uruchomić program {0} i jego aplikację hosta.
pt_br: O {0} e seu aplicativo host devem ser reiniciados antes que a exclusão seja efetivada.
ru_ru: Удаление вступит в силу после перезапуска {0} и основного приложения.
zh_cn: {0} 及其宿主应用程序必须重新启动，删除才会生效。
zh_tw: {0} 及其主體應用程式必須重新啟動，刪除才會生效。

# MessageNodeWithNullFunction
source: There is a null function definition for this node.
cs_cz: Pro tento uzel platí definice funkce null.
de_de: Für diesen Block ist eine Funktionsdefinition mit dem Wert Null vorhanden.
es_es: Hay una definición de función nula para este nodo
fr_fr: Il existe une définition de fonction NULL pour ce noeud.
it_it: Il nodo presenta una definizione di funzione nulla.
ja_jp: このノードに null 関数設定があります。
ko_kr: 이 노드에 대해 빈 함수 정의가 있습니다.
pl_pl: Istnieje pusta definicja funkcji dla tego węzła.
pt_br: Não há uma definição de função nula para este nó.
ru_ru: Для данного узла имеется определение нулевой функции.
zh_cn: 该节点有一个空函数定义。
zh_tw: 此節點有一個空函數定義。

# MessageNoNodeDescription
source: No description provided
cs_cz: Popis není k dispozici
de_de: Keine Beschreibung angegeben
es_es: No se ha proporcionado ninguna descripción
fr_fr: Aucune description disponible
it_it: Nessuna descrizione disponibile
ja_jp: 説明は提供されていません
ko_kr: 설명이 제공되지 않았습니다
pl_pl: Brak opisu
pt_br: Nenhuma descrição fornecida
ru_ru: Описание не предоставлено
zh_cn: 未提供说明
zh_tw: 未提供描述

# MessagePackageContainPythonScript
source: The package or one of its dependencies contains Python scripts or binaries. Do you want to continue?
cs_cz: V balíčku nebo některé z jeho závislostí jsou použity binární soubory nebo skripty Python. Chcete pokračovat?
de_de: Das Paket oder eine seiner Abhängigkeiten enthält Python-Skripts oder -Binärdateien. Möchten Sie fortfahren?
es_es: El paquete o una de sus dependencias contiene binarios o secuencias de comando de Python. ¿Desea continuar?
fr_fr: Le package ou l'une de ses dépendances contient des scripts ou des données binaires Python. Voulez-vous continuer?
it_it: Il pacchetto o una delle relative dipendenze contengono script Python o file binari. Continuare?
ja_jp: パッケージまたはその依存関係の 1 つに Python スクリプトまたはバイナリが含まれています。続行しますか?
ko_kr: 패키지 또는 패키지에 종속된 항목 중 하나에 Python 스크립트 또는 바이너리가 포함되어 있습니다. 계속하시겠습니까?
pl_pl: Pakiet lub jeden z jego elementów zależnych zawiera skrypty w języku Python lub pliki binarne. Czy chcesz kontynuować?
pt_br: O pacote ou uma de suas dependências contém scripts Python ou arquivos binários. Deseja continuar?
ru_ru: В пакете или в одной из его зависимостей содержатся сценарии или двоичные коды Python. Вы хотите продолжить?
zh_cn: 软件包或其相关项之一包含 Python 脚本或二进制文件。是否要继续？
zh_tw: 套件或其中一個相依性包含 Python 指令碼或二進位檔。您要繼續嗎？

# MessagePackageNewerDynamo
source: The package or one of its dependencies use a newer version of {0} than you are currently using. Do you want to continue?
cs_cz: Balíček nebo jedna z jeho závislostí byly vytvořeny pomocí novější verzi aplikace Dynamo. V této verzi nemusí fungovat. Chcete pokračovat?
de_de: Dieses Paket oder eine seiner Abhängigkeiten wurden für eine neuere Version von Dynamo erstellt. In dieser Version funktionieren sie möglicherweise nicht. Möchten Sie fortfahren?
es_es: Este paquete o una de sus dependencias se han creado para una versión más reciente de Dynamo. Es posible que no funcionen en esta versión. ¿Desea continuar?
fr_fr: Le package ou l'une de ses dépendances a été créé pour une version plus récente de Dynamo. Il est possible qu'il ne fonctionne pas avec votre version. Voulez-vous continuer ?
it_it: Il pacchetto o una delle relative dipendenze è stato creato per una versione più recente di Dynamo. Potrebbe non funzionare con questa versione. Continuare?
ja_jp: このパッケージまたはその依存関係の 1 つは、新バージョンの Dynamo 用に作成されています。このバージョンでは動作しない可能性があります。続行しますか?
ko_kr: 이 패키지 또는 패키지에 종속된 항목 중 하나가 최신 버전의 Dynamo용으로 작성되었습니다. 이 버전에서는 작동하지 않을 수 있습니다. 계속하시겠습니까?
pl_pl: Ten pakiet lub jedną z jego zależności utworzono dla nowszej wersji dodatku Dynamo. Ten element może nie działać w tej wersji. Czy chcesz kontynuować?
pt_br: Esse pacote ou uma de suas dependências foram criados para uma versão mais recente do Dynamo. Talvez ele não funcione nesta versão. Deseja continuar?
ru_ru: Этот пакет или одна из его зависимостей были созданы для более поздней версии Dynamo. Они могут не работать в этой версии. Продолжить?
zh_cn: 此软件包或其依赖项之一是为较高版本的 Dynamo 创建的。它可能在此版本中无法使用。是否要继续？
zh_tw: 此套件或其中一個相依性是針對新版 Dynamo 建立。在此版本中可能無法運作。您要繼續嗎？

# MessageSelectAtLeastOneNode
source: You must select at least one custom node.
cs_cz: Je nutné vybrat alespoň jeden vlastní uzel.
de_de: Wählen Sie mindestens einen benutzerdefinierten Block.
es_es: Debe seleccionar al menos un nodo personalizado
fr_fr: Vous devez sélectionner au moins un noeud personnalisé.
it_it: È necessario selezionare almeno un nodo personalizzato.
ja_jp: 少なくとも 1 つのカスタム ノードを選択する必要があります。
ko_kr: 사용자 노드를 하나 이상 선택해야 합니다.
pl_pl: Należy wybrać co najmniej jeden węzeł niestandardowy.
pt_br: Você deve selecionar ao menos um nó personalizado.
ru_ru: Необходимо выбрать хотя бы один пользовательский узел.
zh_cn: 必须至少选择一个自定义节点。
zh_tw: 您必須至少選取一個自訂節點。

# MessageSelectSymbolNotFound
source: The selected symbol was not found in the workspace
cs_cz: Vybraný symbol nebyl v pracovním prostoru nalezen.
de_de: Das ausgewählte Symbol wurde im Arbeitsbereich nicht gefunden.
es_es: El símbolo seleccionado no se ha encontrado en el espacio de trabajo
fr_fr: Le symbole sélectionné est introuvable dans l'espace de travail
it_it: Impossibile trovare il simbolo selezionato nell'area di lavoro
ja_jp: 選択した記号がワークスペース内に見つかりませんでした
ko_kr: 작업공간에서 선택된 기호를 찾을 수 없습니다
pl_pl: Wybrany symbol nie został znaleziony w obszarze roboczym
pt_br: O símbolo selecionado não foi encontrado no espaço de trabalho
ru_ru: Выбранное обозначение не найдено в рабочем пространстве
zh_cn: 在工作空间未找到选定符号
zh_tw: 在工作區找不到選取的符號

# MessageSubmitSameNamePackage
source: The node is part of the {0} package called "{1}" - do you want to submit a new version of this package? If not, this node will be moved to the new package you are creating."
cs_cz: Tento uzel je součást balíčku aplikace {0} s názvem "{1}". Chcete odeslat novou verzi tohoto balíčku? Pokud nebude verze odeslána, uzel bude přesunut do nového balíčku, který vytváříte.
de_de: Der Block ist Teil des {0}-Pakets mit dem Namen "{1}". Möchten Sie eine neue Version dieses Pakets übermitteln? Wenn dies nicht der Fall ist, wird der Block in das neue Paket verschoben, das Sie gerade erstellen."
es_es: El nodo forma parte del paquete de {0} "{1}". ¿Desea enviar una nueva versión de este paquete? De lo contrario, este nodo se desplazará al paquete que está creando"
fr_fr: Le noeud fait partie du package {0} appelé "{1}". Voulez-vous soumettre une nouvelle version de ce package? Dans la négative, ce noeud sera déplacé vers le nouveau package que vous créez.
it_it: Il nodo appartiene al pacchetto di {0} denominato "{1}". Inviare una nuova versione del pacchetto? Se non si invia una nuova versione, il nodo verrà spostato nel nuovo pacchetto in corso di creazione.
ja_jp: このノードは "{1}" という名前で、{0} パッケージの一部です。このパッケージの新しいバージョンを送信しますか? 送信しない場合、このノードは作成中の新しいパッケージに移動します。」
ko_kr: 노드는 "{1}"(이)라는 {0} 패키지의 부분입니다. 이 패키지의 새 버전을 제출하시겠습니까? 그렇지 않으면 이 노드는 작성 중인 새 패키지로 이동됩니다."
pl_pl: Węzeł jest częścią {0} o nazwie „{1}” — czy chcesz przesłać nową wersję tego pakietu? Jeśli nie, to węzeł zostanie przeniesiony do nowego pakietu, który tworzysz.
pt_br: O nó faz parte do pacote {0} denominado "{1}" - deseja enviar uma nova versão deste pacote? Se não, este nó será movido para o novo pacote que você estiver criando".
ru_ru: Узел является частью пакета {0} с именем «{1}». Отправить новую версию этого пакета? При отказе данный узел будет перемещен в новый пакет, создаваемый в данный момент.
zh_cn: 节点是名为“{1}”的 {0} 软件包的一部分 - 是否要提交该软件包的新版本？ 如果不提交，则该节点将被移动到您正在创建的新软件包。
zh_tw: 節點是 {0} 套件的一部分，稱為 {1} - 您要提交此套件的新版本嗎？ 如果不要，此節點將移動至您要建立的新套件。

# MessageToDeprecatePackage
source: Are you sure you want to deprecate {0} ? This request will be rejected if you are not a maintainer of the package. It indicates that you will no longer support the package, although the package will still appear when explicitly searched for. You can always undeprecate the package.
cs_cz: Opravdu chcete odmítnout {0}? Tento požadavek bude zamítnut, pokud aktuálně nemáte na starosti údržbu balíčku. To znamená, že již nebudete nepodporovat balíček, i když balíček bude stále zobrazen, když jej explicitně vyhledáte. Odmítnutí balíčku můžete kdykoliv zrušit.
de_de: Möchten Sie {0} wirklich als veraltet markieren? Diese Anforderung wird abgelehnt, wenn Sie kein Maintainer des Pakets sind. Dies zeigt an, dass Sie das Paket nicht mehr unterstützen. Bei einer expliziten Suche nach dem Paket wird dieses jedoch nach wie vor angezeigt. Sie können die Markierung des Pakets als veraltet jederzeit aufheben.
es_es: ¿Seguro que desea declarar obsoleto {0}? Esta solicitud no se aceptará si usted no es el mantenedor del paquete. Indica que ya no podrá admitir el paquete, si bien el paquete seguirá apareciendo cuando se busque explícitamente. Siempre puede anular la obsolescencia del paquete.
fr_fr: Etes-vous sûr de vouloir révoquer {0}? Cette demande sera rejetée si vous n'êtes pas un gestionnaire du package. Il indique que vous n'êtes plus en charge du package, bien que le package apparaisse toujours lorsqu'il fait l'objet d'une recherche explicite. Vous pouvez toujours annuler la révocation du package.
it_it: Contrassegnare il pacchetto {0} come obsoleto? Se l'utente che esegue la richiesta non è un gestore del pacchetto, la richiesta verrà rifiutata. Se si procede, il pacchetto non verrà più supportato sebbene continui ad essere visualizzato durante le operazioni di ricerca. È possibile ripristinare il pacchetto in un secondo momento.
ja_jp: {0} を廃止してもよろしいですか? あなたがパッケージを保持していない場合は、この要求は拒否されます。廃止すると、明示的に検索すればパッケージは表示されますが、パッケージはサポートされなくなります。 パッケージの廃止はいつでも解除できます。
ko_kr: {0}의 사용을 중단하시겠습니까? 이 요청은 해당 패키지의 유지 담당자가 아닌 경우 거부됩니다. 사용 중단은 유지 담당자가 더 이상 해당 패키지를 지원하지 않음을 의미하지만, 패지키를 직접 검색하면 여전히 표시됩니다. 언제든지 패키지 사용 중단을 취소할 수 있습니다.
pl_pl: Czy na pewno chcesz wycofać {0}? Żądanie zostanie odrzucone, jeśli użytkownik nie jest administratorem pakietu. Oznacza to, że użytkownik nie będzie już obsługiwać pakietu, mimo że pakiet będzie nadal wyświetlany w wynikach wyszukiwania. Zawsze można pobrać ponownie wycofane komponenty pakietu.
pt_br: Você tem certeza de que deseja tornar obsoleto {0}? Esta solicitação será rejeitada se você não for um mantenedor do pacote. Indica que você não mais suporta o pacote, embora o pacote ainda irá aparecer quando for explicitamente pesquisado. Você pode sempre cancelar a obsolescência do pacote.
ru_ru: Вы действительно хотите исключить {0}? Этот запрос будет отклонен, если вы не являетесь разработчиком пакета. Это означает, что вы больше не будете обслуживать данный пакет, несмотря на то что он все равно будет отображаться в результатах поиска. Всегда можно отменить исключение пакета.
zh_cn: 是否确实要弃用 {0}？如果您不是该软件包的维护人员，则该请求将被拒绝。这表示您将不再支持该软件包，尽管在明确搜索时该软件包仍将显示。 您始终可以取消弃用该软件包。
zh_tw: 您確定要棄用 {0} 嗎？如果您不是套件的維護者，此請求將被拒絕。 這表示您將不再支援套件，雖然明確搜尋時，套件仍會出垷。 您可以永遠取消棄用套件。
