Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# PackagesGuideSurveyText
source: Learn more about packages in the #online help=https://dynamobim.org/issues/extend-dynamo-with-packages
cs_cz: Další informace o balíčcích naleznete v #online nápovědě=https://dynamobim.org/issues/extend-dynamo-with-packages.
de_de: Weitere Informationen zu Paketen finden Sie in der #Online-Hilfe=https://dynamobim.org/issues/extend-dynamo-with-packages
es_es: Obtenga más información sobre los paquetes en la #ayuda en línea=https://dynamobim.org/issues/extend-dynamo-with-packages
fr_fr: Pour en savoir plus sur les packages, consultez #l'aide en ligne=https://dynamobim.org/issues/extend-dynamo-with-packages
it_it: Ulteriori informazioni sui pacchetti nella #Guida in linea=https://dynamobim.org/issues/extend-dynamo-with-packages
ja_jp: パッケージの詳細については、以下の #オンライン ヘルプ=https://dynamobim.org/issues/extend-dynamo-with-packages を参照してください
ko_kr: #온라인 도움말=https://dynamobim.org/issues/extend-dynamo-with-packages 에서 패키지에 대해 자세히 알아보십시오.
pl_pl: Dowiedz się więcej na temat pakietów w #pomocy online=https://dynamobim.org/issues/extend-dynamo-with-packages
pt_br: Saiba mais sobre os pacotes na #ajuda on-line=https://dynamobim.org/issues/extend-dynamo-with-packages
ru_ru: Дополнительные сведения о пакетах см. в #онлайн-справке=https://dynamobim.org/issues/extend-dynamo-with-packages
zh_cn: 有关软件包的详细信息，请参见 #联机帮助=https://dynamobim.org/issues/extend-dynamo-with-packages
zh_tw: 在 #線上說明=https://dynamobim.org/issues/extend-dynamo-with-packages 中進一步瞭解套件

# PackagesGuideSurveyTitle
source: Finished
cs_cz: Dokončeno
de_de: Fertig
es_es: Finalizado
fr_fr: Terminé
it_it: Completato
ja_jp: 完了済み
ko_kr: 완료됨
pl_pl: Zakończono
pt_br: Concluído
ru_ru: Завершено
zh_cn: 已完成
zh_tw: 完成

# PackagesGuideUsePackageText
source: To learn how to use nodes in a package, hover over a node to see a description. To add a node to the workspace, click its name in the list.
cs_cz: Chcete-li se dozvědět, jak používat uzly v balíčku, zobrazte popis přesunutím kurzoru nad uzel. Chcete-li přidat uzel do pracovního prostoru, klikněte na jeho název v seznamu.
de_de: Um zu erfahren, wie Sie Blöcke in einem Paket verwenden, bewegen Sie den Mauszeiger über einen Block, um eine Beschreibung anzuzeigen. Um einen Block zum Arbeitsbereich hinzuzufügen, klicken Sie in der Liste auf seinen Namen.
es_es: Para obtener información sobre cómo utilizar nodos en un paquete, coloque el cursor sobre un nodo para ver la descripción. Para agregar un nodo al área de trabajo, haga clic en su nombre en la lista.
fr_fr: Pour savoir comment utiliser les noeuds d'un package, placez le curseur sur un noeud pour afficher une description. Pour ajouter un noeud à l'espace de travail, cliquez sur son nom dans la liste.
it_it: Per informazioni sull'utilizzo dei nodi in un pacchetto, posizionare il cursore su un nodo per visualizzare una descrizione. Per aggiungere un nodo all'area di lavoro, fare clic sul relativo nome nell'elenco.
ja_jp: パッケージ内のノードの使用方法を知るには、ノードにカーソルを合わせて説明を表示します。ワークスペースにノードを追加するには、リスト内でその名前をクリックします。
ko_kr: 패키지에서 노드를 사용하는 방법을 알아보려면 노드 위에 마우스를 놓으면 설명이 표시됩니다. 작업공간에 노드를 추가하려면 리스트에서 해당 노드의 이름을 클릭합니다.
pl_pl: Aby dowiedzieć się, jak używać węzłów w pakiecie, ustaw kursor na węźle w celu wyświetlenia opisu. Aby dodać węzeł do obszaru roboczego, kliknij jego nazwę na liście.
pt_br: Para saber como usar nós em um pacote, passe o cursor sobre um nó para ver uma descrição. Para adicionar um nó ao espaço de trabalho, clique no nome dele na lista.
ru_ru: Чтобы узнать, как использовать узлы в пакете, наведите курсор на узел и ознакомьтесь с описанием. Чтобы добавить узел в рабочее пространство, щелкните его имя в списке.
zh_cn: 若要了解如何在软件包中使用节点，请将光标悬停在节点上以查看说明。若要将节点添加到工作空间，请在列表中单击其名称。
zh_tw: 若要瞭解如何在套件中使用節點，請將游標懸停在節點上以查看描述。若要在工作區中新增節點，請在清單中按一下節點名稱。

# PackagesGuideUsePackageTitle
source: Use package nodes
cs_cz: Použít uzly balíčku
de_de: Paketblöcke verwenden
es_es: Utilizar nodos de paquete
fr_fr: Utiliser les noeuds de package
it_it: Usa nodi pacchetto
ja_jp: パッケージ ノードを使用
ko_kr: 패키지 노드 사용
pl_pl: Użyj węzłów pakietu
pt_br: Usar nós de pacote
ru_ru: Использовать узлы пакета
zh_cn: 使用软件包节点
zh_tw: 使用套件節點

# ConfigureADPButtonText
source: Configure Autodesk Analytics Program
cs_cz: Konfigurovat program Autodesk Analytics
de_de: Autodesk Analytics-Programm konfigurieren
es_es: Configurar el programa de análisis de Autodesk
fr_fr: Configurer le programme d'analyse Autodesk
it_it: Configura programma di analisi Autodesk
ja_jp: Autodesk 解析プログラムを設定
ko_kr: Autodesk 해석 프로그램 구성
pl_pl: Konfiguruj program Autodesk Analytics
pt_br: Configurar programa de análise da Autodesk
ru_ru: Настройка анализа использования продуктов Autodesk
zh_cn: 配置 Autodesk 分析计划
zh_tw: 規劃 Autodesk 分析程式

source: Continue install
cs_cz: Pokračovat v instalaci
de_de: Installation fortsetzen
es_es: Continuar con la instalación
fr_fr: Continuer l'installation
it_it: Continua installazione
ja_jp: インストールを続ける
ko_kr: 계속 설치
pl_pl: Kontynuuj instalację
pt_br: Continuar instalação
ru_ru: Продолжить установку
zh_cn: 继续安装
zh_tw: 繼續安裝

source: Uninstall loaded packages
cs_cz: Odinstalovat načtené balíčky
de_de: Geladene Pakete deinstallieren
es_es: Desinstalar paquetes cargados
fr_fr: Désinstaller les packages chargés
it_it: Disinstalla pacchetti caricati
ja_jp: ロードされたパッケージをアンインストール
ko_kr: 로드된 패키지 설치제거
pl_pl: Odinstaluj wczytane pakiety
pt_br: Desinstalar pacotes carregados
ru_ru: Удаление загруженных пакетов
zh_cn: 卸载已加载的软件包
zh_tw: 解除安裝載入的套件

source: Uninstall loaded package
cs_cz: Odinstalovat načtený balíček
de_de: Geladenes Paket deinstallieren
es_es: Desinstalar paquete cargado
fr_fr: Désinstaller le package chargé
it_it: Disinstalla pacchetto caricato
ja_jp: ロードされたパッケージをアンインストール
ko_kr: 로드된 패키지 설치제거
pl_pl: Odinstaluj wczytany pakiet
pt_br: Desinstalar pacote carregado
ru_ru: Удаление загруженного пакета
zh_cn: 卸载已加载的软件包
zh_tw: 解除安裝載入的套件

# PackagesGuidePackagesNodeTitle
source: Use package nodes
cs_cz: Použít uzly balíčku
de_de: Paketblöcke verwenden
es_es: Utilizar nodos de paquete
fr_fr: Utiliser les noeuds de package
it_it: Usa nodi pacchetto
ja_jp: パッケージ ノードを使用
ko_kr: 패키지 노드 사용
pl_pl: Użyj węzłów pakietu
pt_br: Usar nós de pacote
ru_ru: Использовать узлы пакета
zh_cn: 使用软件包节点
zh_tw: 使用套件節點

# PublishPackageViewFilePath
source: File Path
cs_cz: Cesta k souboru
de_de: Dateipfad
es_es: Ruta de archivo
fr_fr: Chemin de fichier
it_it: Percorso file
ja_jp: ファイル パス
ko_kr: 파일 경로
pl_pl: Ścieżka pliku
pt_br: Caminho do arquivo
ru_ru: Путь к файлу
zh_cn: 文件路径
zh_tw: 檔案路徑

# PublishPackageViewNodeLibrary
source: Node Library
cs_cz: Knihovna uzlů
de_de: Blockbibliothek
es_es: Biblioteca de nodos
fr_fr: Bibliothèque de noeuds
it_it: Libreria di nodi
ja_jp: ノード ライブラリ
ko_kr: 노드 라이브러리
pl_pl: Biblioteka węzłów
pt_br: Biblioteca de nós
ru_ru: Библиотека узлов
zh_cn: 节点库
zh_tw: 節點資源庫

# NodeTooltipRenamed
source: Renamed from {0}
cs_cz: Přejmenováno z {0}
de_de: Umbenannt von {0}
es_es: Renombrado desde {0}
fr_fr: Auparavant nommé {0}
it_it: Rinominato da {0}
ja_jp: {0} から名前が変更されました
ko_kr: {0}에서 이름이 바뀜
pl_pl: Zmieniono nazwę z {0}
pt_br: Renomeado de {0}
ru_ru: Переименовано из {0}
zh_cn: 已从 {0} 重命名
zh_tw: 已從 {0} 更名

# WorkspaceTabTooltipHeaderUnsaved
source: Unsaved
cs_cz: Neuložený
de_de: Nicht gespeichert
es_es: Sin guardar
fr_fr: Non enregistré
it_it: Non salvato
ja_jp: 未保存
ko_kr: 저장되지 않음
pl_pl: Nie zapisano
pt_br: Não salvo
ru_ru: Не сохранено
zh_cn: 未保存
zh_tw: 未儲存

# TourLabelProgressText
source: of
cs_cz: z
de_de: von
es_es: de
fr_fr: sur
it_it: di
pl_pl: z
pt_br: de
ru_ru: из

# StartTourButtonText
source: Start Tour
cs_cz: Spustit prohlídku
de_de: Tour starten
es_es: Iniciar visita
fr_fr: Visite guidée
it_it: Avvia presentazione
ja_jp: ツアーを開始
ko_kr: 둘러보기 시작
pl_pl: Rozpocznij przegląd
pt_br: Iniciar tour
ru_ru: Начать обзор
zh_cn: 开始导览
zh_tw: 開始導覽

# ContextUnpinFromNode
source: Unpin from node
cs_cz: Odepnout z uzlu
de_de: Von Block lösen
es_es: Desbloquear del nodo
fr_fr: Détacher du noeud
it_it: Sblocca dal nodo
ja_jp: ノードから固定解除
ko_kr: 노드에서 고정 해제
pl_pl: Odepnij od węzła
pt_br: Desafixar do nó
ru_ru: Открепить от узла
zh_cn: 从节点取消固定
zh_tw: 從節點取消固定

# UnpinNodeTooltip
source: Unpin this note from the node
cs_cz: Odepnout tuto poznámku z uzlu
de_de: Anmerkung von Block lösen
es_es: Desbloquear esta nota del nodo
fr_fr: Détacher cette note du noeud
it_it: Sblocca questa nota dal nodo
ja_jp: ノードからこのノートを固定解除します
ko_kr: 노드에서 이 노트 잠금 해제
pl_pl: Odepnij tę notatkę od węzła
pt_br: Desafixe esta nota do nó
ru_ru: Открепить это примечание от узла
zh_cn: 从节点取消固定此注释
zh_tw: 從節點取消固定此附註

# PreferencesViewVisualSettingsGroupStyleInput
source: Style Name
cs_cz: Název stylu
de_de: Stilname
es_es: Nombre de estilo
fr_fr: Nom du style
it_it: Nome stile
ja_jp: スタイル名
ko_kr: 스타일 이름
pl_pl: Nazwa stylu
pt_br: Nome do estilo
ru_ru: Имя стиля
zh_cn: 样式名称
zh_tw: 型式名稱

# PreferencesViewEmptyStyleWarning
source: Please enter a valid name
cs_cz: Zadejte platný název.
de_de: Geben Sie einen gültigen Namen ein
es_es: Introduzca un nombre válido.
fr_fr: Entrez un nom valide
it_it: Immettere un nome valido
ja_jp: 有効な名前を入力してください
ko_kr: 유효한 이름을 입력하십시오
pl_pl: Wprowadź poprawną nazwę
pt_br: Insira um nome válido
ru_ru: Введите допустимое имя
zh_cn: 请输入有效的名称
zh_tw: 請輸入有效的名稱

# GroupStyleContextAnnotation
source: Group Style
cs_cz: Styl skupiny
de_de: Gruppenstil
es_es: Estilo de grupo
fr_fr: Style de groupe
it_it: Stile gruppo
ja_jp: グループ スタイル
ko_kr: 그룹 스타일
pl_pl: Styl grupy
pt_br: Estilo do grupo
ru_ru: Стиль группы
zh_cn: 组样式
zh_tw: 群組型式

# ContextPinToNodeTooltip
source: Select a node to pin to this note.
cs_cz: Vyberte uzel, který chcete připnout k této poznámce.
de_de: Wählen Sie einen Block aus, der an dieser Anmerkung fixiert werden soll.
es_es: Seleccione un nodo que anclar a esta nota.
fr_fr: Sélectionnez un noeud à épingler à cette note.
it_it: Seleziona un nodo da associare a questa nota.
ja_jp: ノードを選択して、このノートに固定します。
ko_kr: 이 노트에 고정할 노드를 선택하십시오.
pl_pl: Wybierz węzeł, który ma zostać przypięty do tej uwagi.
pt_br: Selecione um nó para fixar nesta nota.
ru_ru: Выберите узел для прикрепления к этому примечанию.
zh_cn: 选择要固定到此注释的节点。
zh_tw: 選取要釘住到此註記的節點。

# GroupStylesCancelButtonText
source: Cancel
cs_cz: Storno
de_de: Abbrechen
es_es: Cancelar
fr_fr: Annuler
it_it: Annulla
ja_jp: キャンセル
ko_kr: 취소
pl_pl: Anuluj
pt_br: Cancelar
ru_ru: Отмена
zh_cn: 取消
zh_tw: 取消

# GroupStylesSaveButtonText
source: Save
cs_cz: Uložit
de_de: Speichern
es_es: Guardar
fr_fr: Enregistrer
it_it: Salva
ja_jp: 保存
ko_kr: 저장
pl_pl: Zapisz
pt_br: Salvar
ru_ru: Сохранить
zh_cn: 保存
zh_tw: 儲存

# OnboardingGuide
source: _Getting Started
cs_cz: _Začínáme
de_de: Erste _Schritte
es_es: _Para empezar
fr_fr: _Mise en route
it_it: _Introduzione
ja_jp: スタートアップ(_G)
ko_kr: 시작하기(_G)
pl_pl: Pi_erwsze kroki
pt_br: _Introdução
ru_ru: _Руководство по началу работы
zh_cn: 快速入门(_G)
zh_tw: 開始使用(_G)

# OnboardingGuideWelcomeTitle
source: Get started with Dynamo
cs_cz: Začínáme s aplikací Dynamo
de_de: Erste Schritte mit Dynamo
es_es: Empezar a trabajar con Dynamo
fr_fr: Mise en route de Dynamo
it_it: Introduzione a Dynamo
ja_jp: Dynamo のスタートアップ
ko_kr: Dynamo 시작하기
pl_pl: Rozpocznij pracę z dodatkiem Dynamo
pt_br: Introdução ao Dynamo
ru_ru: Начало работы с Dynamo
zh_cn: Dynamo 快速入门
zh_tw: 開始使用 Dynamo

# OnboardingGuideSurveyText
source: You've finished the Getting Started guide.
cs_cz: Dokončili jste příručku Začínáme.
de_de: Sie haben die ersten Schritte abgeschlossen.
es_es: Ha finalizado la guía de introducción.
fr_fr: Vous avez terminé le Guide de démarrage.
it_it: È stata completata la guida Introduzione.
ja_jp: スタートアップ ガイドはこれで終わりです。
ko_kr: 시작하기 안내서를 마쳤습니다.
pl_pl: Zakończono podręcznik Pierwsze kroki.
pt_br: Você terminou o guia de introdução.
ru_ru: Вы изучили руководство по началу работы.
zh_cn: 您已经完成学习《快速入门手册》。
zh_tw: 您已完成開始使用指南。

# OnboardingWorkspaceText
source: This is the workspace, where you’ll develop visual programs and preview the results. \n\nEach visual program is powered by a **graph** . Graphs can process data, create geometry, and more. In this guide, we’ll work with a sample graph.
cs_cz: Toto je pracovní prostor, ve kterém vyvíjíte vizuální programy a zobrazujete náhledy výsledků.\n\nJádrem každého vizuálního programu je **graf** . Grafy mohou zpracovávat data, tvořit geometrie a provádět další jiné činnosti. V tomto průvodci budeme pracovat se vzorovým grafem.
de_de: Dies ist der Arbeitsbereich, in dem Sie visuelle Programme entwickeln und die Ergebnisse in der Vorschau anzeigen. \n\nJedes visuelle Programm wird von einem **Diagramm** gesteuert. Diagramme können Daten verarbeiten, Geometrie erstellen und mehr. In diesem Leitfaden arbeiten wir mit einem Beispieldiagramm.
es_es: Este es el espacio de trabajo, donde se desarrollan programas visuales y se obtiene una vista preliminar de los resultados. \n\nCada programa visual es impulsado por un **gráfico** . Los gráficos pueden procesar datos, crear geometría y mucho más. En esta guía, trabajaremos con un gráfico de ejemplo.
fr_fr: Voici l'espace de travail. Vous y développez des programmes visuels et y affichez un aperçu des résultats. \n\nChaque programme visuel est alimenté par un **graphique** . Les graphiques peuvent traiter des données, créer des géométries, et bien plus encore. Dans ce guide, nous utiliserons un exemple de graphique.
it_it: Questa è l'area di lavoro in cui si sviluppano programmi visivi e si visualizzano in anteprima i risultati. \n\nCiascun programma visivo è basato su un **grafico** . I grafici sono in grado di elaborare i dati, creare la geometria e altro ancora. Nella presente guida, verrà utilizzato un grafico di esempio.
ja_jp: これがワークスペースです。ここでビジュアル プログラムを開発して結果をプレビューします。\n\nビジュアル プログラムは、いずれも **グラフ** によって行われます。グラフでは、データの処理やジオメトリの作成など、さまざまな操作が可能です。このガイドでは、サンプルのグラフを使用します。
ko_kr: 시각적 프로그램을 개발하고 결과를 미리 보는 작업공간입니다. \n\n각 시각적 프로그램은 **그래프** 로 구동됩니다. 그래프는 데이터를 처리하고, 형상을 작성하는 등의 작업을 수행할 수 있습니다. 이 가이드에서는 샘플 그래프를 활용합니다.
pl_pl: Jest to obszar roboczy, w którym będziesz tworzyć programy wizualne i wyświetlać podgląd wyników.\n\nKażdy program wizualny bazuje na **wykresie** . Wykresy mogą przetwarzać dane, tworzyć geometrię i nie tylko. W tym przewodniku będziemy pracować z prostym wykresem.
pt_br: Esse é o espaço de trabalho, onde você desenvolverá programas visuais e visualizará os resultados. \n\nCada programa visual é alimentado por um **gráfico** . Os gráficos podem processar dados, criar geometria e muito mais. Neste guia, trabalharemos com um gráfico de amostra.
ru_ru: Это рабочее пространство для разработки визуальных программ и предварительного просмотра результатов. \n\nКаждая визуальная программа основана на **графике** . Графики обрабатывают данные, создают геометрию и выполняют другие действия. В этом руководстве работе ведется с примером графика.
zh_cn: 这是您开发可视化程序并预览结果的工作空间。\n\n每个可视化程序都由 **图形** 提供支持。图形可以处理数据、创建几何图形等。在本指南中，我们将使用示例图形。
zh_tw: 這是工作區，您將會在當中開發視覺程式並預覽結果。\n\n每個視覺程式都是由 **圖表** 驅動。圖表可以處理資料、建立幾何圖形等等。在此指南中，我們將使用一個範例圖表。

# OnboardingWorkspaceTitle
source: Workspace
cs_cz: Pracovní prostor
de_de: Arbeitsbereich
es_es: Espacio de trabajo
fr_fr: Espace de travail
it_it: Area di lavoro
ja_jp: ワークスペース
ko_kr: 작업공간
pl_pl: Obszar roboczy
pt_br: Espaço de trabalho
ru_ru: Рабочее пространство
zh_cn: 工作空间
zh_tw: 工作區

# GetStartedLinkText
source: Get Started
cs_cz: Začínáme
de_de: Erste Schritte
es_es: Primeros pasos
fr_fr: Mise en route
it_it: Introduzione
ja_jp: スタートアップ
ko_kr: 시작하기
pl_pl: Rozpocznij
pt_br: Introdução
ru_ru: Начало работы
zh_cn: 快速入门
zh_tw: 開始使用

# NextGuideText
source: Next guide:
cs_cz: Další příručka:
de_de: Nächster Leitfaden:
es_es: Siguiente guía:
fr_fr: Guide suivant:
it_it: Guida successiva:
ja_jp: 次のガイド:
ko_kr: 다음 안내서:
pl_pl: Następny przewodnik:
pt_br: Próximo guia:
ru_ru: Следующее руководство:
zh_cn: 下一个指南:
zh_tw: 下一個指南:

# GroupContextMenuColor
source: Color
cs_cz: Barva
de_de: Farbe
fr_fr: Couleur
it_it: Colore
ja_jp: カラー
ko_kr: 색상
pl_pl: Kolor
pt_br: Cor
ru_ru: Цвет
zh_cn: 颜色
zh_tw: 顏色

# RunCompletedWithErrorsMessage
source: Run completed with errors.
cs_cz: Spuštění bylo dokončeno s chybami.
de_de: Ausführung mit Fehlern abgeschlossen.
es_es: Ejecución completada con errores.
fr_fr: Exécution terminée avec des erreurs.
it_it: Esecuzione completata con errori.
ja_jp: 実行は完了しましたが、エラーが発生しました。
ko_kr: 실행이 완료되었으나 오류가 발생했습니다.
pl_pl: Uruchomienie ukończono z błędami.
pt_br: Execução concluída com erros.
ru_ru: Выполнение завершено с ошибками.
zh_cn: 运行已完成，但出现错误。
zh_tw: 執行已完成，但發生錯誤。

# RunCompletedWithScaleChangeAndErrorsMessage
source: Run completed with errors on setting new working range.
cs_cz: Spuštění bylo dokončeno s chybami při nastavení nového pracovního rozsahu.
de_de: Ausführung mit Fehlern beim Festlegen des neuen Arbeitsbereichs abgeschlossen.
es_es: Ejecución finalizada con errores al establecer el nuevo rango de trabajo.
fr_fr: Exécution terminée avec des erreurs lors de la définition d'un nouvel intervalle utile.
it_it: Esecuzione completata con errori durante l'impostazione del nuovo intervallo di lavoro.
ja_jp: 実行は完了しましたが、新しい動作範囲の設定でエラーが発生しました。
ko_kr: 실행이 완료되었으나 새 작업 범위 설정과 관련된 오류가 발생했습니다.
pl_pl: Uruchomienie ukończono z błędami przy ustawianiu nowego zakresu roboczego.
pt_br: Execução concluída com erros durante a definição do novo intervalo de trabalho.
ru_ru: Выполнение завершено с ошибками при задании нового рабочего диапазона.
zh_cn: 运行已完成，但在设置新工作范围时出现错误。
zh_tw: 執行完成，但設定新工作範圍時發生錯誤。

# RunReady
source: Ready to run.
cs_cz: Připraveno ke spuštění.
de_de: Bereit zum Ausführen.
es_es: Listo para ejecutarse.
fr_fr: Prêt à exécuter.
it_it: Pronto per l'esecuzione.
ja_jp: 実行準備ができました。
ko_kr: 실행할 준비가 되었습니다.
pl_pl: Gotowe do uruchomienia.
pt_br: Pronto para execução.
ru_ru: Готово к выполнению.
zh_cn: 准备运行。
zh_tw: 準備好執行。

# PreferencesSecuritySettingsTab
source: Security
cs_cz: Zabezpečení
de_de: Sicherheit
es_es: Seguridad
fr_fr: Sécurité
it_it: Sicurezza
ja_jp: セキュリティ
ko_kr: 보안
pl_pl: Zabezpieczenia
pt_br: Segurança
ru_ru: Безопасность
zh_cn: 安全
zh_tw: 安全性

# PreferencesViewTrustWarningHeader
source: Trust warning
cs_cz: Upozornění důvěryhodnosti
de_de: Sicherheitswarnung
es_es: Advertencia de confianza
fr_fr: Avertissement de confiance
it_it: Avviso di attendibilità
ja_jp: 信頼性に関する警告
ko_kr: 신뢰 경고
pl_pl: Ostrzeżenie dotyczące zaufania
pt_br: Aviso de confiança
ru_ru: Предупреждение о доверии
zh_cn: 信任警告
zh_tw: 信任警告

# PreferencesViewTrustWarningLabel
source: Disable trust warning
cs_cz: Zakázat upozornění na důvěryhodnost
de_de: Warnung zur Vertrauenswürdigkeit deaktivieren
es_es: Desactivar advertencia de confianza
fr_fr: Désactiver l'avertissement de confiance
it_it: Disattiva avviso di attendibilità
ja_jp: 信頼性に関する警告を無効にする
ko_kr: 신뢰 경고 사용 안 함
pl_pl: Wyłącz ostrzeżenie dotyczące zaufania
pt_br: Desativar aviso de confiança
ru_ru: Отключить предупреждение о доверии
zh_cn: 禁用信任警告
zh_tw: 停用信任警告

# PreferencesViewTrustWarningTooltipText
source: This applies to Dynamo, Dynamo Player and Generative Design Player. We recommend keeping this toggle off to avoid inadvertently opening a file from an untrusted location.
cs_cz: Toto se týká aplikací Dynamo, Přehrávač skritpů Dynamo a Přehrávač generativního návrhu. Doporučujeme, abyste tuto možnost měli vypnutou, aby nemohlo dojít k nechtěnému otevření souboru z nedůvěryhodného umístění.
de_de: Dies gilt für Dynamo, Dynamo Player und Generative Design Player. Es wird empfohlen, diese Option deaktiviert zu lassen, um zu vermeiden, dass eine Datei von einem nicht vertrauenswürdigen Speicherort aus Versehen geöffnet wird.
es_es: Esto se aplica a Dynamo, el Reproductor de Dynamo y el Reproductor de Diseño generativo. Recomendamos mantener esta opción desactivada para evitar abrir accidentalmente un archivo desde una ubicación que no es de confianza.
fr_fr: Applicable à Dynamo, au lecteur Dynamo et au lecteur Generative Design. Nous vous recommandons de désactiver cette option pour réduire les risques d'ouvrir par mégarde un fichier provenant d'un emplacement non approuvé.
it_it: Ciò si applica a Dynamo, al Lettore Dynamo e al lettore di Progettazione generativa. È consigliabile tenere disattivato questo pulsante di commutazione per evitare di aprire inavvertitamente un file da una posizione non attendibile.
ja_jp: これは Dynamo、Dynamo プレーヤ、ジェネレーティブ デザインのプレーヤに適用されます。信頼できない場所にあるファイルを誤って開かないよう、このスイッチをオフにしておくことをお勧めします。
ko_kr: Dynamo, Dynamo Player 및 Generative Design Player에 적용됩니다. 신뢰할 수 없는 위치에서 제공된 파일을 실수로 열지 않으려면 이 토글을 끄는 것이 좋습니다.
pl_pl: Dotyczy to dodatku Dynamo, Odtwarzacza Dynamo i Odtwarzacza projektowania generatywnego. Zaleca się, aby ten przełącznik był wyłączony, w celu uniknięcia przypadkowego otwarcia pliku z niezaufanej lokalizacji.
pt_br: Isso se aplica ao Dynamo, Reprodutor do Dynamo e Reprodutor do projeto generativo. Recomendamos manter essa opção desativada para evitar abrir inadvertidamente um arquivo de um local não confiável.
ru_ru: Применимо к Dynamo, проигрывателю Dynamo и проигрывателю Generative Design. Рекомендуется не включать этот параметр во избежание открытия файла из ненадежной папки.
zh_cn: 这适用于 Dynamo、Dynamo 播放器和衍生式设计播放器。建议您保持关闭此开关，以避免无意中打开来自不受信任的位置的文件。
zh_tw: 這會套用到 Dynamo、Dynamo 播放器和衍生式設計播放器。我們建議您保持關閉此選項，以避免意外從未受信任的位置開啟檔案。

# SecurityPathAddPathButtonName
source: Add Path
cs_cz: Přidat cestu
de_de: Pfad hinzufügen
es_es: Añadir ruta
fr_fr: Ajouter un chemin
it_it: Aggiungi percorso
ja_jp: パスを追加
ko_kr: 경로 추가
pl_pl: Dodaj ścieżkę
pt_br: Adicionar caminho
ru_ru: Добавить путь
zh_cn: 添加路径
zh_tw: 加入路徑

# SecurityWarningExpanderName
source: Warning
cs_cz: Upozornění
de_de: Warnung
es_es: Advertencia
fr_fr: Avertissement
it_it: Avviso
ja_jp: 警告
ko_kr: 경고
pl_pl: Ostrzeżenie
pt_br: Aviso
ru_ru: Предупреждение
zh_cn: 警告
zh_tw: 警告

# TrustedPathsExpanderName
source: Trusted File Locations
cs_cz: Důvěryhodná umístění souborů
de_de: Vertrauenswürdige Dateispeicherorte
es_es: Ubicaciones de archivo de confianza
fr_fr: Chemins d'accès de confiance
it_it: Posizioni di file attendibili
ja_jp: 信頼できるファイルの場所
ko_kr: 신뢰할 수 있는 파일 위치
pl_pl: Zaufane lokalizacje plików
pt_br: Localizações dos arquivos confiáveis
ru_ru: Доверенные расположения файлов
zh_cn: 受信任的文件位置
zh_tw: 可信任的檔案位置
