Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# PackageSearchViewTitle
source: Online Package Search
cs_cz: Online vyhledávání balíčku
de_de: Online-Suche nach Paket
es_es: Búsqueda en línea de paquete
fr_fr: Recherche de package en ligne
it_it: Ricerca pacchetto in linea
ja_jp: オンライン パッケージ検索
ko_kr: 온라인 패키지 검색
pl_pl: Wyszukiwanie pakietu online
pt_br: Pesquisa on-line de pacote
ru_ru: Поиск пакета в Интернете
zh_cn: 联机搜索软件包
zh_tw: 搜尋線上套件

# PackageSearchViewUpvoteButtonTooltip
source: Vote in support of this package
cs_cz: Volte na podporu tohoto balíčku.
de_de: Für dieses Paket stimmen
es_es: Votar en soporte de este paquete
fr_fr: Voter pour la prise en charge de ce package
it_it: Voto per il supporto del pacchetto
ja_jp: このパッケージのサポートにプラス評価をする
ko_kr: 이 패키지의 지원에 투표
pl_pl: Wyraź swoją aprobatę dla tego pakietu, oddając głos
pt_br: Votar no suporte deste pacote
ru_ru: Проголосовать в поддержку этого пакета
zh_cn: 支持该软件包的投票
zh_tw: 投票支援此套件

# PackageSearchViewVersions
source: Versions
cs_cz: Verze
de_de: Versionen
es_es: Versiones
it_it: Versioni
ja_jp: バージョン
ko_kr: 버전
pl_pl: Wersje
pt_br: Versões
ru_ru: Версии
zh_cn: 版本
zh_tw: 版本

# PackageSearchViewVisitRepositoryBuutton
source: Visit package repository
cs_cz: Navštívit úložiště balíčku
de_de: Paket-Repository besuchen
es_es: Visitar depósito de paquetes
fr_fr: Parcourir le référentiel du package
it_it: Visualizza repository pacchetto
ja_jp: パッケージのリポジトリにアクセス
ko_kr: 패키지 리포지토리 방문
pl_pl: Odwiedź repozytorium pakietu
pt_br: Visite o repositório do pacote
ru_ru: Посетите хранилище пакетов
zh_cn: 访问软件包储存库
zh_tw: 造訪套件儲存庫

# PackageSearchViewVisitWebSiteButton
source: Visit package website
cs_cz: Navštívit webovou stránku balíčku
de_de: Website für Paket besuchen
es_es: Visitar sitio web de paquetes
fr_fr: Visiter le site Web du package
it_it: Visita il sito Web del pacchetto
ja_jp: パッケージの Web サイトにアクセス
ko_kr: 패키지 웹사이트 방문
pl_pl: Odwiedź stronę internetową pakietu
pt_br: Visite o site do pacote
ru_ru: Посетите веб-сайт пакета
zh_cn: 访问软件包网站
zh_tw: 造訪套件網站

# PackageStateUnknown
source: Unknown
cs_cz: Neznámý
de_de: Unbekannt
es_es: Desconocido
fr_fr: Inconnu
it_it: Sconosciuto
ja_jp: 不明
ko_kr: 알 수 없음
pl_pl: Nieznany
pt_br: Desconhecido
ru_ru: Неизвестно
zh_cn: 未知
zh_tw: 不明

# PackageUploadNoDependency
source: None
cs_cz: Žádné
de_de: Keine
es_es: Ninguno
fr_fr: Aucune
it_it: Nessuno
ja_jp: なし
ko_kr: 없음
pl_pl: Brak
pt_br: Nenhum
ru_ru: Нет
zh_cn: 无
zh_tw: 無

# PackageUploadStateCompressing
source: Compressing...
cs_cz: Komprimování...
de_de: Komprimieren...
es_es: Comprimiendo...
fr_fr: Compression...
it_it: Compressione in corso...
ja_jp: 圧縮中...
ko_kr: 압축 중...
pl_pl: Kompresja...
pt_br: Compactando...
ru_ru: Сжатие...
zh_cn: 正在压缩...
zh_tw: 正在壓縮...

# PackageUploadStateCopying
source: Copying...
cs_cz: Kopírování...
de_de: Kopieren...
es_es: Copiando...
fr_fr: Copie...
it_it: Copia in corso...
ja_jp: コピー中...
ko_kr: 복사 중...
pl_pl: Kopiowanie...
pt_br: Copiando...
ru_ru: Копирование...
zh_cn: 正在复制...
zh_tw: 複製...

# PackageUploadStateError
source: Error!
cs_cz: Chyba!
de_de: Fehler!
fr_fr: Erreur.
it_it: Errore.
ja_jp: エラー!
ko_kr: 오류!
pl_pl: Błąd!
pt_br: Erro!
ru_ru: Ошибка!
zh_cn: 错误！
zh_tw: 錯誤！

# PackageUploadStateReady
source: Ready
cs_cz: Připraven
de_de: Bereit
es_es: Listo
fr_fr: Prêt
it_it: Pronto
ja_jp: 準備完了
ko_kr: 준비
pl_pl: Gotowe
pt_br: Pronto
ru_ru: Готово
zh_cn: 就绪
zh_tw: 就緒

# PackageUploadStateUploaded
source: Uploaded
cs_cz: Nahráno
de_de: Hochgeladen
es_es: Cargado
fr_fr: Chargé
it_it: Caricato
ja_jp: アップロード
ko_kr: 업로드됨
pl_pl: Wczytany
pt_br: Carregado
ru_ru: Выгружено
zh_cn: 已上传
zh_tw: 已上載

# PackageUploadStateUploading
source: Uploading...
cs_cz: Nahrávání...
de_de: Hochladen...
es_es: Cargando...
fr_fr: Chargement...
it_it: Caricamento in corso...
ja_jp: アップロード中...
ko_kr: 업로드 중...
pl_pl: Wysyłanie...
pt_br: Carregando...
ru_ru: Загрузка на сервер...
zh_cn: 正在上传...
zh_tw: 正在上載...

# PackageUseNewerDynamoMessageBoxTitle
source: Package Uses Newer Version of {0}!
cs_cz: Balíček nemusí v této verzi aplikace {0} fungovat.
de_de: Paket funktioniert in dieser Version von {0} möglicherweise nicht!
es_es: Es posible que el paquete no funcione en esta versión de {0}.
fr_fr: Le package peut ne pas fonctionner avec cette version de {0} !
it_it: Il pacchetto potrebbe non funzionare con questa versione di {0}.
ja_jp: {0}! のこのバージョンではパッケージが機能しない可能性があります。
ko_kr: 이 버전의 {0}에서는 패키지가 작동하지 않을 수 있습니다!
pl_pl: Pakiet może nie działać w tej wersji dodatku {0}!
pt_br: O pacote pode não funcionar nesta versão do {0}.
ru_ru: Пакет может не работать в этой версии {0}.
zh_cn: 软件包可能在此版本的 {0} 中无法使用！
zh_tw: 套件可能無法在此版本的 {0} 中運作！

# PackageWarningMessageBoxTitle
source: Package Warning
cs_cz: Varování týkající se balíčku
de_de: Warnung zu Paket
es_es: Advertencia de paquete
fr_fr: Avertissement relatif au package
it_it: Avviso pacchetto
ja_jp: パッケージの警告
ko_kr: 패키지 경고
pl_pl: Ostrzeżenie dotyczące pakietu
pt_br: Aviso de pacote
ru_ru: Предупреждение о пакете
zh_cn: 软件包警告
zh_tw: 套件警告

source: Periodic
cs_cz: Pravidelně
de_de: Periodisch
es_es: Periódica
fr_fr: Périodique
it_it: Periodico
ja_jp: 周期的
ko_kr: 주기적
pl_pl: Okresowo
pt_br: Periódico
ru_ru: Периодически
zh_cn: 周期性
zh_tw: 周期性

# PortViewContextMenuUserDefaultValue
source: Use Default Value
cs_cz: Použít výchozí hodnotu
de_de: Vorgabewert verwenden
es_es: Utilizar valor por defecto
fr_fr: Utiliser la valeur par défaut
it_it: Usa valore di default
ja_jp: 既定値を使用
ko_kr: 기본값 사용
pl_pl: Użyj domyślnej wartości
pt_br: Usar o valor padrão
ru_ru: Использовать значение по умолчанию
zh_cn: 使用默认值
zh_tw: 使用預設值

# PresetOverwrite
source: A preset by this name already exists, do you wish to overwrite?
cs_cz: Předvolba s tímto názvem již existuje. Chcete ji přepsat?
de_de: Eine Voreinstellung mit diesem Namen ist bereits vorhanden. Möchten Sie sie überschreiben?
es_es: Ya existe un valor predefinido con este nombre, ¿desea sobrescribirlo?
fr_fr: Une valeur prédéfinie portant ce nom existe déjà. Voulez-vous la remplacer?
it_it: Una preimpostazione con questo nome esiste già. Sovrascriverla?
ja_jp: この名前のプリセットは既に存在しています。上書きしますか?
ko_kr: 이 이름의 사전 설정이 이미 존재합니다. 덮어쓰시겠습니까?
pl_pl: Ustawienia wstępne o tej nazwie już istnieje. Czy chcesz nadpisać?
pt_br: Já existe uma predefinição com este nome. Deseja substituir?
ru_ru: Набор с таким именем уже существует. Заменить его?
zh_cn: 使用此名称的预设已存在，是否要覆盖？?
zh_tw: 依此名稱的預置已存在，您是否要覆蓋？?

# PresetPromptDescriptionTooltip
source: A description of the preset state.
cs_cz: Popis stavu předvolby
de_de: Eine Beschreibung des vordefinierten Status.
es_es: Una descripción del valor predefinido.
fr_fr: Description de l'état de la valeur prédéfinie.
it_it: Descrizione dello stato della preimpostazione.
ja_jp: プリセット状態の説明。
ko_kr: 사전 설정 상태에 대한 설명입니다.
pl_pl: Opis stanu ustawienia wstępnego.
pt_br: Uma descrição do estado da predefinição.
ru_ru: Описание заданной конфигурации.
zh_cn: 预设状态的说明。
zh_tw: 預置狀態的描述。

# PresetPromptNameTooltip
source: A unique name for the preset.
cs_cz: Jedinečný název předvolby
de_de: Eindeutiger Name für die Voreinstellung.
es_es: Un nombre exclusivo para el valor predefinido.
fr_fr: Un nom unique pour la valeur prédéfinie.
it_it: Nome univoco per la preimpostazione.
ja_jp: プリセットのユニークな名前。
ko_kr: 사전 설정의 고유한 이름.
pl_pl: Unikatowa nazwa ustawienia wstępnego.
pt_br: Um nome único para a predefinição.
ru_ru: Уникальное имя набора параметров.
zh_cn: 预设的唯一名称。
zh_tw: 預置的唯一名稱。

# PresetsWindowDescription
source: Description
cs_cz: Popis
de_de: Beschreibung
es_es: Descripción
it_it: Descrizione
ja_jp: 説明
ko_kr: 설명
pl_pl: Opis
pt_br: Descrição
ru_ru: Описание
zh_cn: 说明
zh_tw: 描述

# PresetsWindowDescriptionHint
source: Enter a description for this preset.
cs_cz: Zadejte popis této předvolby.
de_de: Geben Sie eine Beschreibung für diese Voreinstellung ein.
es_es: Escriba una descripción para este valor predefinido.
fr_fr: Entrer une description pour cette valeur prédéfinie.
it_it: Immettere una descrizione per la preimpostazione.
ja_jp: このプリセットの説明を入力します。
ko_kr: 이 사전 설정에 대한 설명을 입력합니다.
pl_pl: Wprowadź opis dla tego ustawienia wstępnego.
pt_br: Insira uma descrição para esta predefinição.
ru_ru: Введите описание для данного набора параметров.
zh_cn: 输入该预设的说明
zh_tw: 輸入此預置的描述。

# PresetsWindowName
source: Name
cs_cz: Název
es_es: Nombre
fr_fr: Nom
it_it: Nome
ja_jp: 名前
pl_pl: Nazwa
pt_br: Nome
ru_ru: Имя
zh_cn: 名称
zh_tw: 名稱

# PresetsWindowTitle
source: Preset State Properties
cs_cz: Vlastnosti stavu předvolby
de_de: Eigenschaften des vordefinierten Status
es_es: Propiedades de estado predefinido
fr_fr: Propriétés de l'état de la valeur prédéfinie
it_it: Proprietà stato preimpostazione
ja_jp: プリセット状態プロパティ
ko_kr: 사전 설정 상태 속성
pl_pl: Ustaw wstępnie właściwości stanu
pt_br: Propriedades de estado da predefinição
ru_ru: Стандартные свойства конфигурации
zh_cn: 预设状态特性
zh_tw: 預置狀態性質

# PresetTextRemaining
source: Characters Remaining
cs_cz: Zbývající znaky
de_de: Zeichen verbleibend
es_es: Caracteres restantes
fr_fr: Caractères restants
it_it: Caratteri rimanenti
ja_jp: 残りの文字数
ko_kr: 남은 글자
pl_pl: Pozostałe znaki
pt_br: Caracteres remanescentes
ru_ru: Символов осталось
zh_cn: 剩余字符数
zh_tw: 剩餘的字元數

# PresetWarningMessage
source: No input nodes selected. Select at least one input node to create a preset.
cs_cz: Nejsou vybrány žádné vstupní uzly. Chcete-li vytvořit předvolbu, vyberte alespoň jeden vstupní uzel.
de_de: Keine Eingabeblöcke ausgewählt. Wählen Sie mindestens einen Eingabeblock, um eine Voreinstellung zu erstellen.
es_es: No se han seleccionado nodos de entrada. Seleccione al menos un nodo de entrada para crear un valor predefinido.
fr_fr: Aucun noeud d'entrée sélectionné. Sélectionnez au moins un noeud d'entrée pour créer une valeur prédéfinie.
it_it: Nessun nodo di input selezionato. Selezionare almeno un nodo per creare una preimpostazione.
ja_jp: 入力ノードが選択されていません。プリセットを作成するには、少なくとも 1 つの入力ノードを選択します。
ko_kr: 입력 노드가 선택되지 않았습니다. 사전 설정을 작성하려면 하나 이상의 입력 노드를 선택하십시오.
pl_pl: Nie wybrano węzłów wejściowych. Wybierz co najmniej jeden węzeł wprowadzania danych do utworzenia wstępnego ustawienia.
pt_br: Nenhum nó de entrada selecionado. Selecione ao menos um nó de entrada para criar uma predefinição.
ru_ru: Не выбраны узлы ввода. Для создания набора параметров выберите по крайней мере один узел ввода.
zh_cn: 未选择输入节点。至少选择一个输入节点以创建预设。
zh_tw: 未選取任何輸入節點。 請至少選取一個輸入節點來建立預置。

# PreviewListLabel
source: List
cs_cz: Seznam
de_de: Liste
es_es: Lista
fr_fr: Liste
it_it: Elenca
ja_jp: リスト
ko_kr: 리스트
pl_pl: Lista
pt_br: Lista
ru_ru: Список
zh_cn: 列表
zh_tw: 清單

# PublishPackage
source: Publish Online
cs_cz: Publikovat online
de_de: Online publizieren
es_es: Publicar en línea
fr_fr: Publier en ligne
it_it: Pubblica in linea
ja_jp: オンラインでパブリッシュ
ko_kr: 온라인으로 게시
pl_pl: Opublikuj w trybie online
pt_br: Publicar on-line
ru_ru: Публикация в Интернете
zh_cn: 联机发布
zh_tw: 線上發佈

# PublishPackageDialogCaption
source: Published Successfully
cs_cz: Úspěšně publikováno
de_de: Erfolgreich publiziert
es_es: Se ha publicado correctamente
fr_fr: Publié
it_it: Pubblicazione eseguita correttamente
ja_jp: 正常にパブリッシュされました
ko_kr: 게시 성공
pl_pl: Opublikowano pomyślnie
ru_ru: Публикация выполнена успешно
zh_cn: 发布成功
zh_tw: 發佈成功

# PublishPackageLocally
source: Publish Locally
cs_cz: Publikovat místně
de_de: Lokal publizieren
es_es: Publicar localmente
fr_fr: Publier localement
it_it: Pubblica localmente
ja_jp: ローカルにパブリッシュ
ko_kr: 로컬로 게시
pl_pl: Opublikuj lokalnie
pt_br: Publicar localmente
ru_ru: Опубликовать локально
zh_cn: 本地发布
zh_tw: 本端發佈

# PublishPackageMessage
source: Package published successfully. Want to publish a different package?
cs_cz: Balíček byl úspěšně publikován. Chcete publikovat jiný balíček?
de_de: Paket erfolgreich publiziert. Möchten Sie ein anderes Paket veröffentlichen?
es_es: El paquete se ha publicado correctamente. ¿Desea publicar otro paquete?
fr_fr: Le package a été publié. Vous souhaitez publier un autre package?
it_it: Il pacchetto è stato pubblicato correttamente. Pubblicare un altro pacchetto?
ja_jp: パッケージは正常にパブリッシュされました。 続けて他のパッケージをパブリッシュしますか?
ko_kr: 패키지가 게시되었습니다. 다른 패키지를 게시하시겠습니까?
pl_pl: Pomyślnie opublikowano pakiet. Chcesz opublikować inny pakiet?
pt_br: Pacote publicado com sucesso. Deseja publicar outro pacote?
ru_ru: Пакет успешно опубликован. Опубликовать другой пакет?
zh_cn: 软件包发布成功。 要发布其他软件包吗？
zh_tw: 套件已成功發佈。 要發佈其他套件嗎？

# PublishPackagePackageContent
source: Package Contents
cs_cz: Obsah balíčku
de_de: Inhalt des Pakets
es_es: Contenido de paquete
fr_fr: Contenu du package
it_it: Contenuto pacchetto
ja_jp: パッケージの内容
ko_kr: 패키지 내용
pl_pl: Zawartość pakietu
pt_br: Conteúdo do pacote
ru_ru: Содержимое пакета
zh_cn: 软件包内容
zh_tw: 套件內容

# PublishPackageViewAddFileButton
source: Add Files
cs_cz: Přidat soubory
de_de: Dateien hinzufügen
es_es: Añadir archivos
fr_fr: Ajouter des fichiers
it_it: Aggiungi file
ja_jp: ファイルを追加
ko_kr: 파일 추가
pl_pl: Dodaj pliki
pt_br: Adicionar arquivos
ru_ru: Добавить файлы
zh_cn: 添加文件
zh_tw: 加入檔案

# PublishPackageViewAddFileButtonTooltip
source: Add File To Package
cs_cz: Přidat soubor
de_de: Datei hinzufügen
es_es: Añadir archivo
fr_fr: Ajouter un fichier
it_it: Aggiungi file
ja_jp: ファイルを追加
ko_kr: 파일 추가
pl_pl: Dodaj plik
pt_br: Adicionar arquivo
ru_ru: Добавить файл
zh_cn: 添加文件
zh_tw: 加入檔案

# PublishPackageViewContextMenuIsNodeLibrary
source: Is Node Library
cs_cz: Je knihovna uzlů
de_de: Ist Blockbibliothek
es_es: Es biblioteca de nodos
fr_fr: Est une bibliothèque de noeuds
it_it: È libreria nodo
ja_jp: ノード ライブラリ
ko_kr: 노드 라이브러리임
pl_pl: To biblioteka węzłów
pt_br: O nó é uma biblioteca
ru_ru: Библиотека узлов
zh_cn: 为节点库
zh_tw: 是否為節點資源庫

# PublishPackageViewLicense
source: License (optional)
cs_cz: Licence (volitelné)
de_de: Lizenz (optional)
es_es: Licencia (opcional)
fr_fr: Licence (facultatif)
it_it: Licenza (facoltativa)
ja_jp: ライセンス(省略可能)
ko_kr: 라이센스(선택 사항)
pl_pl: Licencja (opcjonalna)
pt_br: Licença (opcional)
ru_ru: Лицензия (необязательно)
zh_cn: 许可证(可选)
zh_tw: 授權 (選填)

# PublishPackageViewPackageDependencies
source: Dependencies
cs_cz: Závislosti
de_de: Abhängigkeiten
es_es: Dependencias
fr_fr: Dépendances
it_it: Dipendenze
ja_jp: 依存関係
ko_kr: 의존성
pl_pl: Zależności
pt_br: Dependências
ru_ru: Зависимости
zh_cn: 相关项
zh_tw: 相依性

# PublishPackageViewPackageDescriptionTooltip
source: A description that helps people understand what the package might be used for.
cs_cz: Popis možností použití balíčku
de_de: Eine Beschreibung, mit der der Verwendungszweck des Pakets für die Benutzer erläutert wird.
es_es: Una descripción que ayuda a los usuarios a entender para qué pueden usar el paquete.
fr_fr: Une description qui aide à comprendre l'utilité du package.
it_it: Descrizione che illustra agli utenti la finalità dell'utilizzo del pacchetto.
ja_jp: ユーザがパッケージの使用目的を理解するのに役立つ説明です。
ko_kr: 패키지의 용도를 이해하는 데 도움이 되는 설명입니다.
pl_pl: Opis, który pomaga użytkownikom zrozumieć, w jakim celu można używać pakiet.
pt_br: Uma descrição que ajuda as pessoas a entenderem para que o pacote pode ser usado.
ru_ru: Описание, которое помогает пользователям понять, в каких целях может использоваться пакет.
zh_cn: 用于帮助用户了解软件包用途的相关说明。
zh_tw: 協助使用者瞭解套件可能用途的描述。

# PublishPackageViewPackageGroup
source: Group (optional)
cs_cz: Skupina (volitelné)
de_de: Gruppe (optional)
es_es: Grupo (opcional)
fr_fr: Groupe (facultatif)
it_it: Gruppo (facoltativo)
ja_jp: グループ(省略可能)
ko_kr: 그룹(선택 사항)
pl_pl: Grupuj (opcjonalne)
pt_br: Grupo (opcional)
ru_ru: Группа (необязательно)
zh_cn: 组(可选)
zh_tw: 群組 (可選)

# PublishPackageViewPackageGroupTooltip
source: A group to help categorize this package. Might be useful for a collection of packages related to a firm, school, etc.
cs_cz: Skupin pro kategorizaci tohoto balíčku. Může být užitečné pro kolekci balíčků, které se vztahují k firmě, škole atd.
de_de: Eine Gruppe zur leichteren Kategorisierung dieses Pakets, möglicherweise nützlich für eine Sammlung von Paketen für ein Unternehmen, eine Schule usw.
es_es: Grupo para ayudar a categorizar este paquete. Puede ser útil para una colección de paquetes relativos a una empresa, una escuela, etc.
fr_fr: Groupe permettant de classer ce package. Peut être utile pour un ensemble de packages associés à une entreprise, une école, etc.
it_it: Gruppo per assegnare una categoria al pacchetto. Potrebbe risultare utile per una raccolta di pacchetti relativi ad un'azienda, una scuola e così via.
ja_jp: このパッケージを分類するためのグループ。会社、学校などに関連するパッケージの収集に便利です
ko_kr: 이 패키지를 분류하는 데 도움이 되는 그룹. 회사, 학교 등과 관련된 패키지 수집에 유용할 수도 있습니다.
pl_pl: Grupa ułatwia kategoryzowanie tego pakietu. Może być to przydatne w przypadku kolekcji pakietów związanych z firmą, szkołą itp.
pt_br: Um grupo para ajudar a categorizar este pacote. Pode ser útil para uma coleção de pacotes relacionados a uma empresa, escola etc.
ru_ru: Группа для сортировки данного пакета по категориям. Может оказаться полезным для коллекции пакетов, связанных с фирмой, учебным заведением, и т. д.
zh_cn: 有助于对该软件包进行分类的组。对与公司、学校等有关的软件包集合可能有用。
zh_tw: 協助分類此套件的群組。可能有助於收集與公司、學校等相關的套件。

# PublishPackageViewPackageKeywords
source: Keywords (optional)
cs_cz: Klíčová slova (volitelné)
de_de: Schlüsselwörter (optional)
es_es: Palabras clave (opcional)
fr_fr: Mots-clés (facultatif)
it_it: Parole chiave (facoltativo)
ja_jp: キーワード(省略可能)
ko_kr: 키워드(선택 사항)
pl_pl: Słowa kluczowe (opcjonalnie)
pt_br: Palavras-chave (opcional)
ru_ru: Ключевые слова (необязательно)
zh_cn: 关键字(可选)
zh_tw: 關鍵字 (可選)

# PublishPackageViewPackageKeywordsTooltip
source: Keywords help find your package in the database. Separate them by spaces.
cs_cz: Klíčová slova pomáhají s vyhledáváním balíčku v databázi. Oddělte je mezerami.
de_de: Schlüsselwörter erleichtern die Suche nach dem Paket in der Datenbank. Trennen Sie sie durch Leerzeichen.
es_es: Las palabras ayudan a buscar el paquete en la base de datos. Sepárelas con espacios
fr_fr: Les mots-clés aident à rechercher votre package dans la base de données. Séparez-les par des espaces.
it_it: Le parole chiave consentono di trovare il pacchetto nel database. Devono essere separate da spazi.
ja_jp: キーワードはデータベースでパッケージを検索する際に便利です。キーワードは スペースで区切ります。
ko_kr: 키워드는 데이터베이스에서 패키지를 찾는 데 도움이 됩니다. 키워드는 공백으로 구분하십시오.
pl_pl: Słowa kluczowe są pomocne przy wyszukiwaniu pakietu w bazie danych. Oddziel je spacjami.
pt_br: As palavras-chave ajudam a localizar seu pacote no banco de dados. Separe as mesmas por espaços.
ru_ru: Ключевые слова служат для поиска требуемого пакета в базе данных. Ключевые слова разделяются при помощи пробелов.
zh_cn: 关键字有助于查找数据库中的软件包。通过空格分隔不同关键字。
zh_tw: 關鍵字可協助您在資料庫中尋找套件。請以空格分隔它們。

# PublishPackageViewPackageName
source: Name
cs_cz: Název
es_es: Nombre
fr_fr: Nom
it_it: Nome
ja_jp: 名前
ko_kr: 이름
pl_pl: Nazwa
pt_br: Nome
ru_ru: Имя
zh_cn: 名称
zh_tw: 名稱

# PublishPackageViewPackageNameTooltip
source: A unique name for the package.
cs_cz: Jedinečný název balíčku
de_de: Ein eindeutiger Name für das Paket.
es_es: Un nombre exclusivo para el paquete.
fr_fr: Nom unique du package.
it_it: Nome univoco per il pacchetto.
ja_jp: パッケージのユニークな名前。
ko_kr: 패키지의 고유한 이름.
pl_pl: Unikatowa nazwa pakietu.
pt_br: Um nome exclusivo para o pacote.
ru_ru: Уникальное имя пакета.
zh_cn: 软件包的唯一名称。
zh_tw: 套件的唯一名稱。

# PublishPackageViewPackageVersion
source: Version (Major Minor Build)
cs_cz: Verze
de_de: Version
es_es: Versión
fr_fr: Version
it_it: Versione
ja_jp: バージョン
ko_kr: 버전
pl_pl: Wersja
pt_br: Versão
ru_ru: Версия
zh_cn: 版本
zh_tw: 版本

# PublishPackageViewPackageVersionTooltip
source: A version name helps a submitter keep track of updates to the package. A new version of a package will be REJECTED if this is not incremeneted.
cs_cz: Název verze pomáhá a odesílatelům sledovat aktualizace balíčku. Když je přidána nová verze balíčku, číslo verze se musí zvýšit.
de_de: Ein Versionsname unterstützt den Absender dabei, Aktualisierungen des Pakets zu verfolgen. Wenn eine neuere Version eines Pakets hinzugefügt wird, muss die Versionsnummer erhöht werden.
es_es: Un nombre de versión ayuda al remitente a realizar el seguimiento de las actualizaciones del paquete. Cuando se añade una nueva versión de un paquete, el número de versión debe incrementarse.
fr_fr: Un nom de version permet à l'auteur de la demande de conserver une trace des mises à jour du package. Lorsqu'une nouvelle version d'un package est ajoutée, le numéro de version doit être incrémenté.
it_it: Il nome di versione consente di tenere traccia degli aggiornamenti per il pacchetto. Quando viene aggiunta una nuova versione di un pacchetto, il numero di versione deve essere incrementato.
ja_jp: バージョン名があると、提出者がパッケージの更新を追跡するときに便利です。パッケージの新しいバージョンが追加された場合は、バージョン番号を上げる必要があります。
ko_kr: 버전 이름은 제출자가 패키지의 업데이트를 추적하는 데 도움이 됩니다. 패키지의 새 버전이 추가되면 버전 번호를 늘려야 합니다.
pl_pl: Nazwa wersji pomaga przesyłającemu śledzić aktualizacje do pakietu. W przypadku dodawania nowej wersji pakietu należy podwyższyć numer wersji.
pt_br: Um nome de versão ajuda o emissor a manter o controle das atualizações do pacote. Quando uma nova versão do pacote é adicionada, número de versão deve aumentar.
ru_ru: Имя версии помогает отправителю отслеживать обновления пакета. Когда добавляется новая версия пакета, номер версии следует увеличить.
zh_cn: 版本名有助于提交程序跟踪软件包的更新。当添加了软件包的新版本时，版本号必须增大。
zh_tw: 版本名稱有助於提交者追蹤套件的更新。當套件加入新版本時，版本號碼一定會增加。

# PublishPackageViewPublish
source: Publish a Package
cs_cz: Publikovat balíček
de_de: Paket publizieren
es_es: Publicar un paquete
fr_fr: Publier un package
it_it: Pubblica un pacchetto
ja_jp: パッケージをパブリッシュ
ko_kr: 패키지 게시
pl_pl: Opublikuj pakiet
pt_br: Publicar um pacote
ru_ru: Публикация пакета
zh_cn: 发布软件包
zh_tw: 發佈套件

# PublishPackageViewPublisherWebiSite
source: Website Url (optional)
cs_cz: Adresa URL webové stránky (volitelné)
de_de: URL der Website (optional)
es_es: URL de sitio web (opcional)
fr_fr: URL du site Web (facultatif)
it_it: URL del sito Web (facoltativo)
ja_jp: Web サイトの URL (省略可能)
ko_kr: 웹사이트 URL(선택 사항)
pl_pl: Adres URL strony internetowej (opcjonalnie)
pt_br: URL do site (opcional)
ru_ru: Адрес веб-сайта (необязательно)
zh_cn: 网站 Url (可选)
zh_tw: 網站 URL (選填)

# PublishPackageViewRepositoryUrl
source: Repository Url (optional)
cs_cz: Adresa URL úložiště (volitelné)
es_es: URL de depósito (opcional)
fr_fr: URL du référentiel (facultatif)
it_it: URL repository (facoltativo)
ja_jp: リポジトリ URL (省略可能)
ko_kr: 리포지토리 URL(선택 사항)
pl_pl: Adres URL repozytorium (opcjonalnie)
pt_br: URL do repositório (opcional)
ru_ru: URL-адрес хранилища (необязательно)
zh_cn: 储存库 Url (可选)
zh_tw: 儲存庫 URL (可選)

# PublishPackageViewTitle
source: Publish a {0} Package
cs_cz: Publikování balíčku aplikace {0}
de_de: {0}-Paket veröffentlichen
es_es: Publicar un paquete de {0}
fr_fr: Publier un package {0}
it_it: Pubblica un pacchetto di {0}
ja_jp: {0} パッケージをパブリッシュ
ko_kr: {0} 패키지 게시
pl_pl: Opublikuj pakiet {0}
pt_br: Publicar um pacote do {0}
ru_ru: Публикация пакета {0}
zh_cn: 发布 {0} 软件包
zh_tw: 發佈 {0} 套件

# QueryMember
source: Query
cs_cz: Dotaz
de_de: Abfrage
es_es: Consultar
fr_fr: Requête
ja_jp: クエリー
ko_kr: 조회
pl_pl: Zapytanie
pt_br: Consultar
ru_ru: Запрос
zh_cn: 查询
zh_tw: 查詢

# RerunButton
source: Apply Changes
cs_cz: Použít změny
de_de: Änderungen anw.
es_es: Aplicar cambios
fr_fr: Appliquer les modif.
it_it: Applica modifiche
ja_jp: 変更を適用
ko_kr: 변경 사항 적용
pl_pl: Zastosuj zmiany
pt_br: Aplicar alterações
ru_ru: Применить
zh_cn: 应用更改
zh_tw: 套用變更

# RunCompletedMessage
source: Run completed.
cs_cz: Spuštění bylo dokončeno.
de_de: Ausführung abgeschlossen
es_es: Ejecución completada
fr_fr: Exécution terminée.
it_it: Esecuzione completata.
ja_jp: 実行が終了しました。
ko_kr: 실행이 완료되었습니다.
pl_pl: Uruchomienie zakończone.
pt_br: Execução concluída.
ru_ru: Процесс завершен.
zh_cn: 运行完成。
zh_tw: 執行完成。
