Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# GetStartedGuideSurveyText
source: Learn more about Dynamo in the #online help=https://primer2.dynamobim.org/
cs_cz: Další informace o práci v aplikaci Dynamo naleznete na stránce #online help=https://primer2.dynamobim.org/v/cs/
de_de: Erfahren Sie in der #Online-Hilfe=https://primer2.dynamobim.org/v/de/ mehr über Dynamo
es_es: Obtenga más información sobre Dynamo en #ayuda en línea=https://primer2.dynamobim.org/v/es/
fr_fr: En savoir plus sur Dynamo dans #l'aide en ligne=https://primer2.dynamobim.org/v/fr/
it_it: Ulteriori informazioni su Dynamo nella #Guida in linea=https://primer2.dynamobim.org/v/it/
ja_jp: Dynamo の詳細については、オンライン #ヘルプ=https://primer2.dynamobim.org/v/ja/ を参照してください。
ko_kr: #online help=https://primer2.dynamobim.org/v/ko/ 에서 Dynamo에 대해 자세히 알아보십시오.
pl_pl: Dowiedz się więcej na temat dodatku Dynamo z #pomocy online=https://primer2.dynamobim.org/v/pl/
pt_br: Saiba mais sobre o Dynamo na #ajuda on-line=https://primer2.dynamobim.org/v/pt-br/
ru_ru: Дополнительные сведения о работе с Dynamo см. в #онлайн-справке=https://primer2.dynamobim.org/v/ru/
zh_cn: 通过 #联机帮助=https://primer2.dynamobim.org/v/zh-cn/ 详细了解 Dynamo
zh_tw: 透過 #線上說明=https://primer2.dynamobim.org/v/zh-tw/ 進一步瞭解 Dynamo

# GetStartedGuideSurveyTitle
source: Finished
cs_cz: Dokončeno
de_de: Fertig
es_es: Finalizado
fr_fr: Terminé
it_it: Completato
ja_jp: 完了
ko_kr: 완료
pl_pl: Zakończono
pt_br: Concluído
ru_ru: Завершено
zh_cn: 已完成
zh_tw: 完成

# GroupDefaultText
source: <Double click here to edit group description>
cs_cz: Popis <Dvojitým kliknutím sem upravte popis skupiny>
de_de: Beschreibung <Hier doppelklicken, um die Gruppenbeschreibung zu bearbeiten>
es_es: Descripción <Haga doble clic aquí para editar la descripción del grupo>
fr_fr: Description <Double-cliquer ici pour modifier la description du groupe>
it_it: Descrizione <Fare doppio clic qui per modificare la descrizione del gruppo>
ja_jp: 説明<グループの説明を編集するにはここをダブル クリック>
ko_kr: 설명 <그룹 설명을 편집하려면 여기를 두 번 클릭하십시오.>
pl_pl: Opis <Kliknij dwukrotnie tutaj, aby edytować opis grupy>
pt_br: Descrição <Clique duas vezes aqui para editar a descrição do grupo>
ru_ru: Описание <Дважды нажмите здесь, чтобы изменить описание группы>
zh_cn: 说明 <双击此处编辑组说明>
zh_tw: 描述 <按兩下這裡以編輯群組描述>

# GroupNameDefaultText
source: <Click here to edit the group title>
cs_cz: Nadpis <Kliknutím sem upravte název skupiny>
de_de: Title <Click here to edit the group title>
es_es: Title <Click here to edit the group title>
fr_fr: Title <Click here to edit the group title>
it_it: Title <Click here to edit the group title>
ja_jp: Title <Click here to edit the group title>
ko_kr: 제목 <그룹 제목을 편집하려면 여기를 클릭하십시오>
pl_pl: Title <Click here to edit the group title>
pt_br: Title <Click here to edit the group title>
ru_ru: Title <Click here to edit the group title>
zh_cn: Title <Click here to edit the group title>
zh_tw: Title <Click here to edit the group title>

# GroupContextMenuAddGroupToGroup
source: Add Group to This Group
cs_cz: Přidat skupinu do této skupiny
de_de: Gruppe zu dieser Gruppe hinzufügen
es_es: Añadir grupo a este grupo
fr_fr: Ajouter le groupe à ce groupe
it_it: Aggiungi gruppo a questo gruppo
ja_jp: このグループにグループを追加
ko_kr: 이 그룹에 그룹 추가
pl_pl: Dodaj grupę do tej grupy
pt_br: Adicionar grupo a este grupo
ru_ru: Добавить группу в эту группу
zh_cn: 将组添加到此组
zh_tw: 將群組加入此群組

# NodeInformationalStateDismiss
source: Dismiss
cs_cz: Zavřít
de_de: Verwerfen
es_es: Descartar
fr_fr: Ignorer
it_it: Ignora
ja_jp: 却下
ko_kr: 닫기
pl_pl: Odrzuć
pt_br: Ignorar
ru_ru: Закрыть
zh_cn: 关闭
zh_tw: 關閉

# NodeInformationalStateShowAllInfo
source: Show all info
cs_cz: Zobrazit všechny informace
de_de: Alle Infos anzeigen
es_es: Mostrar toda la información
fr_fr: Afficher toutes les informations
it_it: Mostra tutte le informazioni
ja_jp: すべての情報を表示
ko_kr: 모든 정보 표시
pl_pl: Pokaż wszystkie informacje
pt_br: Mostrar todas as informações
ru_ru: Показать всю информацию
zh_cn: 显示所有信息
zh_tw: 展示所有資訊

# NodeInformationalStateShowAllWarnings
source: Show all warnings
cs_cz: Zobrazit všechna upozornění
de_de: Alle Warnungen anzeigen
es_es: Mostrar todas las advertencias
fr_fr: Voir tous les avertissements
it_it: Mostra tutti gli avvisi
ja_jp: すべての警告を表示
ko_kr: 모든 경고 표시
pl_pl: Pokaż wszystkie ostrzeżenia
pt_br: Mostrar todos os avisos
ru_ru: Показать все предупреждения
zh_cn: 显示所有警告
zh_tw: 展示所有警告

# NodeInformationalStateShowAllErrors
source: Show all errors
cs_cz: Zobrazit všechny chyby
de_de: Alle Fehler anzeigen
es_es: Mostrar todos los errores
fr_fr: Afficher toutes les erreurs
it_it: Mostra tutti gli errori
ja_jp: すべてのエラーを表示
ko_kr: 모든 오류 표시
pl_pl: Pokaż wszystkie błędy
pt_br: Mostrar todos os erros
ru_ru: Показать все ошибки
zh_cn: 显示所有错误
zh_tw: 展示所有錯誤

# NodeInformationalStateShowLess
source: Show less
cs_cz: Zobrazit méně
de_de: Weniger anzeigen
es_es: Mostrar menos
fr_fr: Afficher moins
it_it: Mostra meno
ja_jp: 簡易表示
ko_kr: 간단히 표시
pl_pl: Pokaż mniej
pt_br: Mostrar menos
ru_ru: Меньше
zh_cn: 显示更少
zh_tw: 展示較少

# NodeInformationalStateDismissAll
source: Dismiss all
cs_cz: Zavřít vše
de_de: Alle verwerfen
es_es: Descartar todo
fr_fr: Tout abandonner
it_it: Ignora tutto
ja_jp: すべて却下
ko_kr: 모두 닫기
pl_pl: Odrzuć wszystkie
pt_br: Ignorar tudo
ru_ru: Закрыть все
zh_cn: 全部关闭
zh_tw: 全部關閉

# NodeInfoDismissButtonToolTip
source: Dismisses the info messages on this node. Utilize when you want to design in graph failures, or the info message will not be relevant during graph execution.
cs_cz: Zavře informační zprávy u tohoto uzlu. Tuto možnost použijte, pokud chcete navrhnout chyby grafu, nebo když informační zpráva nebude při vykreslování grafu relevantní.
de_de: Verwirft die Informationsmeldungen in diesem Block. Verwenden Sie diese Option, wenn Sie das Design in Diagrammfehlern durchführen möchten oder die Informationsmeldung während der Diagrammausführung nicht relevant ist.
es_es: Descarta los mensajes de información de este nodo. Utilice esta opción cuando desee diseñar sin tener en cuenta los errores del gráfico o el mensaje de información no sea pertinente durante la ejecución del gráfico.
fr_fr: Ferme les messages d'information sur ce noeud. Utilisez cette option pour concevoir dans des erreurs de graphique, ou le message d'information ne sera pas pertinent lors de l'exécution du graphique.
it_it: Ignora i messaggi informativi su questo nodo. Utilizzare questa opzione quando si desidera progettare in caso di errori dei grafici o il messaggio informativo non è rilevante durante l'esecuzione del grafico.
ja_jp: このノードの情報メッセージを却下します。グラフのエラーで設計する場合や、グラフの実行中に情報メッセージが関係しない場合に利用します。
ko_kr: 이 노드의 정보 메시지를 닫습니다. 그래프 오류에서 설계할 때 활용하십시오. 그렇지 않으면 그래프를 실행하는 동안 경고 메시지가 관련성이 없습니다.
pl_pl: Odrzuca komunikaty informacyjne w tym węźle. Użyj tej opcji, gdy chcesz projektować w przypadku błędów wykresu lub gdy komunikat informacyjny nie będzie istotny podczas wykonywania wykresu.
pt_br: Ignora as mensagens de informação neste nó. Use quando desejar projetar em falhas de gráfico, ou a mensagem de informação não será relevante durante a execução do gráfico.
ru_ru: Закрытие информационных сообщений для этого узла. Используется при разработке ошибок графика. В противном случае информационное сообщение будет неактуально при выполнении графика.
zh_cn: 关闭此节点上的信息消息。要在图形出现故障的情况下设计时使用，或者信息消息将在图形执行期间并不相关。
zh_tw: 關閉此節點上的資訊訊息。當您要在圖表失敗的狀況下設計時使用，或資訊訊息在圖表執行期間不重要時使用。

# NodeWarningDismissButtonToolTip
source: Dismisses the warning messages on this node. Utilize when you want to design in graph failures, or the warning message will not be relevant during graph execution.
cs_cz: Zavře zprávy upozornění u tohoto uzlu. Tuto možnost použijte, pokud chcete navrhnout chyby grafu, nebo když zpráva upozornění nebude při vykreslování grafu relevantní.
de_de: Verwirft die Warnmeldungen für diesen Block. Verwenden Sie diese Option, wenn Sie das Design in Diagrammfehlern durchführen möchten oder die Warnmeldung während der Diagrammausführung nicht relevant ist.
es_es: Descarta los mensajes de advertencia en este nodo. Utilice esta opción cuando desee diseñar sin tener en cuenta los errores del gráfico o cuando el mensaje de advertencia no sea pertinente durante la ejecución del gráfico.
fr_fr: Ignore les messages d'avertissement sur ce noeud. Utilisez cette option pour concevoir dans des erreurs de graphique, ou le message d'avertissement ne sera pas pertinent lors de l'exécution du graphique.
it_it: Ignora i messaggi di avviso presenti in questo nodo. Utilizzare questa opzione quando si desidera progettare in caso di errori dei grafici o il messaggio di avviso non è rilevante durante l'esecuzione del grafico.
ja_jp: このノードの警告メッセージを却下します。グラフのエラーで設計する場合や、グラフの実行中に警告メッセージが関係しない場合に利用します。
ko_kr: 이 노드의 경고 메시지를 닫습니다. 그래프 오류에서 설계하려는 경우를 활용하십시오. 그렇지 않으면 그래프를 실행하는 동안 경고 메시지가 관련성이 없습니다.
pl_pl: Odrzuca komunikaty ostrzegawcze w tym węźle. Użyj tej opcji, gdy chcesz projektować w przypadku błędów wykresu lub gdy komunikat ostrzegawczy nie będzie istotny podczas wykonywania wykresu.
pt_br: Ignora as mensagens de aviso neste nó. Use quando desejar projetar em falhas de gráfico, ou a mensagem de aviso não será relevante durante a execução do gráfico.
ru_ru: Закрытие предупреждений для этого узла. Используется при разработке ошибок графика. В противном случае предупреждение будет неактуально при выполнении графика.
zh_cn: 关闭此节点上的警告消息。要在图形出现故障的情况下设计时使用，或者警告消息将在图形执行期间并不相关。
zh_tw: 關閉此節點上的警告訊息。當您要在圖表失敗的狀況下設計時使用，或警告訊息在圖表執行期間不重要時使用。

# BreakConnectionsPopupMenuItem
source: Break Connections
cs_cz: Přerušit připojení
de_de: Verbindungen lösen
es_es: Interrumpir conexiones
fr_fr: Couper les connexions
it_it: Interrompi connessioni
ja_jp: 接続を解除
ko_kr: 연결 끊기
pl_pl: Przerwij połączenia
pt_br: Remover conexões
ru_ru: Разорвать соединения
zh_cn: 断开连接
zh_tw: 中斷連接

# HideWiresPopupMenuItem
source: Hide Wires
cs_cz: Skrýt dráty
de_de: Drähte ausblenden
es_es: Ocultar cables
fr_fr: Masquer les fils
it_it: Nascondi fili
ja_jp: ワイヤを非表示
ko_kr: 와이어 숨기기
pl_pl: Ukryj przewody
pt_br: Ocultar fios
ru_ru: Скрыть провода
zh_cn: 隐藏导线
zh_tw: 隱藏線路

# ShowWiresPopupMenuItem
source: Show Wires
cs_cz: Zobrazit dráty
de_de: Drähte anzeigen
es_es: Mostrar cables
fr_fr: Afficher les fils
it_it: Mostra fili
ja_jp: ワイヤを表示
ko_kr: 와이어 표시
pl_pl: Pokaż przewody
pt_br: Mostrar fios
ru_ru: Показать провода
zh_cn: 显示导线
zh_tw: 顯示線路

# ExitTourWindowContent
source: You can return to this guide later from the Help menu.
cs_cz: K tomuto výukovému programu se můžete vrátit později pomocí nabídky Nápověda.
de_de: Sie können später über das Hilfe-Menü zu diesem Leitfaden zurückkehren.
es_es: Puede volver a esta guía más adelante desde el menú Ayuda.
fr_fr: Vous pourrez retourner dans ce guide ultérieurement à partir du menu Aide.
it_it: È possibile tornare a questa guida in un secondo momento dal menu ?.
ja_jp: このガイドには、後で[ヘルプ]メニューから戻ることができます。
ko_kr: 나중에 도움말 메뉴에서 이 가이드로 돌아갈 수 있습니다.
pl_pl: Do tego przewodnika można wrócić później z menu Pomoc.
pt_br: Você pode retornar a esse guia mais tarde no menu Ajuda.
ru_ru: К этому руководству можно вернуться позже из меню «Справка».
zh_cn: 可以以后从“帮助”菜单返回本指南。
zh_tw: 您稍後可以從「說明」功能表回到這份指南。

# PackageStatePendingUnload
source: Scheduled to be unloaded
cs_cz: Naplánováno k nenačtení
de_de: Geplant: Laden aufheben
es_es: Anulación de carga programada
fr_fr: Planifié pour déchargement
it_it: Pianificato per essere scaricato
ja_jp: ロード解除をスケジュール済み
ko_kr: 언로드되도록 일람표에 작성됨
pl_pl: Zaplanowano usunięcie z pamięci
pt_br: Programado para ser descarregado
ru_ru: Запланировано к выгрузке
zh_cn: 已计划卸载
zh_tw: 已排定要卸載

# PackageStateError
source: Error
cs_cz: Chyba
de_de: Fehler
fr_fr: Erreur
it_it: Errore
ja_jp: エラー
ko_kr: 오류
pl_pl: Błąd
pt_br: Erro
ru_ru: Ошибка
zh_cn: 错误
zh_tw: 錯誤

# PackageStateLoaded
source: Loaded
cs_cz: Načteno
de_de: Geladen
es_es: Cargado
fr_fr: Chargé
it_it: Caricato
ja_jp: ロード済み
ko_kr: 로드됨
pl_pl: Wczytano
pt_br: Carregado
ru_ru: Загружено
zh_cn: 已加载
zh_tw: 已載入

# PackageStateUnloaded
source: Unloaded
cs_cz: Nenačteno
de_de: Nicht geladen
es_es: No cargado
fr_fr: Déchargé
it_it: Scaricato
ja_jp: ロード解除済み
ko_kr: 언로드됨
pl_pl: Usunięto z pamięci
pt_br: Descarregado
ru_ru: Выгружено
zh_cn: 已卸载
zh_tw: 已卸載

# PackageStateScheduledForDeletion
source: Scheduled for Delete
cs_cz: Naplánováno k odstranění
de_de: Löschen geplant
es_es: Programado para supresión
fr_fr: Suppression planifiée
it_it: Pianificato per l'eliminazione
ja_jp: 削除をスケジュール済み
ko_kr: 삭제 예약됨
pl_pl: Zaplanowane do usunięcia
pt_br: Programado para exclusão
ru_ru: Запланировано удаление
zh_cn: 已计划删除
zh_tw: 已排定刪除

# PackageStateScheduledForUnload
source: Scheduled for Unload
cs_cz: Naplánováno k uvolnění
de_de: Entfernen geplant
es_es: Programado para descarga
fr_fr: Déchargement planifié
it_it: Pianificato per lo scaricamento
ja_jp: ロード解除をスケジュール済み
ko_kr: 언로드 예약됨
pl_pl: Zaplanowane do usunięcia z pamięci
pt_br: Programado para descarregamento
ru_ru: Запланирована выгрузка
zh_cn: 已计划卸载
zh_tw: 已排定卸載

# PackageStateErrorTooltip
source: Error. This package has not been loaded due to the following error: {0}.
cs_cz: Chyba. Tento balíček nebyl načten z důvodu následující chyby: {0}.
de_de: Fehler. Dieses Paket wurde aufgrund des folgenden Fehlers nicht geladen: {0}.
es_es: Error. Este paquete no se ha cargado debido al siguiente error: {0}.
fr_fr: Erreur. Ce package n'a pas été chargé en raison de l'erreur suivante: {0}.
it_it: Errore. Questo pacchetto non è stato caricato a causa del seguente errore: {0}.
ja_jp: エラー。 このパッケージは次のエラーのためロードされていません: {0}
ko_kr: 오류. 이 패키지는 다음 오류로 인해 로드되지 않았습니다. {0}.
pl_pl: Błąd. Ten pakiet nie został wczytany z powodu następującego błędu: {0}.
pt_br: Erro. Esse pacote não foi carregado devido ao seguinte erro: {0}.
ru_ru: Ошибка. Этот пакет не был загружен из-за следующей ошибки: {0}.
zh_cn: 错误。 由于以下错误，此软件包尚未加载: {0}。
zh_tw: 錯誤。 此套件由於以下錯誤未載入: {0}。

# PackageStateLoadedTooltip
source: Loaded. This package is loaded and ready to be used.
cs_cz: Načteno. Tento balíček je načten a připraven k použití.
de_de: Geladen. Dieses Paket ist geladen und kann verwendet werden.
es_es: Cargado. Este paquete se ha cargado y está listo para su uso.
fr_fr: Chargé. Ce package est chargé et prêt à être utilisé.
it_it: Caricato. Questo pacchetto viene caricato ed è pronto per essere utilizzato.
ja_jp: ロード済みです。 このパッケージはロードされており、使用準備が整っています。
ko_kr: 로드되었습니다. 이 패키지가 로드되어 사용할 준비가 되었습니다.
pl_pl: Wczytano. Ten pakiet jest wczytany i gotowy do użycia.
pt_br: Carregado. Esse pacote foi carregado e está pronto para ser usado.
ru_ru: Загружено. Этот пакет загружен и готов к использованию.
zh_cn: 已加载。 此软件包已加载，可供使用。
zh_tw: 已載入。 此套件已載入且可供使用。

# PackageStateUnloadedTooltip
source: Unloaded. This package has been marked as unloaded.
cs_cz: Uvolněno. Tento balíček byl označen jako uvolněný.
de_de: Nicht geladen. Dieses Paket wurde als Nicht geladen markiert.
es_es: Descargado. Este paquete se ha marcado como descargado.
fr_fr: Déchargé. Ce package a été indiqué comme étant déchargé.
it_it: Scaricato.Il pacchetto è stato contrassegnato come non scaricato.
ja_jp: ロード解除済み。 このパッケージはロード解除済みとマークされています。
ko_kr: 언로드되었습니다. 이 패키지는 언로드된 것으로 표시되었습니다.
pl_pl: Usunięto z pamięci. Ten pakiet został oznaczony jako usunięty z pamięci.
pt_br: Descarregado. Esse pacote não foi marcado como descarregado.
ru_ru: Выгружено. Этот пакет помечен как выгруженный.
zh_cn: 已卸载。 此软件包已标记为“已卸载”。
zh_tw: 已卸載。 此套件已標示為已卸載。

# PackageStateScheduledForDeletionTooltip
source: Scheduled for Delete. This package will be deleted after the next Dynamo restart.
cs_cz: Naplánováno k odstranění. Tento balíček bude odstraněn po příštím restartování aplikace Dynamo.
de_de: Löschen geplant. Dieses Paket wird nach dem nächsten Neustart von Dynamo gelöscht.
es_es: Programado para supresión. Este paquete se suprimirá después del siguiente reinicio de Dynamo.
fr_fr: Suppression planifiée. Ce package sera supprimé après le prochain redémarrage de Dynamo.
it_it: Pianificato per l'eliminazione. Questo pacchetto verrà eliminato dopo il successivo riavvio di Dynamo.
ja_jp: 削除がスケジュール設定されています。 このパッケージは、次に Dynamo を再起動した後に削除されます。
ko_kr: 삭제가 예약되었습니다. 이 패키지는 다음번에 Dynamo를 다시 시작하면 삭제됩니다.
pl_pl: Zaplanowano usunięcie. Ten pakiet zostanie usunięty po następnym ponownym uruchomieniu dodatku Dynamo.
pt_br: Programado para exclusão. Esse pacote será excluído após a próxima reinicialização do Dynamo.
ru_ru: Запланировано удаление. Этот пакет будет удален после следующего перезапуска Dynamo.
zh_cn: 已计划删除。 此软件包将在下次重新启动 Dynamo 后删除。
zh_tw: 已排定刪除。 此套件將在下次重新啟動 Dynamo 後刪除。

# PackageContextMenuDeletePackageText
source: Delete
cs_cz: Odstranit
de_de: Löschen
es_es: Suprimir
fr_fr: Supprimer
it_it: Elimina
ja_jp: 削除
ko_kr: 삭제
pl_pl: Usuń
pt_br: Excluir
ru_ru: Удалить
zh_cn: 删除
zh_tw: 刪除

# PackageContextMenuDeletePackageTooltip
source: Delete this package from the Dynamo package locations. Once deleted, it will not be loaded into Dynamo anymore until it is re-installed
cs_cz: Odstraňte tento balíček z umístění balíčků aplikace Dynamo. Po odstranění již nebude načten do aplikace Dynamo, dokud nebude znovu nainstalován.
de_de: Löschen Sie dieses Paket aus den Speicherorten für Dynamo-Pakete. Nach dem Löschen wird es erst wieder in Dynamo geladen, wenn es erneut installiert wird
es_es: Suprima este paquete de las ubicaciones de paquetes de Dynamo. Una vez suprimido, ya no se cargará en Dynamo hasta que se vuelva a instalar.
fr_fr: Supprimez ce package des emplacements de package Dynamo. Une fois supprimé, il ne sera plus chargé dans Dynamo tant qu'il n'aura pas été réinstallé
it_it: Eliminare questo pacchetto dai percorsi dei pacchetti Dynamo. Una volta eliminato, non verrà più caricato in Dynamo fino a quando non verrà reinstallato
ja_jp: このパッケージを Dynamo パッケージの場所から削除します。削除すると、再インストールするまで Dynamo にロードされなくなります
ko_kr: Dynamo 패키지 위치에서 이 패키지를 삭제합니다. 삭제하면 다시 설치할 때까지 Dynamo에 더 이상 로드되지 않습니다.
pl_pl: Usuń ten pakiet z lokalizacji pakietu Dynamo. Po usunięciu nie zostanie on wczytany do dodatku Dynamo, dopóki nie zostanie ponownie zainstalowany
pt_br: Exclua esse pacote das localizações de pacotes do Dynamo. Depois de excluído, ele não será mais carregado no Dynamo até que seja reinstalado
ru_ru: Удалите этот пакет из папок пакетов Dynamo. После удаления он не будет загружаться в Dynamo до тех пор, пока не будет переустановлен
zh_cn: 将此软件包从 Dynamo 软件包位置中删除。删除后，在重新安装之前，它将不再会加载到 Dynamo 中
zh_tw: 從 Dynamo 套件位置中刪除此套件。刪除後，就不會再載入到 Dynamo 中，直到重新安裝

# PackageContextMenuUnloadPackageText
source: Unload
cs_cz: Uvolnit
de_de: Entfernen
es_es: Descargar
fr_fr: Décharger
it_it: Scarica
ja_jp: ロード解除
ko_kr: 언로드
pl_pl: Usuń z pamięci
pt_br: Descarregar
ru_ru: Выгрузить
zh_cn: 卸载
zh_tw: 卸載

# PackageContextMenuUnloadPackageTooltip
source: Unload this package so that it will not be loaded into Dynamo. The package will not be deleted from the Dynamo package locations
cs_cz: Uvolněte tento balíček, aby nebyl načten do aplikace Dynamo. Balíček nebude odstraněn z umístění balíčků aplikace Dynamo.
de_de: Entfernen Sie dieses Paket, damit es nicht in Dynamo geladen wird. Das Paket wird nicht aus den Speicherorten für Dynamo-Pakete gelöscht
es_es: Descargue este paquete para que no se cargue en Dynamo. El paquete no se eliminará de las ubicaciones de paquetes de Dynamo.
fr_fr: Déchargez ce package afin qu'il ne soit pas chargé dans Dynamo. Il ne sera pas supprimé des emplacements de package Dynamo
it_it: Scaricare questo pacchetto in modo che non venga caricato in Dynamo. Il pacchetto non verrà eliminato dai percorsi dei pacchetti di Dynamo
ja_jp: このパッケージをロード解除して Dynamo にロードされないようにします。パッケージは Dynamo パッケージの場所から削除されません
ko_kr: 이 패키지가 Dynamo에 로드되지 않도록 패키지를 언로드합니다. 이 패키지는 Dynamo 패키지 위치에서 삭제되지 않습니다.
pl_pl: Usuń ten pakiet z pamięci, aby nie został wczytany do dodatku Dynamo. Pakiet nie zostanie usunięty z lokalizacji pakietu Dynamo
pt_br: Descarregue esse pacote para que ele não seja carregado no Dynamo. O pacote não será excluído das localizações de pacotes do Dynamo
ru_ru: Выгрузите этот пакет, чтобы он не загружался в Dynamo. Он не будет удален из папок пакетов Dynamo
zh_cn: 卸载此软件包，使其不会加载到 Dynamo 中。该软件包将不会从 Dynamo 软件包位置中删除
zh_tw: 卸載此套件，讓它不會再載入到 Dynamo 中。不會從 Dynamo 套件位置刪除此套件

# PackageContextMenuUnmarkDeletePackageText
source: Cancel Delete
cs_cz: Zrušit odstranění
de_de: Löschen abbrechen
es_es: Cancelar supresión
fr_fr: Annuler la suppression
it_it: Annulla eliminazione
ja_jp: 削除をキャンセル
ko_kr: 삭제 취소
pl_pl: Anuluj usunięcie
pt_br: Cancelar exclusão
ru_ru: Отменить удаление
zh_cn: 取消删除
zh_tw: 取消刪除

# PackageContextMenuUnmarkDeletePackageTooltip
source: Remove the scheduled delete status
cs_cz: Odebrat naplánovaný stav odstranění
de_de: Geplanten Löschen-Status entfernen
es_es: Eliminar el estado de supresión programada
fr_fr: Supprimer l'état de suppression planifiée
it_it: Rimuove lo stato di eliminazione pianificata
ja_jp: スケジュール済み削除の設定を解除します
ko_kr: 예약된 삭제 상태 제거
pl_pl: Usuń stan zaplanowanego usunięcia
pt_br: Remover o status de exclusão programada
ru_ru: Удалить статус запланированного удаления
zh_cn: 删除计划的删除状态
zh_tw: 移除排定的刪除狀態

# PackageContextMenuUnmarkUnloadPackageText
source: Cancel Unload
cs_cz: Zrušit uvolnění
de_de: Entfernen abbrechen
es_es: Cancelar descarga
fr_fr: Annuler le déchargement
it_it: Annulla scaricamento
ja_jp: ロード解除をキャンセル
ko_kr: 언로드 취소
pl_pl: Anuluj usuwanie z pamięci
pt_br: Cancelar descarregamento
ru_ru: Отменить выгрузку
zh_cn: 取消卸载
zh_tw: 取消卸載

# PackageContextMenuUnmarkUnloadPackageTooltip
source: Remove the scheduled unload status
cs_cz: Odebrat naplánovaný stav uvolnění
de_de: Geplanten Entfernen-Status entfernen
es_es: Eliminar el estado de descarga programada
fr_fr: Supprimer l'état de déchargement planifié
it_it: Rimuove lo stato di scaricamento pianificato
ja_jp: スケジュール済みロード解除の設定を解除します
ko_kr: 예약된 언로드 상태 제거
pl_pl: Usuń stan zaplanowanego usunięcia z pamięci
pt_br: Remover o status de descarregamento programado
ru_ru: Удалить статус запланированной выгрузки
zh_cn: 删除计划的卸载状态
zh_tw: 移除排定的卸載狀態

# PackageViewContextMenuLoadText
source: Load
cs_cz: Načíst
de_de: Laden
es_es: Cargar
fr_fr: Charger
it_it: Carica
ja_jp: ロード
ko_kr: 로드
pl_pl: Wczytaj
pt_br: Carregar
ru_ru: Загрузка
zh_cn: 加载
zh_tw: 載入

# PackageViewContextMenuLoadTooltip
source: Load this package into Dynamo. Other packages with the same name will be automatically deleted
cs_cz: Načíst tento balíček do aplikace Dynamo. Ostatní balíčky se stejným názvem budou automaticky odstraněny.
de_de: Dieses Paket in Dynamo laden. Andere Pakete mit demselben Namen werden automatisch gelöscht.
es_es: Cargue este paquete en Dynamo. Se suprimirán automáticamente otros paquetes con el mismo nombre.
fr_fr: Chargez ce package dans Dynamo. Les autres packages portant le même nom seront automatiquement supprimés
it_it: Carica il pacchetto in Dynamo. Altri pacchetti con lo stesso nome verranno eliminati automaticamente
ja_jp: このパッケージを Dynamo にロードします。同じ名前を持つ他のパッケージは自動的に削除されます
ko_kr: 이 패키지를 Dynamo로 로드합니다. 동일한 이름을 가진 다른 패키지는 자동으로 삭제됩니다.
pl_pl: Wczytaj ten pakiet do dodatku Dynamo. Inne pakiety o tej samej nazwie zostaną automatycznie usunięte
pt_br: Carregue esse pacote no Dynamo. Os outros pacotes com o mesmo nome serão excluídos automaticamente
ru_ru: Загрузите этот пакет в Dynamo. Другие пакеты с таким же именем будут автоматически удалены.
zh_cn: 将此软件包加载到 Dynamo 中。将自动删除名称相同的其他软件包
zh_tw: 將此套件載入 Dynamo。有相同名稱的其他套件將自動刪除

# CannotLoadPackageMessageBoxTitle
source: Cannot Load Package
cs_cz: Balíček nelze načíst
de_de: Paket kann nicht geladen werden
es_es: No se puede cargar el paquete
fr_fr: Impossible de charger le package
it_it: Impossibile caricare il pacchetto
ja_jp: パッケージをロードできません
ko_kr: 패키지를 로드할 수 없음
pl_pl: Nie można wczytać pakietu
pt_br: Não é possível carregar o pacote
ru_ru: Не удалось загрузить пакет
zh_cn: 无法加载软件包
zh_tw: 無法載入套件
