Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# PythonZoomScaleTooltipText
source: Drag to adjust Python Editor zoom scale between 25% and 300%. You can also adjust this in Python Editor by pressing "Ctrl" and scrolling the mouse wheel.
cs_cz: Přetažením upravte měřítko zoomu editoru jazyka Python na 25 % až 300 %. Můžete to také upravit v editoru jazyka Python stisknutím klávesy Ctrl a otočením kolečka myši.
de_de: Passen Sie den Python-Editor-Zoomfaktor durch Ziehen auf einen Wert zwischen 25 % und 300 % an. Dies ist auch im Python-Editor möglich, indem Sie die STRG-Taste drücken und das Mausrad drehen.
es_es: Arrastre para ajustar la escala de zoom del editor de Python entre un 25 % y un 300 %. También puede ajustarla en el editor de Python si pulsa Ctrl y desplaza la rueda del ratón.
fr_fr: Faites glisser le curseur pour régler l'échelle de zoom de l'éditeur Python sur une valeur entre 25 % et 300 %. Vous pouvez également modifier cette valeur dans l'éditeur Python en appuyant sur "Ctrl" et en utilisant la molette de la souris.
it_it: Trascinare per regolare la scala di zoom dell'editor Python tra il 25% e il 300%. È inoltre possibile regolare questa impostazione nell'editor Python premendo CTRL e scorrendo la rotellina del mouse.
ja_jp: ドラッグして、Python エディタのズーム スケールを 25% ～ 300% の範囲で調整します。[Ctrl]を押しながらマウス ホイールをスクロールすると、Python エディタ内でも調整できます。
ko_kr: 끌어서 Python 편집기 줌 축척을 25%에서 300% 사이로 조정합니다. Python 편집기에서 'Ctrl' 키를 누르고 마우스 휠을 스크롤하여 조정할 수도 있습니다.
pl_pl: Przeciągnij, aby dostosować skalę powiększenia w edytorze języka Python w zakresie między 25% a 300%. Można to również dostosować w edytorze języka Python, naciskając klawisz CTRL i przewijając kółkiem myszy.
pt_br: Arraste para ajustar a escala de zoom do Editor Python entre 25% e 300%. Isso também pode ser ajustado no Editor Python pressionando “Ctrl” e rolando a roda do mouse.
ru_ru: Перетащите бегунок между значениями 25 и 300 %, чтобы настроить масштаб зумирования в редакторе Python. Это также можно сделать, нажав клавишу CTRL и прокрутив колесико мыши.
zh_cn: 拖动以在 25% 和 300% 范围之间调整 Python 编辑器缩放比例。在 Python 编辑器中，还可以通过按“Ctrl”键并滚动鼠标滚轮来调整该缩放比例。
zh_tw: 拖曳以在 25% 到 300% 之間調整 Python 編輯器的縮放比例。您也可以在 Python 編輯器中按 Ctrl 鍵並捲動滑鼠滾輪來調整。

# PreferencesViewLanguageSwitchHelp
source: Dynamo must be relaunched to apply the language selection.
cs_cz: Aby bylo možné použít výběr jazyka, je nutné aplikaci Dynamo spustit znovu.
de_de: Dynamo muss neu gestartet werden, damit die Sprachauswahl angewendet werden kann.
es_es: Es necesario reiniciar Dynamo para aplicar la selección de idioma.
fr_fr: Dynamo doit être relancé pour appliquer la sélection de langue.
it_it: È necessario riavviare Dynamo per applicare la selezione della lingua.
ja_jp: 言語の選択を適用するには、Dynamo を再起動する必要があります。
ko_kr: 선택한 언어를 적용하려면 Dynamo를 다시 시작해야 합니다.
pl_pl: Aby zastosować wybór języka, należy ponownie uruchomić dodatek Dynamo.
pt_br: O Dynamo deve ser reiniciado para aplicar a seleção de idioma.
ru_ru: Для применения выбранного языка необходимо перезапустить Dynamo.
zh_cn: 必须重新启动 Dynamo，才能应用语言选择。
zh_tw: 必須重新啟動 Dynamo，才能套用選取的語言。

# CustomColorPickerApplyBtn
source: Apply
cs_cz: Použít
de_de: Anwenden
es_es: Aplicar
fr_fr: Appliquer
it_it: Applica
ja_jp: 適用
ko_kr: 적용
pl_pl: Zastosuj
pt_br: Aplicar
ru_ru: Применить
zh_cn: 应用
zh_tw: 套用

# CustomColorPickerBasicColors
source: Basic colors:
cs_cz: Základní barvy:
de_de: Grundfarben:
es_es: Colores básicos:
fr_fr: Couleurs de base :
it_it: Colori di base:
ja_jp: 基本色:
ko_kr: 기본 색상:
pl_pl: Kolory podstawowe:
pt_br: Cores básicas:
ru_ru: Основные цвета:
zh_cn: 基本颜色:
zh_tw: 基本顏色:

# CustomColorPickerCancelBtn
source: Cancel
cs_cz: Storno
de_de: Abbrechen
es_es: Cancelar
fr_fr: Annuler
it_it: Annulla
ja_jp: キャンセル
ko_kr: 취소
pl_pl: Anuluj
pt_br: Cancelar
ru_ru: Отмена
zh_cn: 取消
zh_tw: 取消

# CustomColorPickerCustomColorBtn
source: Define Custom Colors
cs_cz: Definování vlastních barev
de_de: Benutzerdefinierte Farben definieren
es_es: Definir colores personalizados
fr_fr: Définir des couleurs personnalisées
it_it: Definisci colori personalizzati
ja_jp: カスタム色を定義
ko_kr: 사용자 지정 색상 정의
pl_pl: Definiuj kolory niestandardowe
pt_br: Definir cores personalizadas
ru_ru: Задать пользовательские цвета
zh_cn: 定义自定义颜色
zh_tw: 定義自訂顏色

# CustomColorPickerCustomColors
source: Custom colors:
cs_cz: Vlastní barvy:
de_de: Benutzerdefinierte Farben:
es_es: Colores personalizados:
fr_fr: Couleurs personnalisées :
it_it: Colori personalizzati:
ja_jp: カスタム色:
ko_kr: 사용자 지정 색상:
pl_pl: Kolory niestandardowe:
pt_br: Cores personalizadas:
ru_ru: Пользовательские цвета:
zh_cn: 自定义颜色:
zh_tw: 自訂顏色:

# CustomColorPickerTitle
source: Color
cs_cz: Barva
de_de: Farbe
fr_fr: Couleur
it_it: Colore
ja_jp: 色
ko_kr: 색상
pl_pl: Kolor
pt_br: Cor
ru_ru: Цвет
zh_cn: 颜色
zh_tw: 顏色

# PreferencesViewPythonEditorLable
source: Python Editor
cs_cz: Editor jazyka Python
es_es: Editor de Python
fr_fr: Éditeur Python
it_it: Editor Python
ja_jp: Python エディタ
ko_kr: Python 편집기
pl_pl: Edytor języka Python
pt_br: Editor Python
ru_ru: Редактор Python
zh_cn: Python 编辑器
zh_tw: Python 編輯器

# ChangeScaleFactorPromptUnitsNumberFormatCm
source: {0} cm
ru_ru: {0} см

# ChangeScaleFactorPromptUnitsNumberFormatM
source: {0} m
ru_ru: {0} м

# ChangeScaleFactorPromptUnitsNumberFormatMm
source: {0} mm
ru_ru: {0} мм

# InCanvasOrbitButtonToolTip
source: Orbit
de_de: Umkreisen
es_es: Órbita
fr_fr: Orbite
it_it: Orbita
ja_jp: オービット
ko_kr: 궤도
pl_pl: Orbita
pt_br: Órbita
ru_ru: Орбита
zh_cn: 动态观察
zh_tw: 環轉

# NullString
source: null
fr_fr: nul
pt_br: nulo
ru_ru: ноль
zh_cn: 空
zh_tw: 空

# StartPageReference
source: REFERENCE
de_de: REFERENZ
es_es: REFERENCIA
fr_fr: RÉFÉRENCE
it_it: RIFERIMENTO
ja_jp: 参考資料
ko_kr: 참조
pl_pl: ODNIESIENIE
pt_br: REFERÊNCIA
ru_ru: СПРАВКА
zh_cn: 参照
zh_tw: 參考

# GenericTaskDialogOptionOK
source: OK
es_es: Aceptar
ko_kr: 확인
ru_ru: ОК
zh_cn: 确定
zh_tw: 確定

# InfoBubbleInfo
source: Info
es_es: Información
fr_fr: Informations
it_it: Informazioni
ja_jp: 情報
ko_kr: 정보
pl_pl: Informacje
pt_br: Informações
ru_ru: Сведения
zh_cn: 信息
zh_tw: 資訊

# OKButton
source: OK
es_es: Aceptar
ko_kr: 확인
zh_cn: 确定
zh_tw: 確定

# PackageTypeShortString
source: PKG
es_es: Pqt
ja_jp: パッケージ
ko_kr: 패키지
zh_cn: 资料包

# DynamoViewDynamoMenu
source: _Dynamo
ja_jp: Dynamo(_D)
ko_kr: Dynamo(_D)
zh_cn: Dynamo(_D)
zh_tw: Dynamo(_D)
