Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# PreferencesViewShowRunPreviewTooltip
source: Switchable only when the current workspace is in Manual run mode.
cs_cz: V náhledu stavu provádění grafu jsou vodiče připojené k portům, které budou ovlivněny průběhem grafu, zvýrazněny oranžově. Toto nastavení je dostupné pouze v případě, že je aktuální pracovní prostor v režimu ručního spuštění.
de_de: Wenn eine Vorschau des Ausführungsstatus Ihres Diagramms angezeigt wird, werden Drähte, die mit Anschlüssen verbunden sind, die von einer Diagrammausführung betroffen sind, orange hervorgehoben. Diese Option ist nur verfügbar, wenn sich der aktuelle Arbeitsbereich im manuellen Ausführungsmodus befindet.
es_es: Para previsualizar el estado de ejecución del gráfico, los cables conectados a los puertos que se verán afectados por una ejecución del gráfico se resaltarán en naranja. Solo está disponible cuando el espacio de trabajo actual se encuentra en el modo de ejecución Manual.
fr_fr: Afin de prévisualiser l'état d'exécution de votre graphique, les fils connectés aux ports qui seront affectés par une exécution de graphique sont mis en surbrillance en orange. Cette option est uniquement disponible lorsque l'espace de travail actuel est en mode d'exécution manuelle.
it_it: Per visualizzare l'anteprima dello stato di esecuzione del grafico, i fili collegati alle porte che saranno interessate dall'esecuzione di un grafico sono evidenziati in arancione. Funzione disponibile solo quando l'area di lavoro corrente è in modalità di esecuzione Manuale.
ja_jp: グラフの実行状態をプレビューするには、グラフ実行の影響を受けるポートに接続されているワイヤをオレンジ色でハイライト表示します。現在のワークスペースが手動実行モードの場合にのみ使用できます。
ko_kr: 그래프의 실행 상태를 미리 볼 수 있도록 그래프 실행의 영향을 받는 포트에 연결된 와이어가 주황색으로 강조 표시됩니다. 현재 작업공간이 수동 실행 모드인 경우에만 사용할 수 있습니다.
pl_pl: Aby zapewnić podgląd stanu wykonania wykresu, przewody podłączone do portów, na które będzie miał wpływ przebieg wykresu, są wyróżnione na pomarańczowo. Dostępne tylko wtedy, gdy bieżący obszar roboczy jest w trybie uruchamiania ręcznego.
pt_br: Para visualizar o estado de execução do gráfico, os fios conectados às portas que serão afetadas por uma execução de gráfico são realçadas em laranja. Disponível somente quando o espaço de trabalho atual está no modo de execução Manual.
ru_ru: Для предварительного просмотра рабочего состояния графика провода, которые подсоединены к портам и задействуются в графике, выделяются оранжевым цветом. Функция доступна, только если текущее рабочее пространство находится в режиме запуска вручную.
zh_cn: 要预览图形的执行状态，已连接到将受图形运行所影响端口的导线以橙色亮显。仅在当前工作空间处于“手动”运行模式下时才可用。
zh_tw: 若要預覽圖表的執行狀態，受圖表執行影響的各個埠所連接的線路會以橘色亮顯。只有當目前工作區處於「手動」執行模式時才能使用。

# PersistentVisualStatusOfLinterIssues
source: Issues found
cs_cz: Nalezeny problémy
de_de: Probleme gefunden
es_es: Se han encontrado incidencias.
fr_fr: Problèmes trouvés
it_it: Problemi rilevati
ja_jp: 問題が見つかりました
ko_kr: 문제가 발견됨
pl_pl: Znaleziono problemy
pt_br: Problemas encontrados
ru_ru: Найдены проблемы
zh_cn: 发现的问题
zh_tw: 發現問題

# ContextSelectConnectedDownstream
source: Downstream
cs_cz: Po proudu
de_de: Nachgeschaltet
es_es: Descendente
fr_fr: En aval
it_it: A valle
ja_jp: 下流
ko_kr: 다운스트림
pl_pl: W kierunku podrzędnym
pt_br: A jusante
ru_ru: Последующий
zh_cn: 下游
zh_tw: 下游

# ContextSelectConnectedHeader
source: Select Connected
cs_cz: Vybrat připojené
de_de: Verbundene auswählen
es_es: Seleccionar conectados
fr_fr: Sélectionner les éléments connectés
it_it: Seleziona elementi collegati
ja_jp: 接続済みを選択
ko_kr: 연결된 항목 선택
pl_pl: Wybierz połączone
pt_br: Selecionar Conectado
ru_ru: Выбрать соединенные
zh_cn: 选择已连接
zh_tw: 選取連接的

# ContextSelectConnectedUpstream
source: Upstream
cs_cz: Proti proudu
de_de: Vorgeschaltet
es_es: Ascendente
fr_fr: En amont
it_it: A monte
ja_jp: 上流
ko_kr: 업스트림
pl_pl: W kierunku nadrzędnym
pt_br: A montante
ru_ru: Предшествующий
zh_cn: 上游
zh_tw: 上游

# ContextSelectConnectedUpstreamDownstream
source: Both
cs_cz: Obojí
de_de: Beides
es_es: Ambos
fr_fr: Les deux
it_it: Entrambi
ja_jp: 両方
ko_kr: 둘다
pl_pl: Obie opcje
pt_br: Ambos
ru_ru: В обоих направлениях
zh_cn: 两者
zh_tw: 兩者

# NodeRenamedLabel
source: Renamed
cs_cz: Přejmenovaný
de_de: Umbenannt
es_es: Renombrado
fr_fr: Renommé
it_it: Rinominato
ja_jp: 名前変更されました
ko_kr: 이름이 바뀜
pl_pl: Ze zmienioną nazwą
pt_br: Renomeado
ru_ru: Переименовано
zh_cn: 已重命名
zh_tw: 已更名

# PackagePathProtected
source: This path is built-in and cannot be modified.
cs_cz: Tato cesta je vestavěná a nelze ji upravit.
de_de: Dieser Pfad ist integriert und kann nicht geändert werden.
es_es: Esta ruta está integrada y no se puede modificar.
fr_fr: Ce chemin est intégré et ne peut pas être modifié.
it_it: Questo percorso è incorporato e non può essere modificato.
ja_jp: このパスは組み込みパスであり、修正できません。
ko_kr: 이 경로는 내장되어 있으므로 수정할 수 없습니다.
pl_pl: Ta ścieżka jest wbudowana i nie można jej modyfikować.
pt_br: Esse caminho é interno e não pode ser modificado.
ru_ru: Этот встроенный путь, и его нельзя изменить.
zh_cn: 此路径是内置路径，无法修改。
zh_tw: 此路徑是內建的，無法修改。

# PackagePathUpdatePathTooltip
source: Edit Path
cs_cz: Upravit cestu
de_de: Pfad bearbeiten
es_es: Editar ruta
fr_fr: Modifier le chemin
it_it: Modifica percorso
ja_jp: パスを編集
ko_kr: 경로 편집
pl_pl: Edytuj ścieżki
pt_br: Editar caminho
ru_ru: Редактировать путь
zh_cn: 编辑路径
zh_tw: 編輯路徑

# GetStartedGuide
source: _User Interface Tour
cs_cz: _Prohlídka uživatelského rozhraní
de_de: To_ur durch die Benutzeroberfläche
es_es: _Recorrido por la interfaz de usuario
fr_fr: Exploration de l'interface _utilisateur
it_it: Presentazione dell'interfaccia _utente
ja_jp: ユーザ インタフェース ツアー(_U)
ko_kr: 사용자 인터페이스 둘러보기(_U)
pl_pl: Przewodnik po interfejsie _użytkownika
pt_br: _Tour da interface do usuário
ru_ru: _Обзор пользовательского интерфейса
zh_cn: 用户界面导览(_U)
zh_tw: 使用者介面導覽(_U)

source: _Interactive Guides
cs_cz: _Interaktivní průvodce
de_de: Interaktiver _Leitfaden
es_es: _Guías interactivas
fr_fr: _Guides interactifs
it_it: _Guide interattive
ja_jp: インタラクティブ ガイド(_I)
ko_kr: 대화형 가이드(_I)
pl_pl: _Interaktywne podręczniki
pt_br: Guias i_nterativos
ru_ru: _Интерактивные руководства
zh_cn: 互动指南(_I)
zh_tw: 互動式指南(_I)

# GetStartedGuideLibraryText
source: The library contains all default functions #(nodes)=https://primer2.dynamobim.org/4_nodes_and_wires of Dynamo, as well as custom nodes you may have loaded. \n\nTo find a node, search the library or browse its categories.
cs_cz: Knihovna obsahuje #(uzly)=https://primer2.dynamobim.org/v/cs/4_nodes_and_wires všech výchozích funkcí aplikace Dynamo a dále vlastní uzly, které jste načetli. \n\nChcete-li najít určitý uzel, hledejte v knihovně nebo procházejte její kategorie.
de_de: Die Bibliothek enthält alle vorgegebenen Funktionen #(Blöcke)=https://primer2.dynamobim.org/v/de/4_nodes_and_wires von Dynamo sowie benutzerdefinierte Blöcke, die Sie möglicherweise geladen haben. \n\nDurchsuchen Sie die Bibliothek oder die entsprechenden Kategorien, um einen Block zu finden.
es_es: La biblioteca contiene todas las funciones por defecto #(nodos)=https://primer2.dynamobim.org/v/es/4_nodes_and_wires of Dynamo , así como los nodos personalizados que pueda haber cargado. \n\nPara localizar un nodo, busque en la biblioteca o examine sus categorías.
fr_fr: La bibliothèque contient toutes les fonctions par défaut #(noeuds)=https://primer2.dynamobim.org/v/fr/4_nodes_and_wires de Dynamo, ainsi que les noeuds personnalisés, si vous en avez chargés.\n\nPour localiser un noeud, effectuez une recherche dans la bibliothèque ou parcourez ses catégories.
it_it: La libreria contiene tutte le funzioni di default #(nodi)=https://primer2.dynamobim.org/v/it/4_nodes_and_wires di Dynamo ed eventuali nodi personalizzati caricati. \n\nPer trovare un nodo, cercare nella libreria o sfogliare le categorie corrispondenti.
ja_jp: ライブラリには、Dynamo のすべての既定の関数 #(ノード)=https://primer2.dynamobim.org/v/ja/4_nodes_and_wires やロードしたカスタム ノードが含まれています。\n\nノードを探すには、ライブラリを検索したりカテゴリを参照します。
ko_kr: 라이브러리에는 Dynamo의 모든 기본 함수 #(노드)=https://primer2.dynamobim.org/v/ko/4_nodes_and_wires 와 사용자가 로드했을 수도 있는 사용자 노드가 포함되어 있습니다. \n\n노드를 찾으려면 라이브러리를 검색하거나 해당 카테고리를 찾아보십시오.
pl_pl: Biblioteka zawiera wszystkie funkcje domyślne #(węzły)=https://primer2.dynamobim.org/v/pl/4_nodes_and_wires dodatku Dynamo oraz ewentualnie wczytane węzły niestandardowe. \n\nAby znaleźć węzeł, przeszukaj bibliotekę lub przejrzyj jej kategorie.
pt_br: A biblioteca contém todas as funções padrão #(nós)=https://primer2.dynamobim.org/v/pt-br/4_nodes_and_wires do Dynamo, bem como nós personalizados que você pode ter carregado. \n\nPara encontrar um nó, pesquise na biblioteca ou navegue em suas categorias.
ru_ru: Библиотека содержит все функции Dynamo по умолчанию #(узлы)=https://primer2.dynamobim.org/v/ru/4_nodes_and_wires , а также пользовательские узлы, которые вы могли загрузить. \n\nЧтобы найти узел, выполните поиск в библиотеке или по категориям.
zh_cn: 该库包含所有默认的 Dynamo 功能 #(节点)=https://primer2.dynamobim.org/v/zh-cn/4_nodes_and_wires ，以及可能已载入的自定义节点。\n\n要查找节点，请搜索库或浏览其类别。
zh_tw: 資源庫包含 Dynamo 所有預設的函數 #(節點)=https://primer2.dynamobim.org/v/zh-tw/4_nodes_and_wires ，以及您已載入的自訂節點。\n\n若要尋找節點，請搜尋資源庫或瀏覽其品類。

# GetStartedGuideLibraryTitle
source: Library
cs_cz: Knihovna
de_de: Bibliothek
es_es: Biblioteca
fr_fr: Bibliothèque
it_it: Libreria
ja_jp: ライブラリ
ko_kr: 라이브러리
pl_pl: Biblioteka
pt_br: Biblioteca
ru_ru: Библиотека
zh_cn: 库
zh_tw: 資源庫

# GetStartedGuidePreferencesText
source: Use Preferences to customize your Dynamo experience. \n\nYou can change language and time zone settings, adjust the visual style of your workspace, and more.
cs_cz: Na paletě Předvolby můžete přizpůsobit své prostředí aplikace Dynamo. \n\nJe možné změnit nastavení jazyka a časového pásma, upravit vizuální styl pracovního prostoru a mnohem více.
de_de: In den Voreinstellungen können Sie Ihre Dynamo-Erfahrung anpassen, von den Einstellungen für Sprache und Zeitzone bis hin zum visuellen Stil Ihres Arbeitsbereichs usw.
es_es: Utilice las Preferencias para personalizar su experiencia en Dynamo. \n\nPuede cambiar la configuración de idioma y de zona horaria, ajustar el estilo visual del espacio de trabajo, etc.
fr_fr: Dans la palette Préférences, vous pouvez personnaliser votre expérience Dynamo, des paramètres de langue et de fuseau horaire, aux styles visuels de votre espace de travail, et bien plus encore.
it_it: Utilizzare Preferenze per personalizzare l'esperienza di Dynamo. \n\nÈ possibile modificare le impostazioni della lingua e del fuso orario, regolare lo stile di visualizzazione dell'area di lavoro e altro ancora.
ja_jp: [基本設定]では Dynamo の操作性をカスタマイズできます。\n\n言語やタイムゾーンの設定を変更したり、ワークスペースの表示スタイルを調整することなどが可能です。
ko_kr: 기본 설정을 사용하여 Dynamo 경험을 사용자화하십시오. \n\n언어 및 시간대 설정을 변경하고 작업공간의 비주얼 스타일을 조정하는 등 다양한 작업을 수행할 수 있습니다.
pl_pl: Preferencje pozwalają dostosować środowisko dodatku Dynamo.\n\nDostępne są między innymi ustawienia języka, strefy czasowej oraz stylów wizualnych obszaru roboczego.
pt_br: Use as Preferências para personalizar a experiência do Dynamo. \n\nVocê pode alterar as configurações de idioma e fuso horário, ajustar o estilo visual do espaço de trabalho e muito mais.
ru_ru: Используйте палитру настроек, чтобы адаптировать интерфейс Dynamo. \n\n Можно менять настройки языка и часового пояса, корректировать визуальный стиль рабочего пространства и выполнять многое другое.
zh_cn: 使用“首选项”自定义 Dynamo 体验。\n\n可以更改语言和时区设置、调整工作空间的视觉样式等。
zh_tw: 使用「偏好」自訂 Dynamo 體驗。\n\n您可以變更語言和時區設定、調整工作區的視覺型式等等。

# GetStartedGuidePreferencesTitle
source: Preferences
cs_cz: Předvolby
de_de: Voreinstellungen
es_es: Preferencias
fr_fr: Préférences
it_it: Preferenze
ja_jp: 基本設定
ko_kr: 기본 설정
pl_pl: Preferencje
pt_br: Preferências
ru_ru: Настройки
zh_cn: 首选项
zh_tw: 偏好

# GetStartedGuideResourcesText
source: Use the Help menu to access tools and resources to help you get started. \n\nYou can explore sample scripts, browse the Dynamo Dictionary, find other guides, and more.
cs_cz: Pomocí nabídky Nápověda získáte přístup k nástrojům a zdrojům, které vám pomohou začít.\n\nMůžete si vybrat ukázkové skripty, používat slovník aplikace Dynamo a získat další informace.
de_de: Über das Hilfe-Menü können Sie auf Werkzeuge und Ressourcen zugreifen, die Ihnen den Einstieg erleichtern. \n\nSie können Beispielskripte ansehen, das Dynamo-Wörterbuch durchsuchen, diesen und andere Leitfäden nutzen und vieles mehr.
es_es: Utilice el menú Ayuda para acceder a herramientas y recursos que le ayudarán a empezar. \n\nPuede elegir secuencias de comandos de ejemplo, examinar el diccionario de Dynamo, buscar otras guías, etc.
fr_fr: Le menu Aide permet d'accéder aux outils et aux ressources qui vous aideront à vous familiariser avec le produit.\n\nDécouvrez des exemples de scripts, parcourez le dictionnaire Dynamo, trouvez d'autres guides, et bien plus encore.
it_it: Utilizzare il menu ? per accedere agli strumenti e alle risorse che consentono di iniziare a lavorare.\n\nÈ possibile scegliere script di esempio, esplorare il dizionario di Dynamo, trovare altre guide e molto altro.
ja_jp: [ヘルプ]メニューには Dynamo の使用開始に役立つツールやリソースが多数あります。\n\nサンプル スクリプトを入手したり、Dynamo ディクショナリを参照したり、さまざまな参考情報にアクセスすることなどができます。
ko_kr: 시작하는 데 도움이 되는 도구 및 리소스에 액세스하려면 도움말 메뉴를 사용하십시오. \n\n샘플 스크립트를 살펴보고, Dynamo 사전을 찾아보고, 다른 가이드를 찾아보는 등 많은 작업을 수행할 수 있습니다.
pl_pl: Menu Pomoc zapewnia dostęp do narzędzi i zasobów ułatwiających rozpoczęcie pracy.\n\nObejmują one między innymi skrypty przykładowe, słownik dodatku Dynamo oraz inne przewodniki.
pt_br: Use o menu Ajuda para acessar ferramentas e recursos que vão ajudar você a dar os primeiros passos. \n\nÉ possível explorar scripts de amostra, navegar no Dicionário do Dynamo, localizar outros guias e muito mais.
ru_ru: Используйте меню «Справка» для доступа к инструментам и ресурсам, которые помогут начать работу. \n\nМожно изучить примеры сценариев, найти словарь Dynamo, выполнить поиск других руководств и т.д.
zh_cn: 使用“帮助”菜单访问工具和资源，以帮助您快速入门。\n\n可以探索样例脚本、浏览 Dynamo 词典、查找其他指南等。
zh_tw: 使用「說明」功能表可存取工具和資源，以協助您開始使用。\n\n您可以探索範例指令碼、瀏覽 Dynamo 字典、尋找其他指南等等。

# GetStartedGuideResourcesTitle
source: Resources
cs_cz: Zdroje
de_de: Ressourcen
es_es: Recursos
fr_fr: Ressources
it_it: Risorse
ja_jp: リソース
ko_kr: 리소스
pl_pl: Materiały
pt_br: Recursos
ru_ru: Ресурсы
zh_cn: 资源
zh_tw: 資源

# GetStartedGuideRunStatusBarText
source: Use the Run Status Bar to run a Dynamo graph (a script that contains the logic or algorithm). \n\nYou can select your preferred run type: -Automatic: The graph runs each time you make a change.- -Manual: The graph runs only when you click Run-
cs_cz: Pomocí stavového řádku spuštění můžete spouštět grafy aplikace Dynamo a vybírat mezi automatickým a ručním spouštěním. \n\nVýběrem automatického spuštění nastavíte, že graf se spustí pokaždé, když provedete změnu. Výběr ručního spuštění znamená, že graf se spustí pouze po kliknutí na tlačítko Spustit.
de_de: Verwenden Sie die Ausführungsstatusleiste, um ein Dynamo-Diagramm auszuführen. (Dabei handelt es sich um ein Skript, das die Logik oder den Algorithmus enthält.) \n\nSie können den Ausführungstyp festlegen: -Automatisch: Das Diagramm wird nach jeder Änderung ausgeführt.- -Manuell: Das Diagramm wird nur ausgeführt, wenn Sie auf Ausführen klicken.-
es_es: Utilice la barra de estado de ejecución para ejecutar un gráfico de Dynamo (una secuencia de comandos que contiene la lógica o el algoritmo). \n\nPuede seleccionar el tipo de ejecución que prefiera: -Automático: el gráfico se ejecuta cada vez que realiza un cambio.- -Manual: el gráfico se ejecuta solo cuando hace clic en Ejecutar.-
fr_fr: L'option Exécuter la barre d'état permet d'exécuter un graphique Dynamo (un script contenant la logique ou l'algorithme). \n\nSi vous sélectionnez l'option Automatique, votre graphique s'exécutera à chaque fois que vous apportez une modification. Si vous sélectionnez l'option Manuelle, il ne s'exécutera que lorsque vous cliquerez sur le bouton Exécuter.
it_it: Utilizzare Esegui barra di stato per eseguire i grafici di Dynamo (un script che contiene la logica o l'algoritmo). \n\nÈ possibile selezionare il tipo di esecuzione preferito: -Automatico: il grafico verrà eseguito ogni volta che si apporta una modifica.- -Manuale: il grafico verrà eseguito solo quando si fa clic su Esegui-
ja_jp: [ステータス バーを実行]ボタンは、Dynamo グラフ(ロジックまたはアルゴリズムを含んだスクリプト)を実行するために使用します。\n\n自動か手動のいずれかの実行タイプを選択できます。 -自動: グラフは変更を加えるたびに実行されます- -手動: グラフは[実行]をクリックしたときにのみ実行されます-
ko_kr: 실행 상태 막대를 사용하여 Dynamo 그래프(논리나 알고리즘이 포함된 스크립트)를 실행합니다. \n\n원하는 실행 유형을 선택할 수 있습니다. -자동: 변경될 때마다 그래프가 실행됩니다.- -수동: 실행을 클릭한 경우에만 그래프가 실행됩니다.-
pl_pl: Użyj paska stanu uruchamiania, aby uruchomić wykres programu Dynamo (skrypt zawierający działania logiczne lub algorytm). \n\nMożna wybrać preferowany sposób uruchamiania: -Automatycznie — wykres jest uruchamiany po każdym wprowadzeniu zmiany.- -Ręcznie — wykres jest uruchamiany tylko po wybraniu przycisku Uruchom.-
pt_br: Use a Barra de status de execução para executar um gráfico do Dynamo (um script que contenha a lógica ou o algoritmo). \n\nÉ possível selecionar seu tipo de execução preferido: -Automático: o gráfico é executado sempre que for feita uma alteração.- -Manual: o gráfico é executado somente quando for selecionado o botão Executar-
ru_ru: Используйте строку состояния запуска для выполнения графика Dynamo (сценария, в котором содержится логика или алгоритм). \n\nМожно выбрать желаемый тип запуска: -«Автоматически»: график будет запускаться каждый раз при внесении изменения.- -«Вручную»: график будет запущен только при нажатии кнопки «Запуск».-
zh_cn: 使用“运行状态栏”运行 Dynamo 图形(包含逻辑或算法的脚本)。\n\n可以选择首选的运行类型: -自动: 图形将在每次进行更改时运行。- -手动: 图形将仅在单击“运行”时运行-
zh_tw: 使用「執行狀態列」執行 Dynamo 圖表 (這是一個包含邏輯或演算法的指令碼)。\n\n您可以選擇偏好的執行類型: -自動: 每次您做變更，圖表就會執行。- -手動: 只有在您選取「執行」時，圖表才會執行。-

# GetStartedGuideRunStatusBarTitle
source: Run Status Bar
cs_cz: Stavový řádek spuštění
de_de: Ausführungsstatusleiste
es_es: Barra de estado de ejecución
fr_fr: Exécuter la barre d'état
it_it: Esegui barra di stato
ja_jp: ステータス バーを実行
ko_kr: 실행 상태 막대
pl_pl: Pasek stanu uruchamiania
pt_br: Barra de status de execução
ru_ru: Строка состояния запуска
zh_cn: 运行状态栏
zh_tw: 執行狀態列

# GetStartedGuideToolbarText
source: From the toolbar, you can: -Open a new workspace- -Open a saved Dynamo file- -Save your current Dynamo file- -Undo or redo changes-
cs_cz: Pomocí panelu nástrojů můžete: -Otevřít nový pracovní prostor- -Otevřít uložený soubor aplikace Dynamo- -Uložit aktuální soubor aplikace Dynamo- -Vrátit zpět nebo znovu provést změny-
de_de: Im Werkzeugkasten können Sie Folgendes tun: -Neuen Arbeitsbereich öffnen- -Gespeicherte Dynamo-Datei öffnen- -Aktuelle Dynamo-Datei speichern- -Änderungen rückgängig machen oder wiederherstellen-
es_es: En la barra de herramientas, puede realizar lo siguiente: -Abrir un nuevo espacio de trabajo.- -Abrir un archivo de Dynamo guardado.- -Guardar el archivo de Dynamo actual.- -Deshacer o rehacer cambios.-
fr_fr: Depuis la barre d'outils, vous pouvez: -Ouvrir un nouvel espace de travail- -Ouvrir un fichier Dynamo enregistré- -Enregistrer le fichier Dynamo actuel- -Annuler ou rétablir les modifications-
it_it: Dalla barra degli strumenti è possibile: -Aprire una nuova area di lavoro- -Aprire un file di Dynamo salvato- -Salvare il file di Dynamo corrente- -Annullare o ripetere le modifiche-
ja_jp: ツールバーから次の操作が可能です。 -新しいワークスペースを開く- -保存した Dynamo ファイルを開く- -現在の Dynamo ファイルを保存する- -変更を元に戻す、またはやり直す-
ko_kr: 도구막대에서 다음을 수행할 수 있습니다. -새 작업공간 열기- -저장된 Dynamo 파일 열기- -현재 Dynamo 파일 저장- -변경 사항 실행 취소 또는 다시 실행-
pl_pl: Funkcje paska narzędzi: -Otwieranie nowego obszaru roboczego- -Otwieranie zapisanego pliku dodatku Dynamo- -Zapisywanie bieżącego plik dodatku Dynamo- -Cofanie i ponowne wykonywanie zmian-
pt_br: Na barra de ferramentas, é possível: -Abrir um novo espaço de trabalho- -Abrir um arquivo salvo do Dynamo- -Salvar o arquivo atual do Dynamo- -Desfazer ou refazer alterações-
ru_ru: На панели инструментов можно выполнить следующие действия: -открыть новое рабочее пространство;- -открыть сохраненный файл Dynamo;- -сохранить текущий файл Dynamo;- -отменить или повторить изменения.-
zh_cn: 通过工具栏，可以: -打开新工作空间- -打开保存的 Dynamo 文件- -保存当前的 Dynamo 文件- -撤消或重做更改-
zh_tw: 從工具列，您可以: -開啟新工作區- -開啟儲存的 Dynamo 檔案- -儲存目前的 Dynamo 檔案- -退回或重做變更-

# GetStartedGuideToolbarTitle
source: Toolbar
cs_cz: Panel nástrojů
de_de: Werkzeugkasten
es_es: Barra de herramientas
fr_fr: Barre d'outils
it_it: Barra degli strumenti
ja_jp: ツールバー
ko_kr: 도구막대
pl_pl: Pasek narzędzi
pt_br: Barra de ferramentas
ru_ru: Панель инструментов
zh_cn: 工具栏
zh_tw: 工具列

# GetStartedGuideWelcomeText
source: Start your visual programming journey with this short guide. \n\nHere you'll learn some basics about the Dynamo interface and features.
cs_cz: V tomto výukovém programu se podívejte na základy vizuálního programování. \n\nSeznámíte se zde s uživatelským rozhraním a funkcemi aplikace Dynamo.
de_de: Mit dieser kurzen Tour erfahren Sie mehr über den Einstieg in die visuelle Programmierung. \n\nHier lernen Sie die Grundlagen der Dynamo-Benutzeroberfläche und der Funktionen kennen.
es_es: Comience su recorrido por la programación visual con esta breve guía. \n\nAquí aprenderá algunos conceptos básicos sobre la interfaz y las funciones de Dynamo.
fr_fr: Suivez une courte visite guidée pour découvrir les fonctions et l'interface de Dynamo. \n\nFamiliarisez-vous avec la programmation visuelle.
it_it: Iniziare il viaggio nella programmazione visiva con questa breve guida. \n\nSaranno fornite alcune nozioni di base sull'interfaccia e sulle funzionalità di Dynamo.
ja_jp: この短いガイドを参考にビジュアル プログラミングを始めましょう。\n\nこのガイドでは、Dynamo のインタフェースと機能の基礎を学習できます。
ko_kr: 간단한 이 가이드를 통해 시각적 프로그래밍 여정을 시작하십시오. \n\n여기서 Dynamo 인터페이스와 기능에 대한 몇 가지 기본 사항을 알아볼 수 있습니다.
pl_pl: Ten krótki przewodnik pozwala zapoznać się z podstawami programowania wizualnego. \n\nDzięki niemu poznasz podstawy interfejsu i funkcji dodatku Dynamo.
pt_br: Comece sua jornada de programação visual com este tour curto. \n\nAqui, você vai conhecer alguns conceitos básicos sobre a interface e os recursos do Dynamo.
ru_ru: Начните изучение визуального программирования с этого краткого руководства. \n\nВ нем представлены основные сведения о работе с интерфейсом и функциях Dynamo.
zh_cn: 使用此简短指南，开始可视化编程之旅。\n\n在此处，您将了解有关 Dynamo 界面和功能的一些基础知识。
zh_tw: 透過這份簡短的指南，開始了解視覺程式設計。\n\n在這裡，您將學習有關 Dynamo 介面和功能的一些基礎知識。

# GetStartedGuideWelcomeTitle
source: Welcome To Dynamo
cs_cz: Vítejte v aplikaci Dynamo
de_de: Willkommen bei Dynamo
es_es: Bienvenido a Dynamo
fr_fr: Bienvenue dans Dynamo
it_it: Dynamo
ja_jp: Dynamo へようこそ
ko_kr: Dynamo 시작
pl_pl: Witamy w dodatku Dynamo
pt_br: Bem-Vindo ao Dynamo
ru_ru: Добро пожаловать в Dynamo
zh_cn: 欢迎使用 Dynamo
zh_tw: 歡迎使用 Dynamo

# ContextMenuGroups
source: Groups
cs_cz: Skupiny
de_de: Gruppen
es_es: Grupos
fr_fr: Groupes
it_it: Gruppi
ja_jp: グループ
ko_kr: 그룹
pl_pl: Grupy
pt_br: Grupos
ru_ru: Группы
zh_cn: 组
zh_tw: 群組

# ContextPinToNode
source: Pin to node
cs_cz: Připnout k uzlu
de_de: An Block fixieren
es_es: Bloquear en nodo
fr_fr: Épingler au noeud
it_it: Blocca a nodo
ja_jp: ノードに固定
ko_kr: 노드에 고정
pl_pl: Przypnij do węzła
pt_br: Fixar ao nó
ru_ru: Закрепить в узле
zh_cn: 固定到节点
zh_tw: 固定到節點

# GetStartedGuideRatingTextTitle
source: Rate this guide
cs_cz: Ohodnotit tuto příručku
de_de: Diesen Leitfaden bewerten
es_es: Valorar esta guía
fr_fr: Évaluer ce guide
it_it: Valuta questa guida
ja_jp: このガイドを評価
ko_kr: 이 가이드 평가
pl_pl: Oceń ten podręcznik
pt_br: Classificar este guia
ru_ru: Оценить это руководство
zh_cn: 评价本手册
zh_tw: 對本指南評分
