Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# MessageLoadBuiltInPackage
source: To load the built-in package {1}, {0} needs to first delete any conflicting packages. Delete the following packages: {2}?
cs_cz: Chcete-li načíst vestavěný balíček {1}, aplikace {0} musí nejprve odstranit všechny konfliktní balíčky. Odstranit následující balíčky: {2}?
de_de: Um das integrierte Paket {1} zu laden, müssen für {0} zunächst alle in Konflikt stehenden Pakete gelöscht werden. Folgende Pakete löschen: {2}?
es_es: Para cargar el paquete integrado {1}, {0} debe suprimir primero los paquetes en conflicto. ¿Desea suprimir los siguientes paquetes {2}?
fr_fr: Pour charger le package intégré {1}, {0} doit d'abord supprimer les packages en conflit. Supprimer les packages suivants: {2}?
it_it: Per caricare il pacchetto incorporato {1}, {0} deve prima eliminare eventuali pacchetti in conflitto. Eliminare i seguenti pacchetti: {2}?
ja_jp: 組み込みパッケージ {1} をロードするには、まず {0} で競合するパッケージをすべて削除する必要があります。 次のパッケージを削除しますか: {2}?
ko_kr: 내장 패키지 {1}을(를) 로드하려면 {0}에서 충돌하는 패키지를 먼저 삭제해야 합니다. 패키지 {2}을(를) 삭제하시겠습니까?
pl_pl: Aby wczytać wbudowany pakiet {1}, program {0} musi najpierw usunąć wszystkie pakiety powodujące konflikt. Czy usunąć następujące pakiety: {2}?
pt_br: Para carregar o pacote interno {1}, o {0} precisa primeiro excluir todos os pacotes conflitantes. Exclua os seguintes pacotes: {2}?
ru_ru: Для загрузки встроенного пакета {1} приложению {0} необходимо сначала удалить все конфликтующие пакеты. Удалить следующие пакеты: {2}?
zh_cn: 要加载内置软件包 {1}，{0} 需要先删除任何冲突的软件包。 是否删除以下软件包: {2}？
zh_tw: 若要載入內建套件 {1}，{0} 必須先刪除任何衝突的套件。 是否刪除以下套件: {2}？

# MessageLoadBuiltInWithRestartPackage
source: To load the built-in package {1}, {0} needs to first delete any conflicting packages. Restart {0} to complete the deletion, then try and load the built-in pacakge again. Delete the following packages: {2}?
cs_cz: Chcete-li načíst vestavěný balíček {1}, aplikace {0} musí nejprve odstranit všechny konfliktní balíčky. Restartujte aplikaci {0}, aby se odstranění dokončilo, a poté zkuste znovu načíst vestavěný balíček. Odstranit následující balíčky: {2}?
de_de: Um das integrierte Paket {1} zu laden, müssen für {0} zunächst alle in Konflikt stehenden Pakete gelöscht werden. Starten Sie {0} neu, um den Löschvorgang abzuschließen, und versuchen Sie dann erneut, das integrierte Paket zu laden. Folgende Pakete löschen: {2}?
es_es: Para cargar el paquete integrado {1}, {0} debe suprimir primero los paquetes en conflicto. Reinicie {0} para completar la supresión y, a continuación, intente cargar de nuevo el paquete integrado. ¿Desea suprimir los siguientes paquetes {2}?
fr_fr: Pour charger le package intégré {1}, {0} doit d'abord supprimer tous les packages en conflit. Redémarrez {0} pour terminer la suppression, puis réessayez de charger le package intégré. Supprimer les packages suivants: {2}?
it_it: Per caricare il pacchetto incorporato {1}, {0} deve prima eliminare eventuali pacchetti in conflitto. Riavviare {0} per completare l'eliminazione, quindi provare a caricare nuovamente il pacchetto incorporato. Eliminare i seguenti pacchetti: {2}?
ja_jp: 組み込みパッケージ {1} をロードするには、まず {0} で競合するパッケージをすべて削除する必要があります。 {0} を再起動して削除を完了してから、組み込みパッケージを再ロードしてみてください。 次のパッケージを削除しますか: {2}?
ko_kr: 내장 패키지 {1}을(를) 로드하려면 먼저 {0}에서 충돌하는 패키지를 삭제해야 합니다. 삭제를 완료하려면 {0}을(를) 다시 시작한 다음 내장 패키지를 다시 로드해 보십시오. 패키지 {2}을(를) 삭제하시겠습니까?
pl_pl: Aby wczytać wbudowany pakiet {1}, program {0} musi najpierw usunąć wszystkie pakiety powodujące konflikt. Uruchom ponownie program {0}, aby zakończyć usuwanie, a następnie spróbuj ponownie wczytać wbudowany pakiet. Czy usunąć następujące pakiety: {2}?
pt_br: Para carregar o pacote interno {1}, o {0} precisa primeiro excluir todos os pacotes conflitantes. Reinicie o {0} para concluir a exclusão e, em seguida, tente carregar o pacote interno novamente. Exclua os seguintes pacotes: {2}?
ru_ru: Для загрузки встроенного пакета {1} приложению {0} необходимо сначала удалить все конфликтующие пакеты. Перезапустите {0} для завершения удаления, а затем попробуйте снова загрузить встроенный пакет. Удалить следующие пакеты: {2}?
zh_cn: 要加载内置软件包 {1}，{0} 需要先删除任何冲突的软件包。 重新启动 {0} 以完成删除，然后再次尝试加载内置软件包。 是否删除以下软件包: {2}？
zh_tw: 若要載入內建套件 {1}，{0} 必須先刪除任何衝突的套件。 請重新啟動 {0} 完成刪除，然後嘗試再次載入內建套件。 是否刪除以下套件: {2}？

# GraphIssuesOnSavePath_Description
source: The selected save location path is too long. Please change the save location and try again.
cs_cz: Vybraná cesta umístění uložení je příliš dlouhá. Změňte umístění uložení a zkuste to znovu.
de_de: Der zum Speichern ausgewählte Pfad ist zu lang. Ändern Sie den Speicherort, und versuchen Sie es erneut.
es_es: La ruta de ubicación de almacenamiento seleccionada es demasiado larga. Cambie la ubicación de almacenamiento e inténtelo de nuevo.
fr_fr: Le chemin d'accès à l'emplacement d'enregistrement sélectionné est trop long. Veuillez changer d'emplacement et réessayer.
it_it: Il percorso di salvataggio selezionato è troppo lungo. Modificare il percorso di salvataggio e riprovare.
ja_jp: 選択した保存場所のパスが長すぎます。保存場所を変更して、もう一度試してください。
ko_kr: 선택한 저장 위치 경로가 너무 깁니다. 저장 위치를 변경하고 다시 시도하십시오.
pl_pl: Wybrana ścieżka lokalizacji zapisu jest zbyt długa. Zmień lokalizację zapisu i spróbuj ponownie.
pt_br: O caminho de localização de salvamento selecionado é muito longo. Altere o local de salvamento e tente novamente.
ru_ru: Слишком длинный путь к выбранной для сохранения папке. Измените папку и повторите попытку.
zh_cn: 选定的保存位置路径太长。请更改保存位置，然后重试。
zh_tw: 選取的儲存位置路徑太長。請變更儲存位置，然後再試一次。

# GraphIssuesOnSavePath_Summary
source: You are trying to save a graph with a path that is too long.
cs_cz: Pokoušíte se uložit graf s příliš dlouhou cestou.
de_de: Sie versuchen, ein Diagramm mit einem zu langen Pfad zu speichern.
es_es: Está intentando guardar un gráfico con una ruta demasiado larga.
fr_fr: Vous essayez d'enregistrer un graphique dont le chemin est trop long.
it_it: Si sta tentando di salvare un grafico con un percorso troppo lungo.
ja_jp: 長すぎるパスを使用してグラフを保存しようとしています。
ko_kr: 너무 긴 경로를 사용하여 그래프를 저장하려고 합니다.
pl_pl: Próbujesz zapisać wykres ze zbyt długą ścieżką.
pt_br: Você está tentando salvar um gráfico com um caminho muito longo.
ru_ru: Слишком длинный путь сохраняемого графика.
zh_cn: 您正在尝试保存路径太长的图形。
zh_tw: 您嘗試儲存圖表的路徑太長。

# GraphIssuesOnSavePath_Title
source: Save Path Issues Found
cs_cz: Byly nalezeny problémy s cestou uložení
de_de: Probleme mit Speicherpfad gefunden
es_es: Se han encontrado problemas de ruta de almacenamiento
fr_fr: Problèmes d'enregistrement de chemin détectés
it_it: Trovati problemi relativi al percorso di salvataggio
ja_jp: 保存パスの問題が見つかりました
ko_kr: 발견된 경로 문제 저장
pl_pl: Znaleziono problemy z zapisywaniem ścieżki
pt_br: Encontrados problemas no caminho de salvamento
ru_ru: Обнаружены ошибки при сохранении пути
zh_cn: 发现保存路径问题
zh_tw: 儲存路徑有問題

# MessageNeedToRestartAfterUnload
source: {0} and its host application must restart before unload takes effect.
cs_cz: Aplikace {0} a její hostitelská aplikace musí být restartovány, aby se uvolnění projevilo.
de_de: {0} und die zugehörige Host-Anwendung müssen neu gestartet werden, bevor das Entfernen wirksam wird.
es_es: {0} y su aplicación host deben reiniciarse antes de que se aplique la descarga.
fr_fr: {0} et son application hôte doivent redémarrer avant que le déchargement ne prenne effet.
it_it: {0} e la relativa applicazione host devono essere riavviati prima che avvenga lo scaricamento.
ja_jp: {0} とそのホスト アプリケーションは、ロード解除を有効にする前に再起動する必要があります。
ko_kr: {0} 및 해당 호스트 응용프로그램을 다시 시작해야 언로드가 적용됩니다.
pl_pl: Aby usunięcie z pamięci zostało uwzględnione, należy ponownie uruchomić program {0} i jego aplikację hosta.
pt_br: O {0} e seu aplicativo host devem ser reiniciados antes que o descarregamento seja efetivado.
ru_ru: Выгрузка вступит в силу после перезапуска {0} и основного приложения.
zh_cn: {0} 及其宿主应用程序必须重新启动，卸载才会生效。
zh_tw: {0} 及其主應用程式必須重新啟動，卸載才會生效。

# MessageNeedToRestartAfterUnloadTitle
source: Unloading Package
cs_cz: Uvolnění balíčku
de_de: Paket wird entfernt
es_es: Descarga del paquete
fr_fr: Déchargement du package
it_it: Scaricamento del pacchetto
ja_jp: パッケージをロード解除中
ko_kr: 패키지 언로드
pl_pl: Usuwanie pakietu z pamięci
pt_br: Descarregar pacote
ru_ru: Выгрузка пакета
zh_cn: 正在卸载软件包
zh_tw: 卸載套件

# MessageFailedToUnload
source: {0} failed to unload the package.
cs_cz: Aplikaci {0} se nepodařilo uvolnit balíček.
de_de: Entfernen des Pakets für {0} nicht möglich.
es_es: {0} no ha podido descargar el paquete.
fr_fr: {0} n'a pas pu décharger le package.
it_it: Impossibile scaricare il pacchetto in {0}.
ja_jp: {0} はパッケージのロード解除に失敗しました。
ko_kr: {0}에서 패키지를 언로드하지 못했습니다.
pl_pl: Program {0} nie może usunąć pakietu z pamięci
pt_br: Ocorreu uma falha em {0} ao descarregar o pacote.
ru_ru: {0} не удалось выгрузить пакет.
zh_cn: {0} 无法卸载软件包。
zh_tw: {0} 無法卸載套件。

# UnloadFailureMessageBoxTitle
source: Unload Failure
cs_cz: Uvolnění se nezdařilo
de_de: Fehler beim Entfernen
es_es: Error al descargar
fr_fr: Échec du déchargement
it_it: Errore di scaricamento
ja_jp: ロード解除失敗
ko_kr: 언로드 실패
pl_pl: Niepowodzenie usuwania z pamięci
pt_br: Falha ao descarregar
ru_ru: Сбой при выгрузке
zh_cn: 卸载失败
zh_tw: 卸載失敗

# DynamoViewViewMenuConnectorShowTooltip
source: Show _Tooltip
cs_cz: Zobrazit _popisek
de_de: _QuickInfo anzeigen
es_es: Mostrar _información de herramientas
fr_fr: _Afficher l'info-bulle
it_it: Mostra _descrizione comando
ja_jp: ツールチップを表示(_T)
ko_kr: 툴팁 표시(_T)
pl_pl: P_okaż etykietę narzędzi
pt_br: _Mostrar dica de ferramenta
ru_ru: Показать п_одсказку
zh_cn: 显示工具提示(_T)
zh_tw: 展示工具提示(_T)

# NodeInformationalStateDismissedAlerts
source: Dismissed Alerts
cs_cz: Zavřená upozornění
de_de: Verworfene Warnungen
es_es: Alertas descartadas
fr_fr: Alertes ignorées
it_it: Avvisi ignorati
ja_jp: 却下された警告
ko_kr: 해제한 경고
pl_pl: Odrzucone alerty
pt_br: Alertas ignorados
ru_ru: Закрытые оповещения
zh_cn: 已关闭的警告
zh_tw: 關閉的警示

# ContextMenu
source: Node Options
cs_cz: Možnosti uzlu
de_de: Blockoptionen
es_es: Opciones de nodo
fr_fr: Options de noeud
it_it: Opzioni nodo
ja_jp: ノード オプション
ko_kr: 노드 옵션
pl_pl: Opcje węzła
pt_br: Opções de nó
ru_ru: Параметры узла
zh_cn: 节点选项
zh_tw: 節點選項

# NodeAutocomplete
source: Sort results by
cs_cz: Seřadit výsledky podle
de_de: Ergebnisse sortieren nach
es_es: Ordenar resultados por
fr_fr: Trier les résultats par
it_it: Ordina risultati per
ja_jp: 結果のソート基準
ko_kr: 결과 정렬 기준
pl_pl: Sortuj wyniki według
pt_br: Classificar resultados por
ru_ru: Сортировать результаты по
zh_cn: 结果排序依据
zh_tw: 結果排序依據

# PackageFilter_Name_All
source: All
cs_cz: Vše
de_de: Alle
es_es: Todo
fr_fr: Tout
it_it: Tutti
ja_jp: すべて
ko_kr: 모두
pl_pl: Wszystko
pt_br: Tudo
ru_ru: Все
zh_cn: 全部
zh_tw: 全部

# PackageSearchHeader
source: Search for packages
cs_cz: Vyhledat balíčky
de_de: Nach Paketen suchen
es_es: Buscar paquetes
fr_fr: Rechercher des packages
it_it: Ricerca pacchetti
ja_jp: パッケージを検索
ko_kr: 패키지 검색
pl_pl: Wyszukiwanie pakietów
pt_br: Procurar pacotes
ru_ru: Поиск пакетов
zh_cn: 搜索软件包
zh_tw: 搜尋套件

# DisablePackageInstallIconTooltip
source: All custom package paths have been disabled in Preferences. Packages cannot be installed unless they are re-enabled.
cs_cz: Všechny vlastní cesty balíčků byly v předvolbách zakázány. Balíčky nelze nainstalovat, dokud je znovu neaktivujete.
de_de: Alle benutzerdefinierten Paketpfade wurden in den Voreinstellungen deaktiviert. Pakete können nur installiert werden, wenn sie erneut aktiviert werden.
es_es: Todas las rutas de paquetes personalizadas se han desactivado en Preferencias. Los paquetes no se podrán instalar a menos que se vuelvan a activar.
fr_fr: Tous les chemins d'accès aux packages personnalisés ont été désactivés dans les préférences. Impossible d'installer les packages s'ils ne sont pas réactivés
it_it: Tutti i percorsi dei pacchetti personalizzati sono stati disattivati in Preferenze. I pacchetti possono essere installati solo se sono riattivati.
ja_jp: すべてのカスタム パッケージ パスが[基本設定]で無効になっています。再び有効にしない限り、パッケージはインストールできません。
ko_kr: 기본 설정에서 모든 사용자 패키지 경로가 비활성화되었습니다. 패키지를 다시 활성화하지 않으면 패키지를 설치할 수 없습니다.
pl_pl: Wszystkie ścieżki pakietów niestandardowych zostały wyłączone w preferencjach. Pakietów nie można zainstalować, dopóki nie zostaną one ponownie włączone.
pt_br: Todos os caminhos de pacotes personalizados foram desativados em Preferências. Os pacotes não podem ser instalados, a não ser que sejam reativados.
ru_ru: Все пользовательские пути к пакетам были отключены в настройках. Пакеты нельзя установить, если они не включены повторно.
zh_cn: 所有自定义软件包路径已在“首选项”中禁用。除非重新启用这些软件包，否则无法安装它们。
zh_tw: 所有自訂套件路徑都已在「偏好」中停用。除非重新啟用，否則無法安裝套件。

# DisableBuiltInPackageToggleInfo
source: If the toggle is on, built-in packages will not load on restart. Built-in packages that are currently loaded will be unloaded on restart. If the toggle is off built-in packages that are not already loaded will load once the preferences dialog is closed.
cs_cz: Pokud je přepínač zapnutý, vestavěné balíčky se nenačtou při restartu. Vestavěné balíčky, které jsou právě načteny, budou uvolněny při restartu. Pokud je přepínač vypnutý, načtou se i po zavření dialogu předvoleb.
de_de: Wenn diese Option aktiviert ist, werden integrierte Pakete bei einem Neustart nicht geladen. Integrierte Pakete, die derzeit geladen sind, werden bei einem Neustart entfernt. Wenn die Option deaktiviert ist, werden noch nicht geladene integrierte Pakete geladen, sobald das Dialogfeld Voreinstellungen geschlossen wird.
es_es: Si el conmutador está activado, los paquetes integrados no se cargarán al reiniciar. Los paquetes integrados que estén cargados actualmente se descargarán al reiniciar. Si el conmutador está desactivado, los paquetes integrados que aún no estén cargados se cargarán una vez cerrado el cuadro de diálogo de preferencias.
fr_fr: Si la bascule est activée, les packages intégrés ne seront pas chargés au redémarrage. Les packages intégrés actuellement chargés seront déchargés au redémarrage. Si la bascule est désactivée, les packages intégrés qui ne sont pas déjà chargés seront chargés une fois la boîte de dialogue des préférences fermée.
it_it: Se il pulsante di commutazione è attivato, i pacchetti incorporati non verranno caricati al riavvio. I pacchetti incorporati attualmente caricati verranno scaricati al riavvio. Se il pulsante di commutazione è disattivato, i pacchetti incorporati che non sono già caricati verranno caricati alla chiusura della finestra di dialogo delle preferenze.
ja_jp: オンの場合、組み込みパッケージは再起動時にロードされません。現在ロードされている組み込みパッケージは、再起動時にロード解除されます。 オフの場合、まだロードされていない組み込みパッケージは、[基本設定]ダイアログを閉じるとロードされます。
ko_kr: 토글이 켜져 있으면 기본 패키지가 다시 시작할 때 로드되지 않습니다. 현재 로드된 기본 패키지는 다시 시작할 때 언로드됩니다. 토글이 꺼져 있는 경우 기본 설정 대화상자를 닫으면 아직 로드되지 않은 기본 패키지가 로드됩니다.
pl_pl: Jeśli przełącznik jest włączony, pakiety wbudowane nie będą wczytywane przy ponownym uruchomieniu. Pakiety wbudowane, które są obecnie wczytane, zostaną usunięte z pamięci po ponownym uruchomieniu. Jeśli przełącznik jest wyłączony, pakiety wbudowane, które nie zostały jeszcze wczytane, zostaną wczytane po zamknięciu okna dialogowego preferencji.
pt_br: Se a opção estiver ativada, os pacotes internos não serão carregados na reinicialização. Os pacotes incorporados que estão carregados no momento serão descarregados na reinicialização. Se a opção estiver desativada, os pacotes incorporados que ainda não foram carregados serão carregados quando a caixa de diálogo Preferências for fechada.
ru_ru: Если переключатель включен, встроенные пакеты не загружаются при перезапуске. Встроенные пакеты, загруженные в данный момент, будут выгружены при перезапуске. Если переключатель отключен, встроенные пакеты, которые еще не загружены, будут загружены после закрытия диалогового окна настроек.
zh_cn: 如果开关打开，则内置软件包将不会在重新启动时加载。当前已加载的内置软件包将在重新启动时卸载。 如果开关关闭，则尚未加载的内置软件包将在“首选项”对话框关闭后加载。
zh_tw: 如果開啟，內建套件在重新啟動時將不會載入。目前載入的內建套件將在重新啟動時卸載。 如果關閉，尚未載入的內建套件將在偏好對話方塊關閉後載入。

# DisableCustomPackageToggleInfo
source: If the toggle is on, custom packages will not load on restart. Custom packages that are currently loaded will be unloaded on restart. If the toggle is off custom packages that are not already loaded will load once the preferences dialog is closed.
cs_cz: Pokud je přepínač zapnutý, vlastní balíčky se nenačtou při restartu. Vlastní balíčky, které jsou právě načteny, budou uvolněny při restartování. Pokud je přepínač vypnutý, vlastní balíčky, které ještě nejsou načteny, se načtou při uzavření dialogu předvoleb.
de_de: Wenn diese Option aktiviert ist, werden benutzerdefinierte Pakete bei einem Neustart nicht geladen. Benutzerdefinierte Pakete, die derzeit geladen sind, werden bei einem Neustart entfernt. Wenn die Option deaktiviert ist, werden noch nicht geladene benutzerdefinierte Pakete geladen, sobald das Dialogfeld Voreinstellungen geschlossen wird.
es_es: Si el conmutador está activado, los paquetes personalizados no se cargarán al reiniciar. Los paquetes personalizados que estén cargados actualmente se descargarán al reiniciar. Si el conmutador está desactivado, los paquetes personalizados que aún no estén cargados se cargarán una vez cerrado el cuadro de diálogo de preferencias.
fr_fr: Si le bouton bascule est activé, les packages personnalisés ne seront pas chargés au redémarrage. Le chargement des packages personnalisés concernés sera annulé au redémarrage. Si le bouton bascule est désactivé, les packages personnalisés qui ne sont pas déjà chargés seront chargés une fois la boîte de dialogue des préférences fermée.
it_it: Se il pulsante di commutazione è attivato, i pacchetti personalizzati non verranno caricati al riavvio. I pacchetti personalizzati attualmente caricati verranno scaricati al riavvio. Se il pulsante di commutazione è disattivato, i pacchetti personalizzati che non sono già stati caricati verranno caricati alla chiusura della finestra di dialogo delle preferenze.
ja_jp: オンの場合、カスタム パッケージは再起動時にロードされません。現在ロードされているカスタム パッケージは再起動時にロード解除されます。 オフの場合、まだロードされていないカスタム パッケージは、[基本設定]ダイアログを閉じるとロードされます。
ko_kr: 토글이 켜져 있으면 다시 시작할 때 사용자 패키지가 로드되지 않습니다. 현재 로드된 사용자 패키지는 다시 시작할 때 언로드됩니다. 토글이 꺼져 있는 경우 기본 설정 대화상자를 닫으면 아직 로드되지 않은 사용자 패키지가 로드됩니다.
pl_pl: Jeśli przełącznik jest włączony, pakiety niestandardowe nie będą wczytywane przy ponownym uruchomieniu. Pakiety niestandardowe, które są obecnie wczytane, zostaną usunięte z pamięci po ponownym uruchomieniu. Jeśli przełącznik jest wyłączony, pakiety niestandardowe, które nie zostały jeszcze wczytane, zostaną wczytane po zamknięciu okna dialogowego preferencji.
pt_br: Se a opção estiver ativa, os pacotes personalizados não serão carregados na reinicialização. Os pacotes personalizados que estão carregados no momento serão descarregados na reinicialização. Se a opção estiver desativada, os pacotes personalizados que ainda não foram carregados serão carregados assim que a caixa de diálogo de preferências for fechada.
ru_ru: Если переключатель включен, пользовательские пакеты не загружаются при перезапуске. Пользовательские пакеты, загруженные в данный момент, будут выгружены при перезапуске. Если переключатель отключен, пользовательские пакеты, которые еще не загружены, будут загружены после закрытия диалогового окна настроек.
zh_cn: 如果开关打开，则自定义软件包将不会在重新启动时加载。当前已加载的自定义软件包将在重新启动时卸载。 如果开关关闭，则尚未加载的自定义软件包将在“首选项”对话框关闭后加载。
zh_tw: 如果開啟，自訂套件在重新啟動時將不會載入。目前載入的自訂套件將在重新啟動時卸載。 如果關閉，尚未載入的自訂套件將在偏好對話方塊關閉後載入。

# PackageSearchSortBy
source: SORT BY
cs_cz: SEŘADIT PODLE
de_de: SORTIEREN NACH
es_es: ORDENAR POR
fr_fr: TRIER PAR
it_it: ORDINA PER
ja_jp: 並べ替え基準:
ko_kr: 정렬 기준
pl_pl: SORTUJ WEDŁUG
pt_br: CLASSIFICAR POR
ru_ru: СОРТИРОВАТЬ ПО
zh_cn: 排序方式
zh_tw: 排序依據

# PackageSearchResultViewDetails
source: View Details
cs_cz: Informace
de_de: Info
es_es: Información
fr_fr: Informations
it_it: Informazioni
ja_jp: 情報
ko_kr: 정보
pl_pl: Informacje
pt_br: Informações
ru_ru: Сведения
zh_cn: 信息
zh_tw: 資訊

# PackageSearchResultRequirements
source: Requirements
cs_cz: Požadavky
de_de: Anforderungen
es_es: Requisitos
fr_fr: Conditions
it_it: Requisiti
ja_jp: 要件
ko_kr: 요구 사항
pl_pl: Wymagania
pt_br: Requisitos
ru_ru: Требования
zh_cn: 要求
zh_tw: 需求

# PackageSearchOrder
source: ORDER
cs_cz: POŘADÍ
de_de: REIHENFOLGE
es_es: ORDEN
fr_fr: ORDRE
it_it: ORDINA
ja_jp: 順序
ko_kr: 순서
pl_pl: KOLEJNOŚĆ
pt_br: ORDENAR
ru_ru: ПОРЯДОК
zh_cn: 顺序
zh_tw: 順序

# PreferencesViewShowPreviewBubbles
source: Show Preview Bubbles
cs_cz: Zobrazit bubliny náhledu
de_de: Vorschaufenster anzeigen
es_es: Mostrar burbujas de vista previa
fr_fr: Afficher les bulles d'aperçu
it_it: Mostra simboli circolari di anteprima
ja_jp: プレビュー バルーンを表示
ko_kr: 미리보기 풍선 표시
pl_pl: Pokaż dymki podglądu
pt_br: Mostrar balões de visualização
ru_ru: Показать марки предварительного просмотра
zh_cn: 显示预览气泡
zh_tw: 展示預覽標示圈

# PublishPackageViewPackageDescription
source: Description
cs_cz: Popis
de_de: Beschreibung
es_es: Descripción
it_it: Descrizione
ja_jp: 説明
ko_kr: 설명
pl_pl: Opis
pt_br: Descrição
ru_ru: Описание
zh_cn: 说明
zh_tw: 描述

# PublishPackageViewPackageNameWatermark
source: Package name
cs_cz: Název balíčku
de_de: Paketname
es_es: Nombre del paquete
fr_fr: Nom du package
it_it: Nome pacchetto
ja_jp: パッケージ名
ko_kr: 패키지 이름
pl_pl: Nazwa pakietu
pt_br: Nome do pacote
ru_ru: Имя пакета
zh_cn: 软件包名称
zh_tw: 套件名稱

# PackageStateScheduledForUnloadTooltip
source: Scheduled for Unload. This package will be unloaded after the next Dynamo restart.
cs_cz: Naplánováno k uvolnění. Tento balíček bude uvolněn po dalším restartování aplikace Dynamo.
de_de: Entfernen geplant. Dieses Paket wird nach dem nächsten Neustart von Dynamo entfernt.
es_es: Programado para descarga. Este paquete se descargará después del siguiente reinicio de Dynamo.
fr_fr: Déchargement planifié. Ce package sera déchargé après le prochain redémarrage de Dynamo.
it_it: Pianificato per lo scaricamento. Questo pacchetto verrà scaricato dopo il successivo riavvio di Dynamo.
ja_jp: ロード解除をスケジュール済み。 このパッケージは、次回 Dynamo を再起動した後にロード解除されます。
ko_kr: 언로드가 예약되었습니다. 이 패키지는 다음번에 Dynamo를 다시 시작하면 언로드됩니다.
pl_pl: Zaplanowano usunięcie z pamięci. Ten pakiet zostanie usunięty po następnym ponownym uruchomieniu dodatku Dynamo.
pt_br: Programado para descarregamento. Esse pacote será descarregado após a próxima reinicialização do Dynamo.
ru_ru: Запланирована выгрузка. Этот пакет будет выгружен после следующего перезапуска Dynamo.
zh_cn: 已计划卸载。 此软件包将在下次重新启动 Dynamo 后卸载。
zh_tw: 已排定卸載。 此套件將在下次重新啟動 Dynamo 後卸載。

# PublishPackageGroupWatermark
source: Group
cs_cz: Skupina
de_de: Gruppe
es_es: Grupo
fr_fr: Groupe
it_it: Gruppo
ja_jp: グループ
ko_kr: 그룹
pl_pl: Grupa
pt_br: Grupo
ru_ru: Сгруппировать
zh_cn: 组
zh_tw: 群組

# PublishPackageKeywordsWatermark
source: Keywords
cs_cz: Klíčová slova
de_de: Schlüsselwörter
es_es: Palabras clave
fr_fr: Mots-clés
it_it: Parole chiave
ja_jp: キーワード
ko_kr: 키워드
pl_pl: Słowa kluczowe
pt_br: Palavras-chave
ru_ru: Ключевые слова
zh_cn: 关键字
zh_tw: 關鍵字

# PublishPackageViewLicenseSubLabel
source: Applies to the latest package version. If blank, the package will be licensed under
cs_cz: Platí pro nejnovější verzi balíčku. Pokud je toto pole prázdné, balíček bude licencován pod
ko_kr: 최신 패키지 버전에 적용됩니다. 비어 있으면 다음에 따라 패키지에 라이센스가 부여됩니다.

# PublishPackageViewLicenseWatermark
source: License
cs_cz: Licence
de_de: Lizenz
es_es: Licencia
fr_fr: Licence
it_it: Licenza
ja_jp: ライセンス
ko_kr: 라이센스
pl_pl: Licencja
pt_br: Licença
ru_ru: Лицензия
zh_cn: 许可证
zh_tw: 授權

# PublishPackageViewCopyrightHolder
source: Copyright Holder (optional)
cs_cz: Držitel autorských práv (volitelné)
de_de: Urheberrechte-Inhaber (optional)
es_es: Titular del copyright (opcional)
fr_fr: Propriétaire du copyright (facultatif)
it_it: Titolare del copyright (facoltativo)
ja_jp: 著作権保有者(省略可能)
ko_kr: 저작권 소유자(선택 사항)
pl_pl: Właściciel praw autorskich (opcjonalny)
pt_br: Titular dos direitos autorais (opcional)
ru_ru: Правообладатель (необязательно)
zh_cn: 版权所有者(可选)
zh_tw: 版權擁有者 (選填)
