Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# PackageDownloadStateInstalling
source: Installing
cs_cz: Probíhá instalace
de_de: Installation
es_es: Instalando
fr_fr: Installation
it_it: Installazione in corso
ja_jp: インストール中
ko_kr: 설치
pl_pl: Instalowanie
pt_br: Instalando
ru_ru: Установка
zh_cn: 安装
zh_tw: 安裝中

# PackageDownloadStateStarting
source: Starting
cs_cz: Zahajování
de_de: Start
es_es: Iniciando
fr_fr: Démarrage
it_it: Avvio in corso
ja_jp: 開始中
ko_kr: 시작하는 중
pl_pl: Początkowy
pt_br: Iniciando
ru_ru: Запуск
zh_cn: 开始
zh_tw: 啟動中

# PackageDuplicateAssemblyWarning
source: Due to limitations in the .NET framework, it is not possible to update your package assembly while it is already loaded. Please update the assembly while {0} is not running and try again.
cs_cz: Z důvodu omezení v rozhraní .NET Framework není možné aktualizovat sestavení balíčku při načítání. Proveďte aktualizaci sestavení, když není aplikace {0} spuštěna a opakujte akci.
de_de: Aufgrund von Einschränkungen im .NET Framework ist es nicht möglich, die Paket-Assembly zu aktualisieren, während sie bereits geladen ist. Führen Sie die Aktualisierung durch, während {0} nicht ausgeführt wird, und wiederholen Sie den Vorgang.
es_es: Debido a limitaciones de .NET Framework, no es posible actualizar el conjunto de paquetes mientras está cargado. Actualice el conjunto mientras {0} no se esté ejecutando e inténtelo de nuevo.
fr_fr: En raison des limitations de .NET Framework, il n'est pas possible de mettre à jour votre ensemble de packages déjà chargé. Mettez à jour l'ensemble de packages pendant que {0} n'est pas en cours d'exécution et essayez à nouveau.
it_it: A causa di alcune limitazioni di .NET Framework, non è possibile aggiornare l'assembly del pacchetto se è già caricato. Aggiornare l'assembly quando {0} non è in esecuzione e riprovare.
ja_jp: .NET フレームワークの制限により、既にロードされている場合は、パッケージ アセンブリを更新できません。{0} が実行されていないときにアセンブリを更新して、再度実行してください。
ko_kr: .NET Framework의 제한사항으로 인해 이미 로드된 패키지 조합은 업데이트할 수 없습니다. {0}이(가) 실행되고 있지 않는 동안 조합을 업데이트하고 다시 해보십시오.
pl_pl: Ze względu na ograniczenia programu .NET Framework nie jest możliwa aktualizacja spakowanego zespołu, gdy jest już wczytany. Zaktualizuj zespół, gdy {0} nie jest uruchomiony, i spróbuj ponownie.
pt_br: Devido às limitações do .NET Framework, não é possível atualizar sua montagem do seu pacote enquanto ele já estiver carregado. Atualize a montagem enquanto o {0} não estiver em execução e tente novamente.
ru_ru: Из-за ограничений в .NET Framework невозможно обновить сборку пакета, поскольку он уже загружен. Закройте {0}, обновите сборку и повторите попытку.
zh_cn: 由于 .NET Framework 的限制，软件包组件虽已加载但却无法更新。请在 {0} 未运行时更新部件，然后重试。
zh_tw: 由於 .NET Framework 的限制，在您的套件組合已載入時無法對其進行更新。請在 {0} 未執行時更新組合，然後再試一次。

# PackageDuplicateAssemblyWarningTitle
source: Cannot update assembly
cs_cz: Nelze aktualizovat sestavení
de_de: Assembly kann nicht aktualisiert werden.
es_es: No se puede actualizar conjunto
fr_fr: Impossible de mettre à jour l'ensemble
it_it: Impossibile aggiornare l'assembly
ja_jp: アセンブリを更新できません
ko_kr: 조합을 업데이트할 수 없습니다
pl_pl: Nie można uaktualnić zespołu
pt_br: Não é possível atualizar a montagem
ru_ru: Не удалось обновить сборку
zh_cn: 无法更新部件
zh_tw: 無法更新組合

# PackageFolderNotAccessible
source: A problem occurred when trying to install the package. Dynamo is unable to obtain read/write access to {0}
cs_cz: Při pokusu o instalaci balíčku došlo k potížím. Aplikace Dynamo nemůže získat přístup k adresáři {0} (s oprávněními ke čtení/zápisu).
de_de: Bei der Installation des Pakets ist ein Problem aufgetreten. Dynamo hat keinen Lese-/Schreibzugriff auf {0}
es_es: Se ha producido un problema al intentar instalar el paquete. Dynamo no puede obtener acceso de lectura/escritura para {0}
fr_fr: Un problème est survenu lors de la tentative d'installation du package. Dynamo ne parvient pas à obtenir l'accès en lecture/écriture à {0}
it_it: Si è verificato un problema durante il tentativo di installare il pacchetto. Dynamo non è in grado di ottenere l'accesso in lettura/scrittura a {0}
ja_jp: パッケージのインストール試行中に問題が発生しました。Dynamo で次のフォルダの読み取り/書き込み権限を取得できません。 {0}
ko_kr: 패키지를 설치하려고 할 때 문제가 발생했습니다. Dynamo가 {0}에 대한 읽기/쓰기 액세스 권한을 가져올 수 없습니다.
pl_pl: Wystąpił problem podczas próby zainstalowania pakietu. Dodatek Dynamo nie może uzyskać dostępu do odczytu / zapisu {0}
pt_br: Ocorreu um problema ao tentar instalar o pacote. O Dynamo é incapaz de obter acesso de leitura/gravação para {0}
ru_ru: При установке пакета произошла ошибка. Dynamo не удалось получить доступ на чтение/запись к {0}
zh_cn: 尝试安装软件包时发生问题。Dynamo 无法获得 {0} 的读/写访问权限
zh_tw: 嘗試安裝套件時發生問題。 Dynamo 無法取得 {0} 讀取 / 寫入權限

# PackageNameCannotContainTheseCharacters
source: The name of the package cannot contain
cs_cz: Název balíčku nesmí obsahovat
de_de: Paketname darf Folgendes nicht enthalten:
es_es: El nombre del paquete no puede contener
fr_fr: Le nom du package ne peut pas contenir
it_it: Il nome del pacchetto non può contenere
ja_jp: パッケージの名前に使用できない文字は次のとおりです
ko_kr: 패키지의 이름에는 다음을 포함할 수 없습니다.
pl_pl: Nazwa pakietu nie może zawierać
pt_br: O nome do pacote não pode conter
ru_ru: Имя пакета не может содержать
zh_cn: 软件包的名称不能包含
zh_tw: 套件的名稱不能包含

# PackageNeedAtLeastOneFile
source: Your package must contain at least one file.
cs_cz: Váš balíček musí obsahovat nejméně jeden soubor.
de_de: Das Paket muss mindestens eine Datei enthalten.
es_es: El paquete debe contener al menos un archivo
fr_fr: Votre package doit contenir au minimum un fichier.
it_it: Il pacchetto deve contenere almeno un file.
ja_jp: パッケージには少なくとも 1 つのファイルが必要です。
ko_kr: 패키지에 파일이 하나 이상 포함되어 있어야 합니다.
pl_pl: Pakiet musi zawierać co najmniej jeden plik.
pt_br: Seu pacote deve conter ao menos um arquivo.
ru_ru: Пакет должен содержать хотя бы один файл.
zh_cn: 您的软件包必须至少包含一个文件。
zh_tw: 您的套件必須包含至少一個檔案。

# PackageNotExisted
source: The root directory of the package does not exist. Please try and re-install the package.
cs_cz: Kořenový adresář balíčku neexistuje. Opakujte akci a balíček znovu nainstalujte.
de_de: Das Stammverzeichnis des Pakets ist nicht vorhanden. Versuchen Sie, das Paket erneut zu installieren.
es_es: El directorio raíz del paquete no existe. Intente volver a instalar el paquete.
fr_fr: Le répertoire racine du package n'existe pas. Essayez de réinstaller le package.
it_it: La directory principale del pacchetto non esiste. Provare a reinstallare il pacchetto.
ja_jp: パッケージのルート フォルダが存在しません。パッケージを再インストールした後でもう一度試してください。
ko_kr: 패키지의 루트 디렉토리가 존재하지 않습니다. 패키지를 다시 설치하고 시도하십시오.
pl_pl: Katalog główny pakietu nie istnieje. Spróbuj ponownie zainstalować pakiet.
pt_br: O diretório raiz do pacote não existe. Tente e reinstale o pacote.
ru_ru: Корневая папка пакета не существует. Выполните переустановку пакета.
zh_cn: 软件包的根目录不存在。请尝试重新安装该软件包。
zh_tw: 根目錄的套件不存在。 請嘗試重新安裝套件。

# PackagePathViewAccept
source: Accept Changes
cs_cz: Přijmout změny
de_de: Änderungen übernehmen
es_es: Aceptar cambios
fr_fr: Accepter les modifications
it_it: Accetta le modifiche
ja_jp: 変更を適用
ko_kr: 변경 사항 적용
pl_pl: Akceptuj zmiany
pt_br: Aceitar as alterações
ru_ru: Принять изменения
zh_cn: 接受更改
zh_tw: 接受變更

# PackagePathViewHeading
source: Paths:
cs_cz: Cesty:
de_de: Pfade:
es_es: Rutas:
fr_fr: Chemins d'accès:
it_it: Percorsi:
ja_jp: パス:
ko_kr: 경로:
pl_pl: Ścieżki:
pt_br: Caminhos:
ru_ru: Пути:
zh_cn: 路径:
zh_tw: 路徑:

# PackagePathViewSummary1
source: Add paths to make nodes and packages show up in the library.
cs_cz: Přidáním cest umožníte zobrazení uzlů a balíčků v knihovně.
de_de: Fügen Sie Pfade zum Erstellen von Blöcken und Paketen für die Bibliothek hinzu.
es_es: Añade rutas para que los nodos y los paquetes aparezcan en la biblioteca.
fr_fr: Ajouter des chemins d'accès pour afficher les noeuds et les packages dans la bibliothèque.
it_it: Aggiunge percorsi per visualizzare nodi e pacchetti nella libreria.
ja_jp: ノードとパッケージをライブラリに表示するためのパスを追加します。
ko_kr: 경로를 추가하여 노드와 패키지를 라이브러리에 표시하십시오.
pl_pl: Dodaj ścieżki, aby włączyć wyświetlanie węzłów i pakietów w bibliotece.
pt_br: Adicione caminhos para que os nós e pacotes apareçam na biblioteca.
ru_ru: Добавить пути для отображения узлов и пакетов в библиотеке.
zh_cn: 添加路径以使节点和软件包显示在库中。
zh_tw: 加入路徑以在資源庫中展示節點和套件。

# PackagePathViewTitle
source: Manage Node and Package Paths
cs_cz: Spravovat cesty k uzlům a balíčkům
de_de: Pfade für Blöcke und Pakete verwalten
es_es: Administra rutas de nodos y paquetes
fr_fr: Gérer les chemins d'accès de noeud et de package
it_it: Gestisci percorsi di nodi e pacchetti
ja_jp: ノードとパッケージのパスを管理
ko_kr: 노드 및 패키지 경로 관리
pl_pl: Zarządzaj ścieżkami do węzłów i pakietów
pt_br: Gerenciar caminhos de nó e pacote
ru_ru: Управление путями узла и пакета
zh_cn: 管理节点和软件包路径
zh_tw: 管理節點和套件路徑

# PackagePathViewToolTipDown
source: Move the selected path downward
cs_cz: Přesunout vybranou cestu dolů
de_de: Ausgewählten Pfad nach unten verschieben
es_es: Desplaza la ruta seleccionada hacia abajo
fr_fr: Déplace le chemin sélectionné vers le bas
it_it: Sposta il percorso selezionato verso il basso
ja_jp: 選択したパスを下に移動
ko_kr: 선택한 경로를 아래로 이동
pl_pl: Przenieś wybraną ścieżkę w dół
pt_br: Mover o caminho selecionado para baixo
ru_ru: Переместить выбранный путь вниз
zh_cn: 向下移动选定路径
zh_tw: 向下移動選取的路徑

# PackagePathViewToolTipMinus
source: Remove the selected path from list
cs_cz: Odebrat vybranou cestu ze seznamu
de_de: Ausgewählten Pfad aus Liste entfernen
es_es: Elimina la ruta seleccionada de la lista
fr_fr: Supprimer le chemin d'accès sélectionné de la liste
it_it: Rimuovi il percorso selezionato dall'elenco
ja_jp: 選択したパスをリストから削除
ko_kr: 선택한 경로를 리스트에서 제거
pl_pl: Usuń wybraną ścieżkę z listy
pt_br: Remover o caminho selecionado da lista
ru_ru: Удалить выбранный путь из списка
zh_cn: 从列表中删除选定路径
zh_tw: 從清單中移除選取的路徑

# PackagePathViewToolTipPlus
source: Add a new path to the list
cs_cz: Přidat do seznamu novou cestu
de_de: Neuen Pfad zu Liste hinzufügen
es_es: Añade una nueva ruta a la lista
fr_fr: Ajouter un nouveau chemin d'accès à la liste
it_it: Aggiungi nuovo percorso all'elenco
ja_jp: リストに新しいパスを追加
ko_kr: 새 경로를 리스트에 추가
pl_pl: Dodaj nową ścieżkę do listy
pt_br: Adicione um novo caminho para a lista
ru_ru: Добавить новый путь в список
zh_cn: 为列表添加新路径
zh_tw: 加入新路徑至清單

# PackagePathViewToolTipUp
source: Move the selected path upward
cs_cz: Přesunout vybranou cestu nahoru
de_de: Ausgewählten Pfad nach oben verschieben
es_es: Desplaza la ruta seleccionada hacia arriba
fr_fr: Déplacer le chemin sélectionné vers le haut
it_it: Sposta il percorso selezionato verso l'alto
ja_jp: 選択したパスを上に移動
ko_kr: 선택한 경로를 위로 이동
pl_pl: Przenieś wybraną ścieżkę do góry
pt_br: Mover o caminho selecionado para cima
ru_ru: Переместить выбранный путь вверх
zh_cn: 向上移动选定路径
zh_tw: 向上移動選取的路徑

# PackagePathAutoAddNotificationTitle
source: Package Path Added
cs_cz: Cesta balíčku přidána
de_de: Paketpfad hinzugefügt
es_es: Ruta de paquete añadida
fr_fr: Chemin d'accès de package ajouté
it_it: Percorso pacchetto aggiunto
ja_jp: 追加されたパッケージのパス
ko_kr: 패키지 경로 추가
pl_pl: Ścieżka pakietu dodana
pt_br: Caminho de pacote adicionado
ru_ru: Добавлен путь к пакету
zh_cn: 软件包路径已添加
zh_tw: 已加入套件路徑

# PackagePathAutoAddNotificationShortDescription
source: A library (*.dll, *.ds) was recently imported into Dynamo. Its path was automatically added to "Preferences > Node and Package Paths..."
cs_cz: Knihovna (*.dll, *.ds) byla nedávno importována do aplikace Dynamo. Její cesta byla automaticky přidána do „Předvolby > Cesty k uzlům a balíčkům…“
de_de: Eine Bibliothek (*.dll, *.ds) wurde kürzlich in Dynamo importiert. Der Pfad wurde automatisch unter Voreinstellungen > Pfade für Blöcke und Pakete hinzugefügt.
es_es: Se ha importado recientemente una biblioteca (*.dll, *.ds) en Dynamo. Su ruta se ha añadido automáticamente a "Preferencias > Rutas de nodos y paquetes...".
fr_fr: Une bibliothèque (*.dll, *.ds) a récemment été importée dans Dynamo. Son chemin d'accès a été automatiquement ajouté au menu Préférences > Chemins d'accès de noeud et de package…
it_it: Di recente è stata importata una libreria (*.dll, *.ds) in Dynamo. Il relativo percorso è stato aggiunto automaticamente a "Preferenze > Percorsi di nodi e pacchetti..."
ja_jp: ライブラリ(*.dll、*.ds)は最近 Dynamo に読み込まれました。パスは[基本設定] > [ノードとパッケージのパス]に自動的に追加されました
ko_kr: 최근에 Dynamo로 가져온 라이브러리(*.dll, *.ds)가 있습니다. 해당 경로가 "기본 설정 > 노드 및 패키지 경로..."에 자동으로 추가되었습니다.
pl_pl: Ostatnio zaimportowano bibliotekę (*.dll, *.ds) do dodatku Dynamo. Jej ścieżka została automatycznie dodana do okna wyświetlanego po wybraniu kolejno opcji „Preferencje > Ścieżki węzłów i pakietów...”.
pt_br: Uma biblioteca (*.dll, *.ds) foi recentemente importada no Dynamo. Seu caminho foi automaticamente adicionado a “Preferências > Caminhos de nó e pacote…”
ru_ru: Библиотека (*.dll, *.ds) была недавно импортирована в Dynamo. Путь к ней автоматически добавлен в раздел «Настройки» > «Пути к узлу и пакету...»
zh_cn: 库(*.dll, *.ds)最近已导入到 Dynamo 中。其路径已自动添加到“首选项” > “节点和软件包路径...”
zh_tw: 資源庫 (*.dll、*.ds) 最近已匯入至 Dynamo。其路徑已自動加入「偏好」>「節點和套件路徑」

# PackagePathAutoAddNotificationDetailedDescription
source: The import path "{0}" was added to "Node and Package Paths". If you want to update or remove this path, please open "Dynamo > Preferences >Package Manager > Node and Package Paths..."
cs_cz: Cesta importu "{0}" byla přidána do seznamu „Cesty k uzlům a balíčkům“. Pokud chcete tuto cestu aktualizovat nebo odebrat, otevřete „Dynamo > Předvolby > Package Manager > Cesty k uzlům a balíčkům…“
de_de: Der Importpfad "{0}" wurde zu Pfade für Blöcke und Pakete hinzugefügt. Wenn Sie diesen Pfad aktualisieren oder entfernen möchten, öffnen Sie Dynamo > Voreinstellungen > Package Manager > Pfade für Blöcke und Pakete
es_es: La ruta de importación "{0}" se ha añadido a "Rutas de nodos y paquetes". Si desea actualizar o eliminar esta ruta, abra "Dynamo > Preferencias > Package Manager > Rutas de nodos y paquetes...".
fr_fr: Le chemin d'accès d'importation "{0}" a été ajouté dans Chemins d'accès de noeud et de package. Si vous souhaitez mettre à jour ou supprimer ce chemin d'accès, ouvrez Dynamo > Préférences > Package Manager > Chemins d'accès de noeud et de package…
it_it: Il percorso di importazione "{0}" è stato aggiunto a "Percorsi di nodi e pacchetti". Se si desidera aggiornare o rimuovere questo percorso, aprire "Dynamo > Preferenze > Package Manager > Percorsi di nodi e pacchetti..."
ja_jp: 読み込みパス "{0}" は[ノードとパッケージのパス]に追加されました。このパスを更新または削除する場合は、[Dynamo] > [基本設定] > [Package Manager] > [ノードとパッケージのパス]を開いてください
ko_kr: 가져오기 경로 "{0}"이(가) "노드 및 패키지 경로"에 추가되었습니다. 이 경로를 업데이트하거나 제거하려는 경우 "Dynamo > 기본 설정 > Package Manager > 노드 및 패키지 경로..."를 여십시오.
pl_pl: Ścieżka importu „{0}” została dodana do okna „Ścieżki węzłów i pakietów”. Jeśli chcesz ją zaktualizować lub usunąć, otwórz okno dialogowe, wybierając kolejno opcje „Dynamo > Preferencje > Package Manager > Ścieżki węzłów i pakietów...”
pt_br: O caminho de importação “{0}” foi adicionado a “Caminhos de nó e pacote”. Se você desejar atualizar ou remover esse caminho, abra “Dynamo > Preferências > Package Manager > Caminhos de nó e pacote…”
ru_ru: Путь для импорта «{0}» добавлен в раздел «Пути к узлу и пакету». Чтобы обновить или удалить этот путь, выберите Dynamo > «Настройки» > Package Manager > «Пути к узлу и пакету...»
zh_cn: 导入路径 “{0}” 已添加到 “节点和软件包路径”。如果要更新或删除此路径，请打开“Dynamo”>“首选项”>“Package Manager”>“节点和软件包路径...”
zh_tw: 匯入路徑「{0}」已加入「節點和套件路徑」。如果您要更新或移除此路徑，請開啟 Dynamo >「偏好」>「Package Manager」>「節點和套件路徑」

# PackageSearchStateNoResult
source: Search returned no results!
cs_cz: Vyhledávání nevrátilo žádné výsledky.
de_de: Suche erzielte keine Ergebnisse.
es_es: La búsqueda no ha devuelto ningún resultado
fr_fr: La recherche n'a renvoyé aucun résultat.
it_it: La ricerca non ha restituito risultati.
ja_jp: 返された検索結果はありません!
ko_kr: 검색에서 반환된 결과가 없습니다!
pl_pl: Wyszukiwanie nie zwróciło żadnych wyników!
pt_br: A pesquisa não retornou resultados!
ru_ru: Поиск не дал результатов!
zh_cn: 搜索未返回任何结果！
zh_tw: 搜尋未傳回任何結果！

# PackageSearchStateSearching
source: Searching...
cs_cz: Vyhledávání...
de_de: Suchen...
es_es: Buscando...
fr_fr: Recherche en cours...
it_it: Ricerca in corso...
ja_jp: 検索中...
ko_kr: 검색 중...
pl_pl: Wyszukiwanie...
pt_br: Pesquisando...
ru_ru: Поиск...
zh_cn: 正在搜索...
zh_tw: 搜尋中...

# PackageSearchStateSyncingWithServer
source: Syncing with server...
cs_cz: Synchronizace se serverem...
de_de: Synchronisation mit Server läuft...
es_es: Sincronizando con servidor...
fr_fr: Synchronisation avec le serveur...
it_it: Sincronizzazione con il server in corso...
ja_jp: サーバと同期中...
ko_kr: 서버와 동기화하는 중...
pl_pl: Synchronizowanie z serwerem...
pt_br: Sincronizando com o servidor...
ru_ru: Синхронизация с сервером...
zh_cn: 正在与服务器同步...
zh_tw: 與伺服器同步...

# PackageSearchViewClearButton
source: Clear
cs_cz: Vymazat
de_de: Löschen
es_es: Borrar
fr_fr: Effacer
it_it: Cancella
ja_jp: クリア
ko_kr: 지우기
pl_pl: Wyczyść
pt_br: Limpar
ru_ru: Очистить
zh_cn: 清除
zh_tw: 清除

# PackageSearchViewClearButtonTooltip
source: Clear Downloads
cs_cz: Vymazat stahování
de_de: Downloads löschen
es_es: Anula la selección de las descargas
fr_fr: Effacer les téléchargements
it_it: Cancella download
ja_jp: ダウンロードをクリア
ko_kr: 다운로드 지우기
pl_pl: Usuń pobrane pliki
pt_br: Desmarcar os downloads
ru_ru: Очистить загруженные файлы
zh_cn: 清除下载
zh_tw: 清除下載

# PackageSearchViewContextMenuOrderAscending
source: Ascending
cs_cz: Vzestupně
de_de: Aufsteigend
es_es: Ascendente
fr_fr: Ordre croissant
it_it: Crescente
ja_jp: 昇順
ko_kr: 오름차순
pl_pl: Rosnąco
pt_br: Crescente
ru_ru: По возрастанию
zh_cn: 升序
zh_tw: 遞增

# PackageSearchViewContextMenuOrderDescending
source: Descending
cs_cz: Sestupně
de_de: Absteigend
es_es: Descendente
fr_fr: Ordre décroissant
it_it: Decrescente
ja_jp: 降順
ko_kr: 내림차순
pl_pl: Malejąco
pt_br: Decrescente
ru_ru: По убыванию
zh_cn: 降序
zh_tw: 遞減

# PackageSearchViewContextMenuSortByAuthor
source: Author
cs_cz: Autor
de_de: Autor
es_es: Autor
fr_fr: Auteur
it_it: Autore
ja_jp: 作成者
ko_kr: 작성자
pl_pl: Autor
pt_br: Autor
ru_ru: Автор
zh_cn: 作者
zh_tw: 作者

# PackageSearchViewContextMenuSortByDownloads
source: Downloads
cs_cz: Stahování
es_es: Descargas
fr_fr: Téléchargements
it_it: Download
ja_jp: ダウンロード
ko_kr: 다운로드
pl_pl: Pobrane pliki
ru_ru: Загрузка
zh_cn: 下载项
zh_tw: 下載

# PackageSearchViewContextMenuSortByName
source: Name
cs_cz: Název
es_es: Nombre
fr_fr: Nom
it_it: Nome
ja_jp: 名前
ko_kr: 이름
pl_pl: Nazwa
pt_br: Nome
ru_ru: Имя
zh_cn: 名称
zh_tw: 名稱

# PackageSearchViewContextMenuSortByVotes
source: Votes
cs_cz: Hlasy
de_de: Stimmen
es_es: Votos
it_it: Voti
ja_jp: 投票
ko_kr: 투표
pl_pl: Głosy
pt_br: Votos
ru_ru: Голоса
zh_cn: 投票
zh_tw: 投票

# PackageSearchViewContextMenuSortyByUpdate
source: Most Recent Update
cs_cz: Poslední aktualizace
de_de: Letzte Aktualisierung
es_es: Actualización más reciente
fr_fr: Dernière mise à jour
it_it: Aggiornamento più recente
ja_jp: 最新の更新
ko_kr: 최신 업데이트
pl_pl: Ostatnia aktualizacja
pt_br: Atualização mais recente
ru_ru: Самые последние обновления
zh_cn: 最新更新
zh_tw: 最新的更新

# PackageManagerPackageDeprecated
source: Deprecated
cs_cz: Zastaralé
de_de: Veraltet
es_es: Obsoleto
fr_fr: Obsolète
it_it: Obsoleto
ja_jp: 廃止済み
ko_kr: 더 이상 사용되지 않음
pl_pl: Nieaktualne
pt_br: Obsoleto
ru_ru: Исключено
zh_cn: 已弃用
zh_tw: 已棄用

# PackageSearchViewDeprecatedTooltip
source: The maintainers of this package have indicated that they will no longer be updating it. Use at your own risk!
cs_cz: Udržovatelé tohoto balíčku oznámili, že jej již nebudou nadále aktualizovat. Používejte jej na vlastní nebezpečí!
de_de: Die Maintainer dieses Pakets haben angegeben, dass sie dieses nicht mehr aktualisieren werden. Die Benutzung erfolgt auf eigene Gefahr.
es_es: Los mantenedores de este paquete han indicado que ya no lo actualizarán. Si lo utiliza, lo hará por su cuenta y riesgo
fr_fr: Les gestionnaires de ce package ont indiqué qu'ils ne le mettront plus à jour. Utilisez-le à vos risques et périls.
it_it: I gestori hanno indicato che il pacchetto non verrà più aggiornato. Utilizzarlo a proprio rischio.
ja_jp: このパッケージを保有するユーザは、このパッケージを今後更新しないと表明しています。自分の責任で使用してください。
ko_kr: 이 패키지의 유지 담당자가 패키지를 더 이상 업데이트하지 않을 것이라고 했습니다. 주의해서 사용하십시오!
pl_pl: Administratorzy tego pakietu zaznaczyli, że nie będą już go aktualizować. Korzystasz z niego na własną odpowiedzialność!
pt_br: Os mantenedores deste pacote indicaram que eles não mais o irão atualizar. Utilize a seu próprio risco!
ru_ru: Разработчики данного пакета завершили его обслуживание, и обновления больше поступать не будут. Используйте на свой страх и риск!
zh_cn: 该软件包的维护人员已表示，他们将不再对此软件包进行更新。使用时责任自负！
zh_tw: 此套件的維護者已指出他們將不再更新它。使用時風險自負！

# PackageSearchViewDescription
source: Description
cs_cz: Popis
de_de: Beschreibung
es_es: Descripción
it_it: Descrizione
ja_jp: 説明
ko_kr: 설명
pl_pl: Opis
pt_br: Descrição
ru_ru: Описание
zh_cn: 说明
zh_tw: 描述

# PackageSearchViewInstallButton
source: ⇓ Install
cs_cz: ⇓ Instalovat
de_de: ⇓ Installieren
es_es: ⇓ Instalar
fr_fr: ⇓ Installer
it_it: ⇓ Installa
ja_jp: ⇓ インストール
ko_kr: ⇓ 설치
pl_pl: ⇓ Instalacja
pt_br: ⇓ Instalar
ru_ru: ⇓ Установить
zh_cn: ⇓ 安装
zh_tw: ⇓ 安裝

# PackageSearchViewInstallLatestVersion
source: Install latest version
cs_cz: Nainstalovat nejnovější verzi
de_de: Neueste Version installieren
es_es: Instalar la versión más reciente
fr_fr: Installer la dernière version
it_it: Installa la versione più recente
ja_jp: 最新バージョンをインストール
ko_kr: 최신 버전 설치
pl_pl: Zainstaluj najnowszą wersję
pt_br: Instalar a versão mais recente
ru_ru: Установить последнюю версию
zh_cn: 安装最新版本
zh_tw: 安裝最新版本

# PackageSearchViewInstallLatestVersionTo
source: Install latest version to folder...
cs_cz: Nainstalovat do složky...
de_de: Installieren in Ordner...
es_es: Instalar en la carpeta...
fr_fr: Installer dans le dossier...
it_it: Installa nella cartella...
ja_jp: フォルダにインストール...
ko_kr: 폴더에 설치...
pl_pl: Zainstaluj w folderze...
pt_br: Instalar na pasta...
ru_ru: Установить в папку...
zh_cn: 安装到文件夹...
zh_tw: 安裝至資料夾...

# PackageSearchViewInstallThisVersion
source: Install this version
cs_cz: Nainstalovat tuto verzi
de_de: Diese Version installieren
es_es: Instalar esta versión
fr_fr: Installer cette version
it_it: Installa questa versione
ja_jp: このバージョンをインストール
ko_kr: 이 버전 설치
pl_pl: Zainstaluj tę wersję
pt_br: Instalar esta versão
ru_ru: Установить эту версию
zh_cn: 安装该版本
zh_tw: 安裝此版本

# PackageSearchViewInstallThisVersionTo
source: Install this version to folder...
cs_cz: Nainstalovat tuto verzi do složky...
de_de: Diese Version installieren in Ordner...
es_es: Instalar esta versión en la carpeta...
fr_fr: Installer cette version dans le dossier...
it_it: Installa questa versione nella cartella...
ja_jp: このバージョンをフォルダにインストール...
ko_kr: 이 버전을 폴더에 설치...
pl_pl: Zainstaluj tę wersję do folderu...
pt_br: Instalar esta versão na pasta...
ru_ru: Установить эту версию в папку...
zh_cn: 将该版本安装到文件夹...
zh_tw: 將此版本安裝至資料夾...

# PackageSearchViewKeywords
source: Keywords
cs_cz: Klíčová slova
de_de: Schlüsselwörter
es_es: Palabras clave
fr_fr: Mots-clés
it_it: Parole chiave
ja_jp: キーワード
ko_kr: 키워드
pl_pl: Słowa kluczowe
pt_br: Palavras-chave
ru_ru: Ключевые слова
zh_cn: 关键字
zh_tw: 關鍵字

# PackageSearchViewSearchTextBox
source: Search...
cs_cz: Vyhledávání...
de_de: Suchen...
es_es: Buscar...
fr_fr: Rechercher...
it_it: Cerca...
ja_jp: 検索...
ko_kr: 검색...
pl_pl: Wyszukaj...
pt_br: Pesquisar...
ru_ru: Поиск...
zh_cn: 搜索...
zh_tw: 搜尋 (S)...

# PackageSearchViewSortByButton
source: Sort by
cs_cz: Seřadit podle
de_de: Sortieren nach
es_es: Ordenar por
fr_fr: Trier par
it_it: Ordina per
ja_jp: 並べ替え
ko_kr: 정렬 기준
pl_pl: Sortuj według
pt_br: Classificar por
ru_ru: Сортировать по
zh_cn: 排序方式
zh_tw: 排序依據
