Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# FileDialogDynamoWorkspace
source: {0} Workspace ({1})|{1}
cs_cz: Pracovní prostor aplikace {0} ({1})|{1}
de_de: {0}-Arbeitsbereich ({1})|{1}
es_es: Espacio de trabajo de {0} ({1})|{1}
fr_fr: Espace de travail {0} ({1})|{1}
it_it: Area di lavoro di {0} ({1})|{1}
ja_jp: {0} ワークスペース({1})|{1}
ko_kr: {0} 작업공간({1})|{1}
pl_pl: Obszar roboczy {0} ({1})|{1}
pt_br: {0} Espaço de trabalho ({1})|{1}
ru_ru: Рабочее пространство {0} ({1})|{1}
zh_cn: {0} 工作空间 ({1})|{1}
zh_tw: {0} 工作區 ({1})|{1}

# FileDialogLibraryFiles
source: Library Files ({0})|{0}
cs_cz: Soubory knihovny ({0})|{0}
de_de: Bibliotheksdateien ({0})|{0}
es_es: Archivos de biblioteca ({0})|{0}
fr_fr: Fichiers de bibliothèque ({0})|{0}
it_it: File di libreria ({0})|{0}
ja_jp: ライブラリ ファイル({0})|{0}
ko_kr: 라이브러리 파일({0})|{0}
pl_pl: Pliki biblioteki ({0})|{0}
pt_br: Os arquivos da biblioteca ({0})|{0}
ru_ru: Файлы библиотеки ({0})|{0}
zh_cn: 库文件 ({0})|{0}
zh_tw: 資源庫檔案 ({0})|{0}

# FileDialogManualMode
source: Open in Manual Execution Mode
cs_cz: Otevřít v režimu ručního spuštění
de_de: Im manuellen Ausführungsmodus öffnen
es_es: Abrir en modo de ejecución manual
fr_fr: Ouvrir en mode d'exécution manuelle
it_it: Apri in modalità di esecuzione manuale
ja_jp: Manual Execution Mode で開く
ko_kr: 수동 실행 모드에서 열기
pl_pl: Otwórz w trybie Ręczne wykonywanie
pt_br: Abrir no modo de execução manual
ru_ru: Открыть в режиме ручного выполнения
zh_cn: 以手动执行模式打开
zh_tw: 以手動執行模式開啟

# FileDialogPNGFiles
source: PNG Image|{0}
cs_cz: Obrázek PNG |{0}
de_de: PNG-Bild|{0}
es_es: Imagen PNG|{0}
fr_fr: Image PNG |{0}
it_it: Immagine PNG |{0}
ja_jp: PNG イメージ|{0}
ko_kr: PNG 이미지|{0}
pl_pl: Obraz PNG|{0}
pt_br: Imagem PNG |{0}
ru_ru: Изображение PNG |{0}
zh_cn: PNG 图像|{0}
zh_tw: PNG 影像 |{0}

# FileDialogSTLModels
source: STL Models|{0}
cs_cz: Modely STL|{0}
de_de: STL-Modelle|{0}
es_es: Modelos STL|{0}
fr_fr: Modèles STL|{0}
it_it: Modelli STL|{0}
ja_jp: STL モデル|{0}
ko_kr: STL 모델|{0}
pl_pl: Modele STL |{0}
pt_br: Modelos STL |{0}
ru_ru: Модели STL|{0}
zh_cn: STL 模型|{0}
zh_tw: STL 模型 |{0}

# FileNotPublishCaption
source: Publish Fail!
cs_cz: Problém s publikováním
de_de: Publizieren fehlgeschlagen.
es_es: Error de publicación.
fr_fr: Echec de la publication!
it_it: Pubblicazione non riuscita.
ja_jp: パブリッシュに失敗しました
ko_kr: 게시 실패!
pl_pl: Błąd publikowania!
pt_br: Falha na publicação!
ru_ru: Сбой при публикации!
zh_cn: 发布失败！
zh_tw: 發佈失敗!

# FileNotPublishMessage
source: File(s) were not found or are contained inside of a package. Please only add files that are located outside of packages. Failed to publish file(s): {0}
cs_cz: Soubory nebyly nalezeny nebo jsou součástí balíčku. Přidávejte pouze soubory, které jsou umístěny mimo balíčky. Soubory, které nebyly publikovány: {0}
de_de: Datei(en) wurden nicht gefunden oder sind in einem Paket enthalten. Fügen Sie nur Dateien hinzu, die nicht in Paketen enthalten sind. Fehler beim Publizieren der Datei(en): {0}
es_es: No se ha encontrado los archivos o bien están dentro de un paquete. Añada solo archivos que estén fuera de paquetes. Error al publicar archivos: {0}
fr_fr: Le/les fichier(s) n'a/n'ont pas été trouvé(s) ou est/sont contenu(s) à l'intérieur d'un package. Veuillez ajouter uniquement les fichiers qui se trouvent en dehors des packages. Echec de la publication du/des fichier(s): {0}
it_it: I file non sono stati trovati o sono contenuti all'interno di un pacchetto. Aggiungere solo i file che si trovano al di fuori dei pacchetti. Impossibile pubblicare i file: {0}
ja_jp: ファイルが見つからないか、パッケージ内部に含まれています。パッケージの外部に置かれているファイルのみを追加してください。 ファイルのパブリッシュに失敗しました: {0}
ko_kr: 파일을 찾을 수 없거나 파일이 패키지 내에 포함되어 있습니다. 패키지 외부에 있는 파일만 추가하십시오. 파일 게시 실패: {0}
pl_pl: Plik(i) nie zostały znalezione lub są zawarte w pakiecie. Proszę dodać tylko pliki, które znajdują się poza pakietami. Nie można opublikować pliku(ów): {0}
pt_br: Os arquivos não foram encontrados ou estão dentro de um pacote. Adicione somente os arquivos que estão localizados fora de pacotes. Falha ao publicar os arquivos: {0}
ru_ru: Файл не найдены или содержатся в пакете. Следует добавлять только те файлы, которые находятся вне пакетов. Не удалось опубликовать файлы: {0}
zh_cn: 未找到文件或文件包含在某个软件包中。请仅添加软件包外的文件。 无法发布文件: {0}
zh_tw: 未找到檔案或包含在套件內。 請僅加入位於套件外的檔案。 無法發佈檔案: {0}

# FilePathConverterNoFileSelected
source: No file selected.
cs_cz: Není vybrán žádný soubor.
de_de: Keine Datei ausgewählt.
es_es: No hay ningún archivo seleccionado
fr_fr: Aucun fichier n'est sélectionné.
it_it: Nessun file selezionato.
ja_jp: ファイルが選択されていません。
ko_kr: 파일이 선택되지 않았습니다.
pl_pl: Nie wybrano pliku.
pt_br: Nenhum arquivo selecionado.
ru_ru: Файл не выбран.
zh_cn: 未选择文件。
zh_tw: 未選取檔案。

# FilterIconTooltip
source: Filter results
cs_cz: Filtrovat výsledky
de_de: Ergebnisse filtern
es_es: Filtrar resultados
fr_fr: Filtrer les résultats
it_it: Filtra risultati
ja_jp: フィルタ結果
ko_kr: 결과 필터
pl_pl: Filtrowanie wyników
pt_br: Filtrar os resultados
ru_ru: Фильтрация результатов
zh_cn: 过滤结果
zh_tw: 篩選結果

# FolderNotWritableError
source: You do not have write permission to {0}.
cs_cz: Nemáte oprávnění k zápisu do složky {0}.
de_de: Sie verfügen nicht über Schreibberechtigung für {0}.
es_es: No dispone de permiso de escritura para {0}.
fr_fr: Vous ne disposez pas d'une autorisation d'accès en écriture à {0}.
it_it: Non si dispone delle autorizzazioni di scrittura per {0}.
ja_jp: {0} への書き込み権限がありません。
ko_kr: {0}에 쓸 권한이 없습니다.
pl_pl: Nie masz uprawnień do zapisu w {0}.
pt_br: Você não possui permissão de gravação para {0}.
ru_ru: У вас отсутствуют права на запись в {0}.
zh_cn: 对于 {0}，您没有写入权限。
zh_tw: 您沒有寫入權限可以 {0}。

# GenericTaskDialogSampleLeftButton
source: Sample Left Button
cs_cz: Ukázkové levé tlačítko
de_de: Beispiel für Schaltfläche Links
es_es: Botón izquierdo de muestra
fr_fr: Exemple de bouton gauche
it_it: Pulsante sinistro di esempio
ja_jp: サンプルの左ボタン
ko_kr: 샘플 왼쪽 버튼
pl_pl: Przykładowy lewy przycisk
pt_br: Botão esquerdo de amostra
ru_ru: Пример кнопки «Влево»
zh_cn: 样例左键
zh_tw: 左按鈕範例

# GenericTaskDialogSampleRightButton
source: Sample Right Button
cs_cz: Ukázkové pravé tlačítko
de_de: Beispiel: Schaltfläche rechts
es_es: Botón derecho de muestra
fr_fr: Exemple de bouton droit
it_it: Pulsante destro di esempio
ja_jp: サンプルの右ボタン
ko_kr: 샘플 오른쪽 버튼
pl_pl: Przykładowy prawy przycisk
pt_br: Botão direito de amostra
ru_ru: Пример кнопки «Вправо»
zh_cn: 样例右键
zh_tw: 右按鈕範例

# GenericTaskDialogTitle
source: Generic Task Dialog
cs_cz: Obecný dialog úlohy
de_de: Allgemeines Aufgabendialogfeld
es_es: Cuadro de diálogo genérico de tareas
fr_fr: Boîte de dialogue de tâche générique
it_it: Finestra di dialogo per operazioni generiche
ja_jp: 一般的なタスク ダイアログ
ko_kr: 일반 작업 대화상자
pl_pl: Okno dialogowe zadania ogólnego
pt_br: Caixa de diálogo Tarefa genérica
ru_ru: Диалоговое окно «Типовое задание»
zh_cn: 常规任务对话框
zh_tw: 一般工作對話方塊

# GroupContextMenuBackground
source: Select Background
cs_cz: Vybrat pozadí
de_de: Hintergrund wählen
es_es: Seleccionar fondo
fr_fr: Sélectionner un arrière-plan
it_it: Seleziona sfondo
ja_jp: 背景を選択
ko_kr: 배경 선택
pl_pl: Wybierz opcję Tło
pt_br: Selecionar o plano de fundo
ru_ru: Выбор фона
zh_cn: 选择背景
zh_tw: 選取背景

# GroupContextMenuDeleteGroup
source: Delete Group
cs_cz: Odstranit skupinu
de_de: Gruppe löschen
es_es: Suprimir grupo
fr_fr: Supprimer le groupe
it_it: Elimina gruppo
ja_jp: グループを削除
ko_kr: 그룹 삭제
pl_pl: Usuń grupę
pt_br: Excluir grupo
ru_ru: Удалить группу
zh_cn: 删除组
zh_tw: 刪除群組

# GroupContextMenuFont
source: Font Size
cs_cz: Velikost písma
de_de: Schriftgröße
es_es: Tamaño de tipo de letra
fr_fr: Taille de la police
it_it: Dimensione carattere
ja_jp: フォント サイズ
ko_kr: 글꼴 크기
pl_pl: Rozmiar czcionki
pt_br: Tamanho da fonte
ru_ru: Размер шрифта
zh_cn: 字体大小
zh_tw: 字體大小

# GroupContextMenuGraphLayout
source: Cleanup Node Layout
cs_cz: Rozvržení uzlů vyčištění
de_de: Blocklayout bereinigen
es_es: Presentación de nodo de limpieza
fr_fr: Arranger l'affichage des noeuds
it_it: Semplifica layout nodi
ja_jp: ノードのレイアウトをクリーンアップ
ko_kr: 노드 배치 정리
pl_pl: Wyczyść układ węzłów
pt_br: Limpeza do layout do nó
ru_ru: Очистить компоновку узла
zh_cn: 清理节点布局
zh_tw: 清理節點配置

# GroupContextMenuUngroup
source: Ungr_oup
cs_cz: Zrušit s_eskupení
de_de: G_ruppierung aufheben
es_es: _Desagrupar
fr_fr: Diss_ocier
it_it: Sc_omponi
ja_jp: グループ解除(_O)
ko_kr: 그룹 해제(_O)
pl_pl: _Rozbij grupę
pt_br: Desa_grupar
ru_ru: Р_азгруппировать
zh_cn: 解组(_O)
zh_tw: 解除群組(_O)

source: Hide Classic Node Library
cs_cz: Skrýt klasickou knihovnu uzlů
de_de: Klassische Blockbibliothek ausblenden
es_es: Ocultar biblioteca de nodos clásica
fr_fr: Masquer la bibliothèque de noeuds standard
it_it: Nascondi libreria nodo classica
ja_jp: Classic Node Library を非表示
ko_kr: 일반 노드 라이브러리 숨기기
pl_pl: Ukryj bibliotekę węzłów standardowych
pt_br: Ocultar a biblioteca de nó clássico
ru_ru: Скрыть классическую библиотеки узлов
zh_cn: 隐藏典型节点库
zh_tw: 隱藏典型節點資源庫

# ImportLibraryDialogTitle
source: Import Library
cs_cz: Importovat knihovnu
de_de: Bibliothek importieren
es_es: Importar biblioteca
fr_fr: Importer une bibliothèque
it_it: Importa libreria
ja_jp: Library を読み込む
ko_kr: 라이브러리 가져오기
pl_pl: Importuj bibliotekę
pt_br: Importar biblioteca
ru_ru: Импорт библиотеки
zh_cn: 导入库
zh_tw: 匯入資源庫

# InCanvasFitViewButtonToolTip
source: Zoom to Fit
cs_cz: Přizpůsobit oknu
de_de: Zoom Grenzen
es_es: Ajustar en ventana
fr_fr: Zoom tout
it_it: Adatta alla finestra
ja_jp: 全体表示
ko_kr: 창에 맞게 줌
pl_pl: Powiększ tak, aby dopasować
pt_br: Zoom para ajustar
ru_ru: Вписать
zh_cn: 缩放到合适大小
zh_tw: 縮放至佈滿

# InCanvasGeomButtonToolTip
source: Enable background 3D preview navigation (Ctrl + B)
cs_cz: Povolit navigaci ve 3D náhledu pozadí (Ctrl+B)
de_de: Navigation in Hintergrund-3D-Vorschau aktivieren (Strg + B)
es_es: Activa la navegación de vista preliminar 3D en segundo plano (Ctrl + B)
fr_fr: Activer la navigation de l'aperçu 3D en arrière-plan (Ctrl+B).
it_it: Attiva la navigazione nell'anteprima sfondo 3D (CTRL+B)
ja_jp: 背景 3D プレビュー ナビゲーションを有効にする([Ctrl]+[B])
ko_kr: 배경 3D 미리보기 탐색 사용(Ctrl + B)
pl_pl: Włącz nawigację podglądu 3D tła (Ctrl + B)
pt_br: Ativar a navegação da visualização 3D no plano de fundo (Ctrl + B)
ru_ru: Включить навигацию в фоновом 3D-просмотре (CTRL+B)
zh_cn: 启用背景三维预览导航 (Ctrl + B)
zh_tw: 啟用背景 3D 預覽導覽 (Ctrl + B)

# InCanvasNodeButtonToolTip
source: Enable graph view navigation (Ctrl + B)
cs_cz: Povolit navigaci v zobrazení grafu (Ctrl+B)
de_de: Navigation in Diagrammansicht aktivieren (Strg + B)
es_es: Activar navegación de vista de gráfico (Ctrl + B)
fr_fr: Activer la navigation de la vue graphique (Ctrl+B).
it_it: Attiva navigazione nella vista grafico (CTRL+B)
ja_jp: グラフ ビュー ナビゲーションを有効にする([Ctrl]+[B])
ko_kr: 그래프 뷰 탐색 사용(Ctrl + B)
pl_pl: Włącz nawigację widoku wykresu (Ctrl + B)
pt_br: Ativar a navegação na vista gráfica (Ctrl + B)
ru_ru: Включение вида графика «Навигация» (CTRL+B)
zh_cn: 启用图表视图导航 (Ctrl + B)
zh_tw: 啟用圖表視圖導覽 (Ctrl + B)

# InCanvasPanButtonToolTip
source: Pan
cs_cz: Posun pohledu
de_de: Schwenken
es_es: Encuadrar
fr_fr: Panoramique
ja_jp: 画面移動
ko_kr: 초점이동
pl_pl: Przesuń
ru_ru: Панорамирование
zh_cn: 平移
zh_tw: 平移

# InCanvasZoomInButtonToolTip
source: Zoom In
cs_cz: Přiblížit
de_de: Vergrößern
es_es: Ampliar
fr_fr: Zoom avant
it_it: Zoom avanti
ja_jp: 拡大
ko_kr: 줌 확대
pl_pl: Powiększ
pt_br: Aproximar o zoom
ru_ru: Увеличить
zh_cn: 放大
zh_tw: 放大

# InCanvasZoomOutButtonToolTip
source: Zoom Out
cs_cz: Oddálit
de_de: Verkleinern
es_es: Reducir
fr_fr: Zoom arrière
it_it: Zoom indietro
ja_jp: 縮小
ko_kr: 줌 축소
pl_pl: Pomniejsz
pt_br: Afastar o zoom
ru_ru: Уменьшить
zh_cn: 缩小
zh_tw: 縮小

# InfoBubbleError
source: Error:
cs_cz: Chyba:
de_de: Fehler:
fr_fr: Erreur:
it_it: Errore:
ja_jp: エラー:
ko_kr: 오류:
pl_pl: Błąd:
pt_br: Erro:
ru_ru: Ошибка:
zh_cn: 错误:
zh_tw: 錯誤：

# InfoBubbleWarning
source: Warning:
cs_cz: Varování:
de_de: Warnung:
es_es: Advertencia:
fr_fr: Avertissement:
it_it: Avviso:
ja_jp: 警告:
ko_kr: 경고:
pl_pl: Ostrzeżenie:
pt_br: Aviso:
ru_ru: Предупреждение:
zh_cn: 警告:
zh_tw: 警告：

# InstalledPackageViewAdditionalFileLabel
source: Additional Files
cs_cz: Další soubory
de_de: Zusätzliche Dateien
es_es: Archivos adicionales
fr_fr: Fichiers supplémentaires
it_it: File aggiuntivi
ja_jp: 追加ファイル
ko_kr: 추가 파일
pl_pl: Dodatkowe pliki
pt_br: Arquivos adicionais
ru_ru: Дополнительные файлы
zh_cn: 其他文件
zh_tw: 其他檔案

# InstalledPackageViewAdditionalLabel
source: Additional Libraries
cs_cz: Další knihovny
de_de: Weitere Bibliotheken
es_es: Bibliotecas adicionales
fr_fr: Bibliothèques supplémentaires
it_it: Librerie aggiuntive
ja_jp: 追加のライブラリ
ko_kr: 추가 라이브러리
pl_pl: Dodatkowe biblioteki
pt_br: Bibliotecas adicionais
ru_ru: Дополнительные библиотеки
zh_cn: 附加库
zh_tw: 其他資源庫

# InstalledPackageViewContextMenuDeprecate
source: Deprecate
cs_cz: Odmítnout
de_de: Verwerfen
es_es: Declarar obsoleto
fr_fr: Révoquer
it_it: Imposta come obsoleto
ja_jp: 廃止
ko_kr: 사용 중단
pl_pl: Wycofaj
pt_br: Obsoleto
ru_ru: Исключить
zh_cn: 弃用
zh_tw: 棄用

# InstalledPackageViewContextMenuDeprecateTooltip
source: Set this package as deprecated. Only allowed if you're a current maintainer of the package.
cs_cz: Nastavit balíček jako odmítnutý. Povoleno pouze v případě, že máte aktuálně na starosti údržbu balíčku.
de_de: Dieses Paket als veraltet markieren. Dies ist nur zulässig, wenn Sie derzeit ein Maintainer des Pakets sind.
es_es: Define este paquete como obsoleto. Solo se permite si usted es mantenedor actual del paquete
fr_fr: Définir ce package comme obsolète. Autorisé uniquement si vous êtes un gestionnaire actif du package.
it_it: Imposta il pacchetto come obsoleto. L'operazione è consentita solo ai gestori del pacchetto.
ja_jp: このパッケージを廃止に設定します。現在、ユーザがパッケージを保持している場合にのみ実行可能です。
ko_kr: 이 패키지를 사용 중단된 것으로 설정합니다. 현재 패키지의 유지 담당자인 경우에만 허용됩니다.
pl_pl: Ustaw ten pakiet jako nieaktualny. Dozwolone tylko w przypadku aktualnego administratora pakietu.
pt_br: Definir este pacote como obsoleto. Somente permitido se você no momento for o mantenedor do pacote.
ru_ru: Исключение пакета. Действие разрешено только для разработчиков данного пакета.
zh_cn: 将该软件包设置为已弃用。仅当您是该软件包的当前维护人员时才允许执行此操作。
zh_tw: 將此套件設為已棄用。僅在您是套件的目前維護者，才允許。

# InstalledPackageViewContextMenuGetLatest
source: Get Latest Version
cs_cz: Získat poslední verzi
de_de: Letzte Version abrufen
es_es: Obtener última versión
fr_fr: Obtenir la dernière version
it_it: Ottieni versione più recente
ja_jp: 最新バージョンを取得
ko_kr: 최신 버전 가져오기
pl_pl: Pobierz najnowszą wersję
pt_br: Obter a versão mais recente
ru_ru: Получить последнюю версию
zh_cn: 获取最新版本
zh_tw: 取得最新版本

# InstalledPackageViewContextMenuGetLatestTooltip
source: Check if there is a newer version of this package and download it.
cs_cz: Zkontrolujte, zda existuje novější verze tohoto balíčku, a stáhněte ji.
de_de: Überprüfen Sie, ob eine neuere Version dieses Pakets vorhanden ist, und laden Sie sie herunter.
es_es: Comprueba si hay una versión más reciente de este paquete y la descarga
fr_fr: Vérifiez s'il existe une version plus récente de ce package et téléchargez-la.
it_it: Verificare se è disponibile una versione più recente del pacchetto e scaricarla.
ja_jp: このパッケージの新しいバージョンがあるかどうかを確認し、ダウンロードします。
ko_kr: 이 패키지의 최신 버전이 있는지 확인하고 다운로드합니다.
pl_pl: Sprawdź, czy dostępna jest nowsza wersja tego pakietu, i pobierz ją.
pt_br: Verifique se há uma versão mais recente deste pacote e faça o download.
ru_ru: Установите флажок, если имеется более новая версия этого пакета, и загрузите его.
zh_cn: 检查该软件包是否存在较新版本并进行下载。
zh_tw: 檢查是否有此套件的更新版本，並下載它。

# InstalledPackageViewContextMenuPublish
source: Publish...
cs_cz: Publikovat...
de_de: Veröffentlichen...
es_es: Publicar...
fr_fr: Publier...
it_it: Pubblica...
ja_jp: パブリッシュ...
ko_kr: 게시...
pl_pl: Opublikuj...
pt_br: Publicar...
ru_ru: Публикация...
zh_cn: 发布...
zh_tw: 發佈...

# InstalledPackageViewContextMenuPublishTooltip
source: Publish this package, if it has yet to be published.
cs_cz: Publikujte tento balíček, pokud dosud ještě nebyl publikován.
de_de: Veröffentlichen Sie das Paket, falls dies noch nicht geschehen ist.
es_es: Publica este paquete, si aún no se ha publicado
fr_fr: Publier ce package, s'il doit encore être publié.
it_it: Pubblica il pacchetto se non è ancora stato pubblicato.
ja_jp: パブリッシュが必要な場合は、このパッケージをパブリッシュします。
ko_kr: 이 패키지가 아직 게시되지 않은 경우 게시합니다.
pl_pl: Opublikuj ten pakiet, jeśli nie został jeszcze opublikowany.
pt_br: Publique este pacote, se ele ainda está para ser publicado.
ru_ru: Публикация данного пакета, если он еще не опубликован.
zh_cn: 如果该软件包尚未发布，则进行发布。
zh_tw: 如果尚未發佈此套件，請發佈。

# InstalledPackageViewContextMenuPublishVersion
source: Publish Version...
cs_cz: Publikovat verzi...
de_de: Version veröffentlichen...
es_es: Publicar versión...
fr_fr: Version de publication...
it_it: Pubblica versione...
ja_jp: パブリッシュ バージョン...
ko_kr: 버전 게시...
pl_pl: Opublikuj wersję...
pt_br: Publicar a versão...
ru_ru: Публикация версии...
zh_cn: 发布版本...
zh_tw: 發佈版本...

# InstalledPackageViewContextMenuPublishVersionTooltip
source: Publish a new version of this package, assuming it has already been published. Only allowed if you're a current maintainer of the package.
cs_cz: Publikujte novou verzi tohoto balíčku za předpokladu, že již byl publikován. Povoleno, pouze pokud máte aktuálně na starosti údržbu tohoto balíčku.
de_de: Veröffentlicht eine neue Version dieses Pakets, wobei angenommen wird, dass dieses zuvor bereits veröffentlicht wurde. Dies ist nur möglich, wenn Sie derzeit ein Maintainer des Pakets sind.
es_es: Publica una nueva versión de este paquete suponiendo que ya se haya publicado. Solo se permite si usted es mantenedor actual del paquete
fr_fr: Publier une nouvelle version de ce package, en supposant qu'il a déjà été publié. Autorisé uniquement si vous êtes le gestionnaire actuel du package.
it_it: Pubblica una nuova versione del pacchetto (supponendo che sia già stato pubblicato). L'operazione è consentita solo ai gestori del pacchetto.
ja_jp: パッケージが既にパブリッシュ済みであると仮定して、このパッケージの新しいバージョンをパブリッシュします。現在、ユーザがパッケージを保持している場合にのみ実行可能です。
ko_kr: 패키지가 이미 게시되었다는 가정 하에 이 패키지의 새 버전을 게시합니다. 현재 패키지의 유지 담당자인 경우에만 허용됩니다.
pl_pl: Opublikuj nową wersję tego pakietu przy założeniu, że został on już opublikowany. Dozwolone tylko w przypadku aktualnego administratora pakietu.
pt_br: Publique uma nova versão do pacote, assumindo que ele já tenha sido publicado. Somente permitido se você for o mantenedor atual do pacote.
ru_ru: Публикация новой версии данного пакета (предполагается, что он уже был опубликован ранее). Действие разрешено, если вы в данный момент являетесь разработчиком этого пакета.
zh_cn: 假设该软件包已发布，发布其新版本。仅当您是该软件包的当前维护人员时才允许执行此操作。
zh_tw: 發佈此套件的新版本，假設已發佈。僅在您是套件的目前維護者，才允許。

# InstalledPackageViewContextMenuRemoveDeprecation
source: Remove deprecation
cs_cz: Odstranit odmítnutí
de_de: Markierung als veraltet entfernen
es_es: Eliminar obsolescencia
fr_fr: Supprimer la révocation
it_it: Ripristina pacchetto obsoleto
ja_jp: 廃止を削除
ko_kr: 사용 중단 제거
pl_pl: Usuń nieaktualne komponenty
pt_br: Remover a obsolescência
ru_ru: Отменить исключение
zh_cn: 删除弃用
zh_tw: 移除棄用

# InstalledPackageViewContextMenuRemoveDeprecationTooltip
source: Remove package deprecation. Only allowed if you're a current maintainer of the package.
cs_cz: Odebrat odmítnutí balíčku. Povoleno pouze v případě, že máte aktuálně na starosti údržbu balíčku.
de_de: Markierung von Paket als veraltet entfernen. Dies ist nur zulässig, wenn Sie derzeit ein Maintainer des Pakets sind.
es_es: Eliminar obsolescencia de paquete. Solo se permite si el usuario es un mantenedor actual del paquete
fr_fr: Supprimer la révocation de package. Autorisé uniquement si vous êtes le gestionnaire actuel du package.
it_it: Ripristina un pacchetto dichiarato obsoleto. L'operazione è consentita solo ai gestori del pacchetto.
ja_jp: パッケージの廃止を削除します。現在、ユーザがパッケージを保持している場合にのみ実行可能です。
ko_kr: 사용 중단된 패키지를 제거합니다. 현재 패키지의 유지 담당자인 경우에만 허용됩니다.
pl_pl: Usuń nieaktualne komponenty pakietu. Dozwolone tylko, jeśli użytkownik jest bieżącym administratorem pakietu.
pt_br: Remover a obsolescência do pacote. Somente permitido se você for o mantenedor atual do pacote.
ru_ru: Отмена исключения пакета. Действие разрешено только для разработчиков данного пакета.
zh_cn: 删除软件包弃用。仅当您是该软件包的当前维护人员时才允许执行此操作。
zh_tw: 移除棄用套件。僅在您是套件的目前維護者，才允許移除。

# InstalledPackageViewContextMenuShowRootDir
source: Show Root Directory
cs_cz: Zobrazit kořenový adresář
de_de: Stammverzeichnis anzeigen
es_es: Mostrar directorio raíz
fr_fr: Afficher le répertoire racine
it_it: Mostra directory principale
ja_jp: ルート フォルダを表示
ko_kr: 루트 디렉토리 표시
pl_pl: Pokaż katalog główny
pt_br: Mostrar diretório raiz
ru_ru: Показать корневую папку
zh_cn: 显示根目录
zh_tw: 展示根目錄

# InstalledPackageViewContextMenuShowRootDirTooltip
source: Go to the root folder of this package
cs_cz: Přejděte do kořenové složky tohoto balíčku.
de_de: Wechseln zum Stammordner dieses Pakets
es_es: Va a la carpeta raíz de este paquete
fr_fr: Accéder au dossier racine de ce package
it_it: Passare alla cartella principale del pacchetto
ja_jp: このパッケージのルート フォルダに移動
ko_kr: 이 패키지의 루트 폴더로 이동
pl_pl: Przejdź do folderu głównego tego pakietu
pt_br: Siga para a pasta raiz deste pacote
ru_ru: Перейти к корневой папке данного пакета
zh_cn: 转到该软件包的根文件夹
zh_tw: 移至此套件的根資料夾

# InstalledPackageViewCustomNodesLabel
source: Custom Nodes
cs_cz: Vlastní uzly
de_de: Benutzerdefinierte Blöcke
es_es: Nodos personalizados
fr_fr: Noeuds personnalisés
it_it: Nodi personalizzati
ja_jp: カスタム ノード
ko_kr: 사용자 노드
pl_pl: Węzły niestandardowe
pt_br: Nós personalizados
ru_ru: Пользовательские узлы
zh_cn: 自定义节点
zh_tw: 自訂節點

# InstalledPackageViewNodeLibrariesLabel
source: Node Libraries
cs_cz: Knihovny uzlů
de_de: Blockbibliotheken
es_es: Bibliotecas de nodos
fr_fr: Bibliothèques de noeuds
it_it: Librerie nodo
ja_jp: ノード ライブラリ
ko_kr: 노드 라이브러리
pl_pl: Biblioteki węzłów
pt_br: Bibliotecas de nós
ru_ru: Библиотеки узлов
zh_cn: 节点库
zh_tw: 節點資源庫

# InstalledPackageViewPendingInstallButton
source: Pending uninstall
cs_cz: Nevyřízená odinstalace
de_de: Deinstallation ausstehend
es_es: Desinstalación pendiente
fr_fr: En attente de désinstallation
it_it: Disinstallazione in corso
ja_jp: 保留中のアンインストール
ko_kr: 보류 중인 설치제거
pl_pl: Oczekująca dezinstalacja
pt_br: Desinstalação pendente
ru_ru: Удаление отложено
zh_cn: 正在等待卸载
zh_tw: 待決解除安裝

# InstalledPackageViewTitle
source: Installed Packages
cs_cz: Nainstalované balíčky
de_de: Installierte Pakete
es_es: Paquetes instalados
fr_fr: Packages installés
it_it: Pacchetti installati
ja_jp: インストール済みパッケージ
ko_kr: 설치된 패키지
pl_pl: Zainstalowane pakiety
pt_br: Pacotes instalados
ru_ru: Установленные пакеты
zh_cn: 已安装软件包
zh_tw: 已安裝的套件

# InstallMessageCaption
source: Install Dynamo
cs_cz: Instalovat aplikaci Dynamo
de_de: Dynamo installieren
es_es: Instalar Dynamo
fr_fr: Installer Dynamo
it_it: Installa Dynamo
ja_jp: Dynamo をインストール
ko_kr: Dynamo 설치
pl_pl: Zainstaluj dodatek Dynamo
pt_br: Instalar o Dynamo
ru_ru: Установка Dynamo
zh_cn: 安装 Dynamo
zh_tw: 安裝 Dynamo

# InvalidLoginUrl
source: Invalid URL for login page!
cs_cz: Neplatná adresa URL pro přihlašovací stránku!
de_de: Ungültige URL für Anmeldeseite
es_es: URL no válida para página de inicio de sesión
fr_fr: URL incorrecte pour la page de connexion.
it_it: URL non valido per la pagina di login.
ja_jp: ログイン ページの URL が無効です!
ko_kr: 잘못된 로그인 페이지 URL!
pl_pl: Nieprawidłowy adres URL strony logowania!
pt_br: URL inválido para a página de login.
ru_ru: Недопустимый URL страницы входа в систему!
zh_cn: 登录页面 URL 无效！
zh_tw: 登入頁面的 URL 無效！
