Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# PreferencesViewRunSettingsLabel
source: Default Run Settings
cs_cz: Výchozí nastavení ramene
de_de: Vorgabe-Ausführungseinstellungen
es_es: Configuración de ejecución por defecto
fr_fr: Paramètres d'exécution par défaut
it_it: Impostazioni esecuzione di default
ja_jp: 既定の実行設定
ko_kr: 기본 실행 설정
pl_pl: Domyślne ustawienia przebiegu
pt_br: Configurações padrão de execução
ru_ru: Параметры выполнения по умолчанию
zh_cn: 默认运行设置
zh_tw: 預設執行設定

# PreferencesNodeAutocompleteMethod
source: Default Ranking Method
cs_cz: Výchozí metoda řazení
de_de: Vorgabe-Einstufungsmethode
es_es: Método de clasificación por defecto
fr_fr: Méthode de classement par défaut
it_it: Metodo di classificazione di default
ja_jp: 既定のランク付け方法
ko_kr: 기본 순위 지정 방법
pl_pl: Domyślna metoda klasyfikacji
pt_br: Método de classificação padrão
ru_ru: Метод ранжирования по умолчанию
zh_cn: 默认排名方法
zh_tw: 預設排名方法

# ObjectType
source: Node Type Match
cs_cz: Shoda typu uzlu
de_de: Blocktypübereinstimmung
es_es: Coincidencia de tipo de nodo
fr_fr: Correspondance du type de noeud
it_it: Corrispondenza tipo di nodo
ja_jp: ノード タイプ一致
ko_kr: 노드 유형 일치
pl_pl: Zgodność typu węzła
pt_br: Correspondência do tipo nó
ru_ru: Соответствие типа узла
zh_cn: 节点类型匹配
zh_tw: 節點類型相符

source: Recommended Nodes
cs_cz: Doporučené uzly
de_de: Empfohlene Blöcke
es_es: Nodos recomendados
fr_fr: Noeuds recommandés
it_it: Nodi consigliati
ja_jp: 推奨ノード
ko_kr: 권장 노드
pl_pl: Zalecane węzły
pt_br: Nós recomendados
ru_ru: Рекомендуемые узлы
zh_cn: 建议节点
zh_tw: 建議的節點

# DynamoViewExtensionsMenu
source: E_xtensions
cs_cz: R_ozšíření
de_de: _Erweiterungen
es_es: E_xtensiones
it_it: _Estensioni
ja_jp: 拡張機能(_X)
ko_kr: 확장(_X)
pl_pl: _Rozszerzenia
pt_br: E_xtensões
ru_ru: Рас_ширения
zh_cn: 扩展(_X)
zh_tw: 延伸(_X)

# ConnectorContextMenuHeaderBreakConnection
source: Break Connection
cs_cz: Přerušit připojení
de_de: Verbindung lösen
es_es: Interrumpir conexión
fr_fr: Couper la connexion
it_it: Interrompi connessione
ja_jp: 接続を解除
ko_kr: 연결 끊기
pl_pl: Przerwij połączenie
pt_br: Remover conexão
ru_ru: Разорвать соединение
zh_cn: 断开连接
zh_tw: 中斷連接

# ConnectorContextMenuHeaderShowConnector
source: Show Wire
cs_cz: Zobrazit drát
de_de: Draht anzeigen
es_es: Mostrar cable
fr_fr: Afficher le fil
it_it: Mostra filo
ja_jp: ワイヤを表示
ko_kr: 와이어 표시
pl_pl: Pokaż przewód
pt_br: Mostrar fio
ru_ru: Показать провод
zh_cn: 显示导线
zh_tw: 顯示線路

# ConnectorContextMenuHeaderSelectConnected
source: Select Connected
cs_cz: Vybrat připojené
de_de: Verbundene auswählen
es_es: Seleccionar conectados
fr_fr: Sélectionner les éléments connectés
it_it: Seleziona elementi collegati
ja_jp: 接続済みを選択
ko_kr: 연결된 항목 선택
pl_pl: Wybierz połączone
pt_br: Selecionar conectado
ru_ru: Выбрать соединенные
zh_cn: 选择已连接
zh_tw: 選取連接的

# ConnectorContextMenuHeaderUnpinConnector
source: Unpin Wire
cs_cz: Zrušit připnutí drátu
de_de: Drahtfixierung aufheben
es_es: Desbloquear cable
fr_fr: Détacher le fil
it_it: Sblocca filo
ja_jp: ワイヤを固定解除
ko_kr: 와이어 고정 해제
pl_pl: Odepnij przewód
pt_br: Desafixar fio
ru_ru: Открепить провод
zh_cn: 取消固定导线
zh_tw: 取消固定線路

# PreferencesViewPython
source: Python
cs_cz: Jazyk Python

# PreferencesViewRequiresRelaunchOfDynamo
source: Requires relaunch of Dynamo
cs_cz: Vyžaduje nové spuštění aplikace Dynamo
de_de: Erfordert Neustart von Dynamo
es_es: Requiere que se reinicie Dynamo.
fr_fr: Nécessite le redémarrage de Dynamo
it_it: Richiede il riavvio di Dynamo
ja_jp: Dynamo の再起動が必要です
ko_kr: Dynamo 재시작 필요
pl_pl: Wymaga ponownego uruchomienia dodatku Dynamo
pt_br: É necessário reinicializar o Dynamo
ru_ru: Требуется перезапуск Dynamo
zh_cn: 需要重新启动 Dynamo
zh_tw: 需要重新啟動 Dynamo

# MessagePackageDepsInBuiltinPackages
source: {0} has dependencies that conflict with the following built-in package(s): {1}. Dependency conflicts could cause unintended behavior to occur. Do you wish to continue trying to install {0}?
cs_cz: {0} má závislosti, které jsou v konfliktu s následujícími vestavěnými balíčky: {1}. Konflikty závislostí by mohly způsobit nežádoucí chování. Chcete pokračovat v pokusu o instalaci {0}?
de_de: {0} verfügt über Abhängigkeiten, die Konflikte mit den folgenden integrierten Paketen verursachen: {1}. Abhängigkeitskonflikte können zu unbeabsichtigtem Verhalten führen. Möchten Sie mit der Installation von {0} fortfahren?
es_es: {0} presenta dependencias que entran en conflicto con los siguientes paquetes integrados: {1}. Los conflictos de dependencia podrían provocar un comportamiento no deseado. ¿Desea seguir intentando instalar {0}?
fr_fr: {0} a des dépendances qui sont en conflit avec le(s) package(s) intégré(s) suivant(s): {1}. Les conflits de dépendances peuvent entraîner un comportement inattendu. Voulez-vous poursuivre l'installation de {0}?
ko_kr: {0}에 기본 제공 패키지인 {1}과(와) 충돌하는 종속성이 있습니다. 종속성 충돌로 인해 의도하지 않은 동작이 발생할 수 있습니다. {0}의 설치 시도를 계속하시겠습니까?
pl_pl: {0} ma zależności, które powodują konflikt z następującymi pakietami wbudowanymi: {1}. Konflikty zależności mogą powodować niezamierzone zachowanie. Czy chcesz kontynuować próbę zainstalowania {0}?
pt_br: {0} tem dependências em conflito com os seguintes pacotes internos: {1}. Os conflitos de dependências podem causar comportamento não intencional. Deseja continuar tentando instalar {0}?
ru_ru: {0} имеет зависимости, которые конфликтуют со следующими встроенными пакетами: {1}. Конфликты зависимостей могут привести к непредвиденному поведению. Продолжить установку {0}?
zh_cn: {0} 的依存关系与以下内置软件包冲突: {1}. 依存关系冲突可能会导致发生意外行为。 是否要继续尝试安装 {0}？

# MessageSamePackageDiffVersInBuiltinPackages
source: {0} cannot be installed as it conflicts with a different version of the built-in package, {1}, which is already installed. You can try disabling loading packages from built-in package paths, or unload the conflicting package, then restart {2} and download {0} again.
cs_cz: {0} nelze nainstalovat, protože je v konfliktu s jinou verzí vestavěného balíčku {1}, který je již nainstalován. Můžete zkusit zakázat načítání balíčků pomocí cest vestavěných balíčků, případně uvolnit konfliktní balíček, poté restartovat {2} a stáhnout {0} znovu.
de_de: {0} kann nicht installiert werden, da es einen Konflikt mit einer anderen, bereits installierten Version des integrierten Pakets, {1}, verursacht. Deaktivieren Sie das Laden von Paketen aus Pfaden für integrierte Pakete, oder entfernen Sie das den Konflikt verursachende Paket, starten Sie {2} erneut, und laden Sie {0} noch einmal herunter.
es_es: {0} no puede instalarse porque entra en conflicto con una versión diferente del paquete integrado, {1}, que ya está instalado. Puede intentar desactivar la carga de paquetes desde las rutas de paquetes integrados o descargar el paquete en conflicto y, a continuación, reiniciar {2} y descargar {0} de nuevo.
fr_fr: {0} ne peut pas être installé en raison d'un conflit avec une autre version du package intégré {1}, déjà installée. Vous pouvez essayer de désactiver le chargement de packages à partir des chemins de packages intégrés, ou annuler le chargement du package en conflit, puis redémarrer {2} et télécharger à nouveau {0}.
ko_kr: 이미 설치되어 있는 내장 패키지인 {1}의 다른 버전과 충돌하므로 {0}을(를) 설치할 수 없습니다. 내장 패키지 경로에서 패키지 로드를 비활성화해 보거나 충돌하는 패키지를 언로드한 다음 {2}을(를) 다시 시작하고 {0}을(를) 다시 다운로드할 수 있습니다.
pl_pl: Nie można zainstalować składnika {0}, ponieważ jest w konflikcie z inną, już zainstalowaną wersją pakietu wbudowanego: {1}. Możesz spróbować wyłączyć wczytywanie pakietów ze ścieżek pakietów wbudowanych lub usunąć z pamięci pakiet powodujący konflikt, a następnie ponownie uruchomić {2} i ponownie pobrać {0}.
pt_br: Não é possível instalar o {0} porque tem conflitos com uma versão diferente do pacote interno, {1}, que já está instalado. Você pode tentar desativar o carregamento de pacotes nos caminhos do pacote interno ou descarregue o pacote conflitante, reinicie {2} e faça o download de {0} novamente.
ru_ru: Невозможно установить {0}, так как эта версия конфликтует с другой уже установленной версией встроенного пакета {1}. Можно попробовать отключить загрузку пакетов из путей встроенных пакетов или выгрузить конфликтующий пакет, а затем перезапустить {2} и скачать {0} еще раз.
zh_cn: {0} 无法安装，因为它与已安装的其他版本的内置软件包 {1} 冲突。 可以尝试禁止从内置软件包路径加载软件包，也可以卸载冲突的软件包，然后重新启动 {2} 并再次下载 {0}。

# MessageSamePackageSameVersInBuiltinPackages
source: The same version of package {0} is already installed as a built-in package and does not need to be installed again.
cs_cz: Stejná verze balíčku {0} je již nainstalována jako vestavěný balíček a není nutné ji znovu instalovat.
ko_kr: 동일한 버전의 패키지 {0}이(가) 내장 패키지로 이미 설치되어 있으므로 다시 설치할 필요가 없습니다.

# MessageSamePackageSameVersInLocalPackages
source: The same version of {0} is already installed and does not need to be installed again.
cs_cz: Již je nainstalována stejná verze balíčku {0} a není třeba ji instalovat znovu.
de_de: Die gleiche Version von {0} ist bereits installiert und muss nicht erneut installiert werden.
es_es: La misma versión de {0} ya está instalada y no es necesario instalarla de nuevo.
fr_fr: La même version de {0} est déjà installée, il n'est pas nécessaire de la réinstaller.
it_it: La stessa versione di {0} è già stata installata e non è necessario installarla nuovamente.
ja_jp: 同じバージョンの {0} が既にインストールされているため、再インストールする必要はありません。
ko_kr: 동일한 버전의 {0}이(가) 이미 설치되어 있으므로 다시 설치할 필요가 없습니다.
pl_pl: Ta sama wersja oprogramowania {0} jest już zainstalowana i nie trzeba jej instalować ponownie.
pt_br: A mesma versão do {0} já está instalada e não precisa ser instalada novamente.
ru_ru: Эта же версия {0} уже установлена и не требует повторной установки.
zh_cn: 同一版本的 {0} 已安装，无需再次安装。
zh_tw: 已安裝同版本的 {0}，不需要再次安裝。

# MessageSamePackageDiffVersInLocalPackages
source: Package {0} cannot be installed as it conflicts with a different version, {1}, which is already installed. Do you wish to uninstall {1}? Restart {2} to complete the uninstall and try downloading {0} again.
cs_cz: Balíček {0} není možné nainstalovat, protože je v konfliktu s jinou verzí, {1}, která je již nainstalována. Chcete {1} odinstalovat? Restartujte {2}, aby se dokončila odinstalace, a zkuste {0} stáhnout znovu.
de_de: Paket {0} kann nicht installiert werden, da es Konflikte mit einer anderen bereits installierten Version, {1}, verursacht. Möchten Sie {1} deinstallieren? Starten Sie {2} neu, um die Deinstallation abzuschließen, und laden Sie {0} dann erneut herunter.
es_es: El paquete {0} no se puede instalar porque entra en conflicto con una versión diferente, {1}, que ya está instalada. ¿Desea desinstalar {1}? Reinicie {2} para completar la desinstalación e intente descargar {0} de nuevo.
fr_fr: Impossible d'installer le package {0}, car il est en conflit avec une autre version, {1}, qui est déjà installée. Voulez-vous désinstaller {1}? Redémarrez {2} pour finaliser la désinstallation, puis téléchargez {0}.
ko_kr: 이미 설치되어 있는 다른 버전인 {1}과(와) 충돌하기 때문에 {0} 패키지를 설치할 수 없습니다. {1}을(를) 설치제거하시겠습니까? {2}을(를) 다시 시작하여 설치제거를 완료하고 {0}을(를) 다시 다운로드해 보십시오.
pl_pl: Nie można zainstalować pakietu {0}, ponieważ jest w konflikcie z inną, już zainstalowaną wersją: {1}. Czy chcesz odinstalować wersję {1}? Ponownie uruchom {2}, aby dokończyć dezinstalację, i spróbuj ponownie pobrać {0}.
pt_br: Não é possível instalar o pacote {0} porque está em conflito com uma versão diferente, {1}, que já está instalada. Deseja desinstalar o {1}? Reinicie o {2} para concluir a desinstalação e tente fazer o download {0} novamente.
ru_ru: Невозможно установить пакет {0}, так как он конфликтует с другой уже установленной версией {1}. Удалить {1}? Перезапустите {2}, чтобы завершить удаление, и попробуйте повторно скачать {0}.
zh_cn: 软件包 {0} 无法安装，因为它与已安装的其他版本 {1} 冲突。 是否要卸载 {1}？重新启动 {2} 以完成卸载，然后再次尝试下载 {0}。

# PreferencesViewVisualSettingsGroupStyles
source: Group Styles
cs_cz: Skupiny
de_de: Gruppen
es_es: Grupos
fr_fr: Groupes
it_it: Gruppi
ja_jp: グループ
ko_kr: 그룹
pl_pl: Grupy
pt_br: Grupos
ru_ru: Группы
zh_cn: 组
zh_tw: 群組

# PreferencesViewVisualSettingsRenderPrecision
source: Render Precision
cs_cz: Přesnost rendrování
de_de: Rendergenauigkeit
es_es: Precisión de renderización
fr_fr: Précision du rendu
it_it: Precisione di rendering
ja_jp: レンダリング精度
ko_kr: 렌더링 정밀도
pl_pl: Dokładność renderowania
pt_br: Precisão da renderização
ru_ru: Точность визуализации
zh_cn: 渲染精度
zh_tw: 彩現精確度

# PreferencesViewAlreadyExistingStyleWarning
source: Style name already in use
cs_cz: Název stylu je již používán
de_de: Stilname wird bereits verwendet
es_es: Ya se está utilizando el nombre de estilo.
fr_fr: Nom de style déjà utilisé
it_it: Nome dello stile già in uso
ja_jp: スタイル名は既に使用されています
ko_kr: 스타일 이름이 이미 사용 중임
pl_pl: Nazwa stylu jest już używana
pt_br: O nome do estilo já está em uso
ru_ru: Имя стиля уже используется
zh_cn: 样式名已在使用
zh_tw: 型式名稱已在使用中

# PreferencesViewVisualSettingsDisplaySettings
source: Display Settings
cs_cz: Nastavení zobrazení
de_de: Anzeigeeinstellungen
es_es: Configuración de visualización
fr_fr: Paramètres d'affichage
it_it: Impostazioni di visualizzazione
ja_jp: 表示設定
ko_kr: 화면표시 설정
pl_pl: Ustawienia wyświetlania
pt_br: Configurações de exibição
ru_ru: Параметры отображения
zh_cn: 显示设置
zh_tw: 顯示設定

# PreferencesViewVisualSettingShowEdges
source: Show Edges
cs_cz: Zobrazit hrany
de_de: Kanten anzeigen
es_es: Mostrar aristas
fr_fr: Afficher les arêtes
it_it: Mostra bordi
ja_jp: エッジを表示
ko_kr: 모서리 표시
pl_pl: Pokaż krawędzie
pt_br: Mostrar arestas
ru_ru: Показать ребра
zh_cn: 显示边
zh_tw: 展示邊

# PreferencesViewVisualSettingsIsolateSelectedGeo
source: Isolate Selected Geometry
cs_cz: Izolovat vybranou geometrii
de_de: Ausgewählte Geometrie isolieren
es_es: Aislar geometría seleccionada
fr_fr: Isoler la géométrie sélectionnée
it_it: Isola geometria selezionata
ja_jp: 選択したジオメトリを選択表示
ko_kr: 선택한 형상 분리
pl_pl: Izoluj wybraną geometrię
pt_br: Isolar geometria selecionada
ru_ru: Изолировать выбранную геометрию
zh_cn: 隔离选定的几何图形
zh_tw: 隔離所選幾何圖形

# PackagePathViewModel_BuiltInPackages
source: Dynamo Built-In Packages
cs_cz: Vestavěné balíčky aplikace Dynamo
de_de: Integrierte Dynamo-Pakete
es_es: Paquetes integrados de Dynamo
fr_fr: Packages intégrés à Dynamo
it_it: Pacchetti incorporati in Dynamo
ja_jp: Dynamo 組み込みパッケージ
ko_kr: Dynamo 내장 패키지
pl_pl: Pakiety wbudowane dodatku Dynamo
pt_br: Pacotes internos do Dynamo
ru_ru: Встроенные пакеты Dynamo
zh_cn: Dynamo 内置软件包
zh_tw: Dynamo 內建套件

# PreferencesViewSavedChangesLabel
source: All changes saved automatically
cs_cz: Všechny změny byly uloženy automaticky
de_de: Alle Änderungen werden automatisch gespeichert
es_es: Todos los cambios se han guardado automáticamente.
fr_fr: Toutes les modifications sont enregistrées automatiquement
it_it: Tutte le modifiche salvate automaticamente
ja_jp: すべての変更は自動的に保存されました
ko_kr: 모든 변경 사항이 자동으로 저장됨
pl_pl: Wszystkie zmiany zapisane automatycznie
pt_br: Todas as alterações foram salvas automaticamente
ru_ru: Все изменения сохраняются автоматически
zh_cn: 所有更改已自动保存
zh_tw: 所有變更已自動儲存

# PreferencesViewSavedChangesTooltip
source: Last saved:
cs_cz: Naposledy uloženo:
de_de: Zuletzt gespeichert:
es_es: Guardado por última vez:
fr_fr: Dernier enregistrement:
it_it: Ultimo salvataggio:
ja_jp: 最終保存日時:
ko_kr: 마지막으로 저장됨:
pl_pl: Ostatnio zapisano:
pt_br: Salvo pela última vez:
ru_ru: Последнее сохранение:
zh_cn: 上次保存时间:
zh_tw: 上次儲存:

# PreferencesViewEnableNodeAutoCompleteTooltipText
source: Learn more about Node Autocomplete feature.
cs_cz: Další informace o funkci automatického dokončování uzlů.
de_de: Weitere Informationen zur Funktion Automatische Blockvervollständigung.
es_es: Obtenga más información sobre la función Autocompletar nodo.
fr_fr: En savoir plus sur la fonction de saisie automatique de noeud.
it_it: Sono fornite ulteriori informazioni sulla funzionalità Completamento automatico nodi.
ja_jp: ノード オートコンプリート機能の詳細を確認します。
ko_kr: 노드 자동 완성 기능에 대해 자세히 알아봅니다.
pl_pl: Dowiedz się więcej na temat funkcji automatycznego uzupełniania węzłów.
pt_br: Saiba mais sobre o recurso de preenchimento automático de nós.
ru_ru: Подробнее о функции автозаполнения узлов.
zh_cn: 了解有关“节点自动完成”功能的详细信息。
zh_tw: 進一步瞭解「節點自動完成」功能。

# AddStyleButton
source: Add Style
cs_cz: Přidat styl
de_de: Neuer Stil
es_es: Añadir estilo
fr_fr: Aj. style
it_it: Agg. stile
ja_jp: スタイルを追加
ko_kr: 스타일 추가
pl_pl: Dodaj styl
pt_br: Adic estilo
ru_ru: Доб. стиль
zh_cn: 添加样式
zh_tw: 加入型式

# ResetCPythonButtonText
source: Reset CPython
cs_cz: Obnovit CPython
de_de: CPython zurücksetzen
es_es: Restablecer CPython
fr_fr: Réinitialiser CPython
it_it: Reimposta CPython
ja_jp: CPython をリセット
ko_kr: CPython 재설정
pl_pl: Resetuj środowisko CPython
pt_br: Redefinir CPython
ru_ru: Сбросить CPython
zh_cn: 重置 CPython
zh_tw: 重設 CPython

# ResetCPythonButtonToolTip
source: Resets CPython environment by reloading modules.
cs_cz: Obnoví prostředí CPython opakovaným načtením modulů.
de_de: Setzt die CPython-Umgebung durch erneutes Laden von Modulen zurück.
es_es: Restablece el entorno de CPython mediante la recarga de los módulos.
fr_fr: Réinitialise l'environnement CPython en rechargeant les modules.
it_it: Reimposta l'ambiente CPython ricaricando i moduli.
ja_jp: モジュールを再ロードして CPython 環境をリセットします。
ko_kr: 모듈을 다시 로드하여 CPython 환경을 재설정합니다.
pl_pl: Resetuje środowisko CPython przez ponowne wczytanie modułów.
pt_br: Redefine o ambiente CPython recarregando os módulos.
ru_ru: Сброс среды CPython путем перезагрузки модулей.
zh_cn: 通过重新加载模块重置 CPython 环境。
zh_tw: 透過重新載入模組來重設 CPython 環境。

# GraphIssuesOnSave_CancelBtn
source: Cancel and Show Issues
cs_cz: Zrušit a zobrazit problémy
de_de: Abbrechen und Probleme anzeigen
es_es: Cancelar y mostrar incidencias
fr_fr: Annuler et afficher les problèmes
it_it: Annulla e mostra problemi
ja_jp: キャンセルして問題を表示
ko_kr: 취소 및 문제 표시
pl_pl: Anuluj i pokaż problemy
pt_br: Cancelar e mostrar problemas
ru_ru: Отменить и показать проблемы
zh_cn: 取消并显示问题
zh_tw: 取消並展示問題

# GraphIssuesOnSave_Description
source: There are unresolved issues with the graph type. If this graph is designed to be used outside of Dynamo, resolve all issues and save the graph again.
cs_cz: U tohoto typu grafu existují nevyřešené problémy. Pokud je tento graf navržen k použití mimo aplikaci Dynamo, vyřešte všechny problémy a graf znovu uložte.
de_de: Es sind nicht behobene Probleme mit dem Diagrammtyp vorhanden. Wenn dieses Diagramm für die Verwendung außerhalb von Dynamo vorgesehen ist, beheben Sie alle Probleme, und speichern Sie das Diagramm erneut.
es_es: Hay incidencias sin resolver en relación con el tipo de gráfico. Si este gráfico se ha diseñado para utilizarse fuera de Dynamo, resuelva todas las incidencias y guarde de nuevo el gráfico.
fr_fr: Le type de graphique présente des problèmes non résolus. Si ce graphique est conçu pour être utilisé en dehors de Dynamo, résolvez tous les problèmes et enregistrez à nouveau le graphique.
it_it: Sono presenti problemi irrisolti relativi al tipo di grafico. Se questo grafico è stato progettato per essere utilizzato al di fuori di Dynamo, risolvere tutti i problemi e salvare nuovamente il grafico.
ja_jp: グラフ タイプに未解決の問題がいくつかあります。このグラフが Dynamo の外部で使用するように設計されている場合は、すべての問題を解決して、グラフを再度保存してください。
ko_kr: 해당 그래프 유형에 대해 해결되지 않은 문제가 있습니다. 이 그래프가 Dynamo 외부에서 사용하도록 설계된 경우 모든 문제를 해결한 후 그래프를 다시 저장하십시오.
pl_pl: Występują nierozwiązane problemy z typem wykresu. Jeśli wykres jest przeznaczony do użycia poza dodatkiem Dynamo, rozwiąż wszystkie problemy i zapisz wykres ponownie.
pt_br: Existem problemas não resolvidos com o tipo de gráfico. Se esse gráfico tiver sido projetado para ser usado fora do Dynamo, resolva todos os problemas e salve o gráfico novamente.
ru_ru: Имеются неустраненные проблемы, связанные с типом графика. Если этот график предназначен для использования вне Dynamo, устраните все проблемы и сохраните его повторно.
zh_cn: 存在相应图形类型的未解决问题。如果此图形设计为在 Dynamo 之外使用，请解决所有问题并再次保存该图形。
zh_tw: 圖表類型有未解決的問題。如果此圖表是設計為在 Dynamo 之外使用，請解決所有問題並再儲存一次圖表。

# GraphIssuesOnSave_ProceedBtn
source: Save with Issues
cs_cz: Uložit s problémy
de_de: Mit Problemen speichern
es_es: Guardar con incidencias
fr_fr: Enregistrer avec les problèmes
it_it: Salva con problemi
ja_jp: 問題を含めて保存
ko_kr: 문제가 있는 상태로 저장
pl_pl: Zapisz z problemami
pt_br: Salvar com problemas
ru_ru: Сохранить с проблемами
zh_cn: 带问题一起保存
zh_tw: 帶著問題儲存

# GraphIssuesOnSave_Summary
source: You are trying to save a graph with unresolved issues
cs_cz: Pokoušíte se uložit graf s nevyřešenými problémy.
de_de: Sie versuchen, ein Diagramm mit nicht gelösten Problemen zu speichern
es_es: Está intentando guardar un gráfico con incidencias no resueltas.
fr_fr: Vous essayez d'enregistrer un graphique avec des problèmes non résolus
it_it: Si sta tentando di salvare un grafico con problemi irrisolti
ja_jp: 未解決の問題があるグラフを保存しようとしています
ko_kr: 해결되지 않은 문제가 있는 그래프를 저장하려고 합니다.
pl_pl: Próbujesz zapisać wykres z nierozwiązanymi problemami
pt_br: Você está tentando salvar um gráfico com problemas não resolvidos
ru_ru: Вы пытаетесь сохранить график с неустраненными проблемами
zh_cn: 您正在尝试保存问题尚未解决的图形
zh_tw: 您嘗試儲存的圖表有未解決的問題

# GraphIssuesOnSave_Title
source: Graph Type Issues found
cs_cz: Byly nalezeny problémy s typem grafu
de_de: Probleme mit Diagrammtyp gefunden
es_es: Incidencias de tipo de gráfico encontradas
fr_fr: Problèmes de type de graphique trouvés
it_it: Rilevati problemi del tipo di grafico
ja_jp: グラフ タイプの問題が見つかりました
ko_kr: 그래프 유형 문제가 발견됨
pl_pl: Znaleziono problemy dotyczące typu wykresu
pt_br: Problemas encontrados relativos ao tipo de gráfico
ru_ru: Обнаружены проблемы в типе графика
zh_cn: 发现的图形类型问题
zh_tw: 發現圖表類型問題

# PackagePathsExpanderName
source: Node and Package File Locations
cs_cz: Umístění souborů uzlů a balíčků
de_de: Dateispeicherorte für Blöcke und Pakete
es_es: Ubicaciones de archivo de nodos y paquetes
fr_fr: Chemins d'accès des noeuds et packages
it_it: Posizioni di file di pacchetti e nodi
ja_jp: ノードとパッケージ ファイルの場所
ko_kr: 노드 및 패키지 파일 위치
pl_pl: Lokalizacje plików węzłów i pakietów
pt_br: Localizações dos arquivos de nós e pacotes
ru_ru: Пути к узлу и файлу пакета
zh_cn: 节点和软件包文件位置
zh_tw: 節點和套件檔案位置

# PreferencesPackageManagerSettingsTab
source: Package Manager
cs_cz: Nastavení balíčku
de_de: Paketeinstellungen
es_es: Configuración de paquetes
fr_fr: Paramètres de package
it_it: Impostazioni pacchetto
ja_jp: パッケージの設定
ko_kr: 패키지 설정
pl_pl: Ustawienia pakietu
pt_br: Configurações do pacote
ru_ru: Параметры пакета
zh_cn: 软件包设置
zh_tw: 套件設定

# PackagePathAddPathButtonName
source: Add Path
cs_cz: Přidat cestu
de_de: Pfad hinzufügen
es_es: Añadir ruta
fr_fr: Ajouter un chemin
it_it: Aggiungi percorso
ja_jp: パスを追加
ko_kr: 경로 추가
pl_pl: Dodaj ścieżkę
pt_br: Adicionar caminho
ru_ru: Добавить путь
zh_cn: 添加路径
zh_tw: 加入路徑

# PackagePathPreferencesTitle
source: Package/Library Search Paths
cs_cz: Cesty hledání balíčku/knihovny
de_de: Paket-/Bibliothekssuchpfade
es_es: Rutas de búsqueda de paquete/biblioteca
fr_fr: Chemins de recherche de package/bibliothèque
it_it: Percorsi di ricerca di pacchetti/librerie
ja_jp: パッケージ/ライブラリ検索パス
ko_kr: 패키지/라이브러리 검색 경로
pl_pl: Ścieżki wyszukiwania pakietów/bibliotek
pt_br: Caminhos de pesquisa de pacotes/bibliotecas
ru_ru: Пути поиска пакетов/библиотек
zh_cn: 软件包/库搜索路径
zh_tw: 套件/資源庫搜尋路徑
