Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# MessagePackageTargetOtherHosts
source: The package or one of its dependencies targets a different environment, such as Revit, Civil 3D, Advance Steel, Alias or FormIt. This can cause instability and unexpected problems. Do you want to continue?
cs_cz: Balíček nebo jedna z jeho závislostí se zaměřuje na jiné prostředí, například Revit, Civil 3D, Advance Steel, Alias nebo FormIt. To může způsobit nestabilitu a neočekávané problémy. Chcete pokračovat?
de_de: Das Paket oder eine seiner Abhängigkeiten zielt auf eine andere Umgebung ab, z. B. Revit, Civil 3D, Advance Steel, Alias oder FormIt. Dies kann zu Instabilität und unerwarteten Problemen führen. Möchten Sie fortfahren?
es_es: El paquete o una de sus dependencias tienen como destino un entorno diferente, como Revit, Civil 3D, Advance Steel, Alias o FormIt. Esto puede provocar inestabilidad y problemas inesperados. ¿Desea continuar?
fr_fr: Le package ou l'une de ses dépendances cible un environnement différent, tel que Revit, Civil 3D, Advance Steel, Alias ou FormIt. Cela peut provoquer des problèmes inattendus et d'instabilité. Voulez-vous continuer?
it_it: Il pacchetto o una delle relative dipendenze è destinato ad un ambiente diverso, ad esempio Revit, Civil 3D, Advance Steel, Alias o FormIt. Ciò può causare instabilità e problemi imprevisti. Continuare?
ja_jp: パッケージまたはその依存関係の 1 つが、Revit、Civil 3D、Advance Steel、Alias、FormIt などの異なる環境を対象としています。そのため、不安定となり予期しない問題が発生する可能性があります。続行しますか?
ko_kr: 패키지 또는 해당 종속성 중 하나가 Revit, Civil 3D, Advance Steel, Alias 또는 FormIt 등의 다른 환경을 대상으로 합니다. 이로 인해 불안정해지고 예기치 않은 문제가 발생할 수 있습니다. 계속하시겠습니까?
pl_pl: Ten pakiet lub jedna z jego zależności jest przeznaczona dla innego środowiska, takiego jak Revit, Civil 3D, Advance Steel, Alias lub FormIt. Może to spowodować niestabilność i nieoczekiwane problemy. Czy chcesz kontynuować?
pt_br: O pacote ou uma de suas dependências tem como alvo um ambiente diferente, como o Revit, Civil 3D, Advance Steel, Alias ou FormIt. Isso pode causar instabilidade e problemas inesperados. Deseja continuar?
ru_ru: Пакет или одна из его зависимостей предназначены для другой среды, например Revit, Civil 3D, Advance Steel, Alias или FormIt. Это может привести к нестабильной работе и возникновению непредвиденных проблем. Продолжить?
zh_cn: 该软件包或其依赖项之一针对其他环境，例如 Revit、Civil 3D、Advance Steel、Alias 或 FormIt。这可能会导致出现不稳定和意外问题。是否要继续？
zh_tw: 套件或其中一個相依性是針對不同環境，例如 Revit、Civil 3D、Advance Steel、Alias 或 FormIt。這可能會導致不穩定和非預期的問題。是否要繼續？

# RunBlockedMessage
source: Run blocked.
cs_cz: Spuštění je blokováno.
de_de: Ausführung blockiert.
es_es: Ejecución bloqueada.
fr_fr: Exécution bloquée.
it_it: Esecuzione bloccata.
ja_jp: 実行がブロックされました。
ko_kr: 실행이 차단되었습니다.
pl_pl: Uruchomienie zablokowane.
pt_br: Executar bloqueado.
ru_ru: Выполнение заблокировано.
zh_cn: 运行已被阻止。
zh_tw: 執行被阻止。

# FooterNotificationErrorTooltip
source: Click to cycle through nodes with errors.
cs_cz: Kliknutím procházejte uzly s chybami.
de_de: Klicken Sie, um durch fehlerhafte Blöcke zu blättern.
es_es: Haga clic para recorrer los nodos con errores.
fr_fr: Cliquez pour parcourir les noeuds avec des erreurs.
it_it: Fare clic per scorrere i nodi con errori.
ja_jp: クリックすると、エラーのあるノードを循環します。
ko_kr: 오류가 있는 노드를 순환하려면 클릭합니다.
pl_pl: Klikaj, aby przełączać się między węzłami z błędami.
pt_br: Clique para percorrer os nós com erros.
ru_ru: Нажимайте для циклического перебора узлов с ошибками.
zh_cn: 单击以循环浏览带有错误的节点。
zh_tw: 按一下以循環檢視有錯誤的節點。

# FooterNotificationInfoTooltip
source: Click to cycle through nodes with info states.
cs_cz: Kliknutím procházejte uzly s informačními stavy.
de_de: Klicken Sie, um durch Blöcke mit Infostatus zu blättern.
es_es: Haga clic para recorrer los nodos con estados de información.
fr_fr: Cliquez pour parcourir les noeuds avec des états d'informations.
it_it: Fare clic per scorrere i nodi con stati informativi.
ja_jp: クリックすると、情報状態のノードを循環します。
ko_kr: 정보 상태가 있는 노드를 순환하려면 클릭합니다.
pl_pl: Klikaj, aby przełączać się między węzłami ze stanami informacji.
pt_br: Clique para percorrer os nós com estados de informação.
ru_ru: Нажимайте для циклического перебора узлов с информационными состояниями.
zh_cn: 单击以循环浏览带有信息状态的节点。
zh_tw: 按一下以循環檢視有資訊狀態的節點。

# FooterNotificationWarningTooltip
source: Click to cycle through nodes with warnings.
cs_cz: Kliknutím procházejte uzly s upozorněními.
de_de: Klicken Sie, um durch die Blöcke mit Warnungen zu blättern.
es_es: Haga clic para recorrer los nodos con advertencias.
fr_fr: Cliquez pour parcourir les noeuds avec des avertissements.
it_it: Fare clic per scorrere i nodi con avvisi.
ja_jp: クリックすると、警告のあるノードを循環します。
ko_kr: 경고가 있는 노드를 순환하려면 클릭합니다.
pl_pl: Klikaj, aby przełączać się między węzłami z ostrzeżeniami.
pt_br: Clique para percorrer os nós com avisos.
ru_ru: Нажимайте для циклического перебора узлов с предупреждениями.
zh_cn: 单击以循环浏览带有警告的节点。
zh_tw: 按一下以循環顯示有警告的節點。

# TrustLocationAddedNotification
source: You have trusted file location: {0}
cs_cz: Máte důvěryhodné umístění souboru: {0}
de_de: Sie haben einen vertrauenswürdigen Speicherort für die Datei: {0}
es_es: Tiene una ubicación de archivo de confianza: {0}
fr_fr: Vous disposez d'un emplacement de fichier de confiance: {0}
it_it: La posizione del file attendibile è: {0}
ja_jp: 信頼できるファイルの場所が追加されました: {0}
ko_kr: 신뢰할 수 있는 파일 위치가 있음: {0}
pl_pl: Dodano zaufanie do lokalizacji pliku: {0}
pt_br: Você tem uma localização de arquivo confiável: {0}
ru_ru: Доверенные расположения файла: {0}
zh_cn: 您有受信任的文件位置: {0}
zh_tw: 您已經信任檔案位置: {0}

# TrustLocationSkippedNotification
source: File location was not added to trusted locations.
cs_cz: Nebylo přidáno žádné důvěryhodné umístění.
de_de: Der Dateispeicherort wurde nicht zu den vertrauenswürdigen Speicherorten hinzugefügt.
es_es: La ubicación del archivo no se ha añadido a las ubicaciones de confianza.
fr_fr: L'emplacement du fichier n'a pas été ajouté aux emplacements de confiance.
it_it: La posizione del file non è stata aggiunta alle posizioni attendibili.
ja_jp: ファイルの場所が信頼できる場所に追加されていません。
ko_kr: 파일 위치가 신뢰할 수 있는 위치에 추가되지 않았습니다.
pl_pl: Lokalizacji pliku nie dodano do zaufanych lokalizacji.
pt_br: A localização do arquivo não foi adicionada às localizações confiáveis.
ru_ru: Расположение файла не было добавлено в список доверенных расположений.
zh_cn: 文件位置未添加到受信任的位置。
zh_tw: 檔案位置未加入可信任的位置。

# MessagePackageTargetOtherHosts2
source: The package or one of its dependencies targets a different environment, such as Revit, Civil 3D, Advance Steel, Alias or FormIt. This can cause instability and unexpected problems.
cs_cz: Balíček nebo jedna z jeho závislostí se zaměřuje na jiné prostředí, například Revit, Civil 3D, Advance Steel, Alias nebo FormIt. To může způsobit nestabilitu a neočekávané problémy.
de_de: Das Paket oder eine seiner Abhängigkeiten zielt auf eine andere Umgebung ab, z. B. Revit, Civil 3D, Advance Steel, Alias oder FormIt. Dies kann zu Instabilität und unerwarteten Problemen führen.
es_es: El paquete o una de sus dependencias tienen como destino un entorno diferente, como Revit, Civil 3D, Advance Steel, Alias o FormIt. Esto puede provocar inestabilidad y problemas inesperados.
fr_fr: Le package ou l'une de ses dépendances cible un environnement différent, tel que Revit, Civil 3D, Advance Steel, Alias ou FormIt. Cela peut provoquer des problèmes d'instabilité et des problèmes inattendus.
it_it: Il pacchetto o una delle relative dipendenze è destinato ad un ambiente diverso, ad esempio Revit, Civil 3D, Advance Steel, Alias o FormIt. Ciò può causare instabilità e problemi imprevisti.
ja_jp: パッケージまたはその依存関係の 1 つが、Revit、Civil 3D、Advance Steel、Alias、FormIt などの異なる環境を対象としています。そのため、不安定となり予期しない問題が発生する可能性があります。
ko_kr: 패키지 또는 패키지의 종속성 중 하나는 Revit, Civil 3D, Advance Steel, Alias 또는 FormIt과 같은 다른 환경을 대상으로 합니다. 이로 인해 불안정하고 예기치 않은 문제가 발생할 수 있습니다.
pl_pl: Pakiet lub jedna z jego zależności jest przeznaczona dla innego środowiska, takiego jak Revit, Civil 3D, Advance Steel, Alias lub FormIt. Może to spowodować niestabilność i nieoczekiwane problemy.
pt_br: O pacote ou uma de suas dependências tem como alvo um ambiente diferente, como o Revit, Civil 3D, Advance Steel, Alias ou FormIt. Isso pode causar instabilidade e problemas inesperados.
ru_ru: Пакет или одна из его зависимостей предназначены для другой среды, например Revit, Civil 3D, Advance Steel, Alias или FormIt. Это может привести к нестабильной работе и возникновению непредвиденных проблем.
zh_cn: 该软件包或其一个依赖项针对不同的环境，例如 Revit、Civil 3D、Advance Steel、Alias 或 FormIt。这可能会导致出现不稳定和意外问题。
zh_tw: 套件或其中一個相依性是針對不同環境，例如 Revit、Civil 3D、Advance Steel、Alias 或 FormIt。這可能會導致不穩定和非預期的問題。

# MessagePackageTargetOtherHostShort
source: Package targets a different host than current host application.
cs_cz: Cíl balíčku je jiný hostitel než aktuální hostitelská aplikace.
de_de: Das Paket zielt auf einen anderen Host als die aktuelle Host-Anwendung ab.
es_es: El paquete tiene como destino un anfitrión diferente al de la aplicación de anfitrión actual.
fr_fr: Le package cible un hôte différent de l'application hôte actuelle.
it_it: Il pacchetto è destinato ad un host diverso dall'applicazione host corrente.
ja_jp: パッケージは現在のホスト アプリケーションとは異なるホストを対象としています。
ko_kr: 패키지는 현재 호스트 응용프로그램과 다른 호스트를 대상으로 합니다.
pl_pl: Pakiet jest przeznaczony dla innego hosta niż bieżąca aplikacja hosta.
pt_br: O pacote tem como alvo um hospedeiro diferente do aplicativo hospedeiro atual.
ru_ru: Пакет предназначен для основы, отличной от текущего основного приложения.
zh_cn: 软件包面向的目标主机不同于当前主机应用程序。
zh_tw: 套件的目標主體程式與目前的主體應用程式不同。

# TitlePackageTargetOtherHost
source: Package Host Error
cs_cz: Chyba hostitele balíčku
de_de: Paket-Host-Fehler
es_es: Error de anfitrión de paquete
fr_fr: Erreur de l'hôte du package
it_it: Errore host pacchetto
ja_jp: パッケージ ホスト エラー
ko_kr: 패키지 호스트 오류
pl_pl: Błąd hosta pakietu
pt_br: Erro do hospedeiro do pacote
ru_ru: Ошибка основы пакета
zh_cn: 软件包主机错误
zh_tw: 套件主體錯誤

# TrustedLocationNotAccessible
source: A problem occurred when trying to access the trusted location. Dynamo is unable to obtain read/write access to {0}
cs_cz: Při pokusu o přístup k důvěryhodnému umístění došlo k problému. Aplikace Dynamo nemůže získat přístup pro čtení a zápis do {0}
ko_kr: 신뢰할 수 있는 위치에 액세스하려고 할 때 문제가 발생했습니다. Dynamo가 다음에 대한 읽기/쓰기 액세스 권한을 얻을 수 없습니다. {0}

source: Unable To Access Trusted Directory
cs_cz: Nelze získat přístup k důvěryhodnému adresáři
ko_kr: 신뢰할 수 있는 디렉토리에 액세스할 수 없음

# ConnectorContextMenuHeaderPinConnector
source: Pin Wire
cs_cz: Připnout drát
de_de: Draht fixieren
es_es: Bloquear cable
fr_fr: Épingler le fil
it_it: Blocca filo
ja_jp: ワイヤを固定
ko_kr: 와이어 고정
pl_pl: Przypnij przewód
pt_br: Fixar fio
ru_ru: Закрепить провод
zh_cn: 固定导线
zh_tw: 固定線路

# ContextMenuConnectionsHideAll
source: Hide All Wires
cs_cz: Skrýt všechny dráty
de_de: Alle Drähte ausblenden
es_es: Ocultar todos los cables
fr_fr: Masquer tous les fils
it_it: Nascondi tutti i fili
ja_jp: すべてのワイヤを非表示
ko_kr: 모든 와이어 숨기기
pl_pl: Ukryj wszystkie przewody
pt_br: Ocultar todos os fios
ru_ru: Скрыть все провода
zh_cn: 隐藏所有导线
zh_tw: 隱藏所有線路

# ContextMenuConnectionsShowAll
source: Show All Wires
cs_cz: Zobrazit všechny dráty
de_de: Alle Drähte anzeigen
es_es: Mostrar todos los cables
fr_fr: Afficher tous les fils
it_it: Mostra tutti i fili
ja_jp: すべてのワイヤを表示
ko_kr: 모든 와이어 표시
pl_pl: Pokaż wszystkie przewody
pt_br: Mostrar todos os fios
ru_ru: Показать все провода
zh_cn: 显示所有导线
zh_tw: 顯示所有線路

# ConnectorContextMenuHeaderStartNode
source: Navigate Upstream
cs_cz: Přejít proti proudu
de_de: In vorgelagerten navigieren
es_es: Desplazarse hacia arriba
fr_fr: Naviguer en amont
it_it: Navigazione a monte
ja_jp: 上流をナビゲート
ko_kr: 업스트림 탐색
pl_pl: Przejdź w górę
pt_br: Navegar para nível superior
ru_ru: Перейти к предшествующему
zh_cn: 向上浏览
zh_tw: 導覽上游

# ConnectorContextMenuHeaderEndNode
source: Navigate Downtream
cs_cz: Navigovat dolů
ko_kr: 다운스트림 탐색

# ContextMenuNodeConnections
source: Node Connections
cs_cz: Uzlová připojení
de_de: Blockverbindungen
es_es: Conexiones de nodos
fr_fr: Connexions de noeud
it_it: Connessioni nodi
ja_jp: ノード接続
ko_kr: 노드 연결
pl_pl: Połączenia węzłów
pt_br: Conexões de nó
ru_ru: Соединения узлов
zh_cn: 节点连接
zh_tw: 節點連接

# InvalidDraggingOperationMessgae
source: Nothing is being dragged. If you see this message, most likely your recent Dynamo interaction is not recommended.
cs_cz: Nic se nepřetahuje. Pokud se tato zpráva zobrazí, poslední použitá interakce aplikace Dynamo pravděpodobně není doporučena.
de_de: Es wird nichts gezogen. Wenn diese Meldung angezeigt wird, wird Ihre aktuelle Dynamo-Interaktion wahrscheinlich nicht empfohlen.
es_es: No se está arrastrando nada. Si ve este mensaje, es probable que no se recomiende su interacción reciente con Dynamo.
fr_fr: Aucun élément n'est déplacé. Si ce message s'affiche, il est probable que votre dernière interaction Dynamo ne soit pas recommandée.
it_it: Impossibile trascinare l'elemento. Se viene visualizzato questo messaggio, è probabile che la recente interazione con Dynamo non sia consigliata.
ja_jp: 何もドラッグされていません。このメッセージが表示された場合、直近の Dynamo の操作は推奨されていない可能性が高いです。
ko_kr: 아무 것도 끌고 있지 않습니다. 이 메시지가 표시되면 최근 Dynamo 상호 작용이 권장되지 않을 가능성이 높습니다.
pl_pl: Nic nie jest przeciągane. Jeśli widzisz ten komunikat, nie zaleca się korzystania z ostatnio stosowanej interakcji z dodatkiem Dynamo.
pt_br: Nada está sendo arrastado. Se você vir essa mensagem, provavelmente sua interação recente com o Dynamo não será recomendada.
ru_ru: Нет перетаскиваемых элементов. Если отображается это сообщение, не рекомендуется работать с программой Dynamo, как при последнем взаимодействии с ней.
zh_cn: 未拖动任何对象。如果您看到此消息，很可能不建议您执行最近进行的 Dynamo 交互。
zh_tw: 未拖曳任何內容。如果您看到此訊息，很可能不建議您最近的 Dynamo 互動。

# UngroupParentGroupWarning
source: Dynamo cannot ungroup when there is no parent group.
cs_cz: Aplikace Dynamo nemůže zrušit seskupení, pokud neexistuje žádná nadřazená skupina.
de_de: Dynamo kann die Gruppierung nicht aufheben, wenn keine übergeordnete Gruppe vorhanden ist.
es_es: Dynamo no puede desagrupar grupos si no hay ningún grupo principal.
fr_fr: Impossible de dissocier Dynamo lorsqu'il n'existe aucun groupe parent.
it_it: Impossibile eseguire la scomposizione in Dynamo quando non è presente alcun gruppo principale.
ja_jp: 親グループがない場合、Dynamo はグループ化を解除できません。
ko_kr: 상위 그룹이 없는 경우 Dynamo에서 그룹을 해제할 수 없습니다.
pl_pl: Dodatek Dynamo nie może rozgrupować, gdy nie ma grupy nadrzędnej.
pt_br: O Dynamo não pode desagrupar quando não há um grupo principal.
ru_ru: Dynamo не может выполнить разгруппировку, если отсутствует родительская группа.
zh_cn: 没有父组时，Dynamo 无法解组。
zh_tw: 沒有父系群組時，Dynamo 無法解除群組。

# PreferencesViewEnableNotificationCenter
source: Receive notification
cs_cz: Přijímat oznámení
de_de: Benachrichtigungen erhalten
es_es: Recibir notificación
fr_fr: Recevoir une notification
it_it: Ricevi notifica
ja_jp: 通知を受信
ko_kr: 알림 수신
pl_pl: Odbierz powiadomienie
pt_br: Receber notificações
ru_ru: Уведомление о получении
zh_cn: 接收通知
zh_tw: 接收通知

# PreferencesViewNotificationCenter
source: Notification Center
cs_cz: Centrum upozornění
de_de: Benachrichtigungscenter
es_es: Centro de notificaciones
fr_fr: Centre de notification
it_it: Centro notifiche
ja_jp: 通知センター
ko_kr: 알림 센터
pl_pl: Centrum powiadomień
pt_br: Centro de notificações
ru_ru: Центр уведомлений
zh_cn: 通知中心
zh_tw: 通知中心

# NotificationCenterButtonTooltip
source: Click to view latest news from Dynamo Team.
cs_cz: Kliknutím zobrazíte nejnovější zprávy ze služby Dynamo Team.
de_de: Klicken Sie, um die neuesten Nachrichten vom Dynamo-Team anzuzeigen.
es_es: Haga clic para ver las últimas noticias de Dynamo Team.
fr_fr: Cliquez pour afficher les dernières actualités de l'équipe Dynamo.
it_it: Fare clic per visualizzare le ultime notizie dal team di Dynamo.
ja_jp: クリックすると、Dynamo Team の最新ニュースが表示されます。
ko_kr: Dynamo 팀의 최신 뉴스를 보려면 클릭합니다.
pl_pl: Kliknij, aby wyświetlić najnowsze wiadomości od zespołu Dynamo.
pt_br: Clique para visualizar as últimas notícias da equipe do Dynamo.
ru_ru: Щелкните, чтобы посмотреть последние новости от разработчиков Dynamo.
zh_cn: 单击以查看来自 Dynamo Team 的最新消息。
zh_tw: 按一下以檢視 Dynamo 團隊的最新新聞。

# InfectedPackageMessageString
source: This is an infected package. Please upload a clean version.
cs_cz: Toto je nakažený balíček. Odešlete čistou verzi.
de_de: Dies ist ein infiziertes Paket. Laden Sie eine bereinigte Version hoch.
es_es: Este paquete está infectado. Cargue una versión limpia.
fr_fr: Ce package est infecté. Chargez une version propre.
it_it: Pacchetto infettato. Caricare una versione pulita.
ja_jp: これは感染したパッケージです。感染していないバージョンをアップロードしてください。
ko_kr: 이 패키지는 감염된 패키지입니다. 새 버전을 업로드하십시오.
pl_pl: Ten pakiet jest zainfekowany. Przekaż wersję niezainfekowaną.
pt_br: Este é um pacote infectado. Carregue uma versão limpa.
ru_ru: Это зараженный пакет. Выгрузите безопасную версию.
zh_cn: 这是一个被感染的软件包。请上传一个干净版本。
zh_tw: 這是受感染的套件。請上傳乾淨的版本。

# InfectedPackageErrorString
source: Upload Error
cs_cz: Chyba při odesílání
de_de: Fehler beim Hochladen
es_es: Error de carga
fr_fr: Erreur de chargement
it_it: Errore di caricamento
ja_jp: アップロード エラー
ko_kr: 업로드 오류
pl_pl: Błąd przekazywania
pt_br: Erro de carregamento
ru_ru: Ошибка выгрузки
zh_cn: 上传错误
zh_tw: 上傳錯誤

# PrePackagePublishMessage
source: Your package will be scanned for viruses, and will be available for download once it successfully passes the scan.
cs_cz: V balíčku budou vyhledány viry a po úspěšném skenování jej bude možné stáhnout.
de_de: Ihr Paket wird auf Viren überprüft und steht zum Download bereit, sobald der Scan erfolgreich abgeschlossen wurde.
es_es: El paquete se analizará en busca de virus y se podrá descargar una vez que se haya superado correctamente la exploración.
fr_fr: Votre package sera analysé à la recherche de virus et pourra être téléchargé une fois l'analyse effectuée.
it_it: Il pacchetto verrà sottoposto a scansione per rilevare eventuali virus e sarà disponibile per il download dopo il corretto completamento della scansione.
ja_jp: パッケージはウィルスがないかスキャンされ、スキャンに成功するとダウンロードできるようになります。
ko_kr: 패키지가 바이러스에 감염되었는지 스캔되며 스캔이 성공적으로 통과되면 패키지를 다운로드할 수 있습니다
pl_pl: Pakiet zostanie przeskanowany pod kątem obecności wirusów i po pomyślnym przeskanowaniu będzie dostępny do pobrania.
pt_br: O pacote será verificado quanto a vírus e estará disponível para download depois que passar pela verificação.
ru_ru: Пакет будет проверен на наличие вирусов и станет доступен для скачивания после успешного завершения проверки.
zh_cn: 将扫描软件包中是否有病毒，一旦成功通过扫描，即可供下载。
zh_tw: 將掃描您的套件是否有病毒，成功通過掃描後即可供人下載。

# PrePackagePublishTitle
source: Package Upload Scan
cs_cz: Skenování odesílaného balíčku
de_de: Paket-Scan beim Hochladen
es_es: Exploración de carga de paquetes
fr_fr: Analyse du chargement de package
it_it: Scansione caricamento pacchetto
ja_jp: パッケージ アップロード スキャン
ko_kr: 패키지 업로드 스캔
pl_pl: Skanowanie przy przekazywaniu pakietu
pt_br: Verificação de carregamento do pacote
ru_ru: Сканирование выгружаемого пакета
zh_cn: 软件包上传扫描
zh_tw: 套件上傳掃描

# ImportPreferencesInfo
source: You can import custom settings here, which will overwrite your current settings. If you'd like to preserve a copy of your current settings, export them before importing new settings. Settings not shown in the Preferences panel will be applied once Dynamo and any host program restarts.
cs_cz: Zde můžete importovat vlastní nastavení, která přepíší vaše aktuální nastavení. Chcete-li zachovat kopii svých aktuálních nastavení, před importem nových nastavení je exportujte. Nastavení, která nejsou zobrazena na panelu Předvolby, se použijí, jakmile se aplikace Dynamo a všechny hostitelské programy restartují.
de_de: Ihre benutzerdefinierten Einstellungen können hier importiert werden und überschreiben Ihre aktuellen Einstellungen. Exportieren Sie vor dem Importieren die aktuellen Einstellungen, um eine Kopie zu behalten. Einstellungen, die nicht in der Gruppe Voreinstellungen angezeigt werden, werden angewendet, sobald Sie Dynamo und andere Host-Programme neu starten.
es_es: Aquí puede importar parámetros personalizados, que sobrescribirán a los actuales. Si desea conservar una copia de la configuración actual, expórtela antes de importar la nueva. Los parámetros no mostrados en el panel de Preferencias se aplicarán una vez que Dynamo y cualquier programa anfitrión se reinicien.
fr_fr: Vous pouvez importer des paramètres personnalisés ici, ils écraseront vos paramètres actuels. Si vous souhaitez conserver une copie des paramètres actuels, exportez-les avant importation des nouveaux paramètres. Les paramètres non affichés dans le panneau Préférences seront appliqués une fois Dynamo et tout programme hôte redémarré.
it_it: È possibile importare qui le impostazioni personalizzate, che sovrascriveranno quelle correnti. Se si desidera mantenere una copia delle impostazioni correnti, esportarle prima di importare nuove impostazioni. Le impostazioni non mostrate tramite il pannello Preferenze verranno applicate una volta riavviati Dynamo e qualsiasi programma host.
ja_jp: カスタム設定をここで読み込むことができます。読み込むと、現在の設定が上書きされます。現在の設定のコピーを保存する場合は、設定を書き出してから、新しい設定を読み込んでください。[基本設定]パネルに表示されていない設定は、Dynamo およびホスト プログラムを再起動すると適用されます。
ko_kr: 여기로 사용자 지정 설정을 가져올 수 있습니다. 그러면 사용자 지정 설정이 현재 설정을 덮어씁니다. 현재 설정의 사본을 유지하려면 새 설정을 가져오기 전에 현재 설정을 내보내십시오. 기본 설정 패널에 표시되지 않은 설정은 Dynamo 및 모든 호스트 프로그램이 다시 시작되면 적용됩니다.
pl_pl: Tutaj możesz zaimportować ustawienia niestandardowe, co spowoduje zastąpienie bieżących ustawień. Jeśli chcesz zachować kopię bieżących ustawień, wyeksportuj je przed zaimportowaniem nowych ustawień. Ustawienia niewidoczne w panelu Preferencje zostaną zastosowane po ponownym uruchomieniu dodatku Dynamo i dowolnego programu nadrzędnego.
pt_br: Você pode importar as configurações personalizadas aqui, o que substituirá suas configurações atuais. Se você quiser preservar uma cópia de suas configurações atuais, exporte-as antes de importar novas configurações. As configurações não expostas pelo painel Preferências serão aplicadas assim que o Dynamo e qualquer programa hospedeiro forem reiniciados.
ru_ru: Здесь можно импортировать пользовательские параметры, которые перезапишут текущие параметры. Если необходимо сохранить копию текущих параметров, экспортируйте их перед экспортом новых параметров. Те параметры, которые не отображаются на панели «Настройки», будут применены после перезапуска Dynamo и любой основной программы.
zh_cn: 可以在此处输入自定义设置，这将覆盖当前设置。如果希望保留当前设置的副本，请在输入新设置前输出它们。在 Dynamo 和任何主机程序重新启动后，将应用未显示在“首选项”面板中的设置。
zh_tw: 您可以在此處匯入自訂設定，自訂設定會覆寫您目前的設定。如果您想要保留一份目前的設定，請在匯入新設定之前先將其匯出。Dynamo 和任何主體程式重新啟動後，將套用「偏好」面板中未顯示的設定。

# PreferencesViewNodeAutocomplete
source: Node Autocomplete
cs_cz: Automatické dokončování uzlů
de_de: Automatische Blockvervollständigung
es_es: Autocompletar nodo
fr_fr: Saisie automatique du noeud
it_it: Completamento automatico nodi
ja_jp: ノード オートコンプリート
ko_kr: 노드 자동 완성
pl_pl: Autouzupełnianie węzłów
pt_br: Preenchimento automático de nós
ru_ru: Автозаполнение узла
zh_cn: 节点自动完成
zh_tw: 節點自動完成

# MLRecommendationNumberOfResults
source: Number of results
cs_cz: Počet výsledků
de_de: Anzahl der Ergebnisse
es_es: Número de resultados
fr_fr: Nombre de résultats
it_it: Numero di risultati
ja_jp: 結果数
ko_kr: 결과 수
pl_pl: Liczba wyników
pt_br: Número de resultados
ru_ru: Количество результатов
zh_cn: 结果数
zh_tw: 結果數

# ImportPreferencesText
source: Import
cs_cz: Importovat
de_de: Importieren
es_es: Importar
fr_fr: Importer
it_it: Importa
ja_jp: 読み込み
ko_kr: 가져오기
pl_pl: Importuj
pt_br: Importar
ru_ru: Импорт
zh_cn: 输入
zh_tw: 匯入

# ExportPreferencesText
source: Export
cs_cz: Exportovat
de_de: Exportieren
es_es: Exportar
fr_fr: Exporter
it_it: Esporta
ja_jp: 書き出し
ko_kr: 내보내기
pl_pl: Eksportuj
pt_br: Exportar
ru_ru: Экспорт
zh_cn: 输出
zh_tw: 匯出
