Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# PackagesGuideThirdPartyText
source: \nPackages may come from third parties.\n\nBe aware that packages may pose security risks. #More information=https://dynamobim.org/issues/extend-dynamo-with-packages/
cs_cz: \nBalíčky mohou pocházet od třetích stran. \n\nUpozorňujeme, že balíčky mohou představovat bezpečnostní rizika. #Další informace=https://dynamobim.org/issues/extend-dynamo-with-packages/
de_de: \nPakete können von Drittanbietern stammen.\n\nBeachten Sie, dass Pakete Sicherheitsrisiken darstellen können. #Weitere Informationen=https://dynamobim.org/issues/extend-dynamo-with-packages/
es_es: Los paquetes pueden provenir de terceros. Tenga en cuenta que los paquetes pueden suponer riesgos de seguridad. #Más información=https://dynamobim.org/issues/extend-dynamo-with-packages/
fr_fr: Les packages peuvent provenir de tiers.\n\nNotez qu'ils peuvent présenter des risques de sécurité. #Plus d'informations=https://dynamobim.org/issues/extend-dynamo-with-packages/
it_it: \nI pacchetti possono provenire da terze parti.\n\nTenere presente che i pacchetti possono presentare rischi per la sicurezza. #Ulteriori informazioni=https://dynamobim.org/issues/extend-dynamo-with-packages/
ja_jp: \nパッケージはサード パーティ製である場合があります。\n\nパッケージがセキュリティ上のリスクを引き起こす可能性があることに注意してください。 #詳細情報=https://dynamobim.org/issues/extend-dynamo-with-packages/
ko_kr: \n패키지는 타사의 패키지일 수 있습니다.\n\n그러한 패키지는 보안 위험을 일으킬 수 있습니다. #자세한 정보=https://dynamobim.org/issues/extend-dynamo-with-packages/
pl_pl: \nPakiety mogą pochodzić od innych producentów.\n\nNależy pamiętać, że pakiety mogą stwarzać zagrożenie dla bezpieczeństwa. #Więcej informacji=https://dynamobim.org/issues/extend-dynamo-with-packages/
pt_br: \nOs pacotes podem ser provenientes de terceiros.\n\nEsteja ciente de que os pacotes podem representar riscos de segurança. #Mais informações=https://dynamobim.org/issues/extend-dynamo-with-packages/
ru_ru: \nПакеты могут поступать от третьих лиц.\n\nОбратите внимание, что пакеты могут представлять угрозу безопасности. #Дополнительная информация=https://dynamobim.org/issues/extend-dynamo-with-packages/
zh_cn: \n软件包可能来自第三方。\n\n请注意，软件包可能会带来安全风险。 #更多信息=https://dynamobim.org/issues/extend-dynamo-with-packages/
zh_tw: \n套件可能來自協力廠商。\n\n請注意，套件可能會帶來安全風險。 #更多資訊=https://dynamobim.org/issues/extend-dynamo-with-packages/

# PackagesGuideThirdPartyTitle
source: Third-party packages
cs_cz: Balíčky třetích stran
de_de: Pakete von Drittanbietern
es_es: Paquetes de terceros
fr_fr: Packages tiers
it_it: Pacchetti di terze parti
ja_jp: サードパーティ製パッケージ
ko_kr: 타사 패키지
pl_pl: Pakiety innych producentów
pt_br: Pacotes de terceiros
ru_ru: Пакеты сторонних разработчиков
zh_cn: 第三方软件包
zh_tw: 協力廠商套件

# GenericTaskDialogOptionYes
source: Yes
cs_cz: Ano
de_de: Ja
es_es: Sí
fr_fr: Oui
it_it: Sì
ja_jp: はい
ko_kr: 예
pl_pl: Tak
pt_br: Sim
ru_ru: Да
zh_cn: 是
zh_tw: 是

# GenericTaskDialogOptionNo
source: No
cs_cz: Ne
de_de: Nein
fr_fr: Non
ja_jp: いいえ
ko_kr: 아니오
pl_pl: Nie
pt_br: Não
ru_ru: Нет
zh_cn: 否
zh_tw: 否

# GenericTaskDialogOptionCancel
source: Cancel
cs_cz: Storno
de_de: Abbrechen
es_es: Cancelar
fr_fr: Annuler
it_it: Annulla
ja_jp: キャンセル
ko_kr: 취소
pl_pl: Anuluj
pt_br: Cancelar
ru_ru: Отмена
zh_cn: 取消
zh_tw: 取消

# WorkspaceTabSavingUnnecessary
source: No need to save!
cs_cz: Není třeba nic ukládat.
de_de: Sie müssen nicht speichern!
es_es: No es necesario guardar.
fr_fr: Pas besoin d'enregistrer!
it_it: Non è necessario salvare.
ja_jp: 保存する必要はありません。
ko_kr: 저장할 필요가 없습니다.
pl_pl: Nie trzeba zapisywać!
pt_br: Não é necessário salvar.
ru_ru: Сохранение не требуется.
zh_cn: 无需保存！
zh_tw: 無需儲存！

# WorkspaceTabSavingNecessary
source: You need to save updates to this file.
cs_cz: Je nutné uložit aktualizace do tohoto souboru.
de_de: Sie müssen Aktualisierungen für diese Datei speichern.
es_es: Debe guardar las actualizaciones de este archivo.
fr_fr: Vous devez enregistrer les mises à jour de ce fichier.
it_it: È necessario salvare gli aggiornamenti a questo file.
ja_jp: このファイルに更新を保存する必要があります。
ko_kr: 이 파일에 대한 업데이트를 저장해야 합니다.
pl_pl: Należy zapisać aktualizacje w tym pliku.
pt_br: É necessário salvar as atualizações neste arquivo.
ru_ru: Сохраните обновления в этом файле.
zh_cn: 您需要保存对此文件的更新。
zh_tw: 您必須儲存此檔案的更新。

# WorkspaceTabSavingBrandNewFile
source: This is a brand new file.
cs_cz: Toto je zcela nový soubor.
de_de: Dies ist eine vollkommen neue Datei.
es_es: Este es un archivo totalmente nuevo.
fr_fr: Ce fichier est tout nouveau.
it_it: Questo è un file completamente nuovo.
ja_jp: これは新しいファイルです。
ko_kr: 완전히 새로운 파일입니다.
pl_pl: To jest zupełnie nowy plik.
pt_br: Este é um arquivo totalmente novo.
ru_ru: Это совершенно новый файл.
zh_cn: 这是一个全新文件。
zh_tw: 這是一個全新的檔案。

# WorkspaceTabNotSavedYet
source: You haven't saved this file yet.
cs_cz: Tento soubor jste ještě neuložili.
de_de: Sie haben diese Datei noch nicht gespeichert.
es_es: Aún no ha guardado este archivo.
fr_fr: Vous n'avez pas encore enregistré ce fichier.
it_it: Il file non è stato ancora salvato.
ja_jp: このファイルはまだ保存されていません。
ko_kr: 이 파일을 아직 저장하지 않았습니다.
pl_pl: Ten plik nie został jeszcze zapisany.
pt_br: Você ainda não salvou este arquivo.
ru_ru: Вы еще не сохранили этот файл.
zh_cn: 您尚未保存此文件。
zh_tw: 您尚未儲存此檔案。

# ScriptTagsRemovalWarning
source: Script tags detected in the help document have been removed.
cs_cz: Značky skriptů nalezené v dokumentu nápovědy byly odstraněny.
de_de: Im Hilfedokument erkannte Skript-Tags wurden entfernt.
es_es: Se han eliminado las etiquetas de secuencias de comandos detectadas en el documento de ayuda.
fr_fr: Les étiquettes de script détectées dans le document d'aide ont été supprimées.
it_it: I tag di script rilevati nel documento della Guida sono stati rimossi.
ja_jp: ヘルプ ドキュメントで検出されたスクリプト タグは削除されました。
ko_kr: 도움말 문서에서 탐지된 스크립트 태그가 제거되었습니다.
pl_pl: Oznaczenia skryptów wykryte w dokumencie pomocy zostały usunięte.
pt_br: Os identificadores de scripts detectados no documento de ajuda foram removidos.
ru_ru: Удалены теги сценариев, обнаруженные в документе справки.
zh_cn: 在帮助文档中检测到的脚本标记已被删除。
zh_tw: 在說明文件中偵測到的指令碼標籤已移除。

# PackagesGuideContinueButton
source: Continue
cs_cz: Pokračovat
de_de: Weiter
es_es: Continuar
fr_fr: Continuer
it_it: Continua
ja_jp: 続行
ko_kr: 계속
pl_pl: Kontynuuj
pt_br: Continuar
ru_ru: Продолжить
zh_cn: 继续
zh_tw: 繼續

# PackagesGuideExitButton
source: Exit
cs_cz: Konec
de_de: Beenden
es_es: Salir
fr_fr: Quitter
it_it: Esci
ja_jp: 終了
ko_kr: 종료
pl_pl: Zakończ
pt_br: Sair
ru_ru: Выход
zh_cn: 退出
zh_tw: 結束

# ShortcutExportAsImageMainMenu
source: Export as Image
cs_cz: Exportovat jako obrázek
de_de: Als Bild exportieren
es_es: Exportar como imagen
fr_fr: Exporter au format image
it_it: Esporta come immagine
ja_jp: イメージとして書き出し
ko_kr: 이미지로 내보내기
pl_pl: Eksportuj jako obraz
pt_br: Exportar como imagem
ru_ru: Экспортировать как изображение
zh_cn: 输出为图像
zh_tw: 匯出為影像

# ShortcutExportBackground3DPreview
source: Background 3D Preview
cs_cz: 3D náhled pozadí
de_de: Hintergrund-3D-Vorschau
es_es: Vista preliminar 3D en segundo plano
fr_fr: Aperçu 3D en arrière-plan
it_it: Anteprima sfondo 3D
ja_jp: 背景 3D プレビュー
ko_kr: 배경 3D 미리보기
pl_pl: Podgląd 3D tła
pt_br: Visualização 3D em segundo plano
ru_ru: Фоновый 3D-просмотр
zh_cn: 背景三维预览
zh_tw: 背景 3D 預覽

# ShortcutExportWorkspace
source: Workspace
cs_cz: Pracovní prostor
de_de: Arbeitsbereich
es_es: Espacio de trabajo
fr_fr: Espace de travail
it_it: Area di lavoro
ja_jp: ワークスペース
ko_kr: 작업공간
pl_pl: Obszar roboczy
pt_br: Espaço de trabalho
ru_ru: Рабочее пространство
zh_cn: 工作空间
zh_tw: 工作區

# PackagesGuideExitAcceptTerms
source: To continue the guide and install the sample package, you must accept the Terms of Service. \n\n **Click Continue.** Then in the terms, **click I Accept.** \n\n\n\n
cs_cz: Chcete-li pokračovat v příručce a nainstalovat vzorový balíček, je nutné přijmout Podmínky služby. \n\n **Klikněte na tlačítko Pokračovat.** Poté v podmínkách klikněte na tlačítko Přijímám.** \n\n\n\n
de_de: Um mit der Anleitung fortzufahren und das Beispielpaket zu installieren, müssen Sie die Nutzungsbedingungen akzeptieren. \n\n **Klicken Sie auf Weiter.** Klicken Sie anschließend in den Bedingungen auf **Akzeptieren**. \n
es_es: Para continuar con la guía e instalar el paquete de ejemplo, debe aceptar los Términos del servicio. \n\n **Haga clic en Continuar.** A continuación, en los términos, **haga clic en Acepto.** \n\n\n\n
fr_fr: Pour poursuivre le guide et installer le package d'exemple, vous devez accepter les Conditions d'utilisation. \n\n **Cliquez sur Continuer.** Puis, dans les conditions, **cliquez sur J'accepte.** \n\n\n\n
it_it: Per continuare la guida e installare il pacchetto di esempio, è necessario accettare le Condizioni di servizio. \n\n **Fare clic su Continua.** Quindi, nei termini, **fare clic su Accetto.** \n
ja_jp: ガイドを続けてサンプル パッケージをインストールするには、サービス利用規約に同意する必要があります。\n\n**[続行]をクリック** し、利用規約の中で **[同意する]をクリック** してください。\n\n\n\n
ko_kr: 안내서를 계속 진행하고 샘플 패키지를 설치하려면 서비스 이용 약관에 동의해야 합니다. \n\n **계속을 클릭합니다.** 그런 다음 약관에서 **동의함을 클릭합니다.** \n\n\n\n
pl_pl: Aby kontynuować pracę z przewodnikiem i zainstalować przykładowy pakiet, należy zaakceptować warunki korzystania z usługi. \n\n **Kliknij przycisk Kontynuuj.** Następnie w warunkach kliknij przycisk **Wyrażam zgodę.** \n
pt_br: Para continuar com o guia e instalar o pacote de amostra, você deve aceitar os Termos de serviço. \n\n **Clique em Continuar.** Em seguida, nos termos, **clique em Aceito.** \n\n\n\n
ru_ru: Чтобы продолжить работу с руководством и установить образец пакета, необходимо принять «Условия обслуживания». \n\n **Нажмите кнопку «Продолжить».** Затем **щелкните «Я принимаю».** \n
zh_cn: 要继续使用本手册并安装样例软件包，必须接受“服务条款”。\n\n **单击“继续”。** 然后，在条款中， **单击“我接受”。** \n\n\n\
zh_tw: 若要繼續進行指南並安裝範例套件，您必須接受「服務條款」。\n\n **按一下「繼續」。** 然後在條款中， **按一下「我接受」。** \n\n\n\n

# PackagesGuideExitTitle
source: Do you want to exit the guide?
cs_cz: Chcete ukončit příručku?
de_de: Möchten Sie die Anleitung schließen?
es_es: ¿Desea salir de la guía?
fr_fr: Voulez-vous quitter le guide?
it_it: Uscire dalla guida?
ja_jp: ガイドを終了しますか?
ko_kr: 안내서를 종료하시겠습니까?
pl_pl: Czy chcesz opuścić przewodnik?
pt_br: Deseja sair do guia?
ru_ru: Закончить работу с руководством?
zh_cn: 是否要退出本指南？
zh_tw: 是否要結束指南？

source: Save
cs_cz: Uložit
de_de: Speichern
es_es: Guardar
fr_fr: Enregistrer
it_it: Salva
ja_jp: 保存
ko_kr: 저장
pl_pl: Zapisz
pt_br: Salvar
ru_ru: Сохранить
zh_cn: 保存
zh_tw: 儲存

# PackagesGuideInstallAPackageText
source: Package installations are typically quick, depending on their size and other factors. \n\n**Click Install** to install the latest version of the sample Autodesk package and proceed with this guide.
cs_cz: Instalace balíčku jsou obvykle rychlé podle jejich velikosti a dalších faktorů. \n\n**Kliknutím na tlačítko Instalovat** nainstalujte nejnovější verzi vzorového balíčku společnosti Autodesk a pokračujte v této příručce.
de_de: Paketinstallationen erfolgen in der Regel abhängig von ihrer Größe und anderen Faktoren schnell. \n\n**Klicken Sie auf Installieren** um die neueste Version des Autodesk-Beispielpakets zu installieren, und fahren Sie mit diesem Handbuch fort.
es_es: Las instalaciones de paquetes suelen ser rápidas en función de su tamaño y otros factores. \n\n**Haga clic en Instalar** para instalar la versión más reciente del paquete de Autodesk de muestra y continuar con esta guía.
fr_fr: Les installations de packages sont généralement rapides, en fonction de leur taille et d'autres facteurs. \n\n**Cliquez sur Installer** pour installer la dernière version du package d'exemple Autodesk et passez à l'étape suivante du guide.
it_it: Le installazioni dei pacchetti sono in genere rapide, a seconda della dimensione e di altri fattori. \n\n**Fare clic su Installa** per installare la versione più recente del pacchetto Autodesk di esempio e procedere con questa guida.
ja_jp: パッケージのインストールは、サイズやその他の要因に応じて通常は迅速に行われます。 \n\n最新バージョンのオートデスクのサンプルパッケージをインストールするには、 **[インストール]をクリック** して、このガイドを参考に作業を進めてください。
ko_kr: 패키지 설치는 일반적으로 크기 및 기타 요인에 따라 빠르게 이루어집니다. \n\n**설치를 클릭하여** 최신 버전의 샘플 Autodesk 패키지를 설치하고 이 안내서를 계속 진행합니다.
pl_pl: Instalacje pakietów są zazwyczaj szybkie, w zależności od ich rozmiaru i innych czynników. \n\n**Kliknij przycisk Zainstaluj** aby zainstalować najnowszą wersję przykładowego pakietu Autodesk, i postępuj zgodnie z tym podręcznikiem.
pt_br: As instalações de pacotes são normalmente rápidas, dependendo do tamanho e de outros fatores. \n\n**Clique em Instalar** para instalar a versão mais recente do pacote de amostra da Autodesk e siga com este guia.
ru_ru: Установка пакетов обычно выполняется быстро в зависимости от их размера и других факторов. \n\n**Нажмите кнопку «Установить»** чтобы установить последнюю версию примера пакета Autodesk и продолжить работу с этим руководством.
zh_cn: 软件包安装通常很快，具体取决于其大小和其他因素。\n\n**单击“安装”** 以安装最新版本的样例 Autodesk 软件包，然后继续使用本手册。
zh_tw: 套件安裝通常很快，取決於其大小和其他因素。\n\n**按一下「安裝」** 以安裝最新版本的範例 Autodesk 套件，然後繼續進行本指南。

# PackagesGuideInstallAPackageTitle
source: Install a package
cs_cz: Instalovat balíček
de_de: Paket installieren
es_es: Instalar un paquete
fr_fr: Installer un package
it_it: Installa un pacchetto
ja_jp: パッケージをインストールする
ko_kr: 패키지 설치
pl_pl: Zainstaluj pakiet
pt_br: Instalar um pacote
ru_ru: Установка пакета
zh_cn: 安装软件包
zh_tw: 安裝套件

# PackagesGuideInstalledPackageText
source: Package installations are typically quick, depending on their size and other factors. \n To install the latest version of a package, click Install. \n %./UI/Images/alert.png% The sample Autodesk package is already installed on your computer.
cs_cz: Instalace balíčků jsou obvykle rychlé podle jejich velikosti a dalších faktorů. \n Chcete-li nainstalovat nejnovější verzi balíčku, klikněte na možnost Instalovat. \n %./UI/Images/alert.png% Vzorový balíček společnosti Autodesk je již v počítači nainstalován.
de_de: Abhängig von ihrer Größe und anderen Faktoren werden Pakete in der Regel schnell installiert. \n Um die neueste Version eines Pakets zu installieren, klicken Sie auf Installieren. \n %./UI/Images/alert.png% Das Autodesk-Beispielpaket ist bereits auf Ihrem Computer installiert.
es_es: Las instalaciones de paquetes suelen ser rápidas en función de su tamaño y otros factores. \n Para instalar la versión más reciente de un paquete, haga clic en Instalar. \n %./UI/Images/alert.png% El paquete de muestra de Autodesk ya se ha instalado en el equipo.
fr_fr: Les installations de packages sont généralement rapides, selon leur taille et d'autres facteurs. \n Pour installer la dernière version d'un package, cliquez sur Installer. \n %./UI/Images/alert.png% Le package d'exemple Autodesk est déjà installé sur votre ordinateur.
it_it: Le installazioni dei pacchetti sono in genere rapide, a seconda delle dimensioni e di altri fattori. \n Per installare la versione più recente di un pacchetto, fare clic su Installa. \n %./UI/Images/alert.png% Il pacchetto Autodesk di esempio è già installato nel computer.
ja_jp: 通常、パッケージのインストールは、サイズやその他の要因に応じて迅速に行われます。\n 最新バージョンのパッケージをインストールするには、[インストール]をクリックします。\n %./UI/Images/alert.png% オートデスクのサンプル パッケージは既にコンピュータにインストールされています。
ko_kr: 일반적으로 패키지 설치는 크기 및 기타 요소에 따라 빠르게 수행됩니다.\n 최신 버전의 패키지를 설치하려면 설치를 클릭합니다. \n %./UI/Images/alert.png% 샘플 Autodesk 패키지가 컴퓨터에 이미 설치되어 있습니다.
pl_pl: Instalacje pakietów są zazwyczaj szybkie w zależności od ich rozmiaru i innych czynników. \n Aby zainstalować najnowszą wersję pakietu, kliknij przycisk Zainstaluj. \n %./UI/Images/alert.png% Przykładowy pakiet Autodesk jest już zainstalowany na komputerze.
pt_br: As instalações de pacotes são normalmente rápidas, dependendo do tamanho e de outros fatores. \n Para instalar a versão mais recente de um pacote, clique em Instalar. \n %./UI/Images/alert.png% O pacote Autodesk de amostra já está instalado no computador.
ru_ru: Установка пакетов обычно выполняется быстро в зависимости от их размера и других факторов. \n Чтобы установить последнюю версию пакета, нажмите кнопку «Установить». \n %./UI/Images/alert.png% Образец пакета Autodesk уже установлен на компьютере.
zh_cn: 软件包安装通常较快，具体取决于其大小和其他因素。\n 要安装最新版本的软件包，请单击“安装”。\n %./UI/Images/alert.png% 样例 Autodesk 软件包已安装在计算机上。
zh_tw: 套件安裝通常很快，但具體取決於套件大小和其他因素。\n 若要安裝最新版本的套件，請按一下「安裝」。\n %./UI/Images/alert.png% 範例 Autodesk 套件已安裝在您的電腦上。

# PackagesGuideDependenciesText
source: \nIf you need other software or tools in order to use this package, they are listed under Dependencies.
cs_cz: \nPokud k použití tohoto balíčku potřebujete jiný software nebo nástroje, jsou uvedeny v části Verze a požadavky balíčku.
de_de: \nWenn Sie andere Software oder Werkzeuge benötigen, um dieses Paket zu verwenden, werden diese unter Versionen und Paketanforderungen aufgelistet.
es_es: \nSi necesita otro software o herramientas para utilizar este paquete, estos se muestran en Versiones y requisitos de paquetes.
fr_fr: \nSi vous avez besoin d'autres logiciels ou outils pour utiliser ce package, ces derniers sont répertoriés sous Exigences de version et de package.
it_it: \nSe per utilizzare questo pacchetto sono necessari altro software o altri strumenti, questi vengono elencati in VERSIONI E REQUISITI DI PACCHETTI.
ja_jp: \nこのパッケージを使用するために他のソフトウェアまたはツールが必要な場合は、「バージョンとパッケージの要件」に一覧表示されます。
ko_kr: \n다른 소프트웨어 또는 도구가 있어야 이 패키지를 사용할 수 있는 경우 해당 소프트웨어 또는 도구가 버전 및 패키지 요구 사항 아래에 나열됩니다.
pl_pl: \nJeśli do korzystania z tego pakietu potrzebne jest inne oprogramowanie lub narzędzia, składniki te są wskazane w obszarze Wersje i wymagania dotyczące pakietów.
pt_br: \nSe você precisar de outros softwares ou ferramentas para usar esse pacote, eles serão listados em Requisitos de versões e pacote.
ru_ru: \nЕсли для использования этого пакета вам нужно другое программное обеспечение или инструменты, они перечислены в разделе «Требования к версиям и пакету».
zh_cn: \n如果您需要其他软件或工具来使用此软件包，它们会在“版本和软件包要求”下列出。
zh_tw: \n使用此套件所需的其他軟體或工具，會列在「版本和套件需求」下。

# PackagesGuideDependenciesTitle
source: Package dependencies
cs_cz: Závislosti balíčků
de_de: Paketabhängigkeiten
es_es: Dependencias de paquetes
fr_fr: Dépendances du package
it_it: Dipendenze pacchetto
ja_jp: パッケージの依存関係
ko_kr: 패키지 종속성
pl_pl: Zależności pakietów
pt_br: Dependências do pacote
ru_ru: Зависимости пакета
zh_cn: 软件包依存关系
zh_tw: 套件相依性

# PackagesGuideSearchResultsText
source: \nSearch results display summary information for each package: -author- -likes and downloads- -date of the most recent version- \n**Click View Details** to see more information about a package.
cs_cz: \nVýsledky hledání zobrazí souhrnné informace o jednotlivých balíčcích: -autor- -počet To se mi líbí a stažení- -datum poslední verze- \n**Kliknutím na možnost Zobrazit detaily** zobrazíte další informace o balíčku.
de_de: \nDie Suchergebnisse zeigen eine Übersicht für jedes Paket an: -Autor- -Likes und Downloads- -Datum der aktuellen Version- \n**Klicken Sie auf Details anzeigen** um weitere Informationen zu einem Paket anzuzeigen.
es_es: \nLos resultados de la búsqueda presentan información de resumen de cada paquete: -Autor- -Me gusta y descargas- -Fecha de la versión más reciente- \n**Haga clic en Ver detalles** para ver más información sobre un paquete.
fr_fr: \nLes résultats de la recherche affichent des informations récapitulatives pour chaque package: -auteur- -likes et téléchargements- -date de la version la plus récente- \n**Cliquez sur Afficher les détails** pour afficher plus d'informations sur un package.
it_it: \nI risultati della ricerca visualizzano informazioni di riepilogo per ciascun pacchetto: -autore- -like e download- -date della versione più recente- \n**Fare clic su Visualizza dettagli** per visualizzare ulteriori informazioni su un pacchetto.
ja_jp: \n検索結果に各パッケージの概要情報が表示されます: -作成者- -いいねとダウンロード- -最新バージョンの日付- \n**[詳細を表示]をクリック** するとパッケージの詳細を確認できます。
ko_kr: \n검색 결과에는 각 패키지에 대한 요약 정보가 표시됩니다. -작성자- -좋아요 및 다운로드 수- -최신 버전의 날짜- \n패키지에 대한 자세한 내용을 보려면 **상세 정보 보기를 클릭** 하십시오.
pl_pl: \nWyniki wyszukiwania zawierają podsumowanie informacji dla każdego pakietu: -autor- -polubienia i pobrania- -data najnowszej wersji- \n**Kliknij przycisk Pokaż szczegóły** aby pokazać więcej informacji na temat pakietu.
pt_br: \nOs resultados da pesquisa exibem informações resumidas de cada pacote: -autor- -curtidas e downloads- -data da versão mais recente- \n**Clique em Exibir detalhes** para ver mais informações sobre um pacote.
ru_ru: \nВ результатах поиска отображается сводная информация по каждому пакету: -автор- -количество отметок «нравится» и скачиваний- -дата выхода последней версии- \n**Нажмите кнопку «Показать подробности»** чтобы просмотреть дополнительные сведения о пакете.
zh_cn: \n搜索结果显示每个软件包的摘要信息: -作者- -喜好和下载- -最新版本的日期- \n**单击“查看详细信息”** ，可查看有关软件包的更多信息。
zh_tw: \n搜尋結果會顯示每個套件的摘要資訊: -作者- -按讚數和下載數- -最新版本的日期- \n**按一下「檢視詳細資料」** 可查看套件的更多資訊。

# PackagesGuideSearchResultsTitle
source: Search results
cs_cz: Výsledky hledání
de_de: Suchergebnisse
es_es: Resultados de búsqueda
fr_fr: Résultats de la recherche
it_it: Risultati della ricerca
ja_jp: 検索結果
ko_kr: 검색 결과
pl_pl: Wyniki wyszukiwania
pt_br: Resultados da pesquisa
ru_ru: Результаты поиска
zh_cn: 搜索结果
zh_tw: 搜尋結果

# PackageContextMenuDeletePackageCustomNodesInUseTooltip
source: This package contains custom nodes that are in use. These custom nodes need to be deleted or the graph needs to be closed before the package can be deleted.
cs_cz: Tento balíček obsahuje uživatelské uzly, které se používají. Tyto uživatelské uzly je třeba odstranit, případně je nutné před odstraněním balíčku zavřít graf.
de_de: Dieses Paket enthält benutzerdefinierte Blöcke, die verwendet werden. Diese benutzerdefinierten Blöcke müssen gelöscht oder das Diagramm muss geschlossen werden, bevor das Paket gelöscht werden kann.
es_es: Este paquete contiene nodos personalizados en uso. Estos deben eliminarse o el gráfico debe cerrarse antes de poder suprimir el paquete.
fr_fr: Ce package contient des noeuds personnalisés en cours d'utilisation. Ces noeuds personnalisés doivent être supprimés ou le graphique doit être fermé pour que le package puisse être supprimé.
it_it: Questo pacchetto contiene nodi personalizzati in uso. È necessario eliminare questi nodi personalizzati oppure chiudere il grafico prima di poter eliminare il pacchetto.
ja_jp: このパッケージには使用中のカスタム ノードが含まれています。パッケージを削除する前に、使用中のカスタム ノードを削除するか、グラフを閉じる必要があります。
ko_kr: 이 패키지에는 사용 중인 사용자 노드가 포함되어 있습니다. 이러한 사용자 노드를 삭제하거나 그래프를 닫아야 패키지를 삭제할 수 있습니다.
pl_pl: Ten pakiet zawiera węzły niestandardowe, które są w użyciu. Należy usunąć te węzły niestandardowe lub zamknąć wykres, aby można było usunąć ten pakiet.
pt_br: Esse pacote contém nós personalizados que estão em uso. Esses nós personalizados precisam ser excluídos ou o gráfico precisa ser fechado antes que o pacote possa ser excluído.
ru_ru: Этот пакет содержит пользовательские узлы, которые используются. Их необходимо удалить или закрыть график перед удалением пакета.
zh_cn: 该软件包包含已在使用的自定义节点。在可以删除软件包之前，需要先删除这些自定义节点或关闭图形。
zh_tw: 此套件包含使用中的自訂節點。必須先刪除這些自訂節點或關閉圖表，才能刪除套件。

# PackagesGuideNavigatePackagesText
source: \nWhen you install a package, it appears in the library under Add-ons. \n\n**Click to expand the package** so you can see its nodes (functions).
cs_cz: \nPři instalaci balíčku se balíček zobrazí v knihovně pod položkou Doplňky. \n\n**Kliknutím rozbalíte balíček** a zobrazíte jeho uzly (funkce).
ko_kr: \n패키지를 설치하면 애드온 아래의 라이브러리에 나타납니다. \n\n**패키지를 확장하려면 클릭하십시오.** 그러면 패키지의 노드(함수)를 볼 수 있습니다.

# PackagesGuideNavigatePackagesTitle
source: Navigate to packages
cs_cz: Přejít na balíčky
de_de: Zu Paketen navigieren
es_es: Desplazarse a los paquetes
fr_fr: Accéder aux packages
it_it: Accedi ai pacchetti
ja_jp: パッケージに移動
ko_kr: 패키지 탐색
pl_pl: Przejdź do pakietów
pt_br: Navegar para os pacotes
ru_ru: Перейти к пакетам
zh_cn: 导航到软件包
zh_tw: 導覽至套件
