Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# PackageHostDependencyFilter
source: Filter packages that depend on applications outside Dynamo. This feature currently can only filter packages which have been marked manually by package authors during publish.
cs_cz: Filtrovat balíčky, které závisí kromě aplikace Dynamo na dalších aplikacích. Tato funkce umí momentálně filtrovat balíčky, které byly označeny ručně autory balíčků během publikování.
de_de: Filtert Pakete, die von Anwendungen außerhalb von Dynamo abhängen. Mit dieser Funktion werden derzeit nur Pakete gefiltert, die während der Publizierung manuell vom Paketersteller markiert wurden.
es_es: Filtre los paquetes que dependen de las aplicaciones externas a Dynamo. Actualmente, esta función solo puede filtrar paquetes que hayan marcado manualmente los autores de paquetes durante la publicación.
fr_fr: Filtrez les packages qui dépendent d'applications externes à Dynamo. Actuellement, cette fonctionnalité peut uniquement filtrer les packages qui ont été marqués manuellement par leur auteur lors de la publication.
it_it: Filtrare i pacchetti che dipendono dalle applicazioni esterne a Dynamo. Attualmente questa funzionalità può filtrare solo pacchetti che sono stati contrassegnati manualmente dai relativi autori durante la pubblicazione.
ja_jp: Dynamo 以外のアプリケーションに依存するパッケージをフィルタします。現在この機能でフィルタできるのは、パッケージの作成者がパブリッシュ中に手動でマークしたパッケージのみです。
ko_kr: Dynamo 외부의 응용프로그램에 의존하는 패키지를 필터링합니다. 지금은 이 기능으로 패키지 작성자가 게시할 때 직접 표시한 패키지만 필터링할 수 있습니다.
pl_pl: Filtruje pakiety zależne od aplikacji innych niż dodatek Dynamo. Ta funkcja pozwala obecnie filtrować tylko pakiety, które autorzy ręcznie oznaczyli podczas publikowania.
pt_br: Filtre pacotes que dependem de aplicativos fora do Dynamo. Esse recurso atualmente apenas filtra pacotes que foram marcados manualmente pelos autores dos pacotes durante a publicação.
ru_ru: Фильтровать пакеты, для которых требуются приложения за пределами Dynamo. В настоящее время с помощью этой функции можно фильтровать только те пакеты, которые помечены вручную разработчиками во время публикации.
zh_cn: 过滤依赖 Dynamo 之外的应用程序的软件包。此功能当前仅可以过滤已在发布期间由软件包作者手动标记的软件包。
zh_tw: 篩選依賴 Dynamo 外部之應用程式的套件。此功能目前只能篩選套件作者在發佈期間已手動標示的套件。

# PackageHostDependencyFilterContextItem
source: Packages contain node(s) that depend on specified application outside Dynamo.
cs_cz: Balíčky, které závisí na určené aplikaci.
de_de: Pakete, die von einer ausgewählten externen Anwendung abhängig sind
es_es: Paquetes que dependen de la aplicación externa seleccionada
fr_fr: Packages qui dépendent d'une application spécifiée externe
it_it: Pacchetti che dipendono dall'applicazione esterna selezionata
ja_jp: 選択した外部アプリケーションに依存するパッケージ
ko_kr: 선택한 외부 응용프로그램에 의존하는 패키지
pl_pl: Pakiety zależne od wybranej aplikacji zewnętrznej
pt_br: Os pacotes que dependem do aplicativo externo selecionado
ru_ru: Пакеты, для которых требуется определенное внешнее приложение
zh_cn: 依赖选定外部应用程序的软件包
zh_tw: 依賴所選外部應用程式的套件。

# MessageUninstallSamePackage
source: "The package {0} is already installed. To reinstall it, you must first uninstall it and restart to complete the uninstall. Would you like to mark {0} for uninstall?"
cs_cz: "Balíček {0} je již nainstalován. Chcete-li jej nainstalovat znovu, je nutné jej nejdříve odinstalovat a k dokončení odinstalace restartovat počítač. Chcete balíček {0} označit k odinstalaci?"
de_de: "Das Paket {0} ist bereits installiert. Um es erneut zu installieren, müssen Sie es zunächst deinstallieren und einen Neustart durchführen, um die Deinstallation abzuschließen. Möchten Sie {0} für die Deinstallation markieren?"
es_es: "El paquete {0} ya está instalado. Para volver a instalarlo, primero debe desinstalarlo y reiniciarlo para completar la desinstalación. ¿Desea marcar {0} para desinstalarlo?"
fr_fr: "Le package {0} est déjà installé. Pour le réinstaller, vous devez d'abord le désinstaller, puis redémarrer pour terminer la désinstallation. Voulez-vous désinstaller {0}?"
it_it: "Il pacchetto {0} è già stato installato. Per reinstallarlo, è necessario disinstallarlo e riavviarlo in modo da completare la disinstallazione. Contrassegnare {0} per la disinstallazione?"
ja_jp: "パッケージ {0} は既にインストールされています。これを再インストールするには、まずこれをアンインストールし、再起動してアンインストールを完了します。{0} をアンインストール対象としてマークしますか?"
ko_kr: "패키지 {0}이(가) 이미 설치되어 있습니다. 다시 설치하려면 먼저 이를 설치제거한 후 재시작하여 설치제거를 완료해야 합니다. {0}을(를) 설치제거로 표시하시겠습니까?"
pl_pl: "Pakiet {0} jest już zainstalowany. Aby zainstalować go ponownie, należy go najpierw odinstalować, a następnie ponownie uruchomić program w celu zakończenia dezinstalacji. Czy chcesz oznaczyć {0} do odinstalowania?"
pt_br: "O pacote {0} já está instalado. Para reinstalá-lo, primeiro, é preciso desinstalá-lo e reiniciar para concluir a desinstalação. Deseja marcar{0} para desinstalação?"
ru_ru: «Пакет {0} уже установлен. Для выполнения переустановки сначала удалите его и перезапустите программу для завершения удаления. Пометить {0} для удаления?»
zh_cn: “软件包 {0} 已经安装。要重新安装它，必须先将其卸载并重新启动才能完成卸载。是否要为卸载标记 {0}？”
zh_tw: 「套件 {0} 已安裝。若要重新安裝，您必須先解除安裝，然後重新啟動以完成解除安裝。您是否要標記 {0} 進行解除安裝？」

# MessagePackageNotFound
source: {0} was not found and could not be downloaded.
cs_cz: Položka {0} nebyla nalezena a nebylo možné ji stáhnout.
de_de: {0} wurde nicht gefunden und konnte nicht heruntergeladen werden.
es_es: {0} no se ha encontrado y no se ha podido descargar.
fr_fr: {0} est introuvable et n'a pas pu être téléchargé.
it_it: {0} non trovato. Impossibile eseguire il download.
ja_jp: {0} が見つからず、ダウンロードできませんでした。
ko_kr: {0}을(를) 찾을 수 없어 다운로드하지 못했습니다.
pl_pl: Nie odnaleziono składnika {0} i nie można go pobrać.
pt_br: Não possível localizar nem fazer o download de {0}.
ru_ru: Пакет {0} не найден, и его невозможно скачать.
zh_cn: 找不到 {0}，因此无法下载。
zh_tw: 找不到 {0}，無法下載。

# MessagePackageVersionNotFound
source: Version {0} of {1} could not be found.
cs_cz: Verze {0} položky {1} nebyla nalezena.
de_de: Version {0} von {1} konnte nicht gefunden werden.
es_es: No se ha podido encontrar la versión {0} de {1}.
fr_fr: Version {0} de {1} introuvable.
it_it: Impossibile trovare la versione {0} di {1}.
ja_jp: {1} のバージョン {0} が見つかりませんでした。
ko_kr: {1}의 {0} 버전을 찾을 수 없습니다.
pl_pl: Nie można odnaleźć wersji {0} z {1}.
pt_br: Não foi possível localizar a versão {0} de {1}.
ru_ru: Не удалось найти версию {0} {1}.
zh_cn: 找不到版本 {0}(属于 {1})。
zh_tw: 找不到 {1} {0} 版。

# PublishPackageViewPackageHostDependency
source: External Dependency (optional)
cs_cz: Hostitel (volitelný)
de_de: Basisbauteil (optional)
es_es: Anfitrión (opcional)
fr_fr: Hôte (facultatif)
it_it: Host (facoltativo)
ja_jp: ホスト(省略可能)
ko_kr: 호스트(선택 사항)
pl_pl: Obiekt nadrzędny (opcjonalny)
pt_br: Host (opcional)
ru_ru: Основа (необязательно)
zh_cn: 主体(可选)
zh_tw: 主體程式 (選填)

# PublishPackageViewPackageHostDependencyTooltip
source: An indication of what applications outside of Dynamo your package depends on, such as Revit, Civil 3D or Photoshop. Users of your package will need to install these applications to fully utilize your package.
cs_cz: Značí, na jakých aplikacích kromě aplikace Dynamo váš balíček závisí, například na aplikaci Revit, Civil 3D nebo Photoshop. Uživatelé vašeho balíčku budou muset před jeho plným využitím dané aplikace nainstalovat.
de_de: Ein Hinweis darauf, von welchen Anwendungen außerhalb von Dynamo Ihr Paket abhängt, zum Beispiel Revit, Civil 3D oder Photoshop. Benutzer, die Ihr Paket verwenden, müssen diese Anwendungen installiert haben, um das Paket vollständig nutzen zu können.
es_es: Una indicación de las aplicaciones externas a Dynamo de las que depende el paquete, como Revit, Civil 3D o Photoshop. Los usuarios del paquete deberán instalar estas aplicaciones para utilizarlo por completo.
fr_fr: Informations sur les applications externes à Dynamo dont dépend votre package, telles que Revit, Civil 3D ou Photoshop. Les utilisateurs du package devront installer ces applications afin d'exploiter pleinement le package.
it_it: Un'indicazione delle applicazioni esterne a Dynamo da cui dipende il pacchetto, come Revit, Civil 3D o Photoshop. Per utilizzare pienamente il pacchetto, gli utenti del pacchetto dovranno installare queste applicazioni.
ja_jp: Revit、Civil 3D、Photoshop など、パッケージが依存する Dynamo 以外のアプリケーションの指示。パッケージのユーザは、パッケージを完全に使用するためにこれらのアプリケーションをインストールする必要があります。
ko_kr: 패키지에서 의존하는 Dynamo 외부의 응용프로그램(예: Revit, Civil 3D 또는 Photoshop)을 나타냅니다. 패키지 사용자는 패키지를 완전히 활용하려면 이러한 응용프로그램을 설치해야 합니다.
pl_pl: Wskazuje, od jakich aplikacji (poza dodatkiem Dynamo) zależy ten pakiet, na przykład Revit, Civil 3D czy Photoshop. Aby korzystać z wszystkich funkcji pakietu, jego użytkownicy muszą zainstalować te aplikacje.
pt_br: Uma indicação de quais aplicativos fora do Dynamo o seu pacote depende, como Revit, Civil 3D ou Photoshop. Os usuários de seu pacote precisarão instalar esses aplicativos para usar o pacote completamente.
ru_ru: Указание того, какие приложения за пределами Dynamo требуются для пакета, например Revit, Civil 3D или Photoshop. Пользователям нужно будет установить их, чтобы иметь возможность полностью использовать пакет.
zh_cn: 指示您的软件包依赖 Dynamo 之外的哪些应用程序，例如 Revit、Civil 3D 或 Photoshop。软件包的用户将需要安装这些应用程序以充分利用软件包。
zh_tw: 有跡象顯示，您的套件依賴 Dynamo 外部的應用程式，例如 Revit、Civil 3D 或 Photoshop。套件的使用者必須安裝這些應用程式，才能完整使用套件。

# InfoBubbleDocumentationLinkText
source: Read more...
cs_cz: Další informace...
de_de: Weitere Informationen...
es_es: Más información...
fr_fr: En savoir plus...
it_it: Ulteriori informazioni...
ja_jp: 詳細を表示...
ko_kr: 자세한 내용
pl_pl: Przeczytaj więcej...
pt_br: Leia mais...
ru_ru: Подробнее...
zh_cn: 阅读更多...
zh_tw: 閱讀更多...

# PackageSearchViewFilterByButton
source: Filter by
cs_cz: Filtrovat podle
de_de: Filtern nach
es_es: Filtrar por
fr_fr: Filtrer par
it_it: Filtra per
ja_jp: フィルタ
ko_kr: 필터링 기준
pl_pl: Filtruj według
pt_br: Filtrar por
ru_ru: Фильтровать по
zh_cn: 过滤依据
zh_tw: 篩選依據

# PreferencesViewShowCodeBlockNodeLineNumber
source: Show CodeBlockNode Line Numbers
cs_cz: Zobrazit čísla řádků uzlu CodeBlockNode
de_de: CodeBlockNode-Zeilennummern anzeigen
es_es: Mostrar números de línea de CodeBlockNode
fr_fr: Afficher les numéros de ligne CodeBlockNode
it_it: Mostra numeri righe CodeBlockNode
ja_jp: CodeBlockNode の線分の数を表示
ko_kr: CodeBlockNode 행 번호 표시
pl_pl: Pokaż numery wierszy CodeBlockNode
pt_br: Mostrar números de linha CodeBlockNode
ru_ru: Показать номера линий CodeBlockNode
zh_cn: 显示 CodeBlockNode 线号
zh_tw: 展示 CodeBlockNode 行號

# MessageFailedToDownloadPackageVersion
source: Failed to download version {0} of package with id: {1}. Please try again and report the package if you continue to have problems.
cs_cz: Nezdařilo se stažení verze {0} balíčku s ID: {1}. Zkuste to znovu a nahlaste balíček, pokud budete i nadále mít problémy.
de_de: Fehler beim Herunterladen von Version {0} des Pakets mit der folgenden ID: {1}. Versuchen Sie es erneut, und melden Sie das Paket, wenn weiterhin Probleme auftreten.
es_es: No se ha podido descargar la versión {0} del paquete con el ID: {1}. Inténtelo de nuevo e informe del paquete si continúa teniendo problemas.
fr_fr: Echec du téléchargement de la version {0} du package avec l'ID: {1}. Veuillez réessayer et signaler le package si vous continuez à rencontrer des problèmes.
it_it: Impossibile scaricare la versione {0} del pacchetto con ID: {1}. Se si continuano a verificare problemi, riprovare e segnalare il pacchetto.
ja_jp: ID が {1} のパッケージのバージョン {0} をダウンロードできませんでした。再度実行し、問題が解決しない場合は当該パッケージについて報告してください。
ko_kr: ID가 {1}인 패키지의 버전 {0}을(를) 다운로드하지 못했습니다. 다시 시도해 보고 문제가 계속 발생하면 패키지를 신고하십시오.
pl_pl: Nie można pobrać wersji {0} pakietu z identyfikatorem: {1}. Spróbuj ponownie i zgłoś pakiet, jeśli nadal występują problemy.
pt_br: Falha ao fazer o download da versão {0} do pacote com a ID: {1}. Tente novamente e reporte o pacote se você continuar a ter problemas.
ru_ru: Не удалось скачать версию {0} пакета с идентификатором {1}. Повторите попытку и сообщите о проблемах с пакетом, если они не будут устранены.
zh_cn: 无法下载 ID 为 {1} 的软件包版本 {0}。如果仍有问题，请重试并报告软件包。
zh_tw: 無法下載 ID 為 {1} 的套件版本 {0}。請再試一次，如果持續發生問題，請回報套件。

# NodeTooltipDescription
source: Description:
cs_cz: Popis:
de_de: Beschreibung:
es_es: Descripción:
it_it: Descrizione:
ja_jp: 説明:
ko_kr: 설명:
pl_pl: Opis:
pt_br: Descrição:
ru_ru: Описание:
zh_cn: 说明:
zh_tw: 描述:

# NodeTooltipOriginalName
source: Original node name:
cs_cz: Původní název uzlu:
de_de: Ursprünglicher Blockname:
es_es: Nombre original del nodo:
fr_fr: Nom du noeud d'origine:
it_it: Nome del nodo originale:
ja_jp: 元のノード名:
ko_kr: 오리지널 노드 이름:
pl_pl: Oryginalna nazwa węzła:
pt_br: Nome do nó original:
ru_ru: Исходное имя узла:
zh_cn: 原始节点名称:
zh_tw: 原始節點名稱:

# RenderingMemoryOutageDescription
source: Please check if you intended to render this amount of geometry, and consider turning off the preview of other nodes within your graph, lowering the amount of Geometry you wish to render, or turning down the render precision.
cs_cz: Ujistěte se, že jste chtěli rendrovat toto množství geometrie, a zvažte vypnutí náhledu dalších uzlů v grafu, snížení množství geometrie, které chcete rendrovat, nebo snížení přesnosti rendrování.
de_de: Überprüfen Sie, ob Sie diese Menge an Geometrie rendern möchten. Ziehen Sie in Betracht, die Vorschau anderer Blöcke in Ihrem Diagramm zu deaktivieren, die Menge an Geometrie zu verringern, die Sie rendern möchten, oder die Rendergenauigkeit zu verringern.
es_es: Compruebe si tenía intención de renderizar esta cantidad de geometría y considere la posibilidad de desactivar la vista preliminar de otros nodos del gráfico, reducir la cantidad de geometría que desea renderizar o rebajar la precisión de renderización.
fr_fr: Vérifiez si vous souhaitez effectuer le rendu de cette quantité de géométrie et envisagez de désactiver l'aperçu des autres noeuds du graphique, de réduire la quantité de géométrie pour laquelle effectuer le rendu ou de réduire la précision du rendu.
it_it: Verificare se si desidera eseguire il rendering di questa quantità di geometria. Si consiglia di disattivare l'anteprima di altri nodi nel grafico, ridurre la quantità di geometria di cui si desidera eseguire il rendering o disattivare la precisione di rendering.
ja_jp: この量のジオメトリを本当にレンダリングするのか確認し、グラフ内の他のノードのプレビューをオフにしたり、レンダリングするジオメトリの量を減らしたり、レンダリング精度を下げることなどを検討してください。
ko_kr: 형상을 이만큼 렌더링하려고 했던 것이 맞는지 확인하고, 그래프 내 다른 노드의 미리보기를 끄거나 렌더링할 형상의 양을 줄이거나 렌더링 정밀도를 낮춰 보십시오.
pl_pl: Sprawdź, czy zamierzano renderować tę ilość geometrii, i rozważ wyłączenie podglądu innych węzłów na wykresie, zmniejszając ilość geometrii do renderowania lub obniżając dokładność renderowania.
pt_br: Verifique se você pretendia renderizar esse montante de geometria e considere desativar a visualização de outros nós no gráfico, diminuindo a quantidade de geometria que você deseja renderizar ou desativando a precisão de renderização.
ru_ru: Проверьте, требуется ли визуализировать этот объем геометрии. Отключите предварительный просмотр других узлов в графике, чтобы сократить количество геометрии для визуализации, или уменьшите точность визуализации.
zh_cn: 请检查是否要渲染此数量的几何图形，并考虑关闭图形中其他节点的预览，以减少要渲染的几何图形数量或降低渲染精度。
zh_tw: 請確認您是否要彩現此幾何圖形量，並考慮關閉圖表中其他節點的預覽、降低要彩現的幾何圖形量，或降低彩現精確度。

# RenderingMemoryOutageSummary
source: Dynamo has run out of memory trying to render your geometry. The geometry preview has been disabled.
cs_cz: Aplikace Dynamo má nedostatek paměti k rendrování geometrie. Náhled geometrie byl deaktivován.
de_de: Dynamo hat nicht genügend Arbeitsspeicher zum Rendern der Geometrie. Die Geometrievorschau wurde deaktiviert.
es_es: Dynamo se ha quedado sin memoria al intentar renderizar la geometría. Se ha desactivado la vista preliminar de la geometría.
fr_fr: La mémoire de Dynamo est insuffisante pour effectuer le rendu de votre géométrie. L'aperçu de la géométrie a été désactivé.
it_it: Memoria insufficiente per il rendering della geometria. L'anteprima della geometria è stata disattivata.
ja_jp: ジオメトリのレンダリング中に Dynamo がメモリ不足になりました。ジオメトリのプレビューは無効になっています。
ko_kr: Dynamo에 형상을 렌더링할 메모리가 부족합니다. 형상 미리보기는 비활성화되었습니다.
pl_pl: Dodatek Dynamo wyczerpał pamięć, próbując renderować geometrię. Podgląd geometrii został wyłączony.
pt_br: O Dynamo ficou sem memória ao tentar renderizar a geometria. A visualização da geometria foi desativada.
ru_ru: При попытке визуализировать геометрию закончилась память для Dynamo. Предварительный просмотр геометрии отключен.
zh_cn: Dynamo 在尝试渲染几何图形时内存不足。几何图形预览已被禁用。
zh_tw: Dynamo 在嘗試彩現幾何圖形時記憶體不足。已停用幾何圖形預覽。

# PreferencesViewShowWhitespaceInPythonEditor
source: Show Whitespace in Python Editor
cs_cz: Zobrazit bílé místo v editoru jazyka Python
de_de: Leerzeichen im Python-Editor anzeigen
es_es: Mostrar espacios en blanco en el editor de Python
fr_fr: Afficher les espaces dans l'éditeur Python
it_it: Mostra spazio vuoto nell'editor Python
ja_jp: Python エディタに空白スペースを表示
ko_kr: Python 편집기에 공백 표시
pl_pl: Pokaż odstępy w edytorze języka Python
pt_br: Mostrar espaço em branco no editor Python
ru_ru: Показывать пробелы в редакторе Python
zh_cn: 在 Python 编辑器中显示空格
zh_tw: 在 Python 編輯器中展示空格

# PreferencesViewDefaultPythonEngine
source: Default Python Engine
cs_cz: Výchozí modul jazyka Python
de_de: Vorgabemäßige Python-Engine
es_es: Motor de Python por defecto
fr_fr: Moteur Python par défaut
it_it: Motore Python di default
ja_jp: 既定の Python エンジン
ko_kr: 기본 Python 엔진
pl_pl: Domyślny silnik języka Python
pt_br: Mecanismo Python padrão
ru_ru: Механизм Python по умолчанию
zh_cn: 默认 Python 引擎
zh_tw: 預設 Python 引擎

# PreferencesViewPackageDownloadDirectory
source: New Package Download Path
cs_cz: Cesta pro stahování nových balíčků
de_de: Neuer Paket-Download-Pfad
es_es: Nueva ruta de descarga de paquetes
fr_fr: Répertoire de téléchargement des nouveaux packages
it_it: Nuovo percorso di download del pacchetto
ja_jp: 新しいパッケージのダウンロード用パス
ko_kr: 새 패키지 다운로드 경로
pl_pl: Ścieżka pobierania nowych pakietów
pt_br: Novo caminho de download de pacotes
ru_ru: Новый путь для скачивания пакетов
zh_cn: 新的软件包下载路径
zh_tw: 新套件下載路徑

# PreferencesPackageDownloadDirectoryTooltip
source: Choose a package path from this list to download new packages to.
cs_cz: Vyberte cestu balíčku z tohoto seznamu, do kterého chcete stáhnout nové balíčky.
de_de: Wählen Sie einen Paketpfad aus dieser Liste, in den neue Pakete heruntergeladen werden sollen.
es_es: Elija una ruta de paquete en esta lista en la que descargar los nuevos paquetes.
fr_fr: Choisissez un chemin d'accès de package dans cette liste pour y télécharger les nouveaux packages.
it_it: Scegliere un percorso di pacchetto dall'elenco per il download di nuovi pacchetti.
ja_jp: 新しいパッケージをダウンロードするパッケージ パスを、このリストから選択します。
ko_kr: 이 리스트에서 새 패키지를 다운로드할 패키지 경로를 선택합니다.
pl_pl: Wybierz z tej listy ścieżkę pakietów, do której mają zostać pobrane nowe pakiety.
pt_br: Escolha um caminho de pacote nesta lista para fazer o download de novos pacotes.
ru_ru: Выберите путь к пакету из этого списка, в который будут скачиваться новые пакеты.
zh_cn: 从此列表中选择要将新的软件包下载到的软件包路径。
zh_tw: 從此清單中選擇要將新套件下載到哪個套件路徑。

# DefaultPythonEngineNone
source: Use System Default
cs_cz: Použít výchozí nastavení systému
de_de: Systemvorgabe verwenden
es_es: Usar valores por defecto del sistema
fr_fr: Utiliser la valeur par défaut du système
it_it: Usa valore di default di sistema
ja_jp: システムの既定を使用
ko_kr: 시스템 기본값 사용
pl_pl: Użyj domyślnych ustawień systemowych
pt_br: Usar padrão do sistema
ru_ru: Использовать настройки системы по умолчанию
zh_cn: 使用系统默认值
zh_tw: 使用系統預設

# PreferencesViewEnableNodeAutoComplete
source: Enable Node Autocomplete
cs_cz: Zapnout automatické dokončování uzlů
de_de: Automatische Blockvervollständigung aktivieren
es_es: Activar Autocompletar nodo
fr_fr: Activer la saisie automatique du noeud
it_it: Attiva Completamento automatico nodi
ja_jp: ノード オートコンプリートを有効にする
ko_kr: 노드 자동 완성 사용
pl_pl: Włącz autouzupełnianie węzłów
pt_br: Ativar preenchimento automático de nós
ru_ru: Включить автозаполнение узла
zh_cn: 启用“节点自动完成”
zh_tw: 啟用節點自動完成

# ErrorLoadingIcon
source: An error occurred when loading the application icon: {0}
cs_cz: Při načítání ikony aplikace došlo k chybě: {0}
de_de: Fehler beim Laden des Anwendungssymbols: {0}
es_es: Se ha producido un error al cargar el icono de la aplicación: {0}
fr_fr: Une erreur s'est produite lors du chargement de l'icône d'application: {0}
it_it: Si è verificato un errore durante il caricamento dell'icona dell'applicazione: {0}
ja_jp: アプリケーション アイコンのロード中にエラーが発生しました: {0}
ko_kr: 응용프로그램 아이콘 {0}을(를) 로드하는 중에 오류가 발생했습니다.
pl_pl: Wystąpił błąd podczas wczytywania ikony aplikacji: {0}
pt_br: Ocorreu um erro ao carregar o ícone do aplicativo: {0}
ru_ru: Ошибка при загрузке значка приложения: {0}
zh_cn: 加载应用程序图标时出错: {0}
zh_tw: 載入應用程式圖示時發生錯誤: {0}

# PublishPackageSelectNodeLibraries
source: Select Node Libraries
cs_cz: Vyberte knihovny uzlů
de_de: Blockbibliotheken auswählen
es_es: Seleccionar bibliotecas de nodos
fr_fr: Sélectionner les bibliothèques de noeuds
it_it: Seleziona librerie di nodi
ja_jp: ノード ライブラリを選択
ko_kr: 노드 라이브러리 선택
pl_pl: Wybierz biblioteki węzłów
pt_br: Selecionar bibliotecas de nós
ru_ru: Выбор библиотек узлов
zh_cn: 选择节点库
zh_tw: 選取節點資源庫

# DynamoViewDynamoMenuAbout
source: _About
cs_cz: O _aplikaci
de_de: _Info
es_es: _Acerca de
fr_fr: _À propos de
it_it: _Informazioni su
ja_jp: バージョン情報(_A)
ko_kr: 정보(_A)
pl_pl: _Informacje
pt_br: _Sobre
ru_ru: _О программе
zh_cn: 关于(_A)
zh_tw: 關於(_A)

# DynamoViewDynamoMenuPreferences
source: _Preferences...
cs_cz: _Předvolby...
de_de: _Einstellungen...
es_es: _Preferencias...
fr_fr: _Préférences...
it_it: _Preferenze...
ja_jp: 基本設定(_P)...
ko_kr: 기본 설정(_P)...
pl_pl: _Preferencje...
pt_br: _Preferências...
ru_ru: _Настройки...
zh_cn: 首选项(_P)…
zh_tw: 偏好(_P)...

# DynamoViewFileMenuExport
source: _Export
cs_cz: _Exportovat
es_es: _Exportar
fr_fr: E_xporter
it_it: _Esporta
ja_jp: 書き出し(_E)
ko_kr: 내보내기(_E)
pl_pl: _Eksportuj
pt_br: _Exportar
ru_ru: _Экспорт
zh_cn: 导出(_E)
zh_tw: 匯出(_E)

# PublishPackageDocTooltipText
source: Learn More about publishing a package
cs_cz: Další informace o balíčcích
de_de: Weitere Informationen zu Paketen
es_es: Más información sobre los paquetes
fr_fr: En savoir plus sur les packages
it_it: Ulteriori informazioni sui pacchetti
ja_jp: パッケージに関する詳細を表示
ko_kr: 패키지에 대해 자세히 알아보기
pl_pl: Dowiedz się więcej o pakietach
pt_br: Saiba mais sobre os pacotes
ru_ru: Подробнее о пакетах
zh_cn: 了解有关软件包的详细信息
zh_tw: 進一步瞭解套件

# PreferencesViewFeaturesTab
source: Features
cs_cz: Prvky
de_de: Funktionen
es_es: Funciones
fr_fr: Fonctions
it_it: Funzionalità
ja_jp: フィーチャ
ko_kr: 기능
pl_pl: Funkcje
pt_br: Recursos
ru_ru: Возможности
zh_cn: 功能
zh_tw: 功能

# PreferencesViewGeneralTab
source: General
cs_cz: Obecné
de_de: Allgemein
fr_fr: Général
it_it: Generale
ja_jp: 一般
ko_kr: 일반
pl_pl: Ogólne
pt_br: Geral
ru_ru: Общие
zh_cn: 常规
zh_tw: 一般

# PreferencesViewTitle
source: Preferences
cs_cz: Předvolby
de_de: Voreinstellungen
es_es: Preferencias
fr_fr: Préférences
it_it: Preferenze
ja_jp: 基本設定
ko_kr: 기본 설정
pl_pl: Preferencje
pt_br: Preferências
ru_ru: Настройки
zh_cn: 首选项
zh_tw: 偏好

# PreferencesViewVisualSettingsTab
source: Visual Settings
cs_cz: Vizuální nastavení
de_de: Darstellungseinstellungen
es_es: Configuración visual
fr_fr: Paramètres visuels
it_it: Impostazioni visive
ja_jp: 表示設定
ko_kr: 시각화 설정
pl_pl: Ustawienia wizualne
pt_br: Configurações visuais
ru_ru: Параметры отображения
zh_cn: 视觉设置
zh_tw: 視覺設定

# PreferencesViewFontSizeLabel
source: Node Font Size
cs_cz: Velikost písma uzlu
de_de: Block-Schriftgröße
es_es: Tamaño del tipo de letra del nodo
fr_fr: Taille de police du noeud
it_it: Dimensione carattere nodo
ja_jp: ノードのフォント サイズ
ko_kr: 노드 글꼴 크기
pl_pl: Rozmiar czcionki węzła
pt_br: Tamanho da fonte do nó
ru_ru: Размер шрифта узла
zh_cn: 节点字体大小
zh_tw: 節點字體大小

# PreferencesViewLanguageLabel
source: Language
cs_cz: Jazyk
de_de: Sprache
es_es: Idioma
fr_fr: Langue
it_it: Lingua
ja_jp: 言語
ko_kr: 언어
pl_pl: Język
pt_br: Idioma
ru_ru: Язык
zh_cn: 语言
zh_tw: 語言
