Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# OnboardingNodesText
source: Nodes are the building blocks of graphs. Nodes perform operations, such as storing a number or creating geometry.\n\nYou can learn more about a node by hovering over its parts. This node is missing an input.\n\nHover over the input port to see what types of data it accepts.
cs_cz: Uzly jsou stavební bloky grafů. Uzly provádějí operace, například uložení čísla nebo vytvoření geometrie.\n\nVíce o tomto uzlu se můžete dozvědět, když umístíte kurzor nad jeho součásti. V tomto uzlu chybí vstup.\n\nUmístěte kurzor nad vstupní port a zobrazte typy dat, které přijímá.
de_de: Blöcke sind die Bausteine von Diagrammen. Blöcke führen Vorgänge aus, z. B. Speichern einer Zahl oder Erstellen von Geometrie.\n\nSie können mehr über einen Block erfahren, indem Sie den Mauszeiger über seine Bestandteile bewegen. In diesem Block fehlt eine Eingabe.\n\nBewegen Sie den Mauszeiger über den Eingabeanschluss, um zu sehen, welche Daten akzeptiert werden.
es_es: Los nodos son los bloques de creación de los gráficos y realizan operaciones como, por ejemplo, almacenar un número o crear geometría.\n\nPara obtener más información sobre un nodo, coloque el cursor sobre una de sus piezas. A este nodo le falta una entrada.\n\nColoque el cursor sobre el puerto de entrada para ver los tipos de datos que acepta.
fr_fr: Les noeuds sont des blocs de construction des graphiques. Les noeuds exécutent des opérations, telles que le stockage d'un nombre ou la création d'une géométrie.\n\nVous pouvez obtenir les détails d'un noeud en plaçant la souris sur ses différentes parties. Des données manquent à ce noeud.\n\nPlacez la souris sur ce port d'entrée pour voir les types de données acceptés.
it_it: I nodi sono gli elementi di base dei grafici. I nodi consentono di eseguire operazioni quali la memorizzazione di un numero o la creazione di geometria.\n\nPer ottenere ulteriori informazioni su un nodo, posizionare il cursore sulle relative parti. In questo nodo risulta mancante un input.\n\nPosizionare il cursore sulla porta di input per vedere quali tipi di dati vengono accettati.
ja_jp: ノードはグラフの構成要素です。ノードは、数値の格納やジオメトリの作成などの操作を行います。\n\nノードのパーツにカーソルを合わせると、その詳細を参照できます。このノードには入力がありません。\n\n入力ポートにカーソルを合わせて、入力可能なデータのタイプを確認してください。
ko_kr: 노드는 그래프의 빌딩 블록입니다. 노드는 숫자 저장 또는 형상 작성 등의 작업을 수행합니다.\n\n해당 부분으로 마우스를 가져가면 노드에 대해 자세히 알아볼 수 있습니다. 이 노드에는 입력이 없습니다.\n\n입력 포트 위로 마우스를 가져가 허용되는 데이터 형식을 확인하십시오.
pl_pl: Węzły są elementami składowymi wykresów. Węzły wykonują operacje, takie jak przechowywanie liczby lub tworzenie geometrii.\n\nMożesz dowiedzieć się więcej o węźle, umieszczając wskaźnik myszy na jego elementach. W tym węźle brakuje pozycji danych wejściowych.\n\nUmieść wskaźnik myszy na porcie wejściowym, aby sprawdzić, jakie typy danych akceptuje.
pt_br: Os nós são os blocos de construção dos gráficos. Os nós executam operações, como o armazenamento de um número ou a criação de geometria.\n\nSaiba mais sobre um nó passando o mouse sobre suas partes. Esse nó não tem nenhuma entrada.\n\nPasse o mouse sobre a porta de entrada para ver quais tipos de dados ele aceita.
ru_ru: Узлы являются компоновочными блоками графиков. Узлы выполняют операции, такие как сохранение номера или создание геометрии.\n\nЧтобы узнать больше об узле, наведите указатель на его элементы. В этом узле отсутствует входной параметр.\n\nНаведите указатель на порт ввода, чтобы узнать, какие типы данных он поддерживает.
zh_cn: 节点是图形的构建块。节点会执行操作，例如存储数字或创建几何图形。\n\n可以通过将鼠标光标悬停在节点的各个部分上，来了解有关节点的更多信息。此节点缺少输入。\n\n将鼠标光标悬停在输入端口上，以查看它所接受的数据类型。
zh_tw: 節點是圖表的建置區塊。節點執行作業，例如儲存數字或建立幾何圖形。\n\n您可以將游標懸停在節點各部分來進一步瞭解節點。此節點缺少輸入。\n\n將游標懸停在輸入埠上可查看它接受的資料類型。

# OnboardingNodesTitle
source: Nodes
cs_cz: Uzly
de_de: Blöcke
es_es: Nodos
fr_fr: noeuds
it_it: Nodi
ja_jp: ノード
ko_kr: 노드
pl_pl: Węzły
pt_br: Nós
ru_ru: Узлы
zh_cn: 节点
zh_tw: 節點

# OnboardingGuideWelcomeText
source: Learn about the basic building blocks of Dynamo. Get hands-on practice working with a graph.
cs_cz: Seznamte se se základními stavebními bloky aplikace Dynamo. Získejte praktickou zkušenost, jak pracovat s grafem.
de_de: Erfahren Sie mehr über die grundlegenden Bausteine von Dynamo. Lernen Sie praktische Übungen zum Arbeiten mit einem Diagramm kennen.
es_es: Obtenga más información sobre los componentes básicos de Dynamo. Practique con un gráfico.
fr_fr: Découvrez les blocs de construction de base de Dynamo. Entraînez-vous à utiliser un graphique.
it_it: Informazioni sugli elementi di base di Dynamo. Esercitazione pratica sull'utilizzo di un grafico.
ja_jp: Dynamo の基本的な構成要素について学習します。グラフを使用して実践的な練習を行います。
ko_kr: Dynamo의 기본 빌딩 블록에 대해 알아봅니다. 그래프로 실습해 보십시오.
pl_pl: Dowiedz się więcej na temat podstawowych elementów składowych dodatku Dynamo. Poznaj w praktyce pracę z wykresem.
pt_br: Saiba mais sobre os blocos de construção básicos do Dynamo. Obtenha prática trabalhando com um gráfico.
ru_ru: Узнайте об основных компоновочных блоках Dynamo. Выполните практикум по работе с графиком.
zh_cn: 了解 Dynamo 的基本构建块。动手练习使用图形。
zh_tw: 瞭解 Dynamo 的基本建置區塊。取得使用圖表的實際操作練習。

# OnboardingPlaceNodeText
source: The library contains the nodes used to build graphs. To find a node, you can search the library or browse its categories. To place a node from the library to the workspace, click the node. Try placing the highlighted **ByOrigin** node.
cs_cz: Knihovna obsahuje uzly používané k tvorbě grafů. Chcete-li najít uzel, můžete v knihovně hledat nebo procházet její kategorie. Chcete-li umístit uzel z knihovny do pracovního prostoru, klikněte na něj. Zkuste umístit zvýrazněný uzel **ByOrigin** .
de_de: Die Bibliothek enthält die Blöcke, die zum Erstellen von Diagrammen verwendet werden. Um einen Block zu finden, können Sie die Bibliothek oder die Kategorien durchsuchen. Um einen Block aus der Bibliothek in den Arbeitsbereich zu platzieren, klicken Sie auf den Block. Versuchen Sie, den markierten **ByOrigin** -Block zu platzieren.
es_es: La biblioteca contiene los nodos utilizados para generar gráficos. Para localizar un nodo, puede buscar en la biblioteca o examinar sus categorías. Para colocar un nodo de la biblioteca en el espacio de trabajo, haga clic en el nodo. Pruebe a colocar el nodo resaltado **ByOrigin** .
fr_fr: La bibliothèque contient les noeuds utilisés pour créer des graphiques. Pour trouver un noeud, vous pouvez effectuer une recherche dans la bibliothèque ou parcourir ses catégories. Pour placer un noeud de la bibliothèque dans l'espace de travail, cliquez sur le noeud. Essayez de placer le noeud **ByOrigin** mis en surbrillance.
it_it: La libreria contiene i nodi utilizzati per creare i grafici. Per trovare un nodo, è possibile eseguire una ricerca nella libreria o sfogliare le relative categorie. Per posizionare un nodo dalla libreria nell'area di lavoro, fare clic sul nodo. Provare a posizionare il nodo **ByOrigin** evidenziato.
ja_jp: ライブラリには、グラフの構築に使用されるノードが含まれています。ノードを探すには、ライブラリを検索するか、そのカテゴリを参照します。 ライブラリからワークスペースにノードを配置するには、該当するノードをクリックします。 ハイライト表示された **ByOrigin** ノードを配置してみてください。
ko_kr: 라이브러리에는 그래프를 작성하는 데 사용되는 노드가 포함되어 있습니다. 노드를 찾으려면 라이브러리를 검색하거나 해당 카테고리를 찾아보면 됩니다. 라이브러리에서 작업공간으로 노드를 배치하려면 노드를 클릭합니다. 강조 표시된 **ByOrigin** 노드를 배치해 보십시오.
pl_pl: Ta biblioteka zawiera węzły używane do tworzenia wykresów. Aby znaleźć węzeł, można przeszukać bibliotekę lub przejrzeć jej kategorie. Aby umieścić węzeł z biblioteki w obszarze roboczym, kliknij węzeł. Spróbuj umieścić wyróżniony węzeł **ByOrigin** .
pt_br: A biblioteca contém os nós usados para criar gráficos. Para localizar um nó, é possível pesquisar a biblioteca ou procurar suas categorias. Para inserir um nó da biblioteca no espaço de trabalho, clique no nó. Tente colocar o nó **ByOrigin** realçado.
ru_ru: Библиотека содержит узлы, используемые для построения графиков. Чтобы найти узел, выполните поиск в библиотеке или по категории. Для размещения узла из библиотеки в рабочем пространстве щелкните узел. Попробуйте разместить выделенный узел **ByOrigin** .
zh_cn: 该库包含用于构建图形的节点。要查找节点，可以搜索该库或浏览其类别。 要将节点从库放置到工作空间，请单击该节点。 请尝试放置亮显的 **ByOrigin** 节点。
zh_tw: 資源庫包含用於建置圖表的節點。若要尋找節點，您可以搜尋資源庫或瀏覽其品類。 若要將資源庫的節點放置到工作區，請按一下該節點。 請嘗試放置亮顯的 **ByOrigin** 節點。

# OnboardingPlaceNodeTitle
source: Placing nodes
cs_cz: Umisťování uzlů
de_de: Platzieren von Blöcken
es_es: Colocación de nodos
fr_fr: Positionnement des noeuds
it_it: Posizionamento di nodi
ja_jp: ノードを配置する
ko_kr: 노드 배치
pl_pl: Umieszczanie węzłów
pt_br: Colocar nós
ru_ru: Размещение узлов
zh_cn: 正在放置节点
zh_tw: 放置節點

# OnboardingGuideConnectNodesText
source: This new node needs to be connected to another to make it part of the graph. Give it a try, then click the Next arrow.
cs_cz: Tento nový uzel je potřeba připojit k jinému uzlu, aby se stal součástí grafu. Zkuste to a poté klikněte na šipku Další.
de_de: Dieser neue Block muss mit einem anderen Block verbunden werden, damit er Teil des Diagramms wird. Versuchen Sie es, und klicken Sie dann auf den Weiter-Pfeil.
es_es: Este nuevo nodo debe estar conectado a otro para que forme parte del gráfico. Inténtelo y, a continuación, haga clic en la flecha Siguiente.
fr_fr: Ce nouveau noeud doit être relié à un autre noeud pour être ajouté au graphique. Essayez d'effectuer cette opération, puis cliquez sur la flèche Suivant.
it_it: Questo nuovo nodo deve essere connesso ad un altro per renderlo parte del grafico. Provare, quindi fare clic sulla freccia Avanti.
ja_jp: この新しいノードをグラフの一部にするには、別のノードに接続する必要があります。試してみてから、[次へ]の矢印をクリックしてください。
ko_kr: 이 새 노드를 그래프에 포함하려면 다른 노드에 연결해야 합니다. 연결한 후 다음 화살표를 클릭하십시오.
pl_pl: Ten nowy węzeł musi być połączony z innym, aby stał się częścią wykresu. Wypróbuj to, a następnie kliknij strzałkę Dalej.
pt_br: Este novo nó precisa estar conectado a outro para torná-lo parte do gráfico. Experimente e clique na seta Avançar.
ru_ru: Этот новый узел необходимо соединить с другим, чтобы включить его в график. Попробуйте, а затем нажмите стрелку «Далее».
zh_cn: 此新节点需要连接到另一个节点，才能使其成为图形的一部分。请尝试一下，然后单击“下一步”箭头。
zh_tw: 此新節點需要連接至另一個節點，才能成為圖表的一部分。試試看，然後按「下一步」箭頭。

# OnboardingGuideConnectNodesTitle
source: Connect the nodes
cs_cz: Připojit uzly
de_de: Blöcke verbinden
es_es: Conectar los nodos
fr_fr: Relier les noeuds
it_it: Connetti i nodi
ja_jp: ノードを接続する
ko_kr: 노드 연결
pl_pl: Połącz węzły
pt_br: Conectar os nós
ru_ru: Соединение узлов
zh_cn: 连接节点
zh_tw: 連接節點

# OnboardingGuideRunGraphText
source: Let’s run the graph and see the results of the adjustments you made. Click Run.
cs_cz: Nyní spusťte graf a zobrazte výsledky provedených úprav. Klikněte na tlačítko Spustit.
de_de: Wir führen das Diagramm aus und sehen uns die Ergebnisse der Anpassungen an. Klicken Sie auf Ausführen.
es_es: Vamos a ejecutar el gráfico y ver los resultados de los ajustes realizados. Haga clic en Ejecutar.
fr_fr: Exécutez le graphique et observez les résultats des ajustements apportés. Cliquez sur Exécuter.
it_it: Eseguire il grafico e visualizzare i risultati delle modifiche apportate. Fare clic su Esegui.
ja_jp: グラフを実行し、行った調整の結果を確認します。[実行]をクリックしてください。
ko_kr: 그래프를 실행하고 수행한 조정에 대한 결과를 확인합니다. 실행을 클릭합니다.
pl_pl: Czas na uruchomienie wykresu i przyjrzenie się wynikom wprowadzonych zmian. Kliknij przycisk Uruchom.
pt_br: Vamos executar o gráfico e ver os resultados dos ajustes feitos. Clique em Executar.
ru_ru: Запустите график и посмотрите результаты внесенных изменений. Нажмите «Запуск».
zh_cn: 让我们运行图形并查看所做调整的结果。单击“运行”。
zh_tw: 我們來執行圖表，然後看看調整後的結果。按一下「執行」。

# OnboardingGuideRunGraphTitle
source: Run the graph
cs_cz: Spuštění grafu
de_de: Diagramm ausführen
es_es: Ejecutar el gráfico
fr_fr: Exécuter le graphique
it_it: Esegui il grafico
ja_jp: グラフを実行する
ko_kr: 그래프 실행
pl_pl: Uruchom wykres
pt_br: Executar o gráfico
ru_ru: Выполнение графика
zh_cn: 运行图形
zh_tw: 執行圖表

# FileTrustWarningCheckBoxText
source: Trust this file’s location in the future.
cs_cz: V budoucnu důvěřovat umístění tohoto souboru.
de_de: Dem Speicherort dieser Datei zukünftig vertrauen.
es_es: Confiar en la ubicación de este archivo en el futuro.
fr_fr: Faire confiance à l'emplacement de ce fichier à l'avenir.
it_it: Considerare attendibile la posizione di questo file in futuro.
ja_jp: 今後はこのファイルの場所を信頼します。
ko_kr: 나중에 이 파일의 위치를 신뢰합니다.
pl_pl: Ufaj lokalizacji tego pliku w przyszłości.
pt_br: Confiar na localização deste arquivo no futuro.
ru_ru: Доверять этому расположению файла в будущем.
zh_cn: 以后信任此文件的位置。
zh_tw: 以後都信任此檔案的位置。

# FileTrustWarningPopupNoCloseFile
source: No, close file
cs_cz: Ne, zavřít soubor
de_de: Nein, Datei schließen
es_es: No, cerrar archivo.
fr_fr: Non, fermer le fichier
it_it: No, chiudi file
ja_jp: いいえ、ファイルを閉じます
ko_kr: 아니오, 파일을 닫습니다.
pl_pl: Nie, zamknij plik
pt_br: Não, fechar arquivo
ru_ru: Нет, закрыть файл
zh_cn: 否，关闭文件
zh_tw: 否，關閉檔案

# FileTrustWarningPopupSettings
source: Settings
cs_cz: Nastavení
de_de: Einstellungen
es_es: Configuración
fr_fr: Paramètres
it_it: Impostazioni
ja_jp: 設定
ko_kr: 설정
pl_pl: Ustawienia
pt_br: Configurações
ru_ru: Параметры
zh_cn: 设置
zh_tw: 設定

# FileTrustWarningPopupText
source: This file is stored in an untrusted location. Do you want to open this file?
cs_cz: Tento soubor je uložen v nedůvěryhodném umístění. Chcete tento soubor otevřít?
de_de: Diese Datei ist an einem nicht vertrauenswürdigen Speicherort gespeichert. Möchten Sie diese Datei öffnen?
es_es: Este archivo se ha almacenado en una ubicación que no es de confianza. ¿Desea abrirlo?
fr_fr: Ce fichier est stocké dans un emplacement non approuvé. Voulez-vous l'ouvrir?
it_it: Questo file è memorizzato in una posizione non attendibile. Aprire il file?
ja_jp: このファイルは信頼できない場所に保存されています。このファイルを開きますか?
ko_kr: 이 파일은 신뢰할 수 없는 위치에 저장되어 있습니다. 이 파일을 여시겠습니까?
pl_pl: Ten plik jest przechowywany w niezaufanej lokalizacji. Czy chcesz otworzyć ten plik?
pt_br: Esse arquivo está armazenado em um local não confiável. Deseja abrir o arquivo?
ru_ru: Этот файл сохранен в ненадежной папке. Открыть файл?
zh_cn: 此文件存储在不受信任的位置。是否要打开此文件？
zh_tw: 此檔案儲存在未受信任的位置。是否要開啟此檔案？

# FileTrustWarningPopupTitle
source: Open external file?
cs_cz: Otevřít externí soubor?
de_de: Externe Datei öffnen?
es_es: ¿Abrir archivo externo?
fr_fr: Ouvrir le fichier externe?
it_it: Aprire il file esterno?
ja_jp: 外部ファイルを開きますか?
ko_kr: 외부 파일을 여시겠습니까?
pl_pl: Czy otworzyć plik zewnętrzny?
pt_br: Abrir arquivo externo?
ru_ru: Открыть внешний файл?
zh_cn: 打开外部文件？
zh_tw: 開啟外部檔案？

# FileTrustWarningPopupTooltip1
source: External content may bring risks to your system security.
cs_cz: Externí obsah může ohrozit zabezpečení systému.
de_de: Externe Inhalte können Risiken für die Systemsicherheit mit sich bringen.
es_es: El contenido externo puede poner en riesgo la seguridad del sistema.
fr_fr: Le contenu externe peut présenter des risques pour la sécurité de votre système.
it_it: Il contenuto esterno può comportare rischi per la sicurezza del sistema.
ja_jp: 外部コンテンツは、システムのセキュリティにリスクをもたらす場合があります。
ko_kr: 외부 컨텐츠는 시스템 보안에 위험을 초래할 수 있습니다.
pl_pl: Zawartość zewnętrzna może stanowić zagrożenie dla bezpieczeństwa systemu.
pt_br: O conteúdo externo pode trazer riscos à segurança do sistema.
ru_ru: Внешнее содержимое может угрожать безопасности системы.
zh_cn: 外部内容可能会给系统安全带来风险。
zh_tw: 外部內容可能會對您的系統安全帶來風險。

# FileTrustWarningPopupTooltip2
source: The file's current location will be added to trusted locations. You can manage this in Preferences -> Security.
cs_cz: Aktuální umístění souboru bude přidáno do důvěryhodných umístění. Tato umístění můžete spravovat v části Předvolby -> Zabezpečení.
de_de: Der aktuelle Speicherort der Datei wird zu den vertrauenswürdigen Speicherorten hinzugefügt. Sie können dies unter Voreinstellungen -> Sicherheit verwalten.
es_es: La ubicación actual del archivo se añadirá a las ubicaciones de confianza. Puede administrar esto en Preferencias - > Seguridad.
fr_fr: L'emplacement actuel du fichier sera ajouté aux emplacements de confiance. Vous pouvez gérer ce paramètre dans Préférences -> Sécurité.
it_it: La posizione corrente del file verrà aggiunta alle posizioni attendibili. È possibile gestire questa impostazione in Preferenze -> Sicurezza.
ja_jp: ファイルの現在の場所は、信頼できる場所に追加されます。 これは、[基本設定] -> [セキュリティ]で管理できます。
ko_kr: 파일의 현재 위치가 신뢰할 수 있는 위치에 추가됩니다. 기본 설정 -> 보안에서 관리할 수 있습니다.
pl_pl: Bieżąca lokalizacja pliku zostanie dodana do zaufanych lokalizacji. Można tym zarządzać w obszarze Preferencje -> Zabezpieczenia.
pt_br: A localização atual do arquivo será adicionada às localizações confiáveis. É possível gerenciar isso em Preferências -> Segurança.
ru_ru: Текущее расположение файла будет добавлено в список доверенных. Для управления выберите «Настройки» > «Безопасность».
zh_cn: 文件的当前位置将添加到受信任的位置。 可以在“首选项”->“安全性”中对此进行管理。
zh_tw: 檔案的目前位置將會加入可信任的位置。 您可以在「偏好」 ->「安全性」中管理此位置。

# FileTrustWarningPopupYes
source: Yes
cs_cz: Ano
de_de: Ja
es_es: Sí
fr_fr: Oui
it_it: Sì
ja_jp: はい
ko_kr: 예
pl_pl: Tak
pt_br: Sim
ru_ru: Да
zh_cn: 是
zh_tw: 是

# DynamoViewRunButtonToolTipDisabledFileTrust
source: Graph execution is suspended until warning is resolved
cs_cz: Spuštění grafu je pozastaveno, dokud nebude vyřešeno upozornění.
de_de: Diagrammausführung wird angehalten, bis die Warnung behoben ist
es_es: La ejecución del gráfico se suspenderá hasta que se resuelva la advertencia.
fr_fr: L'exécution du graphique est suspendue jusqu'à la résolution de l'avertissement
it_it: L'esecuzione del grafico viene sospesa fino alla risoluzione dell'avviso
ja_jp: グラフの実行は、警告が解決されるまで中断されます
ko_kr: 경고가 해결될 때까지 그래프 실행이 일시 중단됩니다.
pl_pl: Wykonywanie wykresu wstrzymano do momentu rozstrzygnięcia ostrzeżenia
pt_br: A execução do gráfico é suspensa até que o aviso seja resolvido
ru_ru: Выполнение графика приостановлено до устранения предупреждения
zh_cn: 在解决警告之前图形执行处于暂停状态
zh_tw: 在解決警告之前，圖表會暫停執行

# DynamoShowFileTrustWarning
source: Show File Trust Warning
cs_cz: Zobrazit upozornění důvěryhodnosti souboru
de_de: Warnung zur Vertrauenswürdigkeit von Dateien anzeigen
es_es: Mostrar advertencia de confianza de archivo
fr_fr: Afficher l'avertissement de confiance des fichiers
it_it: Mostra avviso di attendibilità file
ja_jp: ファイルの信頼性の警告を表示する
ko_kr: 파일 신뢰 경고 표시
pl_pl: Pokaż ostrzeżenie dotyczące zaufania do pliku
pt_br: Mostrar aviso de confiança de arquivo
ru_ru: Показывать предупреждение о доверии файлу
zh_cn: 显示文件信任警告
zh_tw: 展示檔案信任警告

# DynamoViewRunTypesComboBoxToolTipDisabled
source: Run mode can not be changed until warning is resolved
cs_cz: Režim spuštění není možné změnit, dokud nebude vyřešeno upozornění
de_de: Der Ausführungsmodus kann erst geändert werden, wenn die Warnung behoben wurde
es_es: El modo de ejecución no se puede cambiar hasta que se resuelva la advertencia.
fr_fr: Le mode d'exécution ne peut pas être modifié tant que l'avertissement n'est pas résolu
it_it: Impossibile modificare la modalità di esecuzione finché l'avviso non viene risolto
ja_jp: 実行モードは警告が解決されるまで変更できません
ko_kr: 경고가 해결될 때까지 실행 모드를 변경할 수 없습니다.
pl_pl: Nie można zmienić trybu uruchomienia, dopóki nie zostanie rozstrzygnięte ostrzeżenie
pt_br: Não é possível alterar o modo de execução até que o aviso seja resolvido
ru_ru: Режим выполнения нельзя изменить до устранения предупреждения
zh_cn: 在解决警告之前无法更改运行模式
zh_tw: 在解決警告之前，無法變更執行模式

# BubbleDismissAllButtonTooltip
source: Temporarily dismiss all warnings of this node
cs_cz: Dočasně zrušit všechna upozornění tohoto uzlu
de_de: Alle Warnungen zu diesem Block vorübergehend verwerfen
es_es: Descartar temporalmente todas las advertencias de este nodo
fr_fr: Fermer temporairement tous les avertissements de ce noeud
it_it: Ignora temporaneamente tutti gli avvisi di questo nodo
ja_jp: このノードのすべての警告を一時的に閉じる
ko_kr: 이 노드의 모든 경고를 일시적으로 취소합니다.
pl_pl: Tymczasowo odrzuć wszystkie ostrzeżenia tego węzła
pt_br: Descartar temporariamente todos os avisos deste nó
ru_ru: Временно закрыть все предупреждения для этого узла
zh_cn: 暂时关闭此节点的所有警告
zh_tw: 暫時關閉此節點的所有警告

# RunCompletedWithWarningsDismissedMessage
source: Run completed with dismissed warnings.
cs_cz: Spuštění bylo dokončeno s odmítnutými upozorněními.
de_de: Ausführung mit verworfenen Warnungen abgeschlossen.
es_es: Ejecución finalizada con advertencias descartadas.
fr_fr: Exécution terminée avec des avertissements ignorés.
it_it: Esecuzione completata con avvisi ignorati.
ja_jp: 実行は完了しましたが、警告は閉じられました。
ko_kr: 경고가 무시된 상태로 실행이 완료되었습니다.
pl_pl: Uruchomienie ukończono z pominiętymi ostrzeżeniami.
pt_br: Execução concluída com avisos descartados.
ru_ru: Выполнение завершено с пропущенными предупреждениями.
zh_cn: 运行已完成，且警告已解决。
zh_tw: 執行已完成，出現關閉的警告。

# PackageRepositoryLabel
source: Repository
cs_cz: Úložiště
es_es: Repositorio
fr_fr: Référentiel
ja_jp: リポジトリ
ko_kr: 리포지토리
pl_pl: Repozytorium
pt_br: Repositório
ru_ru: Репозиторий
zh_cn: 存储库
zh_tw: 儲存庫

# PackageWebsiteLabel
source: Website
cs_cz: Webová stránka
es_es: Sitio web
fr_fr: Site Web
it_it: Sito Web
ja_jp: Web サイト
ko_kr: 웹 사이트
pl_pl: Witryna
pt_br: Site
ru_ru: Веб-сайт
zh_cn: 网站
zh_tw: 網站

# OnboardingSuccessText
source: Well done! You just ran your first graph in Dynamo. \n\nStay tuned for more guides on Dynamo basics. In the meantime, continue your learning journey in #Dynamo Primer=https://primer2.dynamobim.org/ .
cs_cz: Výborně. Právě jste v aplikaci Dynamo spustili první graf. \n\nJiž brzy vám nabídneme další průvodce základy aplikace Dynamo. Mezitím pokračujte ve výuce v nástroji #Dynamo Primer=https://primer2.dynamobim.org/v/cs/ .
de_de: Gut gemacht! Sie haben gerade Ihr erstes Diagramm in Dynamo ausgeführt. \n\nAchten Sie auf zukünftige Leitfäden zu Dynamo-Grundlagen. In der Zwischenzeit können Sie Ihren Lernprozess in #Dynamo Primer=https://primer2.dynamobim.org/v/de/ fortsetzen.
es_es: ¡Bien hecho! Acaba de ejecutar su primer gráfico en Dynamo. \n\nEsté atento a más guías sobre los conceptos básicos de Dynamo. Mientras tanto, continúe su aprendizaje en #Dynamo Primer=https://primer2.dynamobim.org/v/es/ .
fr_fr: Bravo. Vous venez d'exécuter votre premier graphique dans Dynamo. \n\nD'autres guides sur les bases de Dynamo seront disponibles prochainement. En attendant, vous pouvez poursuivre votre formation dans #Dynamo Primer=https://primer2.dynamobim.org/v/fr/ .
it_it: Complimenti. È appena stato eseguito il primo grafico in Dynamo. \n\nA breve saranno disponibili più guide sulle nozioni di base di Dynamo. Nel frattempo, continuare il percorso formativo in #Dynamo Primer=https://primer2.dynamobim.org/v/it/ .
ja_jp: おつかれさまでした。Dynamo で初めてのグラフが実行できました。\n\n今後も #Dynamo Primer=https://primer2.dynamobim.org/v/ja/ で Dynamo の基本について学習を続けてください。
ko_kr: 잘 하셨습니다! Dynamo에서 첫 번째 그래프를 실행했습니다. \n\nDynamo 기본 사항에 대한 추가 지침을 계속 확인하십시오. 그동안 #Dynamo Primer=https://primer2.dynamobim.org/v/ko/ 에서 학습 과정을 계속 진행하십시오.
pl_pl: Dobra robota! Właśnie udało Ci się uruchomić swój pierwszy wykres w dodatku Dynamo. \n\nJuż wkrótce więcej przewodników na temat podstaw dodatku Dynamo. Do tego czasu możesz nadal się uczyć z przewodnika #Dynamo Primer=https://primer2.dynamobim.org/v/pl/ .
pt_br: Muito bem. Você acabou de executar seu primeiro gráfico no Dynamo. \n\nFique atento para mais guias sobre os conceitos básicos do Dynamo. Enquanto isso, continue sua jornada de aprendizagem no #Dynamo Primer=https://primer2.dynamobim.org/v/pt-br/ .
ru_ru: Отлично! Вы только что выполнили свой первый график в Dynamo. \n\nСледите за выходом других руководств по основам работы с Dynamo. А пока продолжайте обучение с помощью #Dynamo Primer=https://primer2.dynamobim.org/v/ru/ .
zh_cn: 做得好！您刚刚在 Dynamo 中运行了您的第一个图形。\n\n请继续关注有关 Dynamo 基础知识的更多指南。同时，在 #Dynamo Primer=https://primer2.dynamobim.org/v/zh-cn/ 中继续您的学习之旅。
zh_tw: 做得很好！您剛在 Dynamo 中執行了第一個圖表。\n\n請密切注意更多 Dynamo 基礎知識的指南。同時，請在 #Dynamo Primer=https://primer2.dynamobim.org/v/zh-tw/ 繼續學習。

# OnboardingSuccessTitle
source: Success
cs_cz: Úspěch
de_de: Vorgang erfolgreich
es_es: Correcto
fr_fr: Opération réussie
it_it: Operazione riuscita
ja_jp: 成功
ko_kr: 성공
pl_pl: Powodzenie
pt_br: Sucesso
ru_ru: Успешно
zh_cn: 成功
zh_tw: 成功
