Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# DynamoViewSettingMenuFractionalInch
source: Fractional Inch
cs_cz: Zlomkový palec
de_de: Zoll als Bruch
es_es: Fracción de pulgada
fr_fr: Fraction de pouce
it_it: Parti frazionarie (pollice)
ja_jp: 分数インチ
ko_kr: 분수 인치
pl_pl: Cal ułamkowy
pt_br: Polegada fracionária
ru_ru: Дробный дюйм
zh_cn: 分数英寸
zh_tw: 分數英寸

# DynamoViewSettingMenuHighRenderPrecision
source: High
cs_cz: Vysoká
de_de: Hoch
es_es: Alta
fr_fr: Elevé
it_it: Alta
ja_jp: 高
ko_kr: 높음
pl_pl: Wysoki
pt_br: Alto
ru_ru: Высокая
zh_cn: 高
zh_tw: 高

# DynamoViewSettingMenuLengthUnits
source: Length Display Units
cs_cz: Jednotky zobrazení délky
de_de: Anzeigeeinheiten für Länge
es_es: Unidades de visualización de longitud
fr_fr: Unités d'affichage de la longueur
it_it: Unità di visualizzazione lunghezza
ja_jp: 長さ表示単位
ko_kr: 길이 표시 단위
pl_pl: Jednostki wyświetlania długości
pt_br: Unidades de exibição do comprimento
ru_ru: Отображаемые единицы длины
zh_cn: 长度显示单位
zh_tw: 長度顯示單位

# DynamoViewSettingMenuLowRenderPrecision
source: Low
cs_cz: Nízká
de_de: Niedrig
es_es: Baja
fr_fr: Faible
it_it: Bassa
ja_jp: 低
ko_kr: 낮음
pl_pl: Niski
pt_br: Baixo
ru_ru: Низкая
zh_cn: 低
zh_tw: 低

# DynamoViewSettingMenuManagePackagePath
source: Manage Node and Package Paths...
cs_cz: Spravovat cesty k uzlům a balíčkům...
de_de: Pfade für Blöcke und Pakete verwalten...
es_es: Administra rutas de nodos y paquetes...
fr_fr: Gérer les chemins d'accès de noeud et de package...
it_it: Gestisci percorsi di nodi e pacchetti...
ja_jp: ノードとパッケージのパスを管理...
ko_kr: 노드 및 패키지 경로 관리...
pl_pl: Zarządzaj ścieżkami do węzłów i pakietów…
pt_br: Gerenciar caminhos de nó e pacote...
ru_ru: Управление путями к узлу и пакету...
zh_cn: 管理节点和软件包路径...
zh_tw: 管理節點和套件路徑...

# DynamoViewSettingMenuMeter
source: Meter
cs_cz: Metr
es_es: Metro
fr_fr: Compteur
it_it: Metro
ja_jp: メートル
ko_kr: 미터
pl_pl: Metr
pt_br: Metro
ru_ru: Метр
zh_cn: 米
zh_tw: 公尺

# DynamoViewSettingMenuMillimeter
source: Millimeter
cs_cz: Milimetr
es_es: Milímetro
fr_fr: Millimètre
it_it: Millimetro
ja_jp: ミリメートル
ko_kr: 밀리미터
pl_pl: Milimetr
pt_br: Milímetro
ru_ru: Миллиметр
zh_cn: 毫米
zh_tw: 公釐

# DynamoViewSettingMenuNumberFormat
source: Number Format
cs_cz: Formát čísla
de_de: Zahlenformat
es_es: Formato de número
fr_fr: Format de nombre
it_it: Formato numerico
ja_jp: 数値形式
ko_kr: 숫자 형식
pl_pl: Format liczby
pt_br: Formato de número
ru_ru: Формат чисел
zh_cn: 数字格式
zh_tw: 數字格式

# PreferencesViewSelectedPackagePathForDownload
source: Selected package path for download
cs_cz: Vybraná cesta balíčku ke stažení
de_de: Ausgewählter Paketpfad für Download
es_es: Ruta del paquete seleccionada para descarga
fr_fr: Chemin d'accès au package sélectionné pour le téléchargement
it_it: Percorso del pacchetto selezionato per il download
ja_jp: ダウンロード用に選択したパッケージのパス
ko_kr: 다운로드하기 위해 선택한 패키지 경로
pl_pl: Ścieżka wybranego pakietu do pobrania
pt_br: Caminho do pacote selecionado para download
ru_ru: Выбранный путь к пакету для скачивания
zh_cn: 要下载的选定软件包路径
zh_tw: 為下載選取的套件路徑

# PreferencesViewDisableBuiltInPackages
source: Disable Loading Built-In Packages
cs_cz: Zakázat načítání vestavěných balíčků
de_de: Laden von integrierten Paketen deaktivieren
es_es: Desactivar carga de paquetes integrados
fr_fr: Désactiver le chargement des packages intégrés
it_it: Disattiva il caricamento di pacchetti incorporati
ja_jp: 組み込みパッケージのロードを無効にする
ko_kr: 내장 패키지 로드 사용 안 함
pl_pl: Wyłącz wczytywanie pakietów wbudowanych
pt_br: Desativar carregamento de pacotes integrados
ru_ru: Отключить загрузку встроенных пакетов
zh_cn: 禁用加载内置软件包
zh_tw: 停用載入內建套件

# PreferencesViewDisableCustomPackages
source: Disable Loading Custom Packages
cs_cz: Zakázat načítání vlastních balíčků
de_de: Laden von benutzerdefinierten Paketen deaktivieren
es_es: Desactivar carga de paquetes personalizados
fr_fr: Désactiver le chargement des packages personnalisés
it_it: Disattiva il caricamento di pacchetti personalizzati
ja_jp: カスタム パッケージのロードを無効にする
ko_kr: 사용자 패키지 로드 사용 안 함
pl_pl: Wyłącz wczytywanie pakietów niestandardowych
pt_br: Desativar carregamento de pacotes personalizados
ru_ru: Отключить загрузку пользовательских пакетов
zh_cn: 禁用加载自定义软件包
zh_tw: 停用載入自訂套件

# DynamoViewSettingMenuSquareCentimeter
source: Square Centimeter
cs_cz: Čtvereční centimetr
de_de: Quadratzentimeter
es_es: Centímetro cuadrado
fr_fr: Centimètre carré
it_it: Centimetro quadrato
ja_jp: 平方センチメートル
ko_kr: 평방 센티미터
pl_pl: Centymetr kwadratowy
pt_br: Centímetro quadrado
ru_ru: Квадратный сантиметр
zh_cn: 平方厘米
zh_tw: 平方公分

# DynamoViewSettingMenuSquareFoot
source: Square Foot
cs_cz: Čtvereční stopa
de_de: Quadratfuß
es_es: Pie cuadrado
fr_fr: Pied carré
it_it: Piede quadro
ja_jp: 平方フィート
ko_kr: 평방 피트
pl_pl: Stopa kwadratowa
pt_br: Pé quadrado
ru_ru: Квадратный фут
zh_cn: 平方英尺
zh_tw: 平方英尺

# DynamoViewSettingMenuSquareInch
source: Square Inch
cs_cz: Čtvereční palec
de_de: Quadratzoll
es_es: Pulgada cuadrada
fr_fr: Pouce carré
it_it: Pollice quadrato
ja_jp: 平方インチ
ko_kr: 평방 인치
pl_pl: Cal kwadratowy
pt_br: Polegada quadrada
ru_ru: Квадратный дюйм
zh_cn: 平方英寸
zh_tw: 平方英寸

# DynamoViewSettingMenuSquareMeter
source: Square Meter
cs_cz: Čtvereční metr
de_de: Quadratmeter
es_es: Metro cuadrado
fr_fr: Mètre carré
it_it: Metri quadrati
ja_jp: 平方メートル
ko_kr: 평방 미터
pl_pl: Metr kwadratowy
pt_br: Metro quadrado
ru_ru: Квадратный метр
zh_cn: 平方米
zh_tw: 平方公尺

# DynamoViewSettingMenuSquareMillimeter
source: Square Millimeter
cs_cz: Čtvereční milimetr
de_de: Quadratmillimeter
es_es: Milímetro cuadrado
fr_fr: Millimètre carré
it_it: Millimetri quadrati
ja_jp: 平方ミリメートル
ko_kr: 평방 밀리미터
pl_pl: Milimetr kwadratowy
pt_br: Milímetro quadrado
ru_ru: Квадратный миллиметр
zh_cn: 平方毫米
zh_tw: 平方公釐

# DynamoViewSettingMenuVolumeUnits
source: Volume Display Units
cs_cz: Jednotky pro zobrazení objemu
de_de: Anzeigeeinheiten für Volumen
es_es: Unidades de visualización de volumen
fr_fr: Unités d'affichage de volume
it_it: Unità di visualizzazione volume
ja_jp: 容積表示単位
ko_kr: 체적 표시 단위
pl_pl: Jednostki wyświetlania kubatury
pt_br: Unidades de exibição do volume
ru_ru: Отображаемые единицы объема
zh_cn: 体积显示单位
zh_tw: 體積顯示單位

# DynamoViewSettingShowRunPreview
source: Show Run Preview
cs_cz: Zobrazit náhled spuštění
de_de: Vorschau von Ausführung anzeigen
es_es: Mostrar vista preliminar de ejecución
fr_fr: Afficher l'aperçu d'exécution
it_it: Mostra anteprima esecuzione
ja_jp: 実行のプレビューを表示
ko_kr: 실행 미리보기 표시
pl_pl: Pokaż podgląd biegu
pt_br: Mostrar visualização do trecho
ru_ru: Предварительный просмотр запуска
zh_cn: 显示梯段预览
zh_tw: 展示執行預覽

# DynamoViewSettingsMenuChangeScaleFactor
source: Geometry Scaling...
cs_cz: Probíhá změna měřítka geometrie...
de_de: Skalierung für Geometrie...
es_es: Escala de geometría...
fr_fr: Mise à l'échelle de géométrie...
it_it: Scala della geometria...
ja_jp: ジオメトリのスケーリング...
ko_kr: 형상 축척
pl_pl: Zakres roboczy geometrii...
pt_br: Escala da geometria...
ru_ru: Масштабирование геометрии...
zh_cn: 几何图形缩放...
zh_tw: 調整幾何圖形比例...

# DynamoViewSettingsMenuVisualizationSettings
source: Visualization Settings
cs_cz: Nastavení vizualizace
de_de: Visualisierungseinstellungen
es_es: Configuración de visualización
fr_fr: Paramètres de visualisation
it_it: Impostazioni di visualizzazione
ja_jp: ビジュアライゼーション設定
ko_kr: 시각화 설정
pl_pl: Ustawienia wizualizacji
pt_br: Configurações de visualização
ru_ru: Параметры визуализации
zh_cn: 可视化设置
zh_tw: 視覺化設定

# DynamoViewToolbarExport3DButtonTooltip
source: Export Background Preview As Image
cs_cz: Exportovat náhled pozadí jako obrázek
de_de: Hintergrundvorschau als Bild exportieren
es_es: Exportar vista preliminar en segundo plano como imagen
fr_fr: Exporter l'aperçu en arrière-plan en tant qu'image
it_it: Esporta anteprima sfondo come immagine
ja_jp: 背景プレビューをイメージとして書き出します
ko_kr: 이미지로 배경 미리보기 내보내기
pl_pl: Eksportuj Podgląd tła jako obraz
pt_br: Exportar visualização do plano de fundo como imagem
ru_ru: Экспорт фонового просмотра как изображения
zh_cn: 将背景预览导出为图像
zh_tw: 匯出背景預覽為影像

# DynamoViewToolbarExportButtonTooltip
source: Export Workspace As Image
cs_cz: Exportovat pracovní prostor jako obrázek
de_de: Arbeitsbereich als Bild exportieren
es_es: Exporta espacio de trabajo como imagen
fr_fr: Exporter un espace de travail en tant qu'image
it_it: Esporta area di lavoro come immagine
ja_jp: ワークスペースをイメージとして書き出します
ko_kr: 작업공간을 이미지로 내보내기
pl_pl: Eksportuj obszar roboczy jako obraz
pt_br: Exportar espaço de trabalho como imagem
ru_ru: Экспорт рабочего пространства в виде изображения
zh_cn: 将工作空间另存为图像
zh_tw: 匯出工作區做為影像

# DynamoViewToolbarNewButtonTooltip
source: New [Ctrl + N]
cs_cz: Nový (Ctrl+N]
de_de: Neu [Strg + N]
es_es: Nuevo [Ctrl + N]
fr_fr: Nouveau [Ctrl + N]
it_it: Nuovo [CTRL+N]
ja_jp: 新規作成[Ctrl + N]
ko_kr: 새로 만들기[Ctrl + N]
pl_pl: Nowy [Ctrl + N]
pt_br: Novo [Ctrl + N]
ru_ru: Создать [Ctrl + N]
zh_cn: 新建 [Ctrl + N]
zh_tw: 新建 [Ctrl + N]

# DynamoViewToolbarOpenButtonTooltip
source: Open [Ctrl + O]
cs_cz: Otevřít [Ctrl+O]
de_de: Öffnen [Strg + O]
es_es: Abrir [Ctrl + O]
fr_fr: Ouvrir (Ctrl + O]
it_it: Apri [CTRL+O]
ja_jp: 開く[Ctrl + O]
ko_kr: 열기[Ctrl + O]
pl_pl: Otwórz [Ctrl + O]
pt_br: Abrir (Ctrl + O)
ru_ru: Открыть (Ctrl + O]
zh_cn: 打开 [Ctrl + O]
zh_tw: 開啟 [Ctrl + O]

# DynamoViewToolbarRedoButtonTooltip
source: Redo [Ctrl + Y]
cs_cz: Znovu [Ctrl+Y]
de_de: Wiederholen [Strg + Y]
es_es: Rehacer [Ctrl + Y]
fr_fr: Rétablir [Ctrl + Y]
it_it: Ripeti [CTRL+Y]
ja_jp: やり直し[Ctrl + Y]
ko_kr: 재실행[Ctrl + Y]
pl_pl: Powtórz [Ctrl + Y]
pt_br: Refazer [Ctrl + Y)
ru_ru: Повторить [Ctrl + Y]
zh_cn: 恢复 [Ctrl + Y]
zh_tw: 重做 [Ctrl + Y]

# DynamoViewToolbarSaveButtonTooltip
source: Save [Ctrl + S]
cs_cz: Uložit (Ctrl+S]
de_de: Speichern [Strg + S]
es_es: Guardar [Ctrl + S]
fr_fr: Enregistrer [Ctrl + S]
it_it: Salva [CTRL+S]
ja_jp: 保存[Ctrl + S]
ko_kr: 저장[Ctrl + S]
pl_pl: Zapisz [Ctrl + S]
pt_br: Salvar [Ctrl + S)
ru_ru: Сохранить [Ctrl + S]
zh_cn: 保存 [Ctrl + S]
zh_tw: 儲存 [Ctrl + S]

# DynamoViewToolbarUndoButtonTooltip
source: Undo [Ctrl + Z]
cs_cz: Zpět (Ctrl+Z]
de_de: Rückgängig [Strg + Z]
es_es: Deshacer [Ctrl + Z]
fr_fr: Annuler [Ctrl + Z]
it_it: Annulla [CTRL+Z]
ja_jp: 元に戻す[Ctrl + Z]
ko_kr: 실행취소[Ctrl + Z]
pl_pl: Cofnij [Ctrl + Z]
pt_br: Desfazer [Ctrl + Z]
ru_ru: Отменить [Ctrl + Z]
zh_cn: 撤销 [Ctrl + Z]
zh_tw: 復原 [Ctrl + Z]

# DynamoViewViewMenu
source: _View
cs_cz: _Zobrazit
de_de: _Ansicht
es_es: _Ver
fr_fr: _Afficher
it_it: _Visualizza
ja_jp: 表示(_V)
ko_kr: 뷰(_V)
pl_pl: _Widok
pt_br: _Vista
ru_ru: _Просмотреть
zh_cn: 视图(_V)
zh_tw: 檢視(_V)

# DynamoViewViewMenu3DPreview
source: _Background 3D Preview
cs_cz: _3D náhled pozadí
de_de: _Hintergrund-3D-Vorschau
es_es: _Vista preliminar 3D en segundo plano
fr_fr: _Aperçu 3D en arrière-plan
it_it: _Anteprima sfondo 3D
ja_jp: 背景 3D プレビュー(_B)
ko_kr: 배경 3D 미리보기(_B)
pl_pl: P_odgląd 3D tła
pt_br: _Visualização 3D no plano de fundo
ru_ru: _Фоновый предпросмотр в 3D
zh_cn: 背景三维预览(_B)
zh_tw: 背景 3D 預覽(_B)

# DynamoViewViewMenuAlternateContextGeometry
source: Show Geometry in {0}
cs_cz: Zobrazit geometrii v {0}
de_de: Geometrie anzeigen in {0}
es_es: Mostrar Geometry en {0}
fr_fr: Afficher la Geometry dans {0}
it_it: Mostra geometria in {0}
ja_jp: {0} のジオメトリを表示
ko_kr: {0}의 형상 표시
pl_pl: Pokaż geometrię w {0}
pt_br: Mostrar a geometria em {0}
ru_ru: Показать геометрию в {0}
zh_cn: 在 {0} 中显示几何图形
zh_tw: 在 {0} 展示幾何圖形

# DynamoViewViewMenuAvailablePreviews
source: _Available Previews
cs_cz: _Dostupné náhledy
de_de: _Verfügbare Vorschauen
es_es: _Vistas preliminares disponibles
fr_fr: Aperçus _disponibles
it_it: _Anteprime disponibili
ja_jp: 使用可能なプレビュー(_A)
ko_kr: 사용 가능한 미리보기(_A)
pl_pl: _Dostępne podglądy
pt_br: _Visualizações disponíveis
ru_ru: _Доступные предварительные версии
zh_cn: 可用预览(_A)
zh_tw: 可用預覽(_A)

# DynamoViewViewMenuConnector
source: _Connectors
cs_cz: _Konektory
es_es: _Conectores
fr_fr: _Connecteurs
it_it: _Connettori
ja_jp: コネクタ(_C)
ko_kr: 커넥터(_C)
pl_pl: _Łączniki
pt_br: _Conectores
ru_ru: _Соединители
zh_cn: 连接件(_C)
zh_tw: 連接器(_C)

# DynamoViewViewMenuConnectorType
source: _Connector Type
cs_cz: _Typ konektoru
de_de: C_onnector-Typ
es_es: Tipo de _conector
fr_fr: _Type de connecteur
it_it: _Tipo di connettore
ja_jp: コネクタ タイプ(_C)
ko_kr: 커넥터 유형(_C)
pl_pl: _Typ łącznika
pt_br: _Tipo de conector
ru_ru: Тип _соединителя
zh_cn: 连接件类型(_C)
zh_tw: 連接器類型(_C)

# DynamoViewViewMenuConnectorTypeCurve
source: Curves
cs_cz: Křivky
de_de: Kurven
es_es: Curvas
fr_fr: Courbes
it_it: Curve
ja_jp: 曲線
ko_kr: 곡선
pl_pl: Krzywe
pt_br: Curvas
ru_ru: Кривые
zh_cn: 曲线
zh_tw: 曲線

# DynamoViewViewMenuConnectorTypePolylines
source: Polylines
cs_cz: Lomené čáry
de_de: Polylinien
es_es: Polilíneas
fr_fr: Polylignes
it_it: Polilinee
ja_jp: ポリライン
ko_kr: 폴리선
pl_pl: Polilinie
pt_br: Polilinhas
ru_ru: Полилинии
zh_cn: 多段线
zh_tw: 聚合線

# DynamoViewViewMenuHideConsole
source: Hide Console
cs_cz: Skrýt konzolu
de_de: Konsole ausblenden
es_es: Ocultar consola
fr_fr: Masquer la console
it_it: Nascondi console
ja_jp: Console を非表示
ko_kr: 콘솔 숨기기
pl_pl: Ukryj konsolę
pt_br: Ocultar o console
ru_ru: Скрыть консоль
zh_cn: 隐藏控制台
zh_tw: 隱藏主控台

# DynamoViewViewMenuPan
source: _Pan
cs_cz: Př_etáhnout
de_de: _Schwenken
es_es: _Encuadrar
fr_fr: _Panoramique
ja_jp: 画面移動(_P)
ko_kr: 초점이동(_P)
pl_pl: P_rzesuń
ru_ru: _Панорамирование
zh_cn: 平移(_P)
zh_tw: 平移(_P)

# DynamoViewViewMenuPanDown
source: Pan Down (Mouse wheel drag down)
cs_cz: Posun pohledu dolů (kolečko myši přetáhněte dolů)
de_de: Nach unten schwenken (mit Mausrad nach unten ziehen)
es_es: Encuadre inferior (rueda de ratón abajo)
fr_fr: Effectuer un panoramique vers le bas (actionner la molette de la souris vers le bas)
it_it: Pan in basso (trascinare verso il basso con la rotellina del mouse)
ja_jp: 画面を下に移動(マウス ホイールを押したまま下にドラッグ)
ko_kr: 아래로 초점이동(마우스 휠 아래로 끌기)
pl_pl: Przesuń w dół (przeciągnij w dół kółkiem myszy)
pt_br: Pan para baixo (arraste a roda do mouse para baixo)
ru_ru: Панорамировать вниз (перетаскивание курсора колесиком мыши вниз)
zh_cn: 向下平移(鼠标滚轮向下拖动)
zh_tw: 向下平移 (向下拖曳滑鼠滾輪)

# DynamoViewViewMenuPanLeft
source: Pan Left (Mouse wheel drag left)
cs_cz: Posun pohledu vlevo (kolečko myši přetáhněte doleva)
de_de: Nach links schwenken (mit Mausrad nach links ziehen)
es_es: Encuadre izquierdo (rueda de ratón izquierda)
fr_fr: Effectuer un panoramique vers la gauche (actionner la molette de la souris vers le bas)
it_it: Pan a sinistra (trascinare verso sinistra con la rotellina del mouse)
ja_jp: 画面を左に移動(マウス ホイールを押したまま左にドラッグ)
ko_kr: 왼쪽으로 초점이동(마우스 휠 왼쪽으로 끌기)
pl_pl: Przesuń w lewo (przeciągnij w lewo kółkiem myszy)
pt_br: Pan à esquerda (arraste a roda do mouse para a esquerda)
ru_ru: Панорамировать влево (перетаскивание курсора колесиком мыши влево)
zh_cn: 向左平移(鼠标滚轮向左拖动)
zh_tw: 向左平移 (向左拖曳滑鼠滾輪)

# DynamoViewViewMenuPanRight
source: Pan Right (Mouse wheel drag right)
cs_cz: Posun pohledu vpravo (kolečko myši přetáhněte doprava)
de_de: Nach rechts schwenken (mit Mausrad nach rechts ziehen)
es_es: Encuadre derecho (rueda de ratón derecha)
fr_fr: Effectuer un panoramique à droite (actionner la molette de la souris vers la droite)
it_it: Pan a destra (trascinare verso destra con la rotellina del mouse)
ja_jp: 画面を右に移動(マウス ホイールを押したまま右にドラッグ)
ko_kr: 오른쪽으로 초점이동(마우스 휠 오른쪽으로 끌기)
pl_pl: Przesuń w prawo (przeciągnij w prawo kółkiem myszy)
pt_br: Pan à direita (arraste a roda do mouse para a direita)
ru_ru: Панорамировать вправо (перетаскивание курсора колесиком мыши вправо)
zh_cn: 向右平移(鼠标滚轮向右拖动)
zh_tw: 向右平移 (向右拖曳滑鼠滾輪)

# DynamoViewViewMenuPanUp
source: Pan Up (Mouse wheel drag up)
cs_cz: Posun pohledu nahoru (kolečko myši přetáhněte nahoru)
de_de: Nach oben schwenken (mit Mausrad nach oben ziehen)
es_es: Encuadre superior (rueda de ratón arriba)
fr_fr: Effectuer un panoramique vers le haut (actionner la molette de la souris vers le haut)
it_it: Pan in alto (trascinare verso l'alto con la rotellina del mouse)
ja_jp: 画面を上に移動(マウス ホイールを押したまま上にドラッグ)
ko_kr: 위로 초점이동(마우스 휠 위로 끌기)
pl_pl: Przesuń w górę (przeciągnij w górę kółkiem myszy)
pt_br: Pan para cima (arraste a roda do mouse para cima)
ru_ru: Панорамировать вверх (перетаскивание курсора колесиком мыши вверх)
zh_cn: 向上平移(鼠标滚轮向上拖动)
zh_tw: 向上平移 (向上拖曳滑鼠滾輪)

# DynamoViewViewMenuPreviewNavigate
source: _Navigate Background 3D Preview
cs_cz: _Navigovat 3D náhledem pozadí
de_de: _In 3D-Hintergrundvorschau navigieren
es_es: _Desplazarse por la vista preliminar 3D en segundo plano
fr_fr: _Parcourir l'aperçu 3D en arrière-plan
it_it: _Naviga nell'anteprima sfondo 3D
ja_jp: 背景 3D プレビューをナビゲート(_N)
ko_kr: 배경 3D 미리보기 탐색(_N)
pl_pl: _Nawigacja po podglądzie 3D tła
pt_br: _Navegar na visualização 3D do plano de fundo
ru_ru: _Навигация по фоновому 3D-просмотру
zh_cn: 导航背景三维预览(_N)
zh_tw: 導覽背景 3D 預覽(_N)

# DynamoViewViewMenuShowBackground3DPreview
source: Showing Background 3D Preview
cs_cz: Zobrazení 3D náhledu pozadí
de_de: Hintergrund-3D-Vorschau wird angezeigt
es_es: Mostrando vista preliminar 3D en segundo plano
fr_fr: Affichage de l'aperçu 3D en arrière-plan
it_it: Mostra anteprima sfondo 3D
ja_jp: 背景 3D プレビューの表示
ko_kr: 배경 3D 미리보기 표시 중
pl_pl: Wyświetlanie podglądu 3D tła
pt_br: Mostrar a visualização 3D no plano de fundo
ru_ru: Отображение 3D-просмотра фона
zh_cn: 正在显示背景三维预览
zh_tw: 展示背景 3D 預覽

# DynamoViewViewMenuShowConnectors
source: Show _Connectors
cs_cz: Zobrazit _spojky
de_de: _Connectors anzeigen
es_es: _Mostrar conectores
fr_fr: Afficher les _connecteurs
it_it: Mostra _connettori
ja_jp: コネクタを表示(_C)
ko_kr: 커넥터 표시(_C)
pl_pl: _Pokaż łączniki
pt_br: Mostrar _conectores
ru_ru: Показать _соединители
zh_cn: 显示连接件(_C)
zh_tw: 展示連接器(_C)

# DynamoViewViewMenuShowConsole
source: _Show Console
cs_cz: _Zobrazit konzolu
de_de: _Konsole anzeigen
es_es: Mo_strar consola
fr_fr: A_fficher la console
it_it: M_ostra console
ja_jp: コンソールを表示(_S)
ko_kr: 콘솔 표시(_S)
pl_pl: Pok_aż konsolę
pt_br: _Mostrar console
ru_ru: П_оказать консоль
zh_cn: 显示控制台(_S)
zh_tw: 展示主控台(_S)

# DynamoViewViewMenuShowGrid
source: _Show Grid
cs_cz: _Zobrazit pomocné prvky
de_de: _Helfer anzeigen
es_es: _Mostrar ayudas
fr_fr: _Afficher les Assistants
it_it: _Mostra helper
ja_jp: ヘルパーを表示(_S)
ko_kr: 도우미 표시(_S)
pl_pl: _Pokaż pomocników
pt_br: _Mostrar ajudas
ru_ru: _Показать вспомогательные элементы
zh_cn: 显示帮助程序(_S)
zh_tw: 展示輔助工具(_S)

# DynamoViewViewMenuZoom
source: _Zoom
cs_cz: _Přiblížení
ja_jp: ズーム(_Z)
ko_kr: 줌(_Z)
pl_pl: _Powiększ
ru_ru: _Зумировать
zh_cn: 缩放(_Z)
zh_tw: 縮放(_Z)

# DynamoViewViewMenuZoomIn
source: Zoom In (Mouse wheel down)
cs_cz: Přiblížit (kolečkem myši dolů)
de_de: Vergrößern (Mausrad nach unten)
es_es: Ampliar (rueda de ratón abajo)
fr_fr: Zoom avant (molette de la souris vers le bas)
it_it: Zoom avanti (rotellina del mouse verso il basso)
ja_jp: 拡大(マウス ホイールを下に)
ko_kr: 확대(마우스 휠 아래로 이동)
pl_pl: Powiększ (kółko myszy w dół)
pt_br: Aproximar zoom (botão de rolagem do mouse para baixo)
ru_ru: Увеличить (колесико мыши вниз)
zh_cn: 放大(鼠标滚轮向下滚动)
zh_tw: 拉近 (滑鼠滾輪向下)

# DynamoViewViewMenuZoomOut
source: Zoom Out (Mouse wheel up)
cs_cz: Oddálit (kolečkem myši nahoru)
de_de: Verkleinern (Mausrad nach oben)
es_es: Reducir (rueda de ratón arriba)
fr_fr: Zoom arrière (molette de la souris vers le haut)
it_it: Zoom indietro (rotellina del mouse verso l'alto)
ja_jp: 縮小(マウス ホイールを上に)
ko_kr: 축소(마우스 휠 위로 이동)
pl_pl: Pomniejsz (kółko myszy w górę)
pt_br: Afastar o zoom (roda do mouse para cima)
ru_ru: Уменьшить (колесико мыши вверх)
zh_cn: 缩小(鼠标滚轮向上滚动)
zh_tw: 拉遠 (滑鼠滾輪向上)

# EditAnnotationTitle
source: Edit Group Title
cs_cz: Upravit název skupiny
de_de: Gruppentitel bearbeiten
es_es: Editar título de grupo
fr_fr: Modifier le titre du groupe
it_it: Modifica titolo gruppo
ja_jp: グループ タイトルを編集
ko_kr: 그룹 제목 편집
pl_pl: Edycja tytułu grupy
pt_br: Editar o título do grupo
ru_ru: Редактировать заголовок группы
zh_cn: 编辑组标题
zh_tw: 編輯群組標題

# EditNodeWindowTitle
source: Edit Node Name
cs_cz: Upravit název uzlu
de_de: Blocknamen bearbeiten
es_es: Editar nombre de nodo
fr_fr: Modifier le nom du noeud
it_it: Modifica nome nodo
ja_jp: ノード名を編集
ko_kr: 노드 이름 편집
pl_pl: Edytuj nazwę węzła
pt_br: Editar nome do nó
ru_ru: Изменить имя узла
zh_cn: 编辑节点名称
zh_tw: 編輯節點名稱

# EditWindowAcceptButton
source: Accept
cs_cz: Přijmout
de_de: Akzeptieren
es_es: Aceptar
fr_fr: Accepter
it_it: Accetta
ja_jp: 適用
ko_kr: 동의
pl_pl: Akceptuj
pt_br: Aceitar
ru_ru: Принять
zh_cn: 接受
zh_tw: 接受

# EditWindowTitle
source: Set value...
cs_cz: Nastavit hodnoty...
de_de: Wert festlegen...
es_es: Definir valor...
fr_fr: Définir la valeur...
it_it: Imposta valore...
ja_jp: 値を設定...
ko_kr: 값 설정...
pl_pl: Ustaw wartość...
pt_br: Definir o valor...
ru_ru: Задать значение...
zh_cn: 设置值...
zh_tw: 設定值...

# FileDialogAllFiles
source: All Files ({0})|{0}
cs_cz: Všechny soubory ({0})|{0}
de_de: Alle Dateien ({0})|{0}
es_es: Todos los archivos ({0})|{0}
fr_fr: Tous les fichiers ({0})|{0}
it_it: Tutti i file ({0})|{0}
ja_jp: すべてのファイル({0})|{0}
ko_kr: 모든 파일({0})|{0}
pl_pl: Wszystkie pliki ({0})|{0}
pt_br: Todos os arquivos ({0})|{0}
ru_ru: Все файлы ({0})|{0}
zh_cn: 所有文件 ({0})|{0}
zh_tw: 所有檔案 ({0})|{0}

# FileDialogAssemblyFiles
source: Assembly Library Files ({0})|{0}
cs_cz: Soubory knihovny sestavení ({0})|{0}
de_de: Assembly-Bibliotheksdateien ({0})|{0}
es_es: Archivos de biblioteca de conjuntos ({0})|{0}
fr_fr: Fichiers de bibliothèque d'assemblages ({0})|{0}
it_it: File libreria assembly ({0})|{0}
ja_jp: アセンブリ ライブラリ ファイル({0})|{0}
ko_kr: 조합 라이브러리 파일({0})|{0}
pl_pl: Pliki biblioteki zespołów ({0})|{0}
pt_br: Arquivos de biblioteca de montagem ({0})|{0}
ru_ru: Файлы библиотеки сборок ({0})|{0}
zh_cn: 部件库文件 ({0})|{0}
zh_tw: 組合資源庫檔案 ({0})|{0}

# FileDialogCustomNodeDLLXML
source: Custom Node, DLL, XML ({0})|{0}
cs_cz: Vlastní uzel, DLL, XML ({0})|{0}
de_de: Benutzerdefinierter Block, DLL, XML ({0})|{0}
es_es: Nodo personalizado, DLL, XML ({0})|{0}
fr_fr: Noeud personnalisé, DLL XML ({0})|{0}
it_it: Nodo personalizzato, DLL, XML ({0})|{0}
ja_jp: カスタム ノード、DLL、XML ({0})|{0}
ko_kr: 사용자 노드, DLL, XML({0})|{0}
pl_pl: Węzeł niestandardowy, DLL XML ({0})|{0}
pt_br: Nó personalizado, DLL, XML ({0})|{0}
ru_ru: Пользовательский узел, DLL, XML ({0})|{0}
zh_cn: 自定义节点、DLL、XML ({0})|{0}
zh_tw: 自訂節點、DLL、XML ({0})|{0}

# FileDialogDesignScriptFiles
source: DesignScript Files ({0})|{0}
cs_cz: Soubory aplikace DesignScript ({0})|{0}
de_de: DesignScript-Dateien ({0})|{0}
es_es: Archivos de DesignScript ({0})|{0}
fr_fr: Fichiers DesignScript ({0})|{0}
it_it: File DesignScript ({0})|{0}
ja_jp: DesignScript ファイル({0})|{0}
ko_kr: DesignScript 파일({0})|{0}
pl_pl: Pliki DesignScript ({0})|{0}
pt_br: Arquivos DesignScript ({0})|{0}
ru_ru: Файлы DesignScript ({0})|{0}
zh_cn: DesignScript 文件 ({0})|{0}
zh_tw: DesignScript 檔案 ({0})|{0}

# FileDialogDynamoCustomNode
source: {0} Custom Node ({1})|{1}
cs_cz: Vlastní uzel aplikace {0} ({1})|{1}
de_de: {0} Benutzerdefinierter Block ({1})|{1}
es_es: Nodo personalizado de {0} ({1})|{1}
fr_fr: Noeud personnalisé {0} ({1})|{1}
it_it: Nodo personalizzato di {0} ({1})|{1}
ja_jp: {0} カスタム ノード({1})|{1}
ko_kr: {0} 사용자 정의 노드({1})|{1}
pl_pl: Węzeł niestandardowy {0} ({1})|{1}
pt_br: {0} Nó personalizado ({1})|{1}
ru_ru: Пользовательский узел {0} ({1})|{1}
zh_cn: {0} 自定义节点 ({1})|{1}
zh_tw: {0} 自訂節點 ({1})|{1}

# FileDialogDynamoDefinitions
source: {0} Definitions ({1})|{1}
cs_cz: Definice aplikace {0} ({1})|{1}
de_de: {0} Definitionen ({1})|{1}
es_es: Definiciones de {0} ({1})|{1}
fr_fr: Définitions {0} ({1})|{1}
it_it: Definizioni di {0} ({1})|{1}
ja_jp: {0} 設定({1})|{1}
ko_kr: {0} 정의({1})|{1}
pl_pl: Definicje {0} ({1})|{1}
pt_br: {0} Definições ({1})|{1}
ru_ru: Определения {0} ({1})|{1}
zh_cn: {0} 定义 ({1})|{1}
zh_tw: {0} 定義 ({1})|{1}
