Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# RunCompletedWithScaleChangeAndWarningsMessage
source: Run completed with warnings on setting new working range.
cs_cz: Běh byl dokončen s upozorněními při nastavení nového pracovního rozsahu.
de_de: Ausführung abgeschlossen mit Warnungen beim Festlegen des neuen Arbeitsbereichs.
es_es: Ejecución finalizada con advertencias al establecer el nuevo rango de trabajo.
fr_fr: Exécution terminée avec des avertissements sur la définition du nouvel intervalle utile.
it_it: Esecuzione completata con avvisi all'impostazione di un nuovo l'intervallo.
ja_jp: 実行は終了しましたが、新しい動作範囲の設定に関する警告が表示されました。
ko_kr: 새 작업 범위 설정에 대한 경고와 함께 실행이 완료되었습니다.
pl_pl: Bieg zakończony, ale wystąpiły ostrzeżenia dotyczące ustawienia nowego zakresu roboczego.
pt_br: Execução concluída com avisos na configuração do novo intervalo de trabalho.
ru_ru: Прогон завершен с предупреждениями о настройке нового рабочего диапазона.
zh_cn: 运行完成，包含设置新工作范围的警告。
zh_tw: 執行已完成，並出現設定新工作範圍的相關警告。

# RunCompletedWithScaleChangeMessage
source: Run completed with new working range.
cs_cz: Běh byl dokončen s novým pracovním rozsahem.
de_de: Ausführung abgeschlossen mit neuem Arbeitsbereich.
es_es: Ejecución finalizada con nuevo rango de trabajo.
fr_fr: Exécution terminée avec le nouvel intervalle utile.
it_it: Esecuzione completata con il nuovo intervallo di lavoro.
ja_jp: 新しい動作範囲での実行が終了しました。
ko_kr: 새 작업 범위에 대한 실행이 완료되었습니다.
pl_pl: Bieg ukończony z nowym zakresem roboczym.
pt_br: Execução concluída com novo intervalo de trabalho.
ru_ru: Прогон завершен с новым рабочим диапазоном.
zh_cn: 运行完成，包含新的工作范围。
zh_tw: 新工作範圍的執行已完成。

# RunCompletedWithWarningsMessage
source: Run completed with warnings.
cs_cz: Spuštění bylo dokončeno s varováními.
de_de: Ausführung abgeschlossen mit Warnungen
es_es: Ejecución finalizada con advertencias
fr_fr: Exécution terminée avec des avertissements.
it_it: Esecuzione completata con avvisi.
ja_jp: 実行が終了し、警告が表示されました。
ko_kr: 경고와 함께 실행 완료됨.
pl_pl: Bieg zakończony, ale wystąpiły ostrzeżenia.
pt_br: Execução concluída com avisos.
ru_ru: Выполнение процесса завершено с предупреждениями.
zh_cn: 运行已完成，但出现警告。
zh_tw: 執行已完成，出現警告。

# RunStartedMessage
source: Run started...
cs_cz: Spouštění zahájeno...
de_de: Ausführung gestartet...
es_es: Se ha iniciado la ejecución...
fr_fr: L'exécution a commencé...
it_it: Esecuzione avviata...
ja_jp: 実行が開始されました...
ko_kr: 실행 시작됨...
pl_pl: Bieg uruchomiony...
pt_br: Execução iniciada...
ru_ru: Процесс запущен...
zh_cn: 运行已开始...
zh_tw: 執行已啟動...

# RunStartedWithScaleChangeMessage
source: Run started with new working range...
cs_cz: Běh byl spuštěn s novým pracovním rozsahem...
de_de: Ausführung gestartet mit neuem Arbeitsbereich...
es_es: Ejecución iniciada con nuevo rango de trabajo...
fr_fr: Exécuter en commençant par le nouvel intervalle utile...
it_it: Esecuzione avviata con un nuovo intervallo di lavoro...
ja_jp: 新しい動作範囲での実行が開始されました...
ko_kr: 새 작업 범위로 실행이 시작되었습니다.
pl_pl: Bieg uruchomiony z nowym zakresem roboczym...
pt_br: Execução iniciada com novo intervalo de trabalho...
ru_ru: Прогон запущен с новым рабочим диапазоном...
zh_cn: 已通过新工作范围启动运行...
zh_tw: 開始執行新工作範圍...

# RunTypeToolTipAutomatically
source: Graph changes are executed in real time. Best suited for smaller graphs, known graphs, and Dynamo Sandbox.
cs_cz: Změny grafu se provádějí v reálném čase. Tato možnost se nejlépe hodí pro menší grafy, známé grafy a karanténu zabezpečení aplikace Dynamo.
de_de: Diagrammänderungen werden in Echtzeit ausgeführt. Am besten geeignet für kleinere Diagramme, bekannte Diagramme und Dynamo Sandbox.
es_es: Los cambios realizados en el gráfico se ejecutan en tiempo real. Es más adecuado para gráficos conocidos y de menor tamaño, además de para Dynamo Sandbox.
fr_fr: Les modifications apportées au graphique sont exécutées en temps réel. Cela convient mieux aux graphiques plus petits, aux graphiques connus et à Dynamo Sandbox.
it_it: Le modifiche al grafico vengono eseguite in tempo reale. L'ideale per grafici di dimensioni più piccole, grafici noti e Dynamo Sandbox.
ja_jp: グラフの変更はリアルタイムで実行されます。小さいグラフ、既知のグラフ、DynamoSandbox に最適です。
ko_kr: 그래프 변경 사항이 실시간으로 실행됩니다. 더 작은 그래프, 알려진 그래프 및 Dynamo Sandbox에 가장 적합합니다.
pl_pl: Zmiany w wykresach są wykonywane w czasie rzeczywistym. Najlepiej nadaje się do mniejszych wykresów, znanych wykresów i trybu Dynamo Sandbox.
pt_br: As alterações dos gráficos são executadas em tempo real. Mais adequado para gráficos menores, gráficos conhecidos e Dynamo Sandbox.
ru_ru: Изменения графиков выполняются в реальном времени. Рекомендуется использовать для небольших, известных графиков и Dynamo Sandbox.
zh_cn: 图形更改会实时执行。最适合较小的图形、已知图形和 Dynamo Sandbox。
zh_tw: 圖表變更會即時執行。最適合較小的圖表、熟知的圖表和 Dynamo Sandbox。

# RunTypeToolTipManually
source: Graph changes are executed when you click Run. Use this mode when working in large graphs, unfamiliar graphs, or host applications.
cs_cz: Změny grafu se provádějí po kliknutí na tlačítko Spustit. Tento režim použijte při práci s velkými grafy, neznámými grafy nebo hostitelskými aplikacemi.
de_de: Diagrammänderungen werden ausgeführt, wenn Sie auf Ausführen klicken. Verwenden Sie diesen Modus, wenn Sie mit großen Diagrammen, unbekannten Diagrammen oder Host-Anwendungen arbeiten.
es_es: Los cambios realizados en el gráfico se ejecutan al hacer clic en Ejecutar. Utilice este modo cuando trabaje con gráficos grandes o desconocidos, o aplicaciones anfitrionas.
fr_fr: Les modifications apportées au graphique sont exécutées lorsque vous cliquez sur Exécuter. Utilisez ce mode lorsque vous travaillez dans des graphiques volumineux, des graphiques inconnus ou des applications hôtes.
it_it: Le modifiche al grafico vengono eseguite ogni volta che si fa clic sul pulsante Esegui. Utilizzare questa modalità quando si lavora su grafici di grandi dimensioni, grafici non familiari o applicazioni host.
ja_jp: グラフの変更は、[実行]をクリックしたときに実行されます。このモードは、大きなグラフ、不明なグラフ、またはホスト アプリケーションで作業するときに使用します。
ko_kr: 실행을 클릭하면 그래프 변경 사항이 실행됩니다. 큰 그래프, 익숙하지 않은 그래프 또는 호스트 응용프로그램에서 작업할 때 이 모드를 사용합니다.
pl_pl: Zmiany w wykresach są wykonywane po kliknięciu przycisku Uruchom. Ten tryb jest odpowiedni do pracy z dużymi wykresami, nieznanymi wykresami oraz aplikacjami nadrzędnymi.
pt_br: As alterações dos gráficos são executadas quando você clica em Executar. Use esse modo para trabalhar em gráficos grandes, gráficos desconhecidos ou aplicativos hospedeiros.
ru_ru: Изменения графика выполняются при нажатии кнопки «Запуск». Этот режим используется при работе с большими и незнакомыми графиками и основными программами.
zh_cn: 图形更改会在您单击“运行”时执行。在处理大型图形、不熟悉的图形或主机应用程序时，请使用此模式。
zh_tw: 當您按一下「執行」時會執行圖表變更。在大型圖表、不熟悉的圖表或主體應用程式中工作時，請使用此模式。

# RunTypeToolTipPeriodicallyDisabled
source: Periodic running is disabled when there are no nodes in your graph that support it.
cs_cz: Pravidelné spuštění je zakázáno, pokud v grafu neexistují žádné uzly, které tuto funkci podporují.
de_de: Die periodische Ausführung ist deaktiviert, wenn in Ihrem Diagramm keine Blöcke vorhanden sind, die dies unterstützen.
es_es: La ejecución periódica se desactiva si su gráfico no tiene nodos que la admitan.
fr_fr: L'exécution périodique est désactivée lorsqu'aucun noeud du graphique ne prend en charge cette fonction.
it_it: L'esecuzione periodica è disattivata se non è supportata da alcun nodo nel grafico.
ja_jp: グラフに定期的な実行をサポートするノードがない場合は、定期的な実行は無効になります。
ko_kr: 그래프에 지원하는 노드가 없는 경우에는 주기적 실행이 사용되지 않습니다.
pl_pl: Okresowe uruchamianie jest wyłączone, gdy nie są dostępne żadne węzły na wykresie, które je obsługują.
pt_br: A execução periódica é desativada quando não houver nenhum nó em seu gráfico que a suporte.
ru_ru: Периодическое выполнение недоступно при отсутствии поддерживающих его узлов в графике.
zh_cn: 在图形中没有节点为定期运行提供支持时，定期运行将禁用。
zh_tw: 當圖表中沒有支援定期執行的節點時，定期執行即會停用，。

# RunTypeToolTipPeriodicallyEnabled
source: Graph changes are executed at a specified interval. Only available when the graph contains specific nodes, such as DateTime.Now or WebRequest.
cs_cz: Změny grafu se provádějí v zadanám intervalu. Tato funkce je k dispozici pouze pokud graf obsahuje specifické uzly, například DateTime.Now nebo WebRequest.
de_de: Diagrammänderungen werden in angegebenen Abständen ausgeführt. Dies ist nur verfügbar, wenn das Diagramm bestimmte Blöcke enthält, zum Beispiel DateTime.Now oder WebRequest.
es_es: Los cambios realizados en el gráfico se ejecutan en un intervalo especificado. Solo está disponible cuando el gráfico contiene nodos específicos, como DateTime.Now o WebRequest.
fr_fr: Les modifications apportées au graphique sont exécutées à un intervalle spécifié. Disponible uniquement lorsque le graphique contient des noeuds spécifiques, tels que DateTime.Now ou WebRequest.
it_it: Le modifiche al grafico vengono eseguite ad un intervallo specificato. Sono disponibili solo quando il grafico contiene nodi specifici, come DateTime.Now o WebRequest.
ja_jp: グラフの変更は指定した間隔で実行されます。グラフに DateTime.Now や WebRequest などの特定のノードが含まれている場合にのみ使用できます。
ko_kr: 그래프 변경 사항이 지정된 간격으로 실행됩니다. 그래프에 DateTime.Now 또는 WebRequest와 같은 특정 노드가 포함되어 있는 경우에만 사용할 수 있습니다.
pl_pl: Zmiany wykresu są wykonywane w określonych odstępach czasu. Dostępne tylko wtedy, gdy wykres zawiera określone węzły, takie jak DateTime.Now lub WebRequest.
pt_br: As alterações dos gráficos são executadas em um intervalo especificado. Disponível somente quando o gráfico contém nós específicos, como DateTime.Now ou WebRequest.
ru_ru: Изменения графика выполняются с заданным интервалом. Доступно, только если график содержит определенные узлы, такие как DateTime.Now или WebRequest.
zh_cn: 图形更改会以指定的间隔执行。仅当图形包含特定节点(如 DateTime.Now 或 WebRequest)时才可用。
zh_tw: 圖表變更會以指定的間隔執行。只有當圖表包含特定節點 (例如 DateTime.Now 或 WebRequest) 時才能使用。

# UnsavedChangesMessageBoxTitle
source: Unsaved changes
cs_cz: Neuložené změny
de_de: Nicht gespeicherte Änderungen
es_es: Cambios sin guardar
fr_fr: Modifications non enregistrées
it_it: Modifiche non salvate
ja_jp: 未保存の変更
ko_kr: 저장되지 않은 변경 사항
pl_pl: Niezapisane zmiany
pt_br: Alterações não salvas
ru_ru: Несохраненные изменения
zh_cn: 未保存的更改
zh_tw: 未儲存的變更

# SaveModelToSTLDialogTitle
source: Save your model to STL.
cs_cz: Uložte model do souboru STL.
de_de: Speichern Sie das Modell als STL.
es_es: Guardar el modelo en STL
fr_fr: Enregistrez votre modèle au format STL.
it_it: Salva il modello in formato STL.
ja_jp: STL にモデルを保存します。
ko_kr: 모델을 STL로 저장합니다.
pl_pl: Zapisz model do pliku STL.
pt_br: Salve seu modelo para STL.
ru_ru: Сохранение модели в формате STL.
zh_cn: 将模型保存为 STL 格式。
zh_tw: 將模型儲存至 STL。

# SaveWorkbenToImageDialogTitle
source: Save your Workbench to an Image
cs_cz: Uložte systém workbench do obrázku
de_de: Speichern Sie Ihre Workbench in einem Image
es_es: Guardar Workbench en una imagen
fr_fr: Enregistrer Workbench dans une image
it_it: Salva workbench in un'immagine
ja_jp: ワークベンチをイメージに保存
ko_kr: 워크벤치를 이미지에 저장
pl_pl: Zapisz Workbench do obrazu
pt_br: Salvar sua bancada de trabalho em uma imagem
ru_ru: Сохранить инструментарий в виде изображения
zh_cn: 将工作台保存至图像
zh_tw: 將 Workbench 儲存至影像

# ScalingExtraLargeButton
source: Extra large
cs_cz: Velmi velké
de_de: Extra groß
es_es: Muy grande
fr_fr: Très grand
it_it: Molto grande
ja_jp: 特大
ko_kr: 아주 큼
pl_pl: Bardzo duży
pt_br: Extra grande
ru_ru: Очень большой
zh_cn: 特大
zh_tw: 特大

# ScalingLargeButton
source: Large
cs_cz: Velké
de_de: Groß
es_es: Grande
fr_fr: Grand
it_it: Grande
ja_jp: 大
ko_kr: 큼
pl_pl: Duży
pt_br: Grande
ru_ru: Большой
zh_cn: 大
zh_tw: 大

# ScalingMediumButton
source: Medium
cs_cz: Střední
de_de: Mittel
es_es: Medio
fr_fr: Moyen
it_it: Medio
ja_jp: 中
ko_kr: 중간
pl_pl: Średni
pt_br: Médio
ru_ru: Средний
zh_cn: 中
zh_tw: 中

# ScalingSmallButton
source: Small
cs_cz: Malé
de_de: Klein
es_es: Pequeño
fr_fr: Petit
it_it: Piccolo
ja_jp: 小
ko_kr: 작음
pl_pl: Mały
pt_br: Pequeno
ru_ru: Маленький
zh_cn: 小
zh_tw: 小

# ScreenShotFrom3DParameter
source: screenshot_3D
cs_cz: snímek_3D
pl_pl: Zrzut ekranu_3D

# ScreenShotFrom3DShortcutParameter
source: screenshot_3D_shortcut
cs_cz: snímek_3D_zástupce
pl_pl: Zrzut ekranu_3D_skrót

# SearchViewTopResult
source: Top Result
cs_cz: Nejlepší výsledek
de_de: Oberes Ergebnis
es_es: Resultado destacado
fr_fr: Résultat principal
it_it: Risultato principale
ja_jp: 上位の結果
ko_kr: 상위 결과
pl_pl: Najlepszy wynik
pt_br: Resultado principal
ru_ru: Верхний результат
zh_cn: 热门搜索结果
zh_tw: 頂部結果

# SelectAllTitle
source: Select All
cs_cz: Vybrat vše
de_de: Alle auswählen
es_es: Seleccionar todo
fr_fr: Tout sélectionner
it_it: Seleziona tutto
ja_jp: すべて選択
ko_kr: 모두 선택
pl_pl: Wybierz wszystko
pt_br: Selecionar todos
ru_ru: Выбрать все
zh_cn: 全部选择
zh_tw: 全選

# SelectionErrorMessageBoxTitle
source: Selection Error
cs_cz: Chyba výběru
de_de: Auswahlfehler
es_es: Error de selección
fr_fr: Erreur de sélection
it_it: Errore di selezione
ja_jp: 選択エラー
ko_kr: 선택 오류
pl_pl: Błąd w wyborze
pt_br: Erro de seleção
ru_ru: Ошибка при выборе
zh_cn: 选择错误
zh_tw: 選取錯誤

# SelectNodeButtonChange
source: Change
cs_cz: Změnit
de_de: Ändern
es_es: Cambiar
fr_fr: Modifier
it_it: Modifica
ja_jp: 変更
ko_kr: 변경
pl_pl: Zmień
pt_br: Alterar
ru_ru: Изменить
zh_cn: 更改
zh_tw: 變更

# SelectNodeButtonSelect
source: Select
cs_cz: Vybrat
de_de: Auswählen
es_es: Seleccionar
fr_fr: Sélectionner
it_it: Seleziona
ja_jp: 選択
ko_kr: 선택
pl_pl: Wybierz
pt_br: Selecionar
ru_ru: Выбрать
zh_cn: 选择
zh_tw: 選取

source: Show Classic Node Library
cs_cz: Zobrazit klasickou knihovnu uzlů
de_de: Klassische Blockbibliothek anzeigen
es_es: Mostrar biblioteca de nodos clásica
fr_fr: Afficher la bibliothèque de noeuds standard
it_it: Mostra libreria nodo classica
ja_jp: クラシック ノード ライブラリを表示
ko_kr: 일반 노드 라이브러리 표시
pl_pl: Pokaż bibliotekę węzłów standardowych
pt_br: Mostrar a biblioteca de nó clássico
ru_ru: Показать классическую библиотеку узлов
zh_cn: 显示典型节点库
zh_tw: 展示典型節點資源庫

# ShowHideLibraryIconTooltip
source: Show/hide
cs_cz: Zobrazit/skrýt
de_de: Anzeigen/Ausblenden
es_es: Mostrar/Ocultar
fr_fr: Afficher/Masquer
it_it: Mostra/nascondi
ja_jp: 表示/非表示
ko_kr: 표시/숨기기
pl_pl: Pokaż / Ukryj
pt_br: Mostrar/Ocultar
ru_ru: Показать/скрыть
zh_cn: 显示/隐藏
zh_tw: 展示/隱藏

# ShowRunPreviewDisableToolTip
source: Preview the execution state of your graph. Nodes that are scheduled for execution will highlight in the graph
cs_cz: Náhled stavu provádění grafu. V grafu se zvýrazní uzly, které jsou naplánovány pro spuštění.
de_de: Zeigt den Ausführungszustand des Diagramms als Vorschau an. Blöcke, deren Ausführung geplant ist, werden im Diagramm hervorgehoben.
es_es: Obtiene una vista preliminar del estado de ejecución de su gráfico. Los nodos previstos para ejecutarse se resaltarán en el gráfico
fr_fr: Afficher l'aperçu de l'état d'exécution du graphique. Les noeuds dont l'exécution est planifiée sont mis en surbrillance dans le graphique
it_it: Visualizza in anteprima lo stato di esecuzione del grafico. I nodi pianificati per l'esecuzione vengono evidenziata nel grafico
ja_jp: グラフの実行状態をプレビューします。実行するようにスケジュール設定されているノードは、グラフ内でハイライト表示されます
ko_kr: 그래프의 실행 상태를 미리봅니다. 실행 예정된 노드는 그래프에 하이라이트됩니다
pl_pl: Wyświetl stan wykonania wykresu. Węzły zaplanowane do wykonania zostaną podświetlone na wykresie
pt_br: Visualize o estado da execução do gráfico. Os nós que estão programadas para execução serão realçados no gráfico
ru_ru: Предварительный просмотр рабочего состояния графика. Назначенные для работы узлы подсвечиваются на графике.
zh_cn: 预览图形执行状态。计划用于执行的节点将在图形中亮显
zh_tw: 預覽圖表的執行狀態。排定執行的節點會亮顯在圖表中

# ShowRunPreviewEnableToolTip
source: Execution preview is not available when running automatically
cs_cz: Náhled provedení není při automatickém spouštění dostupný.
de_de: Bei automatischer Ausführung ist die Ausführungsvorschau nicht verfügbar.
es_es: La vista preliminar de ejecución no está disponible con la ejecución automática
fr_fr: L'aperçu d'exécution n'est pas disponible lors de l'exécution automatique
it_it: L'anteprima di esecuzione non è disponibile per l'esecuzione automatica
ja_jp: 自動実行中は、実行プレビューを使用できません
ko_kr: 자동으로 실행되는 경우 실행 미리보기를 사용할 수 없습니다
pl_pl: Podgląd operacji nie jest dostępny w przypadku automatycznego uruchamiania
pt_br: A visualização da execução não está disponível ao executar automaticamente
ru_ru: Предварительный просмотр выполнения недоступен при автоматическом запуске процесса
zh_cn: 自动运行时执行预览不可用
zh_tw: 自動執行時，無法使用執行預覽

# SolutionToFolderNotWritatbleError
source: Please update the permissions or go to Preferences >Node and Package Paths...' to change your default directory.
cs_cz: Aktualizujte oprávnění nebo přejděte do „Předvolby > Cesty k uzlům a balíčkům“ a změňte výchozí adresář.
de_de: Aktualisieren Sie die Berechtigungen, oder wechseln Sie zu Voreinstellungen > Pfade für Blöcke und Pakete, um das Vorgabeverzeichnis zu ändern.
es_es: Actualice los permisos o vaya a "Preferencias > Rutas de nodos y paquetes..." para cambiar el directorio por defecto.
fr_fr: Mettez à jour les autorisations ou accédez au menu Préférences > Chemins d'accès de noeud et de package… pour modifier votre répertoire par défaut.
it_it: Aggiornare le autorizzazioni o passare a "Preferenze > Percorsi di nodi e pacchetti..." per modificare la directory di default.
ja_jp: 権限を更新するか、[基本設定] > [ノードとパッケージのパス]に移動して既定のフォルダを変更してください。
ko_kr: 권한을 업데이트하거나 '기본 설정 > 노드 및 패키지 경로'로 이동하여 기본 디렉토리를 변경할 수 있습니다.
pl_pl: Zaktualizuj uprawnienia lub przejdź do menu „Preferencje > Ścieżki węzłów i pakietów...”, aby zmienić domyślny katalog.
pt_br: Atualize as permissões ou vá para “Preferências > Caminhos de nó e pacote…” para alterar o diretório padrão.
ru_ru: Обновите права или выберите «Настройки > Пути к узлу и пакету...», чтобы изменить каталог по умолчанию.
zh_cn: 请更新权限或转到“首选项”>“节点和软件包路径...”以更改默认目录。
zh_tw: 請更新權限，或移至「偏好」>「節點和套件路徑」以變更您的預設目錄。

# StartPageAdvancedTutorials
source: Advanced Tutorials
cs_cz: Pokročilé výukové programy
de_de: Übungslektionen für Fortgeschrittene
es_es: Aprendizajes avanzados
fr_fr: Didacticiels avancés
it_it: Esercitazioni avanzate
ja_jp: 高度なチュートリアル
ko_kr: 고급 튜토리얼
pl_pl: Zaawansowane ćwiczenia
pt_br: Tutoriais avançados
ru_ru: Улучшенные учебные пособия
zh_cn: 高级教程
zh_tw: 進階自學課程

# StartPageAsk
source: ASK
cs_cz: ZEPTAT SE
de_de: FRAGEN
es_es: PREGUNTAR
fr_fr: DEMANDER
it_it: CHIEDI
ja_jp: ラーニング
ko_kr: 확인
pl_pl: ZAPYTAJ
pt_br: PERGUNTAR
ru_ru: ОБСУЖДЕНИЯ
zh_cn: 询问
zh_tw: 詢問

# StartPageBackupLocation
source: Backup location
cs_cz: Umístění zálohy
de_de: Sicherungs-Speicherort
es_es: Ubic. copia seguridad
fr_fr: Emplac. sauvegarde
it_it: Posizione di backup
ja_jp: バックアップの場所
ko_kr: 백업 위치
pl_pl: Lokalizacja
pt_br: Localização do backup
ru_ru: Папка с копиями
zh_cn: 备份位置
zh_tw: 備份位置

# StartPageBackupNoCrash
source: BACKUP
cs_cz: ZÁLOHA
de_de: SICHERUNG
es_es: COPIA DE SEGURIDAD
fr_fr: SAUVEGARDE
ja_jp: バックアップ
ko_kr: 백업
pl_pl: KOPIA ZAPASOWA
ru_ru: РЕЗЕРВНОЕ КОПИРОВАНИЕ
zh_cn: 备份
zh_tw: 備份

# StartPageBackupOnCrash
source: RECOVER FROM BACKUP
cs_cz: OBNOVIT ZE ZÁLOHY
de_de: AUS SICHERUNG WIEDERHERST.
es_es: RECUP. DESDE COPIA SEG.
fr_fr: RÉCUP. DEPUIS LA SAUV.
it_it: RECUPERA DA BACKUP
ja_jp: バックアップから復元
ko_kr: 백업에서 복구
pl_pl: ODZYSKAJ Z KOPII ZAPASOW.
pt_br: RECUPERAR DO BACKUP
ru_ru: ВОССТАН. ИЗ РЕЗ. КОПИИ
zh_cn: 恢复备份
zh_tw: 從備份中修復

# StartPageCode
source: CODE
cs_cz: KÓD
es_es: CÓDIGO
it_it: CODICE
ja_jp: コード
ko_kr: 코드
pl_pl: KOD
pt_br: CÓDIGO
ru_ru: КОД
zh_cn: 代码
zh_tw: 字碼

# StartPageDiscussionForum
source: Discussion forum
cs_cz: Diskusní fórum
de_de: Diskussionsforum
es_es: Foro de discusión
fr_fr: Forum de discussion
it_it: Forum di discussione
ja_jp: ディスカッション フォーラム
ko_kr: 토론 포럼
pl_pl: Forum dyskusyjne
pt_br: Fórum de discussão
ru_ru: Форум для обсуждения
zh_cn: 讨论论坛
zh_tw: 討論論壇

# StartPageDynamoDictionary
source: Dynamo Dictionary
cs_cz: Slovník aplikace Dynamo
de_de: Dynamo-Wörterbuch
es_es: Diccionario de Dynamo
fr_fr: Dictionnaire Dynamo
it_it: Dizionario di Dynamo
ja_jp: Dynamo ディクショナリ
ko_kr: Dynamo 사전
pl_pl: Słownik Dynamo
pt_br: Dicionário do Dynamo
ru_ru: Словарь Dynamo
zh_cn: Dynamo 词典
zh_tw: Dynamo 字典

# StartPageFiles
source: FILES
cs_cz: SOUBORY
de_de: DATEIEN
es_es: ARCHIVOS
fr_fr: FICHIERS
it_it: FILE
ja_jp: ファイル
ko_kr: 파일
pl_pl: PLIKI
pt_br: ARQUIVOS
ru_ru: ФАЙЛЫ
zh_cn: 文件
zh_tw: 檔案

# StartPageGithubRepository
source: Github repository
cs_cz: Úložiště Github
es_es: Depósito de Github
fr_fr: Référentiel GitHub
it_it: Repository GitHub
ja_jp: GitHub リポジトリ
ko_kr: Github 리포지토리
pl_pl: Repozytorium Github
pt_br: Repositório Github
ru_ru: Хранилище Github
zh_cn: Github 储存库
zh_tw: Github 儲存庫

# StartPageMoreSamples
source: More Samples
cs_cz: Více ukázek
de_de: Mehr Beispiele
es_es: Más muestras
fr_fr: Plus d'exemples
it_it: Altri esempi
ja_jp: その他のサンプル
ko_kr: 샘플 더 보기
pl_pl: Więcej przykładów
pt_br: Mais amostras
ru_ru: Больше образцов
zh_cn: 多个样例
zh_tw: 更多範例

# StartPageNewCustomNode
source: Custom Node
cs_cz: Vlastní uzel
de_de: Benutzerdefinierter Block
es_es: Nodo personalizado
fr_fr: Noeud personnalisé
it_it: Nodo personalizzato
ja_jp: カスタム ノード
ko_kr: 사용자 노드
pl_pl: Węzeł niestandardowy
pt_br: Nó personalizado
ru_ru: Пользовательский узел
zh_cn: 自定义节点
zh_tw: 自訂節點

# StartPageNewFile
source: New
cs_cz: Nový
de_de: Neu
es_es: Nuevo
fr_fr: Nouveau
it_it: Nuovo
ja_jp: 新規作成
ko_kr: 새로 만들기
pl_pl: Nowy
pt_br: Novo
ru_ru: Создать
zh_cn: 新建
zh_tw: 新建

# StartPageOpenFile
source: Open
cs_cz: Otevřít
de_de: Öffnen
es_es: Abrir
fr_fr: Ouvrir
it_it: Apri
ja_jp: 開く
ko_kr: 열기
pl_pl: Otwórz
pt_br: Abrir
ru_ru: Открыть
zh_cn: 打开
zh_tw: 開啟

# StartPageRecent
source: RECENT
cs_cz: NEDÁVNÉ
de_de: LETZTE
es_es: RECIENTE
fr_fr: RÉCENT
it_it: RECENTI
ja_jp: 最近使用したファイル
ko_kr: 최근
pl_pl: OSTATNI
pt_br: RECENTE
ru_ru: ПОСЛЕДНИЕ
zh_cn: 最近使用的文件
zh_tw: 最近

# StartPageSamples
source: SAMPLES
cs_cz: UKÁZKY
de_de: BEISPIELE
es_es: MUESTRAS
fr_fr: EXEMPLES
it_it: ESEMPI
ja_jp: サンプル
ko_kr: 샘플
pl_pl: PRZYKŁADY
pt_br: AMOSTRAS
ru_ru: ОБРАЗЦЫ
zh_cn: 样例
zh_tw: 範例

# StartPageSendIssues
source: Send issues
cs_cz: Odeslat problémy
de_de: Probleme senden
es_es: Enviar problemas
fr_fr: Envoyer les problèmes
it_it: Invia problemi
ja_jp: 問題を送信
ko_kr: 문제 보내기
pl_pl: Prześlij dane o problemach
pt_br: Enviar perguntas
ru_ru: Отправить проблемы
zh_cn: 发送问题
zh_tw: 傳送問題

# StartPageShowSamples
source: Show Samples In Folder
cs_cz: Zobrazit ukázky ve složce
de_de: Beispiele in Ordner anzeigen
es_es: Mostrar muestras en carpeta
fr_fr: Afficher les ex. dans le dossier
it_it: Mostra esempi nella cartella
ja_jp: フォルダ内のサンプルを表示
ko_kr: 폴더의 샘플 표시
pl_pl: Pokaż przykłady w folderze
pt_br: Mostrar amostras na pasta
ru_ru: Показать образцы в папке
zh_cn: 显示文件夹中的样例
zh_tw: 以資料夾顯示範例

# StartPageVideoTutorials
source: Video Tutorials
cs_cz: Výuková videa
de_de: Videolernprogramme
es_es: Vídeos de aprendizajes
fr_fr: Didacticiels vidéo
it_it: Esercitazioni video
ja_jp: ビデオ チュートリアル
ko_kr: 비디오 튜토리얼
pl_pl: Filmy z samouczkami
pt_br: Tutoriais em vídeo
ru_ru: Учебные видеоролики
zh_cn: 视频教程
zh_tw: 視訊自學課程

# StartPageVisitWebsite
source: {0} website
cs_cz: Web aplikace {0}
es_es: Sitio web de {0}
fr_fr: Site Web de {0}
it_it: Sito Web di {0}
ja_jp: {0} Web サイト
ko_kr: {0} 웹사이트
pl_pl: Strona internetowa {0}
pt_br: Site do {0}
ru_ru: Веб-сайт {0}
zh_cn: {0} 网站
zh_tw: {0} 網站

# StartPageWhatsNew
source: Getting Started
cs_cz: Začínáme
de_de: Erste Schritte
es_es: Para empezar
fr_fr: Mise en route
it_it: Introduzione
ja_jp: スタートアップ ガイド
ko_kr: 시작하기
pl_pl: Pierwsze kroki
pt_br: Iniciar
ru_ru: Начало работы
zh_cn: 快速入门
zh_tw: 開始使用

# StringInputNodeEditMenu
source: Edit...
cs_cz: Upravit...
de_de: Bearbeiten...
es_es: Editar...
fr_fr: Modifier...
it_it: Modifica...
ja_jp: 編集...
ko_kr: 편집...
pl_pl: Edytuj...
pt_br: Editar...
ru_ru: Редактировать...
zh_cn: 编辑...
zh_tw: 編輯...

# TabFileNameReadOnlyPrefix
source: [Read-Only]
cs_cz: [Pouze ke čtení]
de_de: [Schreibgeschützt]
es_es: [Solo lectura]
fr_fr: [Lecture seule]
it_it: [Sola lettura]
ja_jp: [読み取り専用]
ko_kr: [읽기 전용]
pl_pl: [Tylko do odczytu]
pt_br: [Somente leitura]
ru_ru: [Только для чтения]
zh_cn: [只读]
zh_tw: [唯讀]
