Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# PublishPackageViewCopyrightHolderWatermark
source: Author name
cs_cz: Jméno autora
de_de: Autorenname
es_es: Nombre del autor
fr_fr: Nom de l'auteur
it_it: Nome autore
ja_jp: 作成者の名前
ko_kr: 작성자 이름
pl_pl: Nazwa twórcy
pt_br: Nome do autor
ru_ru: Имя разработчика
zh_cn: 作者姓名
zh_tw: 作者名稱

# PublishPackageViewCopyrightHolderSubLabel
source: If blank, default is your username
cs_cz: Pokud je toto pole prázdné, výchozí hodnotou je uživatelské jméno
de_de: Wenn leer, wird vorgabemäßig Ihr Benutzername verwendet
es_es: Si se deja en blanco, el valor por defecto es el nombre de usuario.
fr_fr: Si ce champ est vide, le nom d'utilisateur est utilisé par défaut
it_it: Se vuoto, l'impostazione di default è il nome utente
ja_jp: 空白の場合の既定はユーザ名です
ko_kr: 비어 있는 경우 기본 설정 값은 사용자 이름입니다.
pl_pl: Jeśli ta opcja jest pusta, domyślnie jest to nazwa użytkownika
pt_br: Se estiver em branco, o padrão será seu nome de usuário
ru_ru: Если поле не заполнено, по умолчанию используется имя пользователя
zh_cn: 如果为空，则默认为用户名
zh_tw: 如果空白，預設為您的使用者名稱

# PublishPackageViewCopyrightYear
source: Copyright Year (optional)
cs_cz: Rok autorských práv (volitelné)
de_de: Jahresangabe Urheberrecht (optional)
es_es: Año de copyright (opcional)
fr_fr: Année de copyright (facultatif)
it_it: Anno del copyright (facoltativo)
ja_jp: 著作権期間(省略可能)
ko_kr: 저작권 연도(선택 사항)
pl_pl: Rok objęcia prawem autorskim (opcjonalnie)
pt_br: Ano dos direitos autorais (opcional)
ru_ru: Год авторского права (необязательно)
zh_cn: 版权年份(可选)
zh_tw: 版權年份 (選填)

# PublishPackageViewCopyrightYearWatermark
source: Publishing year
cs_cz: Rok publikování
de_de: Veröffentlichungsjahr
es_es: Año de publicación
fr_fr: Année de publication
it_it: Anno di pubblicazione
ja_jp: 発行年
ko_kr: 게시 연도
pl_pl: Rok publikacji
pt_br: Ano de publicação
ru_ru: Год публикации
zh_cn: 发布年份
zh_tw: 發佈年份

# PublishPackageViewCopyrightYearSubLabel
source: If blank, default is publishing year
cs_cz: Pokud je toto pole prázdné, výchozí hodnotou je rok publikování
de_de: Wenn leer, wird vorgabemäßig das Veröffentlichungsjahr verwendet
es_es: Si se deja en blanco, el valor por defecto es el año de publicación.
fr_fr: Si ce champ est vide, la valeur par défaut est l'année de publication
it_it: Se vuoto, l'impostazione di default è l'anno di pubblicazione
ja_jp: 空白の場合の既定は発行年です
ko_kr: 비어 있는 경우 기본 설정 값은 게시 연도입니다.
pl_pl: Jeśli ta opcja jest pusta, domyślnie jest to rok opublikowania
pt_br: Se estiver em branco, o padrão será o ano de publicação
ru_ru: Если поле не заполнено, по умолчанию используется год публикации
zh_cn: 如果为空，则默认为发布年份
zh_tw: 如果空白，預設為發佈年份

# PublishPackageViewRepositoryUrlWatermark
source: URL
cs_cz: Adresa URL
pl_pl: Adres URL
ru_ru: URL-адрес

# PublishPackageViewPublisherWebSite
source: Website Url (optional)
cs_cz: Adresa URL webové stránky (volitelné)
de_de: URL der Website (optional)
es_es: URL de sitio web (opcional)
fr_fr: URL du site Web (facultatif)
it_it: URL del sito Web (facoltativo)
ja_jp: Web サイトの URL (省略可能)
ko_kr: 웹사이트 URL(선택 사항)
pl_pl: Adres URL strony internetowej (opcjonalnie)
pt_br: URL do site (opcional)
ru_ru: Адрес веб-сайта (необязательно)
zh_cn: 网站 Url (可选)
zh_tw: 網站 URL (選填)

# PublishPackageViewPublisherWebSiteWatermark
source: URL
cs_cz: Adresa URL
pl_pl: Adres URL
ru_ru: URL-адрес

# PublishPackageViewAddDirectoryButton
source: Add Directory
cs_cz: Přidat adresář
de_de: Verzeichnis hinzufügen
es_es: Añadir directorio
fr_fr: Ajouter un répertoire
it_it: Aggiungi directory
ja_jp: フォルダを追加
ko_kr: 디렉토리 추가
pl_pl: Dodaj katalog
pt_br: Adicionar diretório
ru_ru: Добавить папку
zh_cn: 添加目录
zh_tw: 加入目錄

# PublishPackageViewAddDirectoryButtonTooltip
source: Add Directory And Its Files To Package
cs_cz: Přidat složku
de_de: Ordner hinzufügen
es_es: Añadir carpeta
fr_fr: Ajouter un dossier
it_it: Aggiungi cartella
ja_jp: フォルダを追加
ko_kr: 폴더 추가
pl_pl: Dodaj folder
pt_br: Adicionar pasta
ru_ru: Добавить папку
zh_cn: 添加文件夹
zh_tw: 加入資料夾

# PublishPackageViewMarkdownFilesDirectory
source: Markdown Files Path (optional)
cs_cz: Cesta souborů markdown (volitelné)
de_de: Verzeichnis für Markdown-Dateien (optional)
es_es: Ruta de archivos de anotaciones (opcional)
fr_fr: Chemin vers les fichiers Markdown (facultatif)
it_it: Percorso dei file Markdown (facoltativo)
ja_jp: Markdown ファイル パス(省略可能)
ko_kr: Markdown 파일 경로(선택 사항)
pl_pl: Ścieżka plików znaczników (opcjonalna)
pt_br: Caminho dos arquivos markdown (opcional)
ru_ru: Путь к файлам разметки (необязательно)
zh_cn: Markdown 文件路径(可选)
zh_tw: Markdown 檔案路徑 (選填)

# PublishPackageViewMarkdownFilesDirectoryToolTip
source: An optional location for documenting your package in the markdown format.
cs_cz: Volitelné umístění pro dokumentaci balíčku ve formátu markdown.
de_de: Ein optionaler Speicherort für die Dokumentation des Pakets im Markdown-Format.
es_es: Una ubicación opcional para documentar el paquete en formato de anotación.
fr_fr: Un emplacement facultatif qui permet de documenter votre package au format markdown.
it_it: Percorso facoltativo per la documentazione del pacchetto in formato Markdown.
ja_jp: Markdown 形式でパッケージをドキュメント化するためのオプションの場所です。
ko_kr: 패키지를 Markdown 형식으로 문서화하는 선택적 위치입니다.
pl_pl: Opcjonalne położenie dokumentacji pakietu w formacie ze znacznikami.
pt_br: Uma localização opcional para documentar o pacote no formato de revisão.
ru_ru: Необязательная папка для документирования пакета в формате пометки.
zh_cn: 用于以 Markdown 格式记录软件包的可选位置。
zh_tw: 用於以 markdown 格式記錄套件內容的可選位置。

# PublishPackageViewResetMarkdownDirectoryButton
source: Reset
cs_cz: Obnovit
de_de: Zurücksetzen
es_es: Restablecer
fr_fr: Réinitialiser
it_it: Rimposta
ja_jp: リセット
ko_kr: 재설정
pl_pl: Resetuj
pt_br: Redefinir
ru_ru: Сбросить
zh_cn: 重设
zh_tw: 重置

# PublishPackageViewResetMarkdownDirectoryButtonToolTip
source: Clears this package's Markdown directory.
cs_cz: Vymaže adresář Markdown tohoto balíčku.
de_de: Löscht das Markdown-Verzeichnis dieses Pakets.
es_es: Borra el directorio de anotaciones de este paquete.
fr_fr: Efface le répertoire Markdown de ce package.
it_it: Cancella la directory Markdown del pacchetto.
ja_jp: このパッケージの Markdown フォルダをクリアします。
ko_kr: 이 패키지의 Markdown 디렉토리를 지웁니다.
pl_pl: Czyści katalog znaczników tego pakietu.
pt_br: Limpa o diretório de revisão deste pacote.
ru_ru: Очистка каталога разметки для этого пакета.
zh_cn: 清除此软件包的 Markdown 目录。
zh_tw: 清除此套件的 Markdown 目錄。

# PublishPackageViewRemoveItemToolTip
source: Removes this item from the package contents list.
cs_cz: Odebere tuto položku ze seznamu obsahu balíčku.
de_de: Entfernt dieses Element aus der Liste der Paketinhalte.
es_es: Elimina este elemento de la lista de contenido del paquete.
fr_fr: Supprime cet élément de la liste des contenus du package.
it_it: Rimuove questo elemento dall'elenco dei contenuti del pacchetto.
ja_jp: パッケージの内容リストからこの項目を削除します。
ko_kr: 패키지 컨텐츠 리스트에서 이 항목을 제거합니다.
pl_pl: Usuwa ten element z listy zawartości pakietu.
pt_br: Remove este item da lista de conteúdo do pacote.
ru_ru: Удаление элемента из списка содержимого пакета.
zh_cn: 从软件包内容列表中删除此项目。
zh_tw: 從套件內容清單中移除此項目。

# PublishPackageExternalPackageDependencies
source: External Package Dependencies
cs_cz: Závislosti externích balíčků
de_de: Externe Paketabhängigkeiten
es_es: Dependencias de paquetes externos
fr_fr: Dépendances de package externes
it_it: Dipendenze del pacchetto esterno
ja_jp: 外部パッケージの依存関係
ko_kr: 외부 패키지 종속성
pl_pl: Zależności zewnętrzne pakietu
pt_br: Dependências do pacote externo
ru_ru: Зависимости внешнего пакета
zh_cn: 外部软件包从属关系
zh_tw: 外部套件相依性

# PreferencesViewMarkdownDirectoryTooltip
source: Markdown documentation can be added to your package that will leverage the Documentation Browser to display author generated information on a per-node basis.
cs_cz: Do balíčku je možné přidat dokumentaci Markdown, která pomocí Prohlížeče dokumentace zobrazí informace o jednotlivých uzlech vytvořené autorem.
de_de: Sie können eine Markdown-Dokumentation zu Ihrem Paket hinzufügen, die den Dokumentations-Browser nutzt, um vom Autor generierte Informationen auf Blockbasis anzuzeigen.
es_es: La documentación de anotaciones se puede añadir al paquete para que el Navegador de documentación muestre la información generada por el autor en cada nodo.
fr_fr: Vous pouvez ajouter la documentation markdown à votre package. Les informations du navigateur de documentation seront exploitées pour afficher les informations générées par l'auteur noeud par noeud.
it_it: È possibile aggiungere al pacchetto la documentazione Markdown che sfrutti il Browser della documentazione per visualizzare le informazioni generate dall'autore per ogni nodo.
ja_jp: Markdown ドキュメントをパッケージに追加して、ドキュメント ブラウザを使用して作成者が生成した情報をノード単位で表示することができます。
ko_kr: 문서 검색기를 활용하여 노드별로 작성자 생성 정보를 표시할 패키지에 Markdown 문서를 추가할 수 있습니다.
pl_pl: Do pakietu można dodać dokumentację ze znacznikami, która będzie używana w Przeglądarce dokumentacji do wyświetlania wygenerowanych przez autora informacji dla poszczególnych węzłów.
pt_br: A documentação de revisão pode ser adicionada ao pacote, que usará o Navegador de documentação para exibir informações geradas pelo autor em cada nó.
ru_ru: В пакет можно добавить документацию по разметке, которая будет использовать обозреватель документации для отображения информации, созданной автором проекта, на основе узлов.
zh_cn: Markdown 文档可以添加到软件包中，这将利用文档浏览器逐节点显示作者生成的信息。
zh_tw: 您的套件中可以加入 Markdown 文件，利用「文件瀏覽器」以每個節點為基礎顯示作者產生的資訊。

# PublishPackageViewPublisherURLWatermark
source: URL
cs_cz: Adresa URL
pl_pl: Adres URL
ru_ru: URL-адрес

# PackagesGuide
source: _Packages
cs_cz: _Balíčky
de_de: _Pakete
es_es: _Paquetes
it_it: _Pacchetti
ja_jp: パッケージ(_P)
ko_kr: 패키지(_P)
pl_pl: Pa_kiety
pt_br: _Pacotes
ru_ru: _Пакеты
zh_cn: 软件包(_P)
zh_tw: 套件(_P)

# PackagesGuideLearnAbout
source: Learn about packages
cs_cz: Další informace o balíčcích
de_de: Informationen zu Paketen
es_es: Más información sobre los paquetes
fr_fr: En savoir plus sur les packages
it_it: Informazioni sui pacchetti
ja_jp: パッケージの詳細
ko_kr: 패키지에 대해 알아보기
pl_pl: Dowiedz się więcej na temat pakietów
pt_br: Saiba mais sobre os pacotes
ru_ru: Подробнее о пакетах
zh_cn: 了解软件包
zh_tw: 瞭解套件

# NodeAutoCompleteNotAvailableForCollapsedGroups
source: Node AutoComplete is not available on ports belonging to collapsed groups.
cs_cz: Funkce automatického dokončování uzlů není k dispozici u portů, které patří do sbalených skupin.
de_de: Die automatische Blockvervollständigung ist nicht für Anschlüsse verfügbar, die zu ausgeblendeten Gruppen gehören.
es_es: La función Autocompletar nodo no está disponible en los puertos que pertenecen a grupos contraídos.
fr_fr: La saisie automatique du noeud n'est pas disponible sur les ports appartenant aux groupes réduits.
it_it: Completamento automatico nodi non è disponibile per le porte appartenenti a gruppi compressi.
ja_jp: ノード オートコンプリートは、集約されたグループに属するポートでは使用できません。
ko_kr: 축소된 그룹에 속하는 포트에서는 노드 자동 완성을 사용할 수 없습니다.
pl_pl: Autouzupełnianie węzłów nie jest dostępne dla portów należących do zwiniętych grup.
pt_br: O preenchimento automático de nós não está disponível em portas pertencentes a grupos recolhidos.
ru_ru: Автозавершение узла недоступно на портах, принадлежащих свернутым группам.
zh_cn: 节点自动完成在属于收拢组的端口上不可用。
zh_tw: 節點自動完成不適用於屬於收闔群組的埠。

# PackageManagerInstall
source: Install
cs_cz: Instalovat
de_de: Installieren
es_es: Instalar
fr_fr: Installer
it_it: Installa
ja_jp: インストール
ko_kr: 설치
pl_pl: Zainstaluj
pt_br: Instalar
ru_ru: Установить
zh_cn: 安装
zh_tw: 安裝

# PackageManagerPackageUpdated
source: Updated
cs_cz: Aktualizovaný
de_de: Aktualisiert
es_es: Actualizado
fr_fr: Mis à jour
it_it: Aggiornato
ja_jp: 更新済み
ko_kr: 업데이트됨
pl_pl: Zaktualizowany
pt_br: Atualizado
ru_ru: Обновлено
zh_cn: 已更新
zh_tw: 已更新

# PackageManagerPackageNew
source: New
cs_cz: Nový
de_de: Neu
es_es: Nuevo
fr_fr: Nouveau
it_it: Nuovo
ja_jp: 新規作成
ko_kr: 새로 만들기
pl_pl: Nowy
pt_br: Novo
ru_ru: Создать
zh_cn: 新建
zh_tw: 新建

# PackageDetailsDescription
source: DESCRIPTION
cs_cz: POPIS
de_de: BESCHREIBUNG
es_es: DESCRIPCIÓN
it_it: DESCRIZIONE
ja_jp: 説明
ko_kr: 설명
pl_pl: OPIS
pt_br: DESCRIÇÃO
ru_ru: ОПИСАНИЕ
zh_cn: 说明
zh_tw: 描述

# PackageDetailsLicense
source: LICENSE OF LATEST PACKAGE
cs_cz: LICENCE NEJNOVĚJŠÍHO BALÍČKU
de_de: LIZENZ DES AKTUELLEN PAKETS
es_es: LICENCIA DEL PAQUETE MÁS RECIENTE
fr_fr: LICENCE DU DERNIER PACKAGE
it_it: LICENZA DEL PACCHETTO PIÙ RECENTE
ja_jp: 最新パッケージのライセンス
ko_kr: 최신 패키지의 라이센스
pl_pl: LICENCJA NAJNOWSZEGO PAKIETU
pt_br: LICENÇA DO PACOTE MAIS RECENTE
ru_ru: ЛИЦЕНЗИЯ НА ПОСЛЕДНИЙ ПАКЕТ
zh_cn: 最新软件包的许可
zh_tw: 最新套件的授權

# PackageDetailsVersionsAndPackageRequirements
source: VERSIONS AND PACKAGE REQUIREMENTS
cs_cz: VERZE A POŽADAVKY NA BALÍČEK
de_de: VERSIONEN UND PAKETANFORDERUNGEN
es_es: VERSIONES Y REQUISITOS DE PAQUETES
fr_fr: VERSIONS ET CONDITIONS APPLICABLES AUX PACKAGES
it_it: VERSIONI E REQUISITI DI PACCHETTI
ja_jp: バージョンとパッケージの要件
ko_kr: 버전 및 패키지 요구사항
pl_pl: WERSJE I WYMAGANIA DOTYCZĄCE PAKIETÓW
pt_br: VERSÕES E REQUISITOS DE PACOTE
ru_ru: ТРЕБОВАНИЯ К ВЕРСИЯМ И ПАКЕТУ
zh_cn: 版本和软件包要求
zh_tw: 版本和套件需求

# PackageDetailsVersions
source: Versions
cs_cz: Verze
de_de: Versionen
es_es: Versiones
it_it: Versioni
ja_jp: バージョン
ko_kr: 버전
pl_pl: Wersje
pt_br: Versões
ru_ru: Версии
zh_cn: 版本
zh_tw: 版本

# PackageDetailsHost
source: Host
cs_cz: Hostitel
de_de: Basisbauteil
es_es: Anfitrión
fr_fr: Hôte
ja_jp: ホスト
ko_kr: 호스트
pl_pl: Obiekt nadrzędny
pt_br: Hospedeiro
ru_ru: Основа
zh_cn: 主体
zh_tw: 主體程式

# PackageDetailsPython
source: Python
cs_cz: Jazyk Python

# PackageDetailsCopyRightHolder
source: Copyright Holder
cs_cz: Držitel autorských práv
de_de: Urheberrechte-Inhaber
es_es: Titular del copyright
fr_fr: Détenteur du copyright
it_it: Titolare del copyright
ja_jp: 著作権保有者
ko_kr: 저작권 소유자
pl_pl: Prawa autorskie
pt_br: Titular dos direitos autorais
ru_ru: Владелец авторских прав
zh_cn: 版权所有者
zh_tw: 版權擁有者

# PackageDetailsCopyRightYear
source: Copyright Year
cs_cz: Rok autorských práv
de_de: Jahresangabe Urheberrecht
es_es: Año de copyright
fr_fr: Année de copyright
it_it: Anno del copyright
ja_jp: 著作権取得年
ko_kr: 저작권 연도
pl_pl: Rok praw autorskich
pt_br: Ano dos direitos autorais
ru_ru: Год авторских прав
zh_cn: 版权年份
zh_tw: 版權年份

# PackageDetailsPackage
source: Package
cs_cz: Balíček
de_de: Paket
es_es: Paquete
it_it: Pacchetto
ja_jp: パッケージ
ko_kr: 패키지
pl_pl: Pakiet
pt_br: Pacote
ru_ru: Пакет
zh_cn: 软件包
zh_tw: 套件

# PackageSortToolTip
source: Sort Packages.
cs_cz: Třídit balíčky.
de_de: Pakete sortieren.
es_es: Ordene los paquetes.
fr_fr: Trier les packages
it_it: Ordina i pacchetti.
ja_jp: パッケージを並べ替えます。
ko_kr: 패키지 정렬
pl_pl: Sortuj pakiety.
pt_br: Classificar pacotes.
ru_ru: Сортировка пакетов.
zh_cn: 对软件包排序。
zh_tw: 排序套件。

# ConnectorContextMenuHeaderHideConnector
source: Hide Wire
cs_cz: Skrýt drát
de_de: Draht ausblenden
es_es: Ocultar cable
fr_fr: Masquer le fil
it_it: Nascondi filo
ja_jp: ワイヤを非表示
ko_kr: 와이어 숨기기
pl_pl: Ukryj przewód
pt_br: Ocultar fio
ru_ru: Скрыть провод
zh_cn: 隐藏导线
zh_tw: 隱藏線路

# PackagesGuideFindPackageText
source: Packages provide additional functions that you can use in Dynamo. \n\nTo find a package or see what’s available, \n**Click Packages > Search for Packages**.
cs_cz: Balíčky nabízí další funkce, které můžete v aplikaci Dynamo používat. \n\nChcete-li najít balíček nebo zobrazit dostupné funkce, \n**klikněte na Balíčky > Package Manager**.
de_de: Pakete stellen zusätzliche Funktionen bereit, die Sie in Dynamo verwenden können. \n\nKlicken Sie auf **Pakete > Package Manager...**, \num Pakete zu suchen oder die verfügbaren anzuzeigen.
es_es: Los paquetes proporcionan funciones adicionales que se pueden utilizar en Dynamo. \n\nPara buscar un paquete o ver lo que está disponible, \n**Haga clic en Paquetes > Package Manager...**.
fr_fr: Les packages offrent des fonctions supplémentaires que vous pouvez utiliser dans Dynamo. \n\nPour trouver un package ou voir ceux qui sont disponibles, \n**Cliquez sur Packages > Package Manager...**.
it_it: I pacchetti forniscono funzioni aggiuntive che è possibile utilizzare in Dynamo. \n\nPer trovare un pacchetto o vedere gli elementi disponibili, \n**fare clic su Pacchetti > Package Manager**.
ja_jp: パッケージには、Dynamo で使用できる追加機能が用意されています。\n\nパッケージを探したり、使用可能なパッケージについて確認するには、\n**[パッケージ] > [Package Manager...]** をクリックしてください。
ko_kr: 패키지는 Dynamo에서 사용할 수 있는 추가 기능을 제공합니다. \n\n패키지를 찾거나 사용 가능한 패키지를 확인하려면 \n**패키지 > Package Manager...를 클릭하십시오**.
pl_pl: Pakiety zawierają dodatkowe funkcje, których można używać w dodatku Dynamo. \n\nAby znaleźć pakiet lub sprawdzić, co jest dostępne, \n**kliknij kolejno opcje Pakiety > Package Manager...**.
pt_br: Os pacotes fornecem funções adicionais que você pode usar no Dynamo. \n\nPara encontrar um pacote ou ver o que está disponível, \n**clique em Pacotes > Package Manager...**.
ru_ru: Пакеты предоставляют дополнительные функции, которые можно использовать в Dynamo. \n\nДля просмотра пакета или доступных компонентов \n**щелкните «Пакеты» > Package Manager...**.
zh_cn: 软件包会提供可在 Dynamo 中使用的其他功能。\n\n要查找某个软件包或查看可用的软件包，\n**请依次单击“软件包”>“Package Manager...”**。
zh_tw: 套件提供您可在 Dynamo 中使用的其他功能。\n\n若要尋找套件或查看可用的套件，\n**請按一下「套件」>「Package Manager...」**。

# PackagesGuideFindPackageTitle
source: Find a package
cs_cz: Najít balíček
de_de: Paket suchen
es_es: Buscar un paquete
fr_fr: Rechercher un dossier
it_it: Trova un pacchetto
ja_jp: パッケージを検索
ko_kr: 패키지 찾기
pl_pl: Znajdź pakiet
pt_br: Localizar um pacote
ru_ru: Найти пакет
zh_cn: 查找软件包
zh_tw: 尋找套件

# PackagesGuideSearchFilterText
source: \nYou can find packages whose title, author, or keywords contain the search phrase. To filter and sort the results, use the and icons next to the search bar.
cs_cz: \nMůžete najít balíčky, jejichž název, autor nebo klíčová slova obsahují hledanou frázi. Chcete-li filtrovat a třídit výsledky, použijte ikony vedle panelu hledání.
de_de: \nSie können nach Paketen suchen, deren Titel, Autor oder Schlüsselwörter den Suchbegriff enthalten. Um die Ergebnisse zu filtern und zu sortieren, verwenden Sie die Symbole neben der Suchleiste.
es_es: \nPuede buscar paquetes cuyo título, autor o palabras clave contengan la frase de búsqueda. Para filtrar y ordenar los resultados, utilice los iconos situados junto a la barra de búsqueda.
fr_fr: \nVous pouvez rechercher les packages dont le titre, l'auteur ou les mots-clés contiennent l'expression de recherche. Pour filtrer et trier les résultats, utilisez les icônes et en regard de la barre de recherche.
it_it: \nÈ possibile trovare i pacchetti il cui titolo, autore o le cui parole chiave contengono la frase di ricerca. Per filtrare e ordinare i risultati, utilizzare le icone accanto alla barra di ricerca.
ja_jp: \nタイトル、作成者、またはキーワードに検索語句が含まれているパッケージを検索できます。結果をフィルタして並べ替えるには、検索バーの横にあるアイコンを使用します。
ko_kr: \n제목, 작성자 또는 키워드에 검색 구문이 포함된 패키지를 찾을 수 있습니다. 결과를 필터링하고 정렬하려면 검색 막대 옆에 있는 아이콘을 사용하십시오.
pl_pl: \nMożna znaleźć pakiety, których tytuły, nazwy twórców lub słowa kluczowe zawierają wyszukiwaną frazę. Aby filtrować i sortować wyniki, użyj ikon obok paska wyszukiwania.
pt_br: \nÉ possível localizar pacotes cujo título, autor ou palavras-chave contenham a frase de pesquisa. Para filtrar e classificar os resultados, use os ícones ao lado da barra de pesquisa.
ru_ru: \nМожно найти пакеты, в названии, авторе или ключевых словах которых содержится искомая фраза. Для фильтрации и сортировки результатов используйте значки рядом с строкой поиска.
zh_cn: \n可以查找其标题、作者或关键字包含搜索短语的软件包。要过滤和排序结果，请使用搜索栏旁边的图标。
zh_tw: \n您可以尋找標題、作者或關鍵字包含搜尋片語的套件。若要篩選和排序結果，請使用搜尋列旁邊的圖示。

# PackagesGuideSearchFilterTitle
source: Search, filter, and sort
cs_cz: Hledat, filtrovat a třídit
de_de: Suchen, filtern und sortieren
es_es: Buscar, filtrar y ordenar
fr_fr: Rechercher, filtrer et trier
it_it: Cerca, filtra e ordina
ja_jp: 検索、フィルタ、並べ替え
ko_kr: 검색, 필터링 및 정렬
pl_pl: Wyszukiwanie, filtrowanie i sortowanie
pt_br: Pesquisar, filtrar e classificar
ru_ru: Поиск, фильтрация и сортировка
zh_cn: 搜索、过滤和排序
zh_tw: 搜尋、篩選和排序

# PackagesGuideTermsOfServiceText
source: \nPackages may come from third parties. Be aware that packages may pose security risks. #More information=https://dynamobim.org/issues/extend-dynamo-with-packages \n\n**Click I Accept** in the Terms of Service to accept it and proceed with this guide.
cs_cz: \nBalíčky mohou pocházet od třetích stran. Upozorňujeme, že balíčky mohou představovat bezpečnostní rizika. #Další informace=https://dynamobim.org/issues/extend-dynamo-with-packages \n\n**Kliknutím na možnost Přijímám** v Podmínkách služby je přijměte a pokračujte dál v této příručce.
de_de: \nPakete können von Drittanbietern stammen. Beachten Sie, dass Pakete Sicherheitsrisiken darstellen können. #Weitere Informationen=https://dynamobim.org/issues/extend-dynamo-with-packages \n\n**Klicken Sie in den Nutzungsbedingungen auf Akzeptieren**, um sie anzunehmen, und fahren Sie mit dieser Anleitung fort.
es_es: Los paquetes pueden provenir de terceros. Tenga en cuenta que los paquetes pueden suponer riesgos de seguridad. #Más información=https://dynamobim.org/issues/extend-dynamo-with-packages \n\n**Haga clic en Acepto** en los Términos del servicio para aceptarlo y continuar con esta guía.
fr_fr: \nLes packages peuvent provenir de tiers. Ces packages peuvent présenter des risques pour la sécurité. #Plus d'informations=https://dynamobim.org/issues/extend-dynamo-with-packages \n\n**Cliquez sur J'accepte** dans les Conditions d'utilisation du service pour les accepter et poursuivre avec ce guide.
it_it: \nI pacchetti possono provenire da terze parti. Tenere presente che i pacchetti possono presentare rischi per la sicurezza. #Ulteriori informazioni=https://dynamobim.org/issues/extend-dynamo-with-packages \n\n**Fare clic su Accetto** nelle Condizioni di servizio per accettarle e procedere con questa guida.
ja_jp: \nパッケージはサード パーティ製である場合があります。パッケージがセキュリティ上のリスクを引き起こす可能性があることに注意してください。 #詳細情報=https://dynamobim.org/issues/extend-dynamo-with-packages \n\nこのガイドを参照するには、まずサービス利用規約で **[同意する]をクリック** して同意してください。
ko_kr: \n패키지는 타사의 패키지일 수 있습니다. 그러한 패키지는 보안 위험을 일으킬 수 있습니다. #자세한 정보=https://dynamobim.org/issues/extend-dynamo-with-packages \n\n동의하려면 서비스 약관에서 **동의함을 클릭** 하고 이 안내서에 따라 진행합니다.
pl_pl: \nPakiety mogą pochodzić od innych producentów. Należy pamiętać, że pakiety mogą stwarzać zagrożenie dla bezpieczeństwa. #Więcej informacji=https://dynamobim.org/issues/extend-dynamo-with-packages \n\n**Kliknij przycisk Wyrażam zgodę** w warunkach korzystania z usługi, aby je zaakceptować i kontynuować pracę z tym przewodnikiem.
pt_br: \nOs pacotes podem ser de terceiros. Esteja ciente de que os pacotes podem representar riscos de segurança. #Mais informações=https://dynamobim.org/issues/extend-dynamo-with-packages \n\n**Clique em Aceito** nos Termos de serviço para aceitá-los e seguir com este guia.
ru_ru: \nПакеты могут поступать от третьих лиц. Обратите внимание, что пакеты могут представлять угрозу безопасности. #Дополнительная информация=https://dynamobim.org/issues/extend-dynamo-with-packages \n\n**Нажмите кнопку «Я принимаю»** в Условиях обслуживания, чтобы принять условия и продолжить работу с этим руководством.
zh_cn: \n软件包可能来自第三方。请注意，软件包可能会带来安全风险。 #更多信息=https://dynamobim.org/issues/extend-dynamo-with-packages \n\n**单击服务条款中的“我接受”** ，以接受它并继续使用本手册。
zh_tw: \n套件可能來自協力廠商。請注意，套件可能會帶來安全風險。 #更多資訊=https://dynamobim.org/issues/extend-dynamo-with-packages \n\n**在「服務條款」中按一下「我接受」** 以接受並繼續本指南。

# PackagesGuideTermsOfServiceTitle
source: Accept the Terms of Service
cs_cz: Přijmout podmínky služby
de_de: Nutzungsbedingungen akzeptieren
es_es: Aceptar los Términos del servicio
fr_fr: Accepter les conditions d'utilisation
it_it: Accetto le Condizioni di servizio
ja_jp: サービス利用規約に同意する
ko_kr: 서비스 약관 동의
pl_pl: Zaakceptuj warunki korzystania z usługi
pt_br: Aceitar os Termos de serviço
ru_ru: Принять условия обслуживания
zh_cn: 接受服务条款
zh_tw: 接受服務條款
