Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# DynamoViewEditMenuAlighBottom
source: _Bottom
cs_cz: _Dolů
de_de: _Unten
es_es: _Abajo
fr_fr: _Bas
it_it: _In basso
ja_jp: 下(_B)
ko_kr: 하단(_B)
pl_pl: W _dół
pt_br: In_ferior
ru_ru: _Вниз
zh_cn: 底部(_B)
zh_tw: 底部(_B)

# DynamoViewEditMenuAlignLeft
source: _Left
cs_cz: V_levo
de_de: _Links
es_es: _Izquierda
fr_fr: _Gauche
it_it: _A sinistra
ja_jp: 左(_L)
ko_kr: 왼쪽(_L)
pl_pl: W _lewo
pt_br: _Esquerda
ru_ru: В_лево
zh_cn: 左侧(_L)
zh_tw: 左邊(_L)

# DynamoViewEditMenuAlignRight
source: _Right
cs_cz: _Vpravo
de_de: _Rechts
es_es: _Derecha
fr_fr: _Droite
it_it: A _destra
ja_jp: 右(_R)
ko_kr: 오른쪽(_R)
pl_pl: W _prawo
pt_br: _Direita
ru_ru: Впр_аво
zh_cn: 右侧(_R)
zh_tw: 右邊(_R)

# DynamoViewEditMenuAlignSelection
source: _Align Selection
cs_cz: Z_arovnat výběr
de_de: Au_swahl ausrichten
es_es: Alinear _selección
fr_fr: A_ligner la sélection
it_it: A_llinea selezione
ja_jp: 選択項目を位置合わせ(_A)
ko_kr: 선택 항목 정렬(_A)
pl_pl: _Dopasuj wybór
pt_br: _Alinhar seleção
ru_ru: В_ыбор Выравнивания
zh_cn: 对齐所选项(_A)
zh_tw: 對齊選項(_A)

# DynamoViewEditMenuAlignTop
source: _Top
cs_cz: _Nahoru
de_de: _Oben
es_es: A_rriba
fr_fr: _Haut
it_it: I_n alto
ja_jp: 上(_T)
ko_kr: 상단(_T)
pl_pl: W _górę
pt_br: _Superior
ru_ru: Вв_ерх
zh_cn: 顶部(_T)
zh_tw: 頂部(_T)

# DynamoViewEditMenuAlignXAverage
source: _X Average
cs_cz: P_růměr X
de_de: _X-Durchschnitt
es_es: X _media
fr_fr: _Moyenne X
it_it: _Media X
ja_jp: X 平均(_X)
ko_kr: X 평균(_X)
pl_pl: _X średnia
pt_br: _Média X
ru_ru: _Среднее значение по оси X
zh_cn: X 平均值(_X)
zh_tw: X 平均(_X)

# DynamoViewEditMenuAlignXDistribute
source: X _Distribute
cs_cz: D_istribuovat X
de_de: _Verteilen X
es_es: X _distribuida
fr_fr: Distribuer _X
it_it: Distribuzione su _X
ja_jp: X 分配(_D)
ko_kr: X 배포(_D)
pl_pl: X R_ozdziel
pt_br: Distribuir _X
ru_ru: Распределение по оси _X
zh_cn: X 分布(_D)
zh_tw: X 分配(_D)

# DynamoViewEditMenuAlignYAverage
source: _Y Average
cs_cz: _Průměr Y
de_de: _Y-Durchschnitt
es_es: _Y media
fr_fr: M_oyenne Y
it_it: Media _Y
ja_jp: Y 平均(_Y)
ko_kr: Y 평균(_Y)
pl_pl: _Y średnia
pt_br: Méd_ia Y
ru_ru: Среднее значение по оси _Y
zh_cn: Y 平均值(_Y)
zh_tw: Y 平均(_Y)

# DynamoViewEditMenuAlignYDistribute
source: Y Di_stribute
cs_cz: Di_stribuovat Y
de_de: V_erteilen Y
es_es: Y di_stribuida
fr_fr: Distribuer _Y
it_it: Di_stribuzione su Y
ja_jp: Y 分配(_S)
ko_kr: Y 배포(_S)
pl_pl: Y _Rozdziel
pt_br: Distribuir _Y
ru_ru: Р_аспределение по оси Y
zh_cn: Y 分布(_S)
zh_tw: Y 分配(_S)

# DynamoViewEditMenuCleanupLayout
source: Cleanup Node _Layout
cs_cz: R_ozvržení uzlů vyčištění
de_de: Bl_ock-Layout bereinigen
es_es: Presentación de nodo de _limpieza
fr_fr: Arran_ger l'affichage des noeuds
it_it: _Semplifica layout nodi
ja_jp: ノードのレイアウトをクリーンアップ(_L)
ko_kr: 노드 배치 정리(_L)
pl_pl: Wycz_yść układ węzłów
pt_br: _Limpeza do layout do nó
ru_ru: Оч_истить компоновку узла
zh_cn: 清除节点布局(_L)
zh_tw: 清理節點配置(_L)

# DynamoViewEditMenuCopy
source: _Copy
cs_cz: _Kopírovat
de_de: _Kopieren
es_es: _Copiar
fr_fr: _Copier
it_it: _Copia
ja_jp: コピー(_C)
ko_kr: 복사(_C)
pl_pl: _Kopiuj
pt_br: _Copiar
ru_ru: _Копия
zh_cn: 复制(_C)
zh_tw: 複製(_C)

# DynamoViewEditMenuCreateCustomNode
source: Crea_te Custom Node
cs_cz: Vytvoř_it vlastní uzel
de_de: Benu_tzerdefinierten Block erstellen
es_es: Crear _nodo personalizado
fr_fr: Créer u_n noeud personnalisé
it_it: Crea nodo personalizza_to
ja_jp: カスタム ノードを作成(_T)
ko_kr: 사용자 노드 만들기(_T)
pl_pl: _Utwórz węzeł niestandardowy
pt_br: Criar nó perso_nalizado
ru_ru: Создать пользовательский узе_л
zh_cn: 创建自定义节点(_T)
zh_tw: 建立自訂節點(_T)

# DynamoViewEditMenuCreateGroup
source: Create _Group
cs_cz: Vytvořit _skupinu
de_de: _Gruppe erstellen
es_es: Cre_ar grupo
fr_fr: Créer _un groupe
it_it: Crea _gruppo
ja_jp: グループを作成(_G)
ko_kr: 그룹 만들기(_G)
pl_pl: Utwór_z grupę
pt_br: Criar gr_upo
ru_ru: Со_здать группу
zh_cn: 创建组(_G)
zh_tw: 建立群組(_G)

# DynamoViewEditMenuCreateNote
source: Create _Note
cs_cz: Vytvořit _poznámku
de_de: An_merkung erstellen
es_es: Cr_ear nota
fr_fr: Cr_éer une note
it_it: Crea _nota
ja_jp: ノートを作成(_N)
ko_kr: 참고 만들기(_N)
pl_pl: U_twórz notatkę
pt_br: Cr_iar nota
ru_ru: Созда_ть примечание
zh_cn: 创建注释(_N)
zh_tw: 建立註釋(_N)

# DynamoViewEditMenuCreatePreset
source: Create Preset From Selection
cs_cz: Vytvořit předvolbu z výběru
de_de: Voreinstellung aus Auswahl erstellen
es_es: Crear valor predefinido a partir de la selección
fr_fr: Créer une valeur prédéfinie à partir de la sélection
it_it: Crea preimpostazione dalla selezione
ja_jp: 選択からプリセットを作成
ko_kr: 선택에서 사전 설정 작성
pl_pl: Utwórz ustawienie wstępne na podstawie wyboru
pt_br: Criar predefinição a partir da seleção
ru_ru: Создание набора параметров на основе выбранных объектов
zh_cn: 从所选项创建预设
zh_tw: 從選項建立預置

# DynamoViewEditMenuDeletePreset
source: Delete Preset
cs_cz: Odstranit předvolbu
de_de: Voreinstellung löschen
es_es: Suprimir valor predefinido
fr_fr: Supprimer la valeur prédéfinie
it_it: Elimina preimpostazione
ja_jp: プリセットを削除
ko_kr: 사전 설정 삭제
pl_pl: Usuń ustawienie wstępne
pt_br: Excluir predefinição
ru_ru: Удалить набор параметров
zh_cn: 删除预设
zh_tw: 刪除預置

# DynamoViewEditMenuDeleteSelected
source: _Delete Selected
cs_cz: _Odstranit vybrané
de_de: A_uswahl löschen
es_es: Supri_mir seleccionados
fr_fr: Su_pprimer la sélection
it_it: _Elimina selezionati
ja_jp: 選択項目を削除(_D)
ko_kr: 선택 항목 삭제(_D)
pl_pl: U_suń zaznaczone
pt_br: _Excluir selecionado
ru_ru: _Удалить выбранные объекты
zh_cn: 删除所选内容(_D)
zh_tw: 刪除選定項目(_D)

# DynamoViewEditMenuPaste
source: _Paste
cs_cz: _Vložit
de_de: _Einfügen
es_es: _Pegar
fr_fr: Coll_er
it_it: _Incolla
ja_jp: 貼り付け(_P)
ko_kr: 붙여넣기(_P)
pl_pl: _Wklej
pt_br: C_olar
ru_ru: _Вставить
zh_cn: 粘贴(_P)
zh_tw: 貼上(_P)

# DynamoViewEditMenuPresetsMenu
source: Presets
cs_cz: Předvolby
de_de: Voreinstellungen
es_es: Valores predefinidos
fr_fr: Valeurs prédéfinies
it_it: Preimpostazioni
ja_jp: プリセット
ko_kr: 사전 설정
pl_pl: Ustawienia wstępne
pt_br: Predefinições
ru_ru: Наборы параметров
zh_cn: 预设
zh_tw: 預置

# DynamoViewEditMenuRedo
source: _Redo
cs_cz: Z_novu
de_de: _Wiederherstellen
es_es: _Rehacer
fr_fr: _Rétablir
it_it: _Ripeti
ja_jp: やり直し(_R)
ko_kr: 재실행(_R)
pl_pl: _Powtórz
pt_br: _Refazer
ru_ru: _Повторить
zh_cn: 恢复(_R)
zh_tw: 重做(_R)

# DynamoViewEditMenuRestorePreset
source: Restore Preset
cs_cz: Obnovit předvolbu
de_de: Voreinstellung wiederherstellen
es_es: Restaurar valor predefinido
fr_fr: Restaurer la valeur prédéfinie
it_it: Ripristina preimpostazione
ja_jp: プリセットを復元
ko_kr: 사전 설정 복원
pl_pl: Przywróć ustawienie wstępne
pt_br: Restaurar predefinição
ru_ru: Восстановить параметры по умолчанию
zh_cn: 恢复预设
zh_tw: 還原預置

# DynamoViewEditMenuSelectAll
source: _Select All
cs_cz: Vy_brat vše
de_de: A_lle auswählen
es_es: Selecc_ionar todo
fr_fr: _Sélectionner tout
it_it: Sele_ziona tutto
ja_jp: すべてを選択(_S)
ko_kr: 모두 선택(_S)
pl_pl: Wy_bierz wszystkie
pt_br: _Selecionar todos
ru_ru: Вы_делить все
zh_cn: 全部选择(_S)
zh_tw: 全選(_S)

# DynamoViewEditMenuSelectNeighbours
source: _Select Neighbors
cs_cz: _Vybrat sousedy
de_de: _Nachbarn auswählen
es_es: _Seleccionar adyacentes
fr_fr: _Sélectionner les voisins
it_it: _Seleziona contigui
ja_jp: 隣接を選択(_S)
ko_kr: 주변 선택(_S)
pl_pl: _Wybierz sąsiednie elementy
pt_br: _Selecionar vizinhos
ru_ru: _Выделить соседние объекты
zh_cn: 选择相邻区域(_S)
zh_tw: 選取鄰近物件(_S)

# DynamoViewEditMenuUndo
source: _Undo
cs_cz: _Zpět
de_de: Rü_ckgängig
es_es: _Deshacer
fr_fr: _Annuler
it_it: _Annulla
ja_jp: 元に戻す(_U)
ko_kr: 실행취소(_U)
pl_pl: _Cofnij
pt_br: _Desfazer
ru_ru: _Отменить
zh_cn: 撤销(_U)
zh_tw: 退回(_U)

# DynamoViewDynamoMenuExit
source: _Exit Dynamo
cs_cz: _Ukončit aplikaci Dynamo
de_de: D_ynamo beenden
es_es: _Salir de Dynamo
fr_fr: _Quitter Dynamo
it_it: _Chiudi Dynamo
ja_jp: Dynamo を終了(_E)
ko_kr: Dynamo 종료(_E)
pl_pl: _Zakończ dodatek Dynamo
pt_br: S_air do Dynamo
ru_ru: _Выход из Dynamo
zh_cn: 退出 Dynamo(_E)
zh_tw: 結束 Dynamo(_E)

# DynamoViewFileMenu
source: _File
cs_cz: _Soubor
de_de: Da_tei
es_es: _Archivo
fr_fr: _Fichier
ja_jp: ファイル(_F)
ko_kr: 파일(_F)
pl_pl: _Plik
pt_br: _Arquivo
ru_ru: _Файл
zh_cn: 文件(F)
zh_tw: 檔案(_F)

# DynamoViewFileMenuExport3DAsImage
source: Export _Background 3D Preview as Image...
cs_cz: Exportovat _3D náhled pozadí jako obrázek...
de_de: Hint_ergrund-3D-Vorschau als Bild exportieren...
es_es: E_xportar vista preliminar 3D en segundo plano como imagen...
fr_fr: Exporter l'_aperçu 3D en arrière plan en tant qu'image...
it_it: Esporta _anteprima 3D sfondo come immagine...
ja_jp: 背景 3D プレビューをイメージとして書き出し(_B)...
ko_kr: 이미지로 배경 3D 미리보기 내보내기(_B)...
pl_pl: Eksportuj podgląd tła 3D jako o_braz...
pt_br: Exportar _visualização 3D de fundo como imagem...
ru_ru: Э_кспорт фонового 3D-просмотра как изображения...
zh_cn: 将背景三维预览输出为图像(_B)...
zh_tw: 將背景 3D 預覽匯出為影像(_B)...

# DynamoViewFileMenuExportAsImage
source: Export _Workspace As Image...
cs_cz: Exportovat _pracovní prostor jako obrázek...
de_de: _Arbeitsbereich als Bild exportieren...
es_es: _Exportar espacio de trabajo como imagen...
fr_fr: Exporter l'espace de _travail en tant qu'image...
it_it: Esporta _area di lavoro come immagine...
ja_jp: ワークスペースをイメージとして書き出し(_W)...
ko_kr: 작업공간을 이미지로 내보내기(_W)...
pl_pl: Eksportuj _obszar roboczy jako obraz...
pt_br: Exportar _espaço de trabalho como imagem.
ru_ru: Экспорт рабочего _пространства в виде изображения...
zh_cn: 将工作空间输出为图像(_W)...
zh_tw: 將工作區匯出為影像(_W)...

# DynamoViewFileMenuExportToSTL
source: Export _Model to STL...
cs_cz: Exportovat _model do STL...
de_de: _Modell als STL exportieren...
es_es: Ex_portar modelo a STL...
fr_fr: Exporter le _modèle au format STL...
it_it: Esporta _modello in formato STL...
ja_jp: モデルを STL に書き出し(_M)...
ko_kr: 모델을 STL로 내보내기(_M)...
pl_pl: Eksportuj _model do pliku STL...
pt_br: Exportar _modelo para STL...
ru_ru: Эк_спорт модели в формат STL...
zh_cn: 将模型输出为 STL (_M)...
zh_tw: 將模型匯出為 STL(_M)...

# DynamoViewFileMenuImport
source: _Import Library...
cs_cz: _Importovat knihovnu...
de_de: _Bibliothek importieren...
es_es: _Importar biblioteca...
fr_fr: _Importer une bibliothèque...
it_it: _Importa libreria...
ja_jp: ライブラリを読み込む(_I)...
ko_kr: 라이브러리 가져오기(_I)...
pl_pl: _Importuj bibliotekę...
pt_br: _Importar biblioteca...
ru_ru: _Импорт библиотеки...
zh_cn: 导入库(_I)...
zh_tw: 匯入資源庫(_I)...

# DynamoViewFileMenuNew
source: _New
cs_cz: _Nový
de_de: _Neu
es_es: _Nuevo
fr_fr: _Nouveau
it_it: _Nuovo
ja_jp: 新規作成(_N)
ko_kr: 새로 만들기(_N)
pl_pl: _Nowy
pt_br: _Novo
ru_ru: _Создать
zh_cn: 新建(_N)
zh_tw: 新建(_N)

# DynamoViewFileMenuNewCustomNode
source: _Custom Node...
cs_cz: _Vlastní uzel...
de_de: _Benutzerdefinierter Block...
es_es: _Nodo personalizado...
fr_fr: _Noeud personnalisé...
it_it: _Nodo personalizzato...
ja_jp: カスタム ノード(_C)...
ko_kr: 사용자 노드(_C)...
pl_pl: _Węzeł niestandardowy...
pt_br: _Nó personalizado...
ru_ru: _Пользовательский узел...
zh_cn: 自定义节点(_C)...
zh_tw: 自訂節點(_C)...

# DynamoViewFileMenuNewHomeWorkSpace
source: _Home Workspace
cs_cz: _Domovský pracovní prostor
de_de: _Start-Arbeitsbereich
es_es: _Espacio de trabajo de inicio
fr_fr: _Espace de travail d'accueil
it_it: _Area di lavoro iniziale
ja_jp: ホーム ワークスペース(_H)
ko_kr: 홈 작업공간(_H)
pl_pl: _Główny obszar roboczy
pt_br: _Espaço de trabalho inicial
ru_ru: _Начальная страница рабочего пространства
zh_cn: 主工作空间(_H)
zh_tw: 首頁工作區(_H)

# DynamoViewFileMenuOpen
source: _Open...
cs_cz: _Otevřít...
de_de: _Öffnen...
es_es: _Abrir...
fr_fr: _Ouvrir...
it_it: _Apri...
ja_jp: 開く(_O)...
ko_kr: 열기(_O)...
pl_pl: _Otwórz...
pt_br: _Abrir...
ru_ru: _Открыть...
zh_cn: 打开(_O)...
zh_tw: 開啟(_O)...

# DynamoViewFileMenuRecentFiles
source: Open _Recent Files
cs_cz: Otevřít _historii souborů
de_de: _Zuletzt verwendete Dateien öffnen
es_es: A_brir archivos recientes
fr_fr: O_uvrir les fichiers récents
it_it: A_pri file recenti
ja_jp: 最近使用したファイルを開く(_R)
ko_kr: 최근 파일 열기(_R)
pl_pl: O_twórz ostatnie pliki
pt_br: Abrir arquivos _recentes
ru_ru: Откры_ть последние файлы
zh_cn: 打开最近使用的文件(_R)
zh_tw: 開啟最近的檔案(_R)

# DynamoViewFileMenuSave
source: _Save
cs_cz: _Uložit
de_de: _Speichern
es_es: _Guardar
fr_fr: _Enregistrer
it_it: _Salva
ja_jp: 保存(_S)
ko_kr: 저장(_S)
pl_pl: _Zapisz
pt_br: _Salvar
ru_ru: Со_хранить
zh_cn: 保存(_S)
zh_tw: 儲存(_S)

# DynamoViewFileMenuSaveAs
source: Save _As...
cs_cz: Uložit _jako...
de_de: Speichern _unter...
es_es: Guardar _como...
fr_fr: En_registrer sous...
it_it: Sa_lva con nome...
ja_jp: 名前を付けて保存(_A)...
ko_kr: 다른 이름으로 저장(_A)...
pl_pl: Z_apisz jako...
pt_br: Salvar _como...
ru_ru: Сохра_нить как...
zh_cn: 另存为(_A)...
zh_tw: 另存新檔(_A)...

# DynamoViewHelpDictionary
source: Dynamo Di_ctionary
cs_cz: S_lovník aplikace Dynamo
de_de: _Dynamo-Wörterbuch
es_es: Di_ccionario de Dynamo
fr_fr: Di_ctionnaire Dynamo
it_it: _Dizionario di Dynamo
ja_jp: Dynamo ディクショナリ(_C)
ko_kr: Dynamo 사전(_C)
pl_pl: Słownik _Dynamo
pt_br: Di_cionário do Dynamo
ru_ru: С_ловарь Dynamo
zh_cn: Dynamo 词典(_C)
zh_tw: Dynamo 字典(_C)

# DynamoViewHelpMenu
source: _Help
cs_cz: _Nápověda
de_de: _Hilfe
es_es: Ay_uda
fr_fr: A_ide
ja_jp: ヘルプ(_H)
ko_kr: 도움말(_H)
pl_pl: P_omoc
pt_br: A_juda
ru_ru: _Справка
zh_cn: 帮助(_H)
zh_tw: 說明(_H)

# DynamoViewHelpMenuDisplayStartPage
source: _Display Start Page
cs_cz: _Zobrazit úvodní stránku
de_de: S_tartseite anzeigen
es_es: _Mostrar página de inicio
fr_fr: A_fficher la page de démarrage
it_it: _Visualizza pagina iniziale
ja_jp: 開始ページを表示(_D)
ko_kr: 시작 페이지 표시(_D)
pl_pl: W_yświetl stronę startową
pt_br: _Exibir a página inicial
ru_ru: _Показ начальной страницы
zh_cn: 显示开始页面(_D)
zh_tw: 顯示開始頁面(_D)

# DynamoViewHelpMenuGotoWebsite
source: Dynamo _Website
cs_cz: _Webová stránka aplikace Dynamo
es_es: Sitio web de _Dynamo
fr_fr: Site _Web Dynamo
it_it: Sito _Web di Dynamo
ja_jp: Dynamo Web サイト(_W)
ko_kr: Dynamo 웹사이트(_W)
pl_pl: _Strona internetowa Dynamo
pt_br: _Site do Dynamo
ru_ru: _Веб-сайт Dynamo
zh_cn: Dynamo 网站(_W)
zh_tw: Dynamo 網站(_W)

# DynamoViewHelpMenuGotoWiki
source: Dynamo _Project Wiki
cs_cz: _Stránka Wiki k projektu aplikace Dynamo
de_de: Dynamo-Pro_jekt-Wiki
es_es: _Wiki del proyecto Dynamo
fr_fr: Wiki du _projet Dynamo
it_it: Wiki progetto di D_ynamo
ja_jp: Dynamo プロジェクト Wiki (_P)
ko_kr: Dynamo 프로젝트 Wiki(_P)
pl_pl: Strona _wiki projektu Dynamo
pt_br: Wiki do _Projeto do Dynamo
ru_ru: Проект Dynamo _Wiki
zh_cn: Dynamo Project Wiki(_P)
zh_tw: Dynamo 專案 Wiki(_P)

# DynamoViewHelpMenuReportBug
source: _Report A Bug
cs_cz: _Nahlásit problém
de_de: _Fehler melden
es_es: _Informar de un error
fr_fr: S_ignaler un bogue
it_it: Segnala un _bug
ja_jp: バグをレポート(_R)
ko_kr: 버그 신고(_R)
pl_pl: _Raportuj błąd
pt_br: _Reportar um bug
ru_ru: _Отчет об ошибке
zh_cn: 报告错误(_R)
zh_tw: 報告錯誤(_R)

# DynamoViewHelpMenuShowInFolder
source: Show In Folder
cs_cz: Zobrazit ve složce
de_de: In Ordner anzeigen
es_es: Mostrar en carpeta
fr_fr: Afficher dans le dossier
it_it: Mostra nella cartella
ja_jp: フォルダ内を表示
ko_kr: 폴더에 표시
pl_pl: Pokaż w folderze
pt_br: Mostrar na pasta
ru_ru: Показать в папке
zh_cn: 在文件夹中显示
zh_tw: 展示在資料夾

# DynamoViewHepMenuSamples
source: _Samples
cs_cz: _Ukázky
de_de: _Beispiele
es_es: _Muestras
fr_fr: _Exemples
it_it: E_sempi
ja_jp: サンプル(_S)
ko_kr: 샘플(_S)
pl_pl: _Przykłady
pt_br: _Amostras
ru_ru: О_бразцы
zh_cn: 样例(_S)
zh_tw: 範例(_S)

# DynamoViewPackageMenu
source: _Packages
cs_cz: _Balíčky
de_de: _Pakete
es_es: _Paquetes
it_it: _Pacchetti
ja_jp: パッケージ(_P)
ko_kr: 패키지(_P)
pl_pl: Pa_kiety
pt_br: _Pacotes
ru_ru: Па_кеты
zh_cn: 软件包(_P)
zh_tw: 套件(_P)

# DynamoViewPackageMenuManagePackage
source: _Manage Packages...
cs_cz: _Spravovat balíčky...
de_de: _Pakete verwalten...
es_es: _Gestionar paquetes...
fr_fr: _Gérer les packages...
it_it: _Gestisci pacchetti...
ja_jp: パッケージを管理(_M)...
ko_kr: 패키지 관리(_M)...
pl_pl: _Zarządzaj pakietami...
pt_br: _Gerenciar pacotes...
ru_ru: Управление па_кетами...
zh_cn: 管理软件包(_M)...
zh_tw: 管理套件(_M)...

# DynamoViewPackageMenuPublishNodes
source: Publish _Selected Nodes...
cs_cz: Publikovat v_ybrané uzly...
de_de: Ausgewählte Bl_öcke veröffentlichen...
es_es: P_ublicar nodos seleccionados...
fr_fr: P_ublier les noeuds sélectionnés...
it_it: P_ubblica nodi selezionati...
ja_jp: 選択したノードをパブリッシュ(_S)...
ko_kr: 선택된 노드 게시(_S)...
pl_pl: O_publikuj wybrane węzły...
pt_br: P_ublicar nós selecionados...
ru_ru: Опу_бликовать выбранные узлы...
zh_cn: 发布选定节点(_S)...
zh_tw: 發佈選取的節點(_S)...

# DynamoViewPackageMenuPublishWorkspace
source: Publish _Current Workspace...
cs_cz: Publikovat _aktuální pracovní prostor...
de_de: _Aktuellen Arbeitsbereich veröffentlichen...
es_es: Pub_licar espacio de trabajo actual...
fr_fr: Publier l'espa_ce de travail actif...
it_it: Pu_bblica area di lavoro corrente...
ja_jp: 現在のワークスペースをパブリッシュ(_C)...
ko_kr: 현재 작업공간 게시(_C)...
pl_pl: Op_ublikuj bieżący obszar roboczy...
pt_br: Publ_icar espaço de trabalho atual...
ru_ru: Опубликовать _текущее рабочее пространство...
zh_cn: 发布当前工作空间(_C)...
zh_tw: 發佈目前工作區(_C)...

# DynamoViewPackageMenuSearchPackage
source: _Search for a Package...
cs_cz: _Vyhledat balíček...
de_de: _Suchen nach Paket...
es_es: _Buscar un paquete...
fr_fr: _Rechercher un package...
it_it: _Cerca pacchetto...
ja_jp: パッケージの検索(_S)...
ko_kr: 패키지 검색(_S)...
pl_pl: _Szukaj pakietu...
pt_br: _Pesquisar por um pacote...
ru_ru: _Поиск пакета...
zh_cn: 搜索软件包(_S)...
zh_tw: 搜尋套件(_S)...

# DynamoViewRunAutomaticallyOption
source: Run Automatically
cs_cz: Spouštět automaticky
de_de: Automatisch ausführen
es_es: Ejecutar automáticamente
fr_fr: Exécuter automatiquement
it_it: Esecuzione automatica
ja_jp: 自動実行
ko_kr: 자동으로 실행
pl_pl: Uruchom automatycznie
pt_br: Executar automaticamente
ru_ru: Автоматическое выполнение процесса
zh_cn: 自动运行
zh_tw: 自動執行

# DynamoViewRunButton
source: Run
cs_cz: Spustit
de_de: Ausführen
es_es: Ejecutar
fr_fr: Exécuter
it_it: Esegui
ja_jp: 実行
ko_kr: 실행
pl_pl: Uruchom
pt_br: Executar
ru_ru: Запуск
zh_cn: 运行
zh_tw: 執行

# DynamoViewRunButtonTooltip
source: Run Workflow (F5)
cs_cz: Spustit pracovní postup (F5)
de_de: Arbeitsablauf ausführen (F5)
es_es: Ejecuta flujo de trabajo (F5)
fr_fr: Exécuter le workflow (F5)
it_it: Flusso di lavoro di esecuzione (F5)
ja_jp: ワークフローを実行([F5])
ko_kr: 워크플로우 실행(F5)
pl_pl: Uruchom proces roboczy (F5)
pt_br: Executar o fluxo de trabalho (F5)
ru_ru: Выполнить рабочий процесс (F5)
zh_cn: 运行工作流程 (F5)
zh_tw: 執行工作流程 (F5)

# DynamoViewRunButtonToolTipDisabled
source: Run is not available when running Automatically or Periodically.
cs_cz: Spuštění není k dispozici při spuštěních Automaticky nebo Pravidelně.
de_de: Bei automatischer oder periodischer Ausführung steht Ausführen nicht zur Verfügung.
es_es: No se puede ejecutar cuando se ejecuta automáticamente o periódicamente
fr_fr: L'exécution n'est pas disponible lors de l'exécution automatique ou régulière.
it_it: Il comando Esegui non è disponibile per l'esecuzione automatica o periodica.
ja_jp: 自動的または定期的に実行する場合は、実行を使用できません。
ko_kr: 자동 또는 주기적으로 실행되는 경우 실행을 사용할 수 없습니다.
pl_pl: Bieg jest niedostępny w przypadku uruchamiania automatycznego lub okresowego.
pt_br: Executar não está disponível ao executar automaticamente ou periodicamente.
ru_ru: Выполнение процесса недоступно, если включен параметр «Автоматически» или «Периодически».
zh_cn: 自动或者定期运行时运行不可用。
zh_tw: 自動或定期執行時，無法使用「執行」。

# DynamoViewSamplesMenuShowInFolder
source: Show In Folder
cs_cz: Zobrazit ve složce
de_de: In Ordner anzeigen
es_es: Mostrar en carpeta
fr_fr: Afficher dans le dossier
it_it: Mostra nella cartella
ja_jp: フォルダ内を表示
ko_kr: 폴더에 표시
pl_pl: Pokaż w folderze
pt_br: Mostrar na pasta
ru_ru: Показать в папке
zh_cn: 在文件夹中显示
zh_tw: 展示在資料夾

# PreferencesViewEnableTSplineNodes
source: Enable T-Spline nodes
cs_cz: Povolit uzly T-Spline
de_de: T-Spline-Blöcke aktivieren
es_es: Activar nodos de T-Spline
fr_fr: Activer les noeuds T-Spline
it_it: Attiva nodi T-spline
ja_jp: T スプライン ノードを有効にする
ko_kr: T-Spline 노드 사용
pl_pl: Włącz węzły T-splajn
pt_br: Ativar nós T-Spline
ru_ru: Включить узлы Т-сплайна
zh_cn: 启用 T 样条曲线节点
zh_tw: 啟用 T 雲形線節點

# PreferencesViewExperimentalLabel
source: Experimental
cs_cz: Experimentální
de_de: Experimentell
fr_fr: Expérimental
it_it: Sperimentale
ja_jp: サンプル
ko_kr: 실험
pl_pl: Eksperymentalne
ru_ru: Экспериментальный
zh_cn: 实验
zh_tw: 實驗

# DynamoViewSettingMenu
source: _Settings
cs_cz: _Nastavení
de_de: _Einstellungen
es_es: _Configuración
fr_fr: _Paramètres
it_it: _Impostazioni
ja_jp: 設定(_S)
ko_kr: 설정(_S)
pl_pl: _Ustawienia
pt_br: _Configurações
ru_ru: _Параметры
zh_cn: 设置(_S)
zh_tw: 設定(_S)

# DynamoViewSettingMenuAreaUnits
source: Area Display Units
cs_cz: Jednotky zobrazení plochy
de_de: Anzeigeeinheiten für Fläche
es_es: Unidades de visualización de área
fr_fr: Unités d'affichage de la zone
it_it: Unità di visualizzazione area
ja_jp: 面積表示単位
ko_kr: 면적 표시 단위
pl_pl: Jednostki wyświetlania powierzchni
pt_br: Unidades de exibição da área
ru_ru: Отображаемые единицы площади
zh_cn: 面积显示单位
zh_tw: 面積顯示單位

# DynamoViewSettingMenuCentimeter
source: Centimeter
cs_cz: Centimetr
de_de: Zentimeter
es_es: Centímetro
fr_fr: Centimètre
it_it: Centimetro
ja_jp: センチメートル
ko_kr: 센티미터
pl_pl: Centymetr
pt_br: Centímetro
ru_ru: Сантиметр
zh_cn: 厘米
zh_tw: 公分

# DynamoViewSettingMenuCubicCentimeter
source: Cubic Centimeter
cs_cz: Krychlový centimetr
de_de: Kubikzentimeter
es_es: Centímetro cúbico
fr_fr: Centimètre cube
it_it: Centimetro cubo
ja_jp: 立方センチメートル
ko_kr: 입방 센티미터
pl_pl: Centymetr sześcienny
pt_br: Centímetro cúbico
ru_ru: Кубический сантиметр
zh_cn: 立方厘米
zh_tw: 立方公分

# DynamoViewSettingMenuCubicFoot
source: Cubic Foot
cs_cz: Krychlová stopa
de_de: Kubikfuß
es_es: Pie cúbico
fr_fr: Pied cube
it_it: Piedi cubi
ja_jp: 立方フィート
ko_kr: 입방 피트
pl_pl: Stopa sześcienna
pt_br: Pé cúbico
ru_ru: Кубический фут
zh_cn: 立方英尺
zh_tw: 立方英尺

# DynamoViewSettingMenuCubicInch
source: Cubic Inch
cs_cz: Krychlový palec
de_de: Kubikzoll
es_es: Pulgada cúbica
fr_fr: Pouce cube
it_it: Pollice cubo
ja_jp: 立方インチ
ko_kr: 입방 인치
pl_pl: Cal sześcienny
pt_br: Polegada cúbica
ru_ru: Кубический дюйм
zh_cn: 立方英寸
zh_tw: 立方英寸

# DynamoViewSettingMenuCubicMeter
source: Cubic Meter
cs_cz: Krychlový metr
de_de: Kubikmeter
es_es: Metro cúbico
fr_fr: Mètre cube
it_it: Metri cubi
ja_jp: 立方メートル
ko_kr: 입방 미터
pl_pl: Metr sześcienny
pt_br: Metro cúbico
ru_ru: Кубический метр
zh_cn: 立方米
zh_tw: 立方公尺

# DynamoViewSettingMenuCubicMillimeter
source: Cubic Millimeter
cs_cz: Krychlový milimetr
de_de: Kubikmillimeter
es_es: Milímetro cúbico
fr_fr: Millimètre cube
it_it: Millimetri cubi
ja_jp: 立方ミリメートル
ko_kr: 입방 밀리미터
pl_pl: Milimetr sześcienny
pt_br: Milímetro cúbico
ru_ru: Кубический миллиметр
zh_cn: 立方毫米
zh_tw: 立方公釐

# DynamoViewSettingMenuDecimalFoot
source: Decimal Foot
cs_cz: Desetinná stopa
de_de: Fuß als Dezimalzahl
es_es: Pie decimal
fr_fr: Pieds décimaux
it_it: Parti decimali (piede)
ja_jp: 十進数フィート
ko_kr: 소수 피트
pl_pl: Stopa dziesiętna
pt_br: Pés decimais
ru_ru: Десятичный фут
zh_cn: 十进制英尺
zh_tw: 小數英尺

# DynamoViewSettingMenuDecimalInch
source: Decimal Inch
cs_cz: Desetinný palec
de_de: Zoll als Dezimalzahl
es_es: Pulgada decimal
fr_fr: Pouce décimal
it_it: Parti decimali (pollice)
ja_jp: 十進数インチ
ko_kr: 소수 인치
pl_pl: Cal dziesiętny
pt_br: Polegadas decimais
ru_ru: Десятичный дюйм
zh_cn: 小数英寸
zh_tw: 小數英寸

# DynamoViewSettingMenuShowDataReportingDialog
source: Agreement to _Collect Usability Data
cs_cz: ­Smlouvy pro shromažďování dat
de_de: Vereinbarungen zur _Datenerfassung
es_es: Acuerdos para la recopilación _de datos
fr_fr: Accords pour la _Collecte de données
it_it: Accordi per la raccolta di _dati
ja_jp: データ収集に関する契約(_D)
ko_kr: 데이터 수집에 대한 동의(_D)
pl_pl: _Umowy dotyczące zbierania danych
pt_br: Acordos para a _coleta de dados
ru_ru: Соглашения для сбора _данных
zh_cn: 数据收集协议(_D)
zh_tw: 同意資料收集(_D)

# DynamoViewSettingMenuFractionalFoot
source: Fractional Foot
cs_cz: Zlomková stopa
de_de: Fuß als Bruch
es_es: Fracción de pie
fr_fr: Fraction de pied
it_it: Parti frazionarie (piede)
ja_jp: 分数フィート
ko_kr: 분수 피트
pl_pl: Stopa ułamkowa
pt_br: Pés fracionários
ru_ru: Дробный фут
zh_cn: 分数英尺
zh_tw: 分數英尺
