Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# TermsOfUseAcceptButton
source: I Accept
cs_cz: Přijímám
de_de: Akzeptieren
es_es: Acepto
fr_fr: J'accepte
it_it: Accetto
ja_jp: 同意する
ko_kr: 동의함
pl_pl: Wyrażam zgodę
pt_br: Aceito
ru_ru: Я принимаю
zh_cn: 我接受
zh_tw: 我接受

# TermsOfUseDeclineButton
source: I Decline
cs_cz: Nepřijímám
de_de: Ablehnen
es_es: No acepto
fr_fr: Je refuse
it_it: Rifiuto
ja_jp: 同意しない
ko_kr: 거부함
pl_pl: Nie wyrażam zgody
pt_br: Não aceito
ru_ru: Я не принимаю
zh_cn: 我拒绝
zh_tw: 我拒絕

# TermsOfUseViewTitle
source: Package Manager Terms of Use
cs_cz: Podmínky použití aplikace Package Manager
de_de: Nutzungsbedingungen für Package Manager
es_es: Términos de uso de Package Manager
fr_fr: Conditions d'utilisation de Package Manager
it_it: Termini d'uso di Package Manager
ja_jp: Package Manager の利用規約
ko_kr: Package Manager 이용 약관
pl_pl: Warunki korzystania z aplikacji Package Manager
pt_br: Termos de uso do Package Manager
ru_ru: Условия использования Package Manager
zh_cn: Package Manager 使用条款
zh_tw: Package Manager 使用條款

# TooltipCurrentIndex
source: {0} of {1}
cs_cz: {0} z {1}
de_de: {0} von {1}
es_es: {0} de {1}
fr_fr: {0} sur {1}
it_it: {0} di {1}
pl_pl: {0} z {1}
pt_br: {0} de {1}
ru_ru: {0} из {1}
zh_tw: {1} 的 {0}

source: Unable To Access Package Directory
cs_cz: Nelze získat přístup k adresáři s balíčkem.
de_de: Zugriff auf Paketverzeichnis nicht möglich
es_es: No se puede acceder al directorio de paquetes
fr_fr: Impossible d'accéder au répertoire du package
it_it: Impossibile accedere alla directory del pacchetto
ja_jp: パッケージ フォルダにアクセスできません
ko_kr: 패키지 디렉토리에 액세스할 수 없음
pl_pl: Nie można uzyskać dostępu do katalogu pakietu
pt_br: Não é possível acessar o diretório do pacote
ru_ru: Не удалось получить доступ к папке пакета
zh_cn: 无法访问软件包目录
zh_tw: 無法存取套件目錄

# UndeprecatingPackageMessageBoxTitle
source: Removing Package Deprecation
cs_cz: Odstraňování odmítnutí balíčku
de_de: Markierung von Paket als veraltet entfernen
es_es: Eliminando obsolescencia de paquete
fr_fr: Suppression de la révocation du package
it_it: Ripristino del pacchetto dichiarato obsoleto in corso
ja_jp: パッケージの廃止の削除
ko_kr: 사용 중단된 패키지 제거 중
pl_pl: Usuwanie nieaktualnych komponentów pakietu
pt_br: Removendo a obsolescência do pacote
ru_ru: Отмена исключения пакета
zh_cn: 删除软件包弃用
zh_tw: 正在移除棄用套件

# DeleteFailureMessageBoxTitle
source: Delete Failure
cs_cz: Chyba při odstraňování
de_de: Fehler beim Löschen
es_es: Error al suprimir
fr_fr: Échec de la suppression
it_it: Errore di eliminazione
ja_jp: 削除失敗
ko_kr: 삭제 실패
pl_pl: Niepowodzenie usuwania
pt_br: Falha ao excluir
ru_ru: Сбой при удалении
zh_cn: 删除失败
zh_tw: 刪除失敗

# MessageNeedToRestartAfterDeleteTitle
source: Deleting Package
cs_cz: Odstraňování balíčku
de_de: Paket wird gelöscht
es_es: Supresión del paquete
fr_fr: Suppression du package
it_it: Eliminazione del pacchetto
ja_jp: パッケージを削除中
ko_kr: 패키지 삭제
pl_pl: Usuwanie pakietu
pt_br: Excluir pacote
ru_ru: Удаление пакета
zh_cn: 正在删除软件包
zh_tw: 刪除套件

# UnitAcres
source: Acres
cs_cz: Akry
it_it: Acri
ja_jp: エーカー
ko_kr: 에이커
pl_pl: Akry
ru_ru: Акры
zh_cn: 英亩
zh_tw: 英畝

# UnitArea
source: Area
cs_cz: Plocha
de_de: Bereich
es_es: Área
fr_fr: Surface
ja_jp: 面積
ko_kr: 면적
pl_pl: Obszar
pt_br: Área
ru_ru: Площадь
zh_cn: 区域
zh_tw: 面積

# UnitCentimeters
source: Centimeters
cs_cz: Centimetry
de_de: Zentimeter
es_es: Centímetros
fr_fr: Centimètres
it_it: Centimetri
ja_jp: センチメートル
ko_kr: 센티미터
pl_pl: Centymetry
pt_br: Centímetros
ru_ru: Сантиметры
zh_cn: 厘米
zh_tw: 公分

# UnitCubicCentimeter
source: CubicCentimeter
cs_cz: Krychlový centimetr
de_de: Kubikzentimeter
es_es: Centímetro cúbico
fr_fr: Centimètre cube
it_it: Centimetri cubici
ja_jp: 立方センチメートル
ko_kr: 입방 센티미터
pl_pl: Centymetr sześcienny
pt_br: Centímetro cúbico
ru_ru: КубСантиметры
zh_cn: 立方厘米
zh_tw: 立方厘米

# UnitCubicFoot
source: CubicFoot
cs_cz: Krychlová stopa
de_de: Kubikfuß
es_es: Pie cúbico
fr_fr: Pied cube
it_it: Piedi cubici
ja_jp: 立方フィート
ko_kr: 입방 피트
pl_pl: Stopa sześcienna
pt_br: Pé cúbico
ru_ru: КубФуты
zh_cn: 立方英尺
zh_tw: 立方英尺

# UnitCubicInches
source: CubicInches
cs_cz: Krychlové palce
de_de: Kubikzoll
es_es: Pulgadas cúbicas
fr_fr: Pouces cubes
it_it: Pollici cubici
ja_jp: 立方インチ
ko_kr: 입방 인치
pl_pl: Cale sześcienne
pt_br: Polegadas cúbicas
ru_ru: КубДюймы
zh_cn: 立方英寸
zh_tw: 立方英寸

# UnitCubicMeters
source: CubicMeters
cs_cz: Krychlové metry
de_de: Kubikmeter
es_es: Metros cúbicos
fr_fr: Mètres cubes
it_it: Metri cubici
ja_jp: 立方メートル
ko_kr: 입방 미터
pl_pl: Metry sześcienne
pt_br: Metros cúbicos
ru_ru: КубМетры
zh_cn: 立方米
zh_tw: 立方米

# UnitCubicMillimeter
source: CubicMillimeter
cs_cz: Krychlový milimetr
de_de: Kubikmillimeter
es_es: Milímetro cúbico
fr_fr: Millimètre cube
it_it: Millimetri cubici
ja_jp: 立方ミリメートル
ko_kr: 입방 밀리미터
pl_pl: Milimetr sześcienny
pt_br: Milímetro cúbico
ru_ru: КубМиллиметры
zh_cn: 立方毫米
zh_tw: 立方毫米

# UnitCubicYards
source: CubicYards
cs_cz: Krychlové yardy
de_de: Kubik-Yard
es_es: Yardas cúbicas
fr_fr: Yards cubes
it_it: Iarde cubiche
ja_jp: 立方ヤード
ko_kr: 입방 야드
pl_pl: Jardy sześcienne
pt_br: Jardas cúbicas
ru_ru: КубЯрды
zh_cn: 立方码
zh_tw: 立方碼

# UnitDecimeters
source: Decimeters
cs_cz: Decimetry
de_de: Dezimeter
es_es: Decímetros
fr_fr: Décimètres
it_it: Decimetri
ja_jp: デシメートル
ko_kr: 데시미터
pl_pl: Decymetry
pt_br: Decímetros
ru_ru: Дециметры
zh_cn: 分米
zh_tw: 公寸

# UnitFeet
source: Feet
cs_cz: Stopy
de_de: Fuß
es_es: Pies
fr_fr: Pieds
it_it: Piedi
ja_jp: フィート
ko_kr: 피트
pl_pl: Stopy
pt_br: Pés
ru_ru: Футы
zh_cn: 英尺
zh_tw: 英尺

# UnitHectares
source: Hectares
cs_cz: Hektary
de_de: Hektar
es_es: Hectáreas
it_it: Ettari
ja_jp: ヘクタール
ko_kr: 헥타르
pl_pl: Hektary
ru_ru: Гектары
zh_cn: 公顷
zh_tw: 公頃

# UnitInches
source: Inches
cs_cz: Palce
de_de: Zoll
es_es: Pulgadas
fr_fr: Pouces
it_it: Pollici
ja_jp: インチ
ko_kr: 인치
pl_pl: Cale
pt_br: Polegadas
ru_ru: Дюймы
zh_cn: 英寸
zh_tw: 英寸

# UnitLength
source: Length
cs_cz: Délka
de_de: Länge
es_es: Longitud
fr_fr: Longueur
it_it: Lunghezza
ja_jp: 長さ
ko_kr: 길이
pl_pl: Długość
pt_br: Comprimento
ru_ru: Длина
zh_cn: 长度
zh_tw: 長度

# UnitLitres
source: Litres
cs_cz: Litry
de_de: Liter
es_es: Litros
it_it: Litri
ja_jp: リットル
ko_kr: 리터
pl_pl: Litry
pt_br: Litros
ru_ru: Литры
zh_cn: 升
zh_tw: 公升

# UnitMeters
source: Meters
cs_cz: Metry
de_de: Meter
es_es: Metros
fr_fr: Mètres
it_it: Metri
ja_jp: メートル
ko_kr: 미터
pl_pl: Metry
pt_br: Metros
ru_ru: Метры
zh_cn: 米
zh_tw: 公尺

# UnitMillimeters
source: Millimeters
cs_cz: Milimetry
de_de: Millimeter
es_es: Milímetros
fr_fr: Millimètres
it_it: Millimetri
ja_jp: ミリメートル
ko_kr: 밀리미터
pl_pl: Milimetry
pt_br: Milímetros
ru_ru: Миллиметры
zh_cn: 毫米
zh_tw: 公釐

source: Units:
cs_cz: Jednotky:
de_de: Einheiten:
es_es: Unidades:
fr_fr: Unités:
it_it: Unità:
ja_jp: 単位:
ko_kr: 단위:
pl_pl: Jednostki:
pt_br: Unidades:
ru_ru: Единицы:
zh_cn: 单位:
zh_tw: 單位:

# UnitSquareCentimeter
source: SquareCentimeter
cs_cz: Čtvereční centimetr
de_de: Quadratzentimeter
es_es: Centímetro cuadrado
fr_fr: Centimètre carré
it_it: Centimetri quadrati
ja_jp: 平方センチメートル
ko_kr: 평방 센티미터
pl_pl: Centymetr kwadratowy
pt_br: Centímetro quadrado
ru_ru: КвСантиметры
zh_cn: 平方厘米
zh_tw: 平方厘米

# UnitSquareFoot
source: SquareFoot
cs_cz: Čtvereční stopa
de_de: Quadratfuß
es_es: Pie cuadrado
fr_fr: Pied carré
it_it: Piedi quadrati
ja_jp: 平方フィート
ko_kr: 평방 피트
pl_pl: Stopa kwadratowa
pt_br: Pé quadrado
ru_ru: КвФуты
zh_cn: 平方英尺
zh_tw: 平方英尺

# UnitSquareInch
source: SquareInch
cs_cz: Čtvereční palec
de_de: Quadratzoll
es_es: Pulgada cuadrada
fr_fr: Pouce carré
it_it: Pollici quadrati
ja_jp: 平方インチ
ko_kr: 평방 인치
pl_pl: Cal kwadratowy
pt_br: Polegada quadrada
ru_ru: КвДюймы
zh_cn: 平方英寸
zh_tw: 平方英寸

# UnitSquareMeter
source: SquareMeter
cs_cz: Čtvereční metr
de_de: Quadratmeter
es_es: Metro cuadrado
fr_fr: Mètre carré
it_it: Metri quadrati
ja_jp: 平方メートル
ko_kr: 평방 미터
pl_pl: Metr kwadratowy
pt_br: Metro quadrado
ru_ru: КвМетры
zh_cn: 平方米
zh_tw: 平方米

# UnitSquareMillimeter
source: SquareMillimeter
cs_cz: Čtvereční milimetr
de_de: Quadratmillimeter
es_es: Milímetro cúbico
fr_fr: Millimètre carré
it_it: Millimetri quadrati
ja_jp: 平方ミリメートル
ko_kr: 평방 밀리미터
pl_pl: Milimetr kwadratowy
pt_br: Milímetro quadrado
ru_ru: КвМиллиметры
zh_cn: 平方毫米
zh_tw: 平方毫米

# UnitUSGallons
source: USGallons
cs_cz: Americké galony
es_es: Galones EE. UU.
fr_fr: Gallons américains
it_it: Galloni
ja_jp: 米国ガロン
ko_kr: US 갤런
pl_pl: Galony amerykańskie
pt_br: Galões americanos
ru_ru: Американские галлоны
zh_tw: 美制加侖

# UnitVolume
source: Volume
cs_cz: Objem
de_de: Volumen
es_es: Volumen
ja_jp: 容積
ko_kr: 체적
pl_pl: Objętość
ru_ru: Объем
zh_cn: 体积
zh_tw: 體積

# UnknowDateFormat
source: Unknown date format
cs_cz: Neznámý formát data
de_de: Unbekanntes Dateiformat
es_es: Formato de fecha desconocido
fr_fr: Format de date inconnu
it_it: Formato data sconosciuto
ja_jp: 不明な日付形式
ko_kr: 알 수 없는 날짜 형식
pl_pl: Nieznany format daty
pt_br: Formato de data desconhecido
ru_ru: Неизвестный формат даты
zh_cn: 未知日期格式
zh_tw: 不明日期格式

# UpdateMessage
source: An update is available for Dynamo. Installing the latest update requires Dynamo and any host applications to close. Do you want to install the latest Dynamo update?
cs_cz: Pro aplikaci Dynamo je k dispozici aktualizace. Instalace nejnovější aktualizace vyžaduje zavření aplikace Dynamo a libovolné hostitelské aplikace. Chcete nainstalovat nejnovější aktualizaci aplikace Dynamo?
de_de: Ein Update für Dynamo ist verfügbar. Zum Installieren des neuesten Updates müssen Dynamo und etwaige Host-Anwendungen geschlossen werden. Möchten Sie das neueste Update für Dynamo installieren?
es_es: Hay una actualización disponible para Dynamo. Para instalar la actualización más reciente, hay que cerrar Dynamo y todas las aplicaciones host. ¿Desea instalar la actualización más reciente de Dynamo?
fr_fr: Une mise à jour est disponible pour Dynamo. L'installation de la dernière mise à jour requiert Dynamo et la fermeture de toutes les applications hôte. Voulez-vous installer la dernière mise à jour de Dynamo?
it_it: È disponibile un aggiornamento per Dynamo. Per installare l'aggiornamento più recente, è necessario chiudere Dynamo e le applicazioni host. Installare l'aggiornamento più recente di Dynamo?
ja_jp: Dynamo の更新プログラムを利用できます。 最新の更新プログラムをインストールするには、Dynamo とすべてのホスト アプリケーションを終了する必要があります。 最新の Dynamo 更新プログラムをインストールしますか?
ko_kr: Dynamo 업데이트를 사용할 수 있습니다. 최신 업데이트를 설치하려면 Dynamo 및 모든 호스트 응용프로그램을 닫아야 합니다. 최신 Dynamo 업데이트를 설치하시겠습니까?
pl_pl: Dla dodatku Dynamo dostępna jest aktualizacja. Instalacja najnowszej aktualizacji wymaga zamknięcia dodatku Dynamo i wszystkich aplikacji hosta. Czy chcesz zainstalować najnowszą aktualizację dodatku Dynamo?
pt_br: Uma atualização para o Dynamo está disponível. Feche o Dynamo e todos os aplicativos host para instalar a atualização mais recente. Deseja instalar a atualização mais recente do Dynamo?
ru_ru: Доступны обновления для Dynamo. Для установки обновлений требуется закрыть Dynamo и все основные приложения. Вы хотите установить последние обновления Dynamo?
zh_cn: Dynamo 有更新可用。 安装最新更新需要关闭 Dynamo 和任何主机应用程序。 是否要安装最新的 Dynamo更新？
zh_tw: Dynamo 有可用的更新。 安裝最新的更新需要 Dynamo 和任何主應用程式關閉。 您要安裝最新的 Dynamo 更新嗎？

# UsageReportPromptDialogTitle
source: Agreement to Collect Usability Data
cs_cz: Smlouvy pro shromažďování dat
de_de: Vereinbarungen zur Datenerfassung
es_es: Acuerdos para la recopilación de datos
fr_fr: Accords pour la Collecte de données
it_it: Accordi per la raccolta di dati
ja_jp: データ収集に関する契約
ko_kr: 데이터 수집에 대한 동의
pl_pl: Umowy dotyczące zbierania danych
pt_br: Acordos para a coleta de dados
ru_ru: Соглашения для сбора данных
zh_cn: 数据收集协议
zh_tw: 同意資料收集

# UseLevelKeepListStructureHint
source: Keep 1 input list's nesting
cs_cz: Zachová vnoření seznamu s jedním vstupem.
de_de: Verschachtelung von 1 Eingabeliste beibehalten
es_es: Mantener 1 anidación de la lista de entradas
fr_fr: Conserver l'imbrication de la liste d'entrée 1
it_it: Mantieni una nidificazione di un elenco di input
ja_jp: リストでネストされている 1 個の入力を保持
ko_kr: 1개 입력 리스트의 내포 유지
pl_pl: Zachowaj zagnieżdżenie jednej listy wejściowej.
pt_br: Manter uma entrada de aninhamento da lista
ru_ru: Сохранить 1 вложение списка ввода
zh_cn: 保持 1 个输入列表的嵌套
zh_tw: 保留 1 輸入清單的巢狀

# UseLevelKeepListStructurePopupMenuItem
source: Keep list structure
cs_cz: Zachovat strukturu seznamu
de_de: Listenstruktur beibehalten
es_es: Mantener la estructura de listas
fr_fr: Conserver la structure de la liste
it_it: Mantieni struttura elenco
ja_jp: リスト構造を保持
ko_kr: 리스트 구조 유지
pl_pl: Zachowaj strukturę listy
pt_br: Manter a estrutura da lista
ru_ru: Сохранить структуру списков
zh_cn: 保持列表结构
zh_tw: 保留清單結構

# UseLevelPopupMenuItem
source: Use Levels
cs_cz: Použít úrovně
de_de: Ebenen verwenden
es_es: Utilizar niveles
fr_fr: Utiliser des niveaux
it_it: Usa livelli
ja_jp: レベルを使用
ko_kr: 레벨 사용
pl_pl: Użyj poziomów
pt_br: Utilizar níveis
ru_ru: Используйте уровни
zh_cn: 使用级别
zh_tw: 使用層級

# VersionValueGreaterThan0
source: At least one of your version values must be greater than 0.
cs_cz: Alespoň jedna hodnota verze musí být větší než 0.
de_de: Mindestens einer der Versionswerte muss größer sein als 0.
es_es: Al menos uno de los valores de su versión debe ser mayor que 0
fr_fr: Au moins une des valeurs de version doit être supérieure à 0.
it_it: Almeno un valore di versione deve essere maggiore di 0.
ja_jp: バージョンの値の少なくとも 1 つを 0 より大きくする必要があります。
ko_kr: 하나 이상의 버전 값이 0보다 커야 합니다.
pl_pl: Co najmniej jedna z wartości wersji musi być większa niż 0.
pt_br: Pelo menos um dos valores da versão deve ser maior do que 0.
ru_ru: Значение хотя бы одной версии должно быть больше 0.
zh_cn: 至少一个版本值必须大于 0。
zh_tw: 其中一個版本值必須至少大於 0。

# Watch3DViewContextMenuPan
source: _Pan
cs_cz: _Přetáhnout
de_de: _Schwenken
es_es: _Encuadrar
fr_fr: _Panoramique
ja_jp: 画面移動(_P)
ko_kr: 초점이동(_P)
pl_pl: _Przesuń
ru_ru: _Панорамирование
zh_cn: 平移(_P)
zh_tw: 平移(_P)

# Watch3DViewContextMenuRotate
source: _Rotate
cs_cz: _Otočit
de_de: _Drehen
es_es: _Rotar
fr_fr: _Rotation
it_it: _Ruota
ja_jp: 回転(_R)
ko_kr: 회전(_R)
pl_pl: _Obróć
pt_br: _Rotacionar
ru_ru: _Повернуть
zh_cn: 旋转(_R)
zh_tw: 旋轉(_R)

# Watch3DViewContextMenuSwitchView
source: Switch to Node _View
cs_cz: Přepnout na _zobrazení uzlu
de_de: Zu Block_ansicht wechseln
es_es: Cambiar a nodo _Ver
fr_fr: Basculer vers Node _View
it_it: Passa alla _visualizzazione nodo
ja_jp: ノード ビューに切り替える(_V)
ko_kr: 노드 뷰로 전환(_V)
pl_pl: Przełącz na Węzeł _Widok
pt_br: Alternar para a Node _View
ru_ru: Перейти к _Виду узла
zh_cn: 切换到节点视图(_V)
zh_tw: 切換至節點視圖(_V)

# Watch3DViewContextMenuZoomToFit
source: _Zoom to Fit
cs_cz: _Přizpůsobit oknu
de_de: _Zoom anpassen
es_es: _Ajustar en ventana
fr_fr: _Zoom tout
it_it: _Adatta alla finestra
ja_jp: 全体表示(_Z)
ko_kr: 창에 맞게 줌(_Z)
pl_pl: _Powiększ, aby dopasować do okna
pt_br: _Zoom para ajustar
ru_ru: _Зумировать и вписать
zh_cn: 缩放到合适大小(_Z)
zh_tw: 縮放以符合(_Z)

# WatchNodeRawDataMenu
source: Show Raw Data
cs_cz: Zobrazit nezpracovaná data
de_de: Rohdaten anzeigen
es_es: Mostrar datos sin procesar
fr_fr: Afficher les données brutes
it_it: Visualizza dati grezzi
ja_jp: 未処理データを表示
ko_kr: Raw Data 표시
pl_pl: Pokaż dane pierwotne
pt_br: Mostrar os dados originais
ru_ru: Показать исходные данные
zh_cn: 显示原始数据
zh_tw: 展示原始資料

# ZeroTouchTypeShortString
source: DLL
cs_cz: Knihovna DLL

# RerunButtonToolTip
source: Rerun the graph.
cs_cz: Spusťte graf znovu.
de_de: Führt das Diagramm erneut aus.
es_es: Vuelva a ejecutar el gráfico.
fr_fr: Exécutez à nouveau le graphique.
it_it: Eseguire nuovamente il grafico.
ja_jp: グラフを再実行します。
ko_kr: 그래프를 다시 실행하십시오.
pl_pl: Uruchom ponownie wykres.
pt_br: Execute novamente o gráfico.
ru_ru: Повторный прогон графика.
zh_cn: 重新运行图形。
zh_tw: 重新執行該圖形。

# PackageSearchViewSearchTextBoxSyncing
source: Please wait...
cs_cz: Čekejte...
de_de: Bitte warten...
es_es: Espere...
fr_fr: Veuillez patienter…
it_it: Attendere...
ja_jp: お待ちください...
ko_kr: 잠시 기다려 주십시오...
pl_pl: Czekaj...
pt_br: Aguarde...
ru_ru: Подождите...
zh_cn: 请稍候...
zh_tw: 請稍候...

# EditNoteWindowTitle
source: Write note here
cs_cz: Zapsat poznámky sem
de_de: Anmerkung hier schreiben
es_es: Escribir nota aquí
fr_fr: Écrire votre remarque ici
it_it: Scrivi nota qui
ja_jp: ここに注記を記入
ko_kr: 여기에 참고 작성
pl_pl: W tym miejscu wpisz uwagę
pt_br: Escrever nota aqui
ru_ru: Запись примечания
zh_cn: 在此处写注释
zh_tw: 在此處撰寫附註

# ExtensionAdded
source: Extension tab added to the extensions side bar.
cs_cz: Karta Rozšíření byla přidána na boční panel rozšíření.
de_de: Registerkarte Erweiterung zur Erweiterungsseitenleiste hinzugefügt.
es_es: Se ha añadido una ficha de extensión a la barra lateral de extensiones.
fr_fr: L'onglet Extension a été ajouté à la barre latérale des extensions.
it_it: Scheda dell'estensione aggiunta alla barra laterale delle estensioni.
ja_jp: [拡張]サイド バーに拡張タブが追加されました。
ko_kr: 확장 탭이 확장 사이드바에 추가됩니다.
pl_pl: Dodano kartę rozszerzenia na pasku bocznym rozszerzeń.
pt_br: Guia Extensão adicionada à barra lateral de extensões.
ru_ru: Вкладка расширения добавлена на боковую панель расширений.
zh_cn: “扩展”选项卡已添加到扩展侧栏。
zh_tw: 延伸頁籤已加入至延伸側邊列。

# ExtensionAlreadyPresent
source: No new tab is added, as the extension is already present in the extensions side bar.
cs_cz: Nebyla přidána žádná nová karta, protože rozšíření se již nachází na bočním panelu rozšíření.
de_de: Es wurde keine neue Registerkarte hinzugefügt, da die Erweiterung bereits auf der Erweiterungsseitenleiste vorhanden ist.
es_es: No se ha añadido ninguna ficha nueva, ya que la extensión ya está presente en la barra lateral de extensiones.
fr_fr: Aucun nouvel onglet n'a été ajouté, car l'extension figure déjà dans la barre latérale des extensions.
it_it: Non è stata una nuova scheda perché l'estensione è già presente sulla barra laterale delle estensioni.
ja_jp: [拡張]サイド バーに既に拡張が存在するため、新しいタブは追加されません。
ko_kr: 확장이 이미 확장 사이트바에 있어 새 탭이 추가되지 않습니다.
pl_pl: Nie zostanie dodana nowa karta, ponieważ to rozszerzenie już występuje na pasku bocznym rozszerzeń.
pt_br: Não foi adicionada nenhuma guia nova, porque a extensão já está presente na barra lateral de extensões.
ru_ru: Новая вкладка не добавляется, т. к. расширение уже присутствует на боковой панели расширений.
zh_cn: 添加了新选项卡，因为该扩展已经显示在扩展侧栏上。
zh_tw: 未加入新頁籤，因為該延伸已經位於延伸側邊列中。

# MessageUninstallCustomNodeToContinue
source: {1} cannot be loaded. Installing it will conflict with one or more node definitions that already exist in {0}, which is currently loaded. To install {1}, Dynamo needs to first uninstall {0}. Restart Dynamo to complete the uninstall. Uninstall the following packages: {0}?
cs_cz: {1} nelze načíst. Instalace tohoto uzlu je v konfliktu s jednou nebo více definicemi uzlů, které již v aktuálně načteném {0} existují. Chcete-li {1} nainstalovat, aplikace Dynamo potřebuje nejprve odinstalovat {0}. Restartováním Dynamo dokončete odinstalaci. Odinstalovat následující balíčky: {0}?
de_de: {1} kann nicht geladen werden. Die Installation führt zu Konflikten mit mindestens einer Blockdefinition, die bereits in {0} (aktuell geladen) vorhanden ist. Um {1} zu installieren, muss Dynamo zunächst {0} deinstallieren. Starten Sie Dynamo neu, um die Deinstallation abzuschließen. Die folgenden Pakete deinstallieren: {0}?
es_es: {1} no se puede cargar. Su instalación entrará en conflicto con una o más definiciones de nodo que existen en {0}, que ya se ha cargado. Para instalar {1}, Dynamo debe desinstalar primero {0}. Reinicie Dynamo para completar la desinstalación. ¿Desinstalar los siguientes paquetes: {0}?
fr_fr: Impossible de charger {1}. L'installation va entrer en conflit avec une ou plusieurs définitions de noeud qui existent déjà dans {0}, qui est en cours de chargement. Pour installer {1}, Dynamo doit d'abord désinstaller {0}. Redémarrez Dynamo pour terminer la désinstallation. Désinstaller les packages suivants: {0}?
ko_kr: {1}을(를) 로드할 수 없습니다. 이것을 설치하면 현재 로드되어 있고 {0}에 이미 존재하는 하나 이상의 노드 정의와 충돌하게 됩니다. {1}을(를) 설치하려면 Dynamo에서 먼저 {0}을(를) 설치제거해야 합니다. 설치제거를 완료하려면 Dynamo를 다시 시작하십시오. {0} 패키지를 설치제거하시겠습니까?
pl_pl: Nie można wczytać składnika {1}. Zainstalowanie tego składnika spowoduje konflikt z co najmniej jedną definicją węzła już istniejącą w obecnie wczytanym składniku {0}. Aby zainstalować składnik {1}, dodatek Dynamo musi najpierw odinstalować składnik {0}. Uruchom ponownie dodatek Dynamo, aby zakończyć dezinstalację. Czy odinstalować następujące pakiety: {0}?
pt_br: Não é possível carregar {1}. A instalação vai conflitar com uma ou mais definições de nós que já existem em {0}, que está atualmente carregado. Para instalar {1}, o Dynamo precisa de desinstalar {0} primeiro. Reinicie o Dynamo para concluir a desinstalação. Desinstalar os pacotes a seguir: {0}?
ru_ru: Невозможно загрузить {1}. Установка приведет к конфликту с одним или несколькими определениями узлов, которые уже существуют в загруженном данный момент пакете {0}. Для установки {1} Dynamo требуется сначала удалить {0}. Для завершения удаления перезапустите Dynamo. Удалить следующие пакеты: {0}?
zh_cn: {1} 无法加载。 安装它会与当前加载的 {0} 中已存在的一个或多个节点定义产生冲突。 要安装 {1}，Dynamo 需要先卸载 {0}。 重新启动 Dynamo 以完成卸载。 卸载以下软件包: {0}？

# PreviewText
source: This Feature is in Preview!
cs_cz: Tato funkce je v režimu Náhled.
de_de: Für diese Funktion ist die Vorschau verfügbar!
es_es: Esta función se encuentra en modo de vista preliminar.
fr_fr: Cette fonctionnalité est disponible en aperçu.
it_it: Questa funzionalità è in anteprima.
ja_jp: このフィーチャはプレビューです。
ko_kr: 이 기능은 미리보기 상태입니다!
pl_pl: Ta funkcja jest w wersji Preview!
pt_br: Este recurso está em visualização.
ru_ru: Данная функция доступна в предварительной версии.
zh_cn: 此功能为预览版!
zh_tw: 此功能為預覽版功能！

# PackageHostDependencyTooltip
source: This package contains node(s) that depend on applications outside Dynamo. To fully utilize node(s) in this package, you will need to have these external applications installed.
cs_cz: Tento balíček obsahuje uzly, které kromě aplikace Dynamo závisí i na dalších aplikacích. Před využitím těchto uzlů je nutné tyto externí aplikace nainstalovat.
de_de: Dieses Paket enthält mindestens einen Block, der von Anwendungen außerhalb von Dynamo abhängt. Sie müssen diese externen Anwendungen installiert haben, um die Blöcke in diesem Paket vollständig nutzen zu können.
es_es: Este paquete contiene nodos que dependen de aplicaciones externas a Dynamo. Para utilizar por completo los nodos de este paquete, debe tener instaladas estas aplicaciones externas.
fr_fr: Ce package contient des noeuds qui dépendent d'applications externes à Dynamo. Afin d'exploiter pleinement les noeuds de ce package, vous devrez installer ces applications externes.
it_it: Questo pacchetto contiene nodi che dipendono dalle applicazioni esterne a Dynamo. Per utilizzare pienamente i nodi in questo pacchetto, sarà necessario installare queste applicazioni esterne.
ja_jp: このパッケージには Dynamo 以外のアプリケーションに依存するノード(複数可)が含まれています。このパッケージのノードを完全に使用するには、これらの外部アプリケーションがインストールされている必要があります。
ko_kr: 이 패키지에는 Dynamo 외부의 응용프로그램에 의존하는 노드가 포함되어 있습니다. 이 패키지에서 노드를 완전히 활용하려면 이러한 외부 응용프로그램을 설치해야 합니다.
pl_pl: Ten pakiet zawiera węzły zależne od aplikacji innych niż dodatek Dynamo. Aby korzystać z wszystkich funkcji węzłów tego pakietu, należy zainstalować te aplikacje zewnętrzne.
pt_br: Este pacote contém nós que dependem de aplicativos fora do Dynamo. Para usar o nós completamente neste pacote, você precisará ter esses aplicativos externos instalados.
ru_ru: Пакет содержит узлы, для которых требуются приложения за пределами Dynamo. Чтобы полностью использовать эти узлы, необходимо установить внешние приложения.
zh_cn: 此软件包包含依赖 Dynamo 之外的应用程序的节点。要充分利用此软件包中的节点，您需要安装这些外部应用程序。
zh_tw: 此套件包含的節點依賴 Dynamo 外部的應用程式。若要完整使用此套件中的節點，您必須安裝這些外部應用程式。
