Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# ExportSettingsDialogTitle
source: Select Folder to Export
cs_cz: Vyberte složku, kterou chcete exportovat.
de_de: Ordner für Export auswählen
es_es: Seleccionar carpeta para exportar
fr_fr: Sélectionner le dossier à exporter
it_it: Seleziona cartella da esportare
ja_jp: 書き出すフォルダを選択
ko_kr: 내보낼 폴더 선택
pl_pl: Wybierz folder do eksportu
pt_br: Selecionar pasta para exportar
ru_ru: Выберите папку для экспорта
zh_cn: 选择要输出的文件夹
zh_tw: 選取要匯出的資料夾

# FileDialogImportSettingsFiles
source: Settings Files ({0})|{0}
cs_cz: Soubory nastavení ({0})|{0}
de_de: Einstellungsdateien ({0})|{0}
es_es: Archivos de configuración ({0})|{0}
fr_fr: Fichiers de paramètres ({0})|{0}
it_it: File di impostazioni ({0})|{0}
ja_jp: 設定ファイル({0})|{0}
ko_kr: 설정 파일({0})|{0}
pl_pl: Pliki ustawień ({0})|{0}
pt_br: Arquivos de configurações ({0})|{0}
ru_ru: Файлы параметров ({0})|{0}
zh_cn: 设置文件({0})|{0}
zh_tw: 設定檔 ({0})|{0}

# ImportSettingsDialogTitle
source: Import Settings
cs_cz: Importovat nastavení
de_de: Einstellungen importieren
es_es: Importar configuración
fr_fr: Paramètres d'importation
it_it: Impostaz. importazione
ja_jp: 読み込み設定
ko_kr: 가져오기 설정
pl_pl: Importuj ustawienia
pt_br: Config. importação
ru_ru: Параметры импорта
zh_cn: 输入设置
zh_tw: 匯入設定

# ImportSettingsSuccessMessage
source: Import Success
cs_cz: Import proběhl úspěšně.
de_de: Import erfolgreich
es_es: Importación correcta
fr_fr: Importation réussie
it_it: Importazione completata
ja_jp: 読み込みに成功しました
ko_kr: 가져오기 성공
pl_pl: Pomyślnie zaimportowano
pt_br: Importação bem-sucedida
ru_ru: Импорт выполнен успешно
zh_cn: 输入成功
zh_tw: 匯入成功

# ImportSettingsFailedMessage
source: Import Failed
cs_cz: Import se nezdařil.
de_de: Import fehlgeschlagen
es_es: Error de importación
fr_fr: Echec de l'importation
it_it: Importazione non riuscita
ja_jp: 読み込みに失敗しました
ko_kr: 가져오기 실패
pl_pl: Importowanie nie powiodło się
pt_br: Falha na importação
ru_ru: Сбой при импорте
zh_cn: 输入失败
zh_tw: 匯入失敗

# PreferencesSettingHardwareAcceleration
source: Use Hardware Acceleration
cs_cz: Použít hardwarovou akceleraci
de_de: Hardwarebeschleunigung verwenden
es_es: Usar aceleración de hardware
fr_fr: Utiliser l'accélération matérielle
it_it: Usa accelerazione hardware
ja_jp: ハードウェア アクセラレーションを使用
ko_kr: 하드웨어 가속 사용
pl_pl: Użyj przyspieszenia sprzętowego
pt_br: Usar aceleração por hardware
ru_ru: Использовать аппаратное ускорение
zh_cn: 使用硬件加速
zh_tw: 使用硬體加速

# PreferencesSettingCustomPythomTemplate
source: Custom Python Template File Path
cs_cz: Cesta k souboru vlastní šablony jazyka Python
de_de: Benutzerdefinierter Pfad für Python-Vorlagendatei
es_es: Ruta de archivo de plantilla de Python personalizada
fr_fr: Chemin d'accès au fichier modèle Python personnalisé
it_it: Percorso di file modello Python personalizzato
ja_jp: カスタム Python テンプレート ファイル パス
ko_kr: 사용자 Python 템플릿 파일 경로
pl_pl: Ścieżka pliku szablonu niestandardowego języka Python
pt_br: Caminho de arquivo do modelo Python personalizado
ru_ru: Путь к пользовательскому файлу шаблона Python
zh_cn: 自定义 Python 模板文件路径
zh_tw: 自訂 Python 樣板檔路徑

# PreferencesSettingBackupInterval
source: Auto-Backup Interval
cs_cz: Interval automatického zálohování
de_de: Intervall für automatische Sicherung
es_es: Intervalo copia seg. automática
fr_fr: Intervalle de sauvegarde automatique
it_it: Intervallo di backup automatico
ja_jp: 自動バックアップ間隔
ko_kr: 자동 백업 간격
pl_pl: Odstęp automat. kopii zapasowej
pt_br: Intervalo de backup automático
ru_ru: Интервал автом. Рез. копирования
zh_cn: 自动备份间隔
zh_tw: 自動備份間隔

# PreferencesSettingMaxRecentFiles
source: Maximum Number of Recent Files
cs_cz: Maximální počet posledních souborů
de_de: Zuletzt verwendet (max.)
es_es: Número máximo de archivos recientes
fr_fr: Nombre maximal de fichiers récents
it_it: Numero massimo di file recenti
ja_jp: 最近使用したファイルの最大数
ko_kr: 최근 파일의 최대 수
pl_pl: Maksymalna liczba ostatnich plików
pt_br: Nº máximo de arquivos recentes
ru_ru: Макс. кол-во последних файлов
zh_cn: 最近使用的文件的最大数量
zh_tw: 最近使用的檔案數上限

# BackupInternalUnit
source: Minute(s) between backups
cs_cz: Minuty mezi zálohami
de_de: Minute(n) zwischen Sicherungen
es_es: Minuto(s) entre copias de seguridad
fr_fr: Minute(s) entre les sauvegardes
it_it: Minuto/i tra i backup
ja_jp: バックアップ間隔(分単位)
ko_kr: 백업 간 시간(분)
pl_pl: Minuty między kopiami zapasowymi
pt_br: Minutos entre backups
ru_ru: мин. между операциями рез. коп.
zh_cn: 备份的间隔分钟数
zh_tw: 備份間的分鐘數

# PythonTemplateAddPathTooltip
source: Add a file path for Python Node Template
cs_cz: Přidání cesty k souboru šablony uzlu jazyka Python
de_de: Dateipfad für Python-Blockvorlage hinzufügen
es_es: Añadir una ruta de archivo para la plantilla de nodo de Python
fr_fr: Ajouter un chemin de fichier pour le modèle de noeud Python
it_it: Aggiungi un percorso di file per il modello di nodo Python
ja_jp: Python ノード テンプレートのファイル パスを追加します
ko_kr: Python 노드 템플릿에 대한 파일 경로 추가
pl_pl: Dodaj ścieżkę pliku dla szablonu węzła języka Python
pt_br: Adicionar um caminho de arquivo para o modelo do nó Python
ru_ru: Добавление пути к файлу для шаблона узла Python
zh_cn: 添加 Python 节点模板的文件路径
zh_tw: 為 Python 節點樣板加入檔案路徑

# AddFilePathButtonName
source: Add File Path
cs_cz: Přidat cestu k souboru
de_de: Dateipfad hinzufügen
es_es: Añadir ruta de archivo
fr_fr: Ajouter un chemin de fichier
it_it: Aggiungi percorso di file
ja_jp: ファイル パスを追加
ko_kr: 파일 경로 추가
pl_pl: Dodaj ścieżkę pliku
pt_br: Adicionar caminho de arquivo
ru_ru: Добавить путь к файлу
zh_cn: 添加文件路径
zh_tw: 加入檔案路徑

# PackageDeprecatedTooltip
source: This package is outdated and cannot be installed.
cs_cz: Tento balíček je zastaralý a nelze jej nainstalovat.
de_de: Dieses Paket ist veraltet und kann nicht installiert werden.
es_es: Este paquete está obsoleto y no se puede instalar.
fr_fr: Ce package est obsolète et ne peut pas être installé.
it_it: Il pacchetto è obsoleto e non può essere installato.
ja_jp: このパッケージは古いためインストールできません。
ko_kr: 이 패키지는 오래되어 설치할 수 없습니다.
pl_pl: Ten pakiet jest nieaktualny i nie można go zainstalować.
pt_br: Esse pacote está desatualizado e não pode ser instalado.
ru_ru: Этот пакет устарел и не может быть установлен.
zh_cn: 此软件包已过期，无法安装。
zh_tw: 此套件太舊，無法安裝。

# SplashScreenViewExtensions
source: Loading View Extensions...
cs_cz: Načítání rozšíření pohledu...
de_de: Ansichtserweiterungen werden geladen...
es_es: Cargando extensiones de vista...
fr_fr: Chargement des extensions de vue…
it_it: Caricamento estensioni vista in corso...
ja_jp: ビューの拡張機能をロードしています...
ko_kr: 뷰 확장을 로드하는 중...
pl_pl: Wczytywanie rozszerzeń widoku...
pt_br: Carregando as extensões da vista...
ru_ru: Загрузка расширений видов...
zh_cn: 正在加载视图扩展…
zh_tw: 正在載入視圖延伸...

# DynamoViewSettingShowStaticSplashScreen
source: Pause Splash Screen
cs_cz: Zobrazit úvodní obrazovku
de_de: Startbildschirm anhalten
es_es: Pausar pantalla de bienvenida
fr_fr: Mettre en pause l'écran d'accueil statique
it_it: Metti in pausa schermata iniziale
ja_jp: スプラッシュ画面を一時停止
ko_kr: 시작 화면 일시 정지
pl_pl: Wstrzymaj ekran powitalny
pt_br: Pausar tela inicial
ru_ru: Приостановить вывод экрана-заставки
zh_cn: 暂停启动屏幕
zh_tw: 暫停啟動畫面

# PreferencesViewShowStaticSplashScreenTooltip
source: Pauses the splash screen when loading is complete, enabling you to launch Dynamo manually, sign in to your Autodesk account, or import settings.
cs_cz: Pozastaví úvodní obrazovku po dokončení načtení a umožní spustit aplikaci Dynamo ručně, přihlásit se k účtu Autodesk, nebo importovat nastavení.
de_de: Hält nach dem Laden den Startbildschirm an, damit Sie Dynamo manuell starten, sich bei Ihrem Konto bei Autodesk Account anmelden oder Einstellungen importieren können.
es_es: Pausa la pantalla de bienvenida cuando se completa la carga, lo que le permite iniciar Dynamo manualmente, iniciar sesión en su cuenta de Autodesk Account o importar la configuración.
fr_fr: Met en pause l'écran d'accueil lorsque le chargement est terminé, vous permettant de lancer Dynamo manuellement, de vous connecter à votre compte Autodesk Account ou d'importer des paramètres.
it_it: Mette in pausa la schermata iniziale quando il caricamento è stato completato, consentendo di avviare Dynamo manualmente, accedere ad Autodesk Account o alle impostazioni di importazione.
ja_jp: ロードの完了時にスプラッシュ画面を一時停止します。これにより、Dynamo の手動での起動、Autodesk Account へのサイン イン、または設定の読み込みを実行できます。
ko_kr: 로드가 완료되면 스플래시 화면을 일시 정지하고 Dynamo를 수동으로 시작하거나 Autodesk Account에 로그인하거나 설정을 가져올 수 있습니다.
pl_pl: Wstrzymuje ekran powitalny po zakończeniu wczytywania, umożliwiając ręczne uruchomienie dodatku Dynamo, zalogowanie się na konto Autodesk lub zaimportowanie ustawień.
pt_br: Pausa a tela inicial quando o carregamento está completo, permitindo que você inicie o Dynamo manualmente, entre na conta da Autodesk Account ou importe as configurações.
ru_ru: Приостановка вывода экрана-заставки по завершении загрузки, позволяющая запустить Dynamo вручную, выполнить вход в учетную запись на портале Autodesk Account или импортировать настройки.
zh_cn: 载入完成后暂停启动屏幕，以使您能够手动启动 Dynamo、登录到 Autodesk 帐户或输入设置。
zh_tw: 載入完成後暫停啟動畫面，讓您手動啟動 Dynamo，登入您的 Autodesk 帳戶，或匯入設定。

# LogoutMenuItemText
source: Sign Out
cs_cz: Odhlásit
de_de: Abmelden
es_es: Cerrar sesión
fr_fr: Se déconnecter
it_it: Esci
ja_jp: サインアウト
ko_kr: 로그아웃
pl_pl: Wyloguj się
pt_br: Sair
ru_ru: Выход
zh_cn: 注销
zh_tw: 登出

# SignInButtonText
source: Sign In
cs_cz: Přihlásit
de_de: Anmelden
es_es: Iniciar sesión
fr_fr: Se connecter
it_it: Accedi
ja_jp: サインイン
ko_kr: 로그인
pl_pl: Zaloguj się
pt_br: Entrar
ru_ru: Вход
zh_cn: 登录
zh_tw: 登入

# SigningInButtonText
source: Signing In
cs_cz: Přihlášení
de_de: Anmelden
es_es: Iniciando sesión
fr_fr: Connexion en cours
it_it: Accesso
ja_jp: サインインしています
ko_kr: 로그인 중
pl_pl: Logowanie
pt_br: Entrando
ru_ru: Выполняется вход
zh_cn: 正在登录
zh_tw: 正在登入

# RecentFileNumberInfo
source: Reducing this number will discard all recent files beyond your chosen number.
cs_cz: Snížením tohoto čísla budou zrušeny všechny poslední soubory mimo vámi vybrané číslo.
de_de: Wenn Sie diese Anzahl verringern, werden alle zuletzt verwendeten Dateien, die über diese Anzahl hinausgehen, verworfen.
es_es: Si se reduce este número, se descartarán todos los archivos recientes que superen el número seleccionado.
fr_fr: La réduction de ce nombre entraînera la suppression de tous les fichiers récents au-delà du nombre choisi.
it_it: La riduzione di questo numero eliminerà tutti i file recenti oltre il numero scelto.
ja_jp: この数を減らすと、選択した数を超える最近使用したファイルがすべて破棄されます。
ko_kr: 이 수를 줄이면 선택한 수를 초과하는 최근 파일이 모두 삭제됩니다.
pl_pl: Zmniejszenie tej liczby spowoduje odrzucenie wszystkich ostatnio używanych plików poza wybraną liczbą.
pt_br: Reduzir este número descartará todos os arquivos recentes além do número escolhido.
ru_ru: При уменьшении этого числа будут удалены все последние файлы, выходящие за рамки указанного значения.
zh_cn: 减少此编号将放弃所有超出所选编号的最近使用的文件。
zh_tw: 減少此數值將捨棄所有超出所選數值的最近使用檔案。

# WebView2RequiredMessage
source: Dynamo requires WebView2 Evergreen Runtime, which is not installed on your computer. Please use the link below to download the Evergreen Standalone Installer and install the program. Then relaunch Dynamo. \n\n#WebView2 Runtime Installer=https://developer.microsoft.com/en-us/microsoft-edge/webview2/#download-sectionedge/webview2/#download-section
cs_cz: Aplikace Dynamo vyžaduje aplikaci WebView2 Evergreen Runtime, která není nainstalována ve vašem počítači. Pomocí následujícího odkazu si stáhněte instalační program Evergreen Standalone a nainstalujte aplikaci. Poté znovu spusťte aplikaci Dynamo. \n\n#WebView2 Runtime Installer=https://developer.microsoft.com/en-us/microsoft-edge/webview2/#download-sectionedge/webview2/#download-section
de_de: Dynamo erfordert WebView2 Evergreen Runtime, das nicht auf Ihrem Computer installiert ist. Verwenden Sie den folgenden Link, um das Installationsprogramm für die Evergreen-Standalone-Version herunterzuladen und das Programm zu installieren. Starten Sie anschließend Dynamo neu. \n\n#WebView2 Runtime-Installationsprogramm=https://developer.microsoft.com/de-de/microsoft-edge/webview2/#download-sectionedge/webview2/#download-section
es_es: Dynamo requiere WebView2 Evergreen Runtime, que no está instalado en el equipo. Utilice el vínculo siguiente para descargar el instalador independiente de Evergreen e instalar el programa. A continuación, vuelva a iniciar Dynamo. \n\n#WebView2 Runtime Installer=https://developer.microsoft.com/es-es/microsoft-edge/webview2/#download-sectionedge/webview2/#download-section
fr_fr: Dynamo requiert WebView2 Evergreen Runtime, qui n'est pas installé sur votre ordinateur. Utilisez le lien ci-dessous pour télécharger le programme d'installation de l'application autonome Evergreen et installer le programme. Relancez ensuite Dynamo. \n\n#WebView2 Runtime Installer=https://developer.microsoft.com/fr-fr/microsoft-edge/webview2/#download-sectionedge/webview2/#download-section
it_it: Dynamo richiede WebView2 Evergreen Runtime, che non è installato nel computer. Utilizzare il collegamento seguente per scaricare Evergreen Standalone Installer e installare il programma. Quindi riavviare Dynamo. \n\n#Programma di installazione di WebView2 Runtime=https://developer.microsoft.com/it-it/microsoft-edge/webview2/#download-sectionedge/webview2/#download-section
ja_jp: Dynamo には WebView2 Evergreen Runtime が必要ですが、お使いのコンピュータにはインストールされていません。次のリンクを使用して Evergreen Standalone インストーラをダウンロードし、プログラムをインストールした後 Dynamo を再起動してください。\n\n#WebView2 Runtime Installer=https://developer.microsoft.com/ja-jp/microsoft-edge/webview2/#download-sectionedge/webview2/#download-section
ko_kr: Dynamo를 사용하려면 WebView2 Evergreen Runtime이 필요합니다. 이 런타임은 컴퓨터에 설치되어 있지 않습니다. 아래 링크를 사용하여 Evergreen 독립 실행형 설치 프로그램을 다운로드하고 프로그램을 설치하십시오. 그런 다음 Dynamo를 다시 시작하십시오. \n\n#WebView2 Runtime 설치 프로그램=https://developer.microsoft.com/ko-kr/microsoft-edge/webview2/#download-sectionedge/webview2/#download-section
pl_pl: Dodatek Dynamo wymaga środowiska WebView2 Evergreen Runtime, które nie jest zainstalowane na komputerze. Użyj poniższego łącza, aby pobrać autonomiczny instalator oprogramowania Evergreen i zainstalować program. Następnie ponownie uruchom dodatek Dynamo. \n\n#WebView2 Runtime Installer=https://developer.microsoft.com/en-us/microsoft-edge/webview2/#download-sectionedge/webview2/#download-section
pt_br: O Dynamo requer o WebView2 Evergreen Runtime, que não está instalado no computador. Use o link abaixo para fazer o download do instalador independente do Evergreen e instalar o programa. Em seguida, reinicie o Dynamo. \n\n#WebView2 Runtime Installer=https://developer.microsoft.com/pt-br/microsoft-edge/webview2/#download-sectionedge/webview2/#download-section
ru_ru: Для Dynamo требуется автоматически обновляемая среда выполнения WebView2, которая не установлена на компьютере. Перейдите по указанной ниже ссылке, чтобы скачать установщик однопользовательской автоматически обновляемой программы и установить ее. Затем перезапустите Dynamo. \n\n#Установщик среды выполнения WebView2=https://developer.microsoft.com/ru-ru/microsoft-edge/webview2/#download-sectionedge/webview2/#download-section
zh_cn: Dynamo 需要 WebView2 Evergreen Runtime，但在计算机上并未安装。请使用下面的链接下载 Evergreen 独立安装程序并安装该程序。然后，重新启动 Dynamo。\n\n#WebView2 Runtime Installer=https://developer.microsoft.com/zh-cn/microsoft-edge/webview2/#download-sectionedge/webview2/#download-section
zh_tw: Dynamo 需要 WebView2 永久執行階段，但此程式未安裝在您的電腦上。請使用以下連結下載「永久獨立安裝程式」並安裝此程式。然後重新啟動 Dynamo。\n\n#WebView2 Runtime 安裝程式=https://developer.microsoft.com/zh-tw/microsoft-edge/webview2/#download-sectionedge/webview2/#download-section

# WebView2RequiredTitle
source: WebView2 Required
cs_cz: Je vyžadován WebView2.
de_de: WebView2 erforderlich
es_es: WebView2 necesario
fr_fr: Vue Web2 requise
it_it: Richiesto WebView2
ja_jp: WebView2 が必要です
ko_kr: WebView2 필요
pl_pl: Wymagany widok siatki WebView2
pt_br: WebView2 necessário
ru_ru: Требуется WebView2
zh_cn: 需要 WebView2
zh_tw: 需要 WebView2

# DynamoViewFileMenuInsert
source: Insert...
cs_cz: Vložit...
de_de: Einfügen...
es_es: Insertar...
fr_fr: Insérer…
it_it: Inserisci...
ja_jp: 挿入...
ko_kr: 삽입...
pl_pl: Wstaw...
pt_br: Inserir...
ru_ru: Вставить...
zh_cn: 插入...
zh_tw: 插入...

# DynamoViewRunTypesAutomaticToolTip
source: Graph changes are executed in real time. Best suited for smaller graphs, known graphs, and Dynamo Sandbox.
cs_cz: Změny grafu se provádějí v reálném čase. Tato možnost se nejlépe hodí pro menší grafy, známé grafy a karanténu zabezpečení aplikace Dynamo.
de_de: Diagrammänderungen werden in Echtzeit ausgeführt. Am besten geeignet für kleinere Diagramme, bekannte Diagramme und Dynamo Sandbox.
es_es: Los cambios realizados en el gráfico se ejecutan en tiempo real. Es más adecuado para gráficos conocidos y de menor tamaño, además de para Dynamo Sandbox.
fr_fr: Les modifications apportées au graphique sont exécutées en temps réel. Cela convient mieux aux graphiques plus petits, aux graphiques connus et à Dynamo Sandbox.
it_it: Le modifiche del grafico vengono eseguite in tempo reale. L'ideale per grafici di dimensioni più piccole, grafici noti e Dynamo Sandbox.
ja_jp: グラフの変更はリアルタイムで実行されます。小さいグラフ、既知のグラフ、DynamoSandbox に最適です。
ko_kr: 그래프 변경 사항이 실시간으로 실행됩니다. 더 작은 그래프, 알려진 그래프 및 Dynamo Sandbox에 가장 적합합니다.
pl_pl: Zmiany w wykresach są wykonywane w czasie rzeczywistym. Najlepiej nadaje się do mniejszych wykresów, znanych wykresów i trybu Dynamo Sandbox.
pt_br: As alterações dos gráficos são executadas em tempo real. Mais adequado para gráficos menores, gráficos conhecidos e Dynamo Sandbox.
ru_ru: Изменения графиков выполняются в реальном времени. Рекомендуется использовать для небольших, известных графиков и Dynamo Sandbox.
zh_cn: 图形更改会实时执行。最适合较小的图形、已知图形和 Dynamo Sandbox。
zh_tw: 圖表變更會即時執行。最適合較小的圖表、熟知的圖表和 Dynamo Sandbox。

# DynamoViewRunTypesComboBoxToolTipEnabled
source: Run mode\n\nControls when graph changes are executed.
cs_cz: Režim spuštění\n\nŘídí, kdy jsou prováděny změny grafu.
de_de: Ausführungsmodus\n\nSteuert, wann Diagrammänderungen ausgeführt werden.
es_es: Modo de ejecución\n\nControla cuándo se ejecutan los cambios realizados en el gráfico.
fr_fr: Exécutez mode\n\nContrôle l'exécution des modifications des graphiques.
it_it: Modalità di esecuzione\n\nControlla quando vengono eseguite le modifiche al grafico.
ja_jp: 実行モード\n\nグラフが変更されたときの動作をコントロールします。
ko_kr: 실행 모드\n\n그래프 변경 사항이 실행되는 경우를 제어합니다.
pl_pl: Tryb uruchamiania\n\nSteruje tym, kiedy są wykonywane zmiany w wykresie.
pt_br: Execute o modo\n\nControla quando as alterações dos gráficos são executadas.
ru_ru: Режим запуска\n\nОпределение того, когда следует выполнить изменения графика.
zh_cn: 运行模式\n\n控制图形更改何时执行。
zh_tw: 執行模式\n\n控制何時執行圖表變更。

# DynamoViewRunTypesManualToolTip
source: Graph changes are executed when you click Run. Use this mode when working in large graphs, unfamiliar graphs, or host applications.
cs_cz: Změny grafu se provádějí po kliknutí na tlačítko Spustit. Tento režim použijte při práci s velkými grafy, neznámými grafy nebo hostitelskými aplikacemi.
de_de: Diagrammänderungen werden ausgeführt, wenn Sie auf Ausführen klicken. Verwenden Sie diesen Modus, wenn Sie mit großen Diagrammen, unbekannten Diagrammen oder Host-Anwendungen arbeiten.
es_es: Los cambios realizados en el gráfico se ejecutan al hacer clic en Ejecutar. Utilice este modo cuando trabaje con gráficos grandes o desconocidos, o aplicaciones anfitrionas.
fr_fr: Les modifications apportées au graphique sont exécutées lorsque vous cliquez sur Exécuter. Utilisez ce mode lorsque vous travaillez dans des graphiques volumineux, des graphiques inconnus ou des applications hôtes.
it_it: Le modifiche del grafico vengono eseguite quando si fa clic su Esegui. Utilizzare questa modalità quando si lavora in grafici di grandi dimensioni, grafici non familiari o applicazioni host.
ja_jp: グラフの変更は、[実行]をクリックしたときに実行されます。このモードは、大きなグラフ、不明なグラフ、またはホスト アプリケーションで作業するときに使用します。
ko_kr: 실행을 클릭하면 그래프 변경 사항이 실행됩니다. 큰 그래프, 익숙하지 않은 그래프 또는 호스트 응용프로그램에서 작업할 때 이 모드를 사용합니다.
pl_pl: Zmiany w wykresach są wykonywane po kliknięciu przycisku Uruchom. Ten tryb jest odpowiedni do pracy z dużymi wykresami, nieznanymi wykresami oraz aplikacjami nadrzędnymi.
pt_br: As alterações dos gráficos são executadas quando você clica em Executar. Use esse modo para trabalhar em gráficos grandes, gráficos desconhecidos ou aplicativos hospedeiros.
ru_ru: Изменения графика выполняются при нажатии кнопки «Запуск». Этот режим используется при работе с большими и незнакомыми графиками и основными программами.
zh_cn: 图形更改会在您单击“运行”时执行。在处理大型图形、不熟悉的图形或主机应用程序时，请使用此模式。
zh_tw: 當您按一下「執行」時會執行圖表變更。在大型圖表、不熟悉的圖表或主體應用程式中工作時，請使用此模式。

# DynamoViewRunTypesPeriodicToolTip
source: Graph changes are executed at a specified interval. Only available when the graph contains specific nodes, such as DateTime.Now or WebRequest.
cs_cz: Změny grafu se provádějí v zadanám intervalu. Tato funkce je k dispozici pouze pokud graf obsahuje specifické uzly, například DateTime.Now nebo WebRequest.
de_de: Diagrammänderungen werden in angegebenen Abständen ausgeführt. Dies ist nur verfügbar, wenn das Diagramm bestimmte Blöcke enthält, zum Beispiel DateTime.Now oder WebRequest.
es_es: Los cambios realizados en el gráfico se ejecutan en un intervalo especificado. Solo está disponible cuando el gráfico contiene nodos específicos, como DateTime.Now o WebRequest.
fr_fr: Les modifications apportées au graphique sont exécutées à un intervalle spécifié. Disponible uniquement lorsque le graphique contient des noeuds spécifiques, tels que DateTime.Now ou WebRequest.
it_it: Le modifiche al grafico vengono eseguite ad un intervallo specificato. Disponibile solo quando il grafico contiene nodi specifici, ad esempio DateTime.Now o WebRequest.
ja_jp: グラフの変更は指定した間隔で実行されます。グラフに DateTime.Now や WebRequest などの特定のノードが含まれている場合にのみ使用できます。
ko_kr: 그래프 변경 사항이 지정된 간격으로 실행됩니다. 그래프에 DateTime.Now 또는 WebRequest와 같은 특정 노드가 포함되어 있는 경우에만 사용할 수 있습니다.
pl_pl: Zmiany wykresu są wykonywane w określonych odstępach czasu. Dostępne tylko wtedy, gdy wykres zawiera określone węzły, takie jak DateTime.Now lub WebRequest.
pt_br: As alterações dos gráficos são executadas em um intervalo especificado. Disponível somente quando o gráfico contém nós específicos, como DateTime.Now ou WebRequest.
ru_ru: Изменения графика выполняются с заданным интервалом. Доступно, только если график содержит определенные узлы, такие как DateTime.Now или WebRequest.
zh_cn: 图形更改会以指定的间隔执行。仅当图形包含特定节点(如 DateTime.Now 或 WebRequest)时才可用。
zh_tw: 圖表變更會以指定的間隔執行。只有當圖表包含特定節點 (例如 DateTime.Now 或 WebRequest) 時才能使用。
