Repository: DynamoDS/Dynamo
Catalog: src/DynamoCoreWpf/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# MessageToUndeprecatePackage
source: Are you sure you want to undeprecate {0} ? This request will be rejected if you are not a maintainer of the package. It indicates that you will continue to support the package and the package will appear when users are browsing packages. You can always re-deprecate the package.
cs_cz: Opravdu chcete odmítnout {0}? Tento požadavek bude zamítnut, pokud aktuálně nemáte na starosti údržbu balíčku. To znamená, že budete nadále podporovat balíček a balíček se zobrazí, když uživatelé procházejí balíčky. Odmítnutí balíčku můžete vždy zrušit.
de_de: Möchten Sie die Markierung von {0} als veraltet wirklich aufheben? Diese Anforderung wird abgelehnt, wenn Sie kein Maintainer des Pakets sind. Dies zeigt an, dass Sie das Paket weiterhin unterstützen und dass dieses angezeigt wird, wenn die Benutzer nach Paketen suchen. Sie können das Paket jederzeit erneut als veraltet markieren.
es_es: ¿Seguro que desea anular la obsolescencia de {0}? Esta solicitud no se aceptará si usted no es el mantenedor del paquete. Indica que seguirá admitiendo el paquete y que el paquete aparecerá cuando los usuarios naveguen por los paquetes. Siempre puede volver a declarar obsoleto el paquete.
fr_fr: Êtes-vous sûr de vouloir annuler la révocation de {0}? Cette demande sera rejetée si vous n'êtes pas un gestionnaire du package. Elle indique que vous allez continuer à prendre en charge le package et que ce dernier apparaîtra lorsque les utilisateurs parcourent les packages. Vous pouvez toujours révoquer de nouveau le package.
it_it: Ripristinare il pacchetto obsoleto {0}? Se l'utente che esegue la richiesta non è un gestore del pacchetto, la richiesta verrà rifiutata. Se si procede, il pacchetto continuerà ad essere supportato e verrà visualizzato dagli utenti. È possibile impostare il pacchetto come obsoleto in un secondo momento.
ja_jp: {0} の廃止を解除してもよろしいですか? あなたがパッケージを保持していない場合は、この要求は拒否されます。廃止を解除すると、引き続きパッケージをサポートすることができ、ユーザがパッケージを参照するとパッケージが表示されます。 パッケージはいつでも再廃止できます。
ko_kr: {0} 사용 중단을 취소하시겠습니까? 패키지의 유지 담당자가 아닌 경우 요청이 거부됩니다. 사용 중단 취소는 패키지를 계속 지원하며 사용자가 패키지를 탐색할 때 패키지가 표시된다는 것을 나타냅니다. 언제든지 패키지를 다시 사용 중단할 수 있습니다.
pl_pl: Czy na pewno chcesz przywrócić {0}? Żądanie zostanie odrzucone, jeśli użytkownik nie jest administratorem pakietu. Oznacza to, że użytkownik będzie nadal obsługiwać pakiet i pakiet będzie wyświetlany, gdy użytkownicy przeglądają pakiety. Zawsze można cofnąć przywrócenie pakietu.
pt_br: Você tem certeza de que deseja cancelar a obsolescência {0}? Esta solicitação será rejeitada se você não for um mantenedor do pacote. Isso indica que você irá continuar a suportar o pacote e o pacote irá aparecer quando os usuários estiverem procurando por pacotes. Você pode sempre cancelar a obsolescência do pacote.
ru_ru: Вы действительно хотите отменить исключение {0}? Этот запрос будет отклонен, если вы не являетесь разработчиком этого пакета. Это означает, что вы продолжите обслуживать данный пакет, и он будет отображаться при просмотре пользователями пакетов. Всегда можно исключить пакет повторно.
zh_cn: 是否确实要取消弃用 {0}？如果您不是该软件包的维护人员，则该请求将被拒绝。这表示您将继续支持该软件包，当用户正在浏览软件包时该软件包会出现。 您始终可以再次弃用该软件包。
zh_tw: 您確定要取消棄用{0}嗎？如果您不是套件的維護者，此請求將被拒絕。 這表示您將繼續支援套件，而且在使用者瀏覽套件時，套件將會出現。 您可以永遠重新棄用套件。

# MessageForceInstallOrUninstallToContinue
source: Package {0} has one or more dependencies that conflict with the following packages that are in use in the workspace: {1}. Dependency conflicts could cause unintended behavior to occur. Do you wish to continue installing it while keeping the packages that are already installed? If not, {2} needs to uninstall {1} to continue but cannot as they are in use. Try restarting {2} and download {0} again.
cs_cz: Balíček {0} má jednu nebo více závislostí, které jsou v konfliktu s následujícími balíčky, které jsou používány v pracovním prostoru: {1}. Konflikty závislostí by mohly způsobit nežádoucí chování. Chcete pokračovat v instalaci a zachovat již nainstalované balíčky? Pokud ne, {2} potřebuje odinstalovat {1}, abyste mohli pokračovat, ale zatím to není možné, protože se právě používají. Zkuste restartovat {2} a stáhnout {0} znovu.
de_de: Paket {0} verfügt über mindestens eine Abhängigkeit, die mit den folgenden im Arbeitsbereich verwendeten Paketen in Konflikt steht: {1}. Abhängigkeitskonflikte können zu unbeabsichtigtem Verhalten führen. Möchten Sie die Installation fortsetzen und die bereits installierten Pakete beibehalten? Anderenfalls muss {2} {1} deinstallieren, um fortzufahren, was jedoch nicht möglich ist, da sie verwendet werden. Starten Sie {2} erneut, und laden Sie {0} noch einmal herunter.
es_es: El paquete {0} presenta una o más dependencias que entran en conflicto con los siguientes paquetes que están en uso en el espacio de trabajo: {1}. Los conflictos de dependencia pueden provocar un comportamiento no deseado. ¿Desea seguir instalándolo al mismo tiempo que conserva los paquetes instalados? Si no es así, {2} debe desinstalar {1} para continuar, pero no puede mientras estén en uso. Intente reiniciar {2} y descargar {0} de nuevo.
fr_fr: Le package {0} possède une ou plusieurs dépendances qui sont en conflit avec les packages suivants utilisés dans l'espace de travail: {1}. Les conflits de dépendance peuvent entraîner un comportement inattendu. Voulez-vous continuer l'installation tout en conservant les packages déjà installés? Si ce n'est pas le cas, {2} doit désinstaller {1} pour continuer, mais ne peut pas le faire, car ils sont en cours d'utilisation. Essayez de redémarrer {2} et de télécharger {0} à nouveau.
ko_kr: 패키지 {0}에 작업공간에서 사용 중인 {1} 패키지와 충돌하는 종속성이 하나 이상 있습니다. 종속성 충돌로 인해 의도하지 않은 동작이 발생할 수 있습니다. 이미 설치되어 있는 패키지를 유지하면서 설치를 계속하시겠습니까? 그렇지 않은 경우 계속하려면 {2}에서 {1}을(를) 설치제거해야 하지만, 사용 중이므로 설치제거할 수 없습니다. {2}을(를) 다시 시작하고 {0}을 다시 다운로드해 보십시오.
pl_pl: Pakiet {0} ma co najmniej jedną zależność powodującą konflikt z następującymi pakietami używanymi w obszarze roboczym: {1}. Konflikty zależności mogą spowodować niezamierzone zachowanie. Czy chcesz kontynuować instalowanie pakietu, zachowując pakiety, które są już zainstalowane? Jeśli nie, oprogramowanie {2} musi odinstalować {1}, aby kontynuować, ale nie może, ponieważ te składniki są w użyciu. Uruchom ponownie oprogramowanie {2}, a następnie ponownie pobierz pakiet {0}.
pt_br: O pacote {0} tem uma ou mais dependências que entram em conflito com os seguintes pacotes que estão em uso no espaço de trabalho: {1}. Os conflitos de dependências podem causar comportamento não intencional. Deseja continuar a instalação mantendo os pacotes que já estão instalados? Em caso negativo, o {2} precisa desinstalar o {1} para continuar, mas não é possível, pois ambos estão em uso. Tente reiniciar o {2} e fazer o download de {0} novamente.
ru_ru: Пакет {0} имеет одну или несколько зависимостей, которые конфликтуют со следующими пакетами, используемыми в рабочем пространстве: {1}. Конфликты зависимостей могут привести к непредвиденному поведению. Продолжить установку, не удаляя уже установленные пакеты? В противном случае {2} необходимо удалить {1} для продолжения работы, однако это невозможно, так как они используются. Попробуйте перезапустить {2}, а затем повторно скачайте {0}.
zh_cn: 软件包 {0} 的一个或多个依存关系与工作空间中已在使用的以下软件包冲突: {1}. 依存关系冲突可能会导致发生意外行为。 是否要在保留已安装的软件包的情况下继续安装它？ 如果不是，{2} 需要卸载 {1} 才能继续，但在它们已在使用的情况下无法卸载。尝试重新启动 {2}，然后再次下载 {0}。

# MessageForceInstallOrUninstallUponRestart
source: Package {0} has one or more dependencies that conflict with the following package(s): {1} If you continue to install the package, unintended behavior may occur. To avoid unintended behavior, uninstall the conflicting loaded package(s), restart Dynamo, and download {0} again.
cs_cz: Balíček {0} má jednu nebo více závislostí, které jsou v konfliktu s následujícími balíčky: {1} Pokud budete pokračovat v instalaci, konflikty závislostí by mohly způsobit nežádoucí chování. Chcete-li se tomuto vyhnout, odinstalujte načtené balíčky způsobující konflikt, restartujte aplikaci Dynamo a znovu stáhněte balíček {0}.
de_de: Paket {0} verfügt über mindestens eine Abhängigkeit, die einen Konflikt mit folgenden Paketen verursacht: {1} Wenn Sie mit der Installation des Pakets fortfahren, kann dies zu unbeabsichtigtem Verhalten führen. Deinstallieren Sie die geladenen Pakete, die Konflikte verursachen, starten Sie Dynamo erneut, und laden Sie {0} noch einmal herunter, um unbeabsichtigtes Verhalten zu vermeiden.
es_es: El paquete {0} presenta una o más dependencias que entran en conflicto con los siguientes paquetes: {1} Si continúa con la instalación del paquete, puede producirse un comportamiento inesperado. Para evitar tal comportamiento, desinstale el paquete o los paquetes cargados que generan el conflicto, reinicie Dynamo y vuelva a descargar {0}.
fr_fr: Le package {0} a une ou plusieurs dépendances qui sont en conflit avec les packages suivants: {1} Si vous poursuivez l'installation du package, un comportement inattendu peut se produire. Pour éviter tout comportement inattendu, désinstallez les packages chargés à l'origine du conflit, redémarrez Dynamo et téléchargez {0} à nouveau.
it_it: Il pacchetto {0} presenta una o più dipendenze in conflitto con i seguenti pacchetti: {1} Se si continua ad installare il pacchetto, potrebbe verificarsi un funzionamento imprevisto. Per evitare ciò, disinstallare i pacchetti caricati in conflitto, riavviare Dynamo e scaricare nuovamente {0}.
ja_jp: パッケージ {0} には、以下のパッケージと競合する 1 つ以上の依存関係があります: {1} このパッケージのインストールを続行すると、予期しない動作が発生する可能性があります。 予期しない動作を回避するには、ロード済みの競合するパッケージをアンインストールし、Dynamo を再起動して、再度 {0} をダウンロードします。
ko_kr: {0} 패키지에 다음 패키지와 충돌하는 종속성이 하나 이상 있습니다. {1} 패키지 설치를 계속하면 의도하지 않은 동작이 발생할 수 있습니다. 의도하지 않은 동작을 방지하려면 충돌하는 로드된 패키지를 설치제거하고 Dynamo를 다시 시작한 후 {0}을(를) 다시 다운로드하십시오.
pl_pl: Pakiet {0} ma co najmniej jedną zależność powodującą konflikt z następującymi pakietami: {1} W przypadku kontynuowania instalowania pakietu może wystąpić nieoczekiwane zachowanie. Aby uniknąć nieoczekiwanego zachowania, odinstaluj wczytane pakiety powodujące konflikt, uruchom ponownie dodatek Dynamo i ponownie pobierz pakiet {0}.
pt_br: O pacote {0} tem uma ou mais dependências que entram em conflito com os seguintes pacotes: {1} Se você continuar com a instalação do pacote, poderá correr comportamento não intencional. Para evitar esse comportamento, desinstale os pacotes carregados que entram em conflito, reinicie o Dynamo e faça o download de {0} novamente.
ru_ru: Пакет {0} имеет одну или несколько зависимостей, конфликтующих со следующими пакетами: {1} Дальнейшая установка пакета может привести к непредвиденному поведению. Во избежание такой ситуации удалите загруженные конфликтующие пакеты, перезапустите Dynamo и повторно скачайте {0}.
zh_cn: 软件包 {0} 的一个或多个依存关系与以下软件包冲突: {1} 如果继续安装软件包，可能会发生意外行为。 要避免发生意外行为，请卸载冲突的已加载软件包、重新启动 Dynamo 并再次下载 {0}。
zh_tw: 套件 {0} 有一個或多個相依性與下列套件發生衝突: {1} 如果繼續安裝套件，可能會發生意外的行為。 若要避免發生意外的行為，請解除安裝已載入的衝突套件，重新啟動 Dynamo，然後再次下載 {0}。

# MessageUnkownErrorOpeningFile
source: Unknown error opening file: {0}
cs_cz: Neznámá chyba při otevírání souboru: {0}
de_de: Unbekannter Fehler beim Öffnen der Datei: {0}
es_es: Error desconocido al abrir archivo: {0}
fr_fr: Erreur inconnue lors de l'ouverture du fichier: {0}
it_it: Errore sconosciuto durante l'apertura del file: {0}
ja_jp: ファイルを開いているときに次の不明なエラーが発生しました: {0}
ko_kr: 파일을 여는 중 알 수 없는 오류 발생: {0}
pl_pl: Nieznany błąd podczas otwierania pliku: {0}
pt_br: Erro desconhecido ao abrir o arquivo: {0}
ru_ru: Неизвестная ошибка при открытии файла: {0}
zh_cn: 打开文件时出现未知错误: {0}
zh_tw: 開啟檔案時發生不明的錯誤: {0}

# MessageUnsavedChanges0
source: The following workspaces have not been saved:
cs_cz: Následující pracovní prostory nebyly uloženy:
de_de: Die folgenden Arbeitsbereiche wurden nicht gespeichert:
es_es: Los espacios de trabajo siguientes no se han guardado:
fr_fr: Les espaces de travail suivants n'ont pas été enregistrés:
it_it: Le aree di lavoro seguenti non sono state salvate:
ja_jp: 次のワークスペースが保存されていません。
ko_kr: 다음 작업공간이 저장되지 않았습니다:
pl_pl: Następujące obszary robocze nie zostały zapisane:
pt_br: Os seguintes espaços de trabalho não foram salvos:
ru_ru: Следующие рабочие пространства не были сохранены:
zh_cn: 以下工作空间尚未保存:
zh_tw: 以下工作區尚未儲存：

# MessageUnsavedChanges1
source: . Please save them and try again.
cs_cz: . Uložte je a zkuste to znovu.
de_de: . Bitte speichern Sie sie, und versuchen Sie es erneut.
es_es: . Guárdelos y vuelva a intentarlo.
fr_fr: . Veuillez les enregistrer et essayez à nouveau.
it_it: . Salvarli e riprovare.
ja_jp: 保存して再度実行してください。
ko_kr: . 저장하고 다시 해보십시오.
pl_pl: . Zapisz je i spróbuj ponownie.
pt_br: . Salve e tente novamente.
ru_ru: . Сохраните их и повторите попытку.
zh_cn: 。 请先保存，然后重试。
zh_tw: 。 請儲存它們，然後再試一次。

# MinorVersionNonNegative
source: You must provide a Minor version as a non-negative integer.
cs_cz: Verzi Vedlejší je třeba zadat jako nezáporné celé číslo.
de_de: Geben Sie eine Nebenversion als nicht negative Ganzzahl an.
es_es: Debe proporcionar una versión secundaria como entero no negativo
fr_fr: Vous devez fournir une version Minor sous la forme d’un nombre entier non négatif.
it_it: È necessario specificare una versione secondaria come numero intero non negativo.
ja_jp: マイナー バージョンを負ではない整数で指定する必要があります。
ko_kr: 보조 버전을 음이 아닌 정수로 입력해야 합니다.
pl_pl: Należy podać wersję pośrednią jako nieujemną liczbę całkowitą.
pt_br: Você deve fornecer uma versão secundária como um inteiro não negativo.
ru_ru: Необходимо ввести вспомогательную версию в виде целого числа, не являющегося отрицательным.
zh_cn: 必须提供一个次版本作为非负整数。
zh_tw: 您必須提供非負整數的次要版本。

# MoreButton
source: More
cs_cz: Více
de_de: Mehr
es_es: Más
fr_fr: Plus
it_it: Altro
ja_jp: 詳細
ko_kr: 자세히
pl_pl: Więcej
pt_br: Mais
ru_ru: Больше
zh_cn: 更多
zh_tw: 更多

# NameNeedMoreCharacters
source: Name must be at least 3 characters.
cs_cz: Název musí obsahovat alespoň tři znaky.
de_de: Muss mindestens drei Zeichen lang sein
es_es: Debe tener al menos 3 caracteres.
fr_fr: Doit comporter au moins 3 caractères.
it_it: Deve contenere almeno 3 caratteri.
ja_jp: 3 文字以上にする必要があります
ko_kr: 3자 이상이어야 합니다.
pl_pl: Musi zawierać co najmniej 3 znaki.
pt_br: Deve ter pelo menos 3 caracteres.
ru_ru: Должно быть не менее 3 символов
zh_cn: 必须至少包含 3 个字符
zh_tw: 必須至少 3 個字元。

# NodeContextMenuEnablePeriodicUpdate
source: Enable Periodic Update
cs_cz: Povolit pravidelné aktualizace
de_de: Regelmäßige Aktualisierung aktivieren
es_es: Activar actualización periódica
fr_fr: Activer la mise à jour régulière
it_it: Attiva aggiornamento periodico
ja_jp: 定期的な更新を有効にする
ko_kr: 주기적 업데이트 사용
pl_pl: Włącz okresową aktualizację
pt_br: Ativar atualização periódica
ru_ru: Включить периодическое обновление
zh_cn: 启用定期更新
zh_tw: 啟用定期更新

# NodeContextMenuHelp
source: Help...
cs_cz: Nápověda…
de_de: Hilfe...
es_es: Ayuda...
fr_fr: Aide...
ja_jp: ヘルプ...
ko_kr: 도움말...
pl_pl: Pomoc...
pt_br: Ajuda...
ru_ru: Справка...
zh_cn: 帮助...
zh_tw: 說明...

# NodeContextMenuIsInput
source: Is Input
cs_cz: Je vstup
de_de: Ist Eingabe
es_es: Es entrada
fr_fr: Est une entrée
it_it: È input
ja_jp: 入力
ko_kr: 입력임
pl_pl: Obecne dane wejściowe
pt_br: É entrada
ru_ru: Является вводом
zh_cn: 是输入
zh_tw: 是輸入

# NodeContextMenuIsOutput
source: Is Output
cs_cz: Je výstup
de_de: Ist Ausgabe
es_es: Se genera
fr_fr: Est une sortie
it_it: È output
ja_jp: 出力
ko_kr: 출력임
pl_pl: Obecne dane wyjściowe
pt_br: É saída
ru_ru: Является выводом
zh_cn: 为输出
zh_tw: 是輸出

# NodeContextMenuPreview
source: Preview Geometry
cs_cz: Náhled geometrie
de_de: Geometrievorschau
es_es: Vista preliminar de geometría
fr_fr: Aperçu de la géométrie
it_it: Anteprima geometria
ja_jp: ジオメトリをプレビュー
ko_kr: 형상 미리보기
pl_pl: Podgląd geometrii
pt_br: Visualizar geometria
ru_ru: Предварительный просмотр геометрии
zh_cn: 预览几何图形
zh_tw: 預覽幾何圖形

# NodeContextMenuRenameNode
source: Rename
cs_cz: Přejmenovat
de_de: Umbenennen
es_es: Cambiar nombre
fr_fr: Renommer
it_it: Rinomina
ja_jp: 名前変更
ko_kr: 이름 바꾸기
pl_pl: Zmień nazwę
pt_br: Renomear
ru_ru: Переименовать
zh_cn: 重命名
zh_tw: 更名

# NodeContextMenuShowLabels
source: Show Labels
cs_cz: Zobrazit popisky
de_de: Bezeichnungen anzeigen
es_es: Mostrar etiquetas
fr_fr: Afficher les libellés
it_it: Mostra etichette
ja_jp: ラベルを表示
ko_kr: 레이블 표시
pl_pl: Pokaż etykiety
pt_br: Mostrar legendas
ru_ru: Показать метки
zh_cn: 显示标签
zh_tw: 展示標籤

# NodeHelpWindowNodeCategory
source: CATEGORY
cs_cz: KATEGORIE
de_de: Kategorie
es_es: CATEGORÍA
fr_fr: Catégorie
it_it: CATEGORIA
ja_jp: カテゴリ
ko_kr: 카테고리
pl_pl: KATEGORIA
pt_br: Categoria
ru_ru: КАТЕГОРИЯ
zh_cn: 类别
zh_tw: 品類

# NodeHelpWindowNodeDescription
source: DESCRIPTION
cs_cz: POPIS
de_de: Beschreibung
es_es: DESCRIPCIÓN
it_it: DESCRIZIONE
ja_jp: 説明
ko_kr: 설명
pl_pl: OPIS
pt_br: Descrição
ru_ru: ОПИСАНИЕ
zh_cn: 说明
zh_tw: 描述

# NodeHelpWindowNodeInput
source: INPUTS
cs_cz: VSTUPY
de_de: Eingaben
es_es: ENTRADAS
fr_fr: Entrées
it_it: INPUT
ja_jp: 入力
ko_kr: 입력
pl_pl: DANE WEJŚCIOWE
pt_br: ENTRADAS
ru_ru: ВХОДНЫЕ ДАННЫЕ
zh_cn: 输入
zh_tw: 輸入

# NodeHelpWindowNodeOutput
source: OUTPUTS
cs_cz: VÝSTUPY
de_de: Ausgaben
es_es: SALIDAS
fr_fr: SORTIES
it_it: OUTPUT
ja_jp: 出力
ko_kr: 출력
pl_pl: DANE WYJŚCIOWE
pt_br: SAÍDAS
ru_ru: ВЫВОДЫ
zh_cn: 输出
zh_tw: 輸出

# NodeHelpWindowNodeType
source: NODE TYPE
cs_cz: TYP UZLU
de_de: Blocktyp
es_es: TIPO DE NODO
fr_fr: Type de noeud
it_it: TIPO DI NODO
ja_jp: ノード タイプ
ko_kr: 노드 유형
pl_pl: TYP WĘZŁA
pt_br: TIPO DE NÓ
ru_ru: ТИП УЗЛА
zh_cn: 节点类型
zh_tw: 節點類型

# NodesRunStatus
source: Freeze
cs_cz: Zmrazit
de_de: Anhalten
es_es: Bloquear
fr_fr: Geler
it_it: Congela
ja_jp: フリーズ
ko_kr: 동결
pl_pl: Zablokuj
pt_br: Congelar
ru_ru: Заморозить
zh_cn: 冻结
zh_tw: 凍結

# NodeViewCustomizationFindErrorMessage
source: There was an error while finding node view customizations for {0}. Contact the author of this assembly for more information.
cs_cz: Při hledání uživatelských úprav zobrazení uzlu pro položku {0} se vyskytla chyba. Chcete-li získat další informace, kontaktujte autora tohoto sestavení.
de_de: Bei der Suche nach Anpassungen der Blockansicht für {0} ist ein Fehler aufgetreten. Weitere Informationen erhalten Sie vom Autor dieser Assembly.
es_es: Se ha producido un error al buscar las personalizaciones de vista de nodo para {0}. Póngase en contacto con el autor de este ensamblaje para obtener más información.
fr_fr: Une erreur s'est produite lors de la recherche des personnalisations de vue de noeud de {0}. Contactez l'auteur de cet ensemble pour plus d'informations.
it_it: Errore durante la ricerca di personalizzazioni della visualizzazione nodo per {0}. Per ulteriori informazioni, contattare l'autore dell'assembly.
ja_jp: {0} のノード ビューのカスタマイズの検索中にエラーが発生しました。詳細については、このアセンブリの作成者に問い合わせてください。
ko_kr: {0}에 대한 노드 뷰 사용자화를 찾는 동안 오류가 발생했습니다. 자세한 정보는 조합 작성자에게 문의하십시오.
pl_pl: Wystąpił błąd podczas wyszukiwania niestandardowych widoków węzła dla {0}. Skontaktuj się z autorem tego zespołu, aby uzyskać więcej informacji.
pt_br: Ocorreu um erro ao localizar as personalizações da vista do nó para {0}. Contate o autor desta montagem para obter mais informações.
ru_ru: Ошибка при поиске адаптаций вида узла для {0}. Обратитесь к автору этой сборки для получения дополнительной информации.
zh_cn: 查找 {0} 的节点视图自定义时出错。请联系创建者以了解详细信息。
zh_tw: 尋找 {0} 的自訂節點視圖時發生錯誤。 聯絡此組合的作者以了解更多資訊。

# NoneString
source: none
cs_cz: žádné
de_de: Keine
es_es: ninguno
fr_fr: aucun
it_it: Nessuno
ja_jp: なし
ko_kr: 없음
pl_pl: brak
pt_br: nenhum
ru_ru: нет
zh_cn: 无
zh_tw: 無

# NoteViewContextMenuDelete
source: Delete
cs_cz: Odstranit
de_de: Löschen
es_es: Suprimir
fr_fr: Supprimer
it_it: Elimina
ja_jp: 削除
ko_kr: 삭제
pl_pl: Usuń
pt_br: Excluir
ru_ru: Удалить
zh_cn: 删除
zh_tw: 刪除

# NoteViewContextMenuEdit
source: Edit...
cs_cz: Upravit...
de_de: Bearbeiten...
es_es: Editar...
fr_fr: Modifier...
it_it: Modifica...
ja_jp: 編集...
ko_kr: 편집...
pl_pl: Edycja...
pt_br: Editar...
ru_ru: Редактировать...
zh_cn: 编辑...
zh_tw: 編輯...

# OneAssemblyWasLoadedSeveralTimesErrorMessage
source: Please, load assembly just one time. Next assemblies were loaded several times:
cs_cz: Načtěte sestavu pouze jednou. Několikrát byly načteny i další sestavy:
de_de: Bitte die Assembly nur einmal laden. Die nächsten Assemblys wurden mehrmals geladen:
es_es: Por favor, cargue los montajes solo una vez. Los siguientes montajes se han cargado varias veces:
fr_fr: Veuillez charger l'ensemble une seule fois. Les ensembles suivants ont été chargés plusieurs fois:
it_it: Si prega di caricare l'assieme solo una volta. Gli assiemi successivi sono stati caricati più volte:
ja_jp: アセンブリのロードは一回だけ実行するようにしてください。 次のアセンブリは複数回ロードされました:
ko_kr: 조립품을 한 번만 로드하십시오. 다음 조립품이 여러 번 로드되었습니다.
pl_pl: Zespół należy wczytać tylko jeden raz. Poniższe zespoły zostały wczytane wiele razy:
pt_br: Carregue a montagem apenas uma vez. As montagens a seguir foram carregadas diversas vezes:
ru_ru: Каждую сборку следует загружать только один раз. Следующие сборки были загружены несколько раз:
zh_cn: 请一次性加载部件。 后续部件会分几次加载:
zh_tw: 請只載入組合一次。 下一個組合已載入多次：

# OnlyTitle
source: only
cs_cz: pouze
de_de: Nur
es_es: solo
fr_fr: uniquement
it_it: Solo
ja_jp: のみ
ko_kr: 전용
pl_pl: tylko
pt_br: somente
ru_ru: только
zh_cn: 仅
zh_tw: 僅

# OpenDynamoDefinitionDialogTitle
source: Open {0} Definition...
cs_cz: Otevřít definici aplikace {0}...
de_de: {0} Definition öffnen...
es_es: Abrir definición de {0}...
fr_fr: Ouvrir la définition {0} ...
it_it: Apri definizione di {0}...
ja_jp: {0} 設定を開く...
ko_kr: {0} 정의 열기...
pl_pl: Otwórz definicję {0}…
pt_br: Abrir a definição {0}...
ru_ru: Открыть определение {0}...
zh_cn: 打开 {0} 定义...
zh_tw: 開啟 {0} 定義...

# PackageDownloadConfirmMessageBoxTitle
source: Package Download Confirmation
cs_cz: Potvrzení stažení balíčku
de_de: Bestätigung für Download von Paket
es_es: Confirmación de descarga de paquete
fr_fr: Confirmation du téléchargement du package
it_it: Conferma download pacchetto
ja_jp: パッケージのダウンロードの確認
ko_kr: 패키지 다운로드 확인
pl_pl: Potwierdzenie pobrania pakietu
pt_br: Confirmação do download do pacote
ru_ru: Подтверждение загрузки пакета
zh_cn: 软件包下载确认
zh_tw: 確認套件下載

# PackageDownloadErrorMessageBoxTitle
source: Package Download Error
cs_cz: Chyba při stahování balíčku
de_de: Fehler beim Herunterladen von Paket
es_es: Error de descarga de paquete
fr_fr: Erreur de téléchargement de package
it_it: Errore di download del pacchetto
ja_jp: パッケージのダウンロード エラー
ko_kr: 패키지 다운로드 오류
pl_pl: Błąd podczas pobierania pakietu
pt_br: Erro ao efetuar o download do pacote
ru_ru: Ошибка загрузки пакета
zh_cn: 软件包下载错误
zh_tw: 套件下載錯誤

# PackageDownloadMessageBoxTitle
source: Package Download
cs_cz: Stažení balíčku
de_de: Paket herunterladen
es_es: Descarga de paquetes
fr_fr: Téléchargement du package
it_it: Download pacchetto
ja_jp: パッケージのダウンロード
ko_kr: 패키지 다운로드
pl_pl: Pobieranie pakietu
pt_br: Download do pacote
ru_ru: Загрузка пакета
zh_cn: 软件包下载
zh_tw: 套件下載

# PackageDownloadStateDownloaded
source: Downloaded
cs_cz: Staženo
de_de: Heruntergeladen
es_es: Descargado
fr_fr: Téléchargé
it_it: Scaricato
ja_jp: ダウンロード済み
ko_kr: 다운로드
pl_pl: Pobrano
pt_br: Baixado
ru_ru: Загружено
zh_cn: 已下载
zh_tw: 已下載

# PackageDownloadStateDownloading
source: Downloading
cs_cz: Stahování
de_de: Herunterladen
es_es: Descargando
fr_fr: Téléchargement
it_it: Download in corso
ja_jp: ダウンロード中
ko_kr: 다운로드 중
pl_pl: Pobieranie
pt_br: Fazendo o download
ru_ru: Загрузка
zh_cn: 下载
zh_tw: 下載中

# PackageDownloadStateError
source: Error
cs_cz: Chyba
de_de: Fehler
fr_fr: Erreur
it_it: Errore
ja_jp: エラー
ko_kr: 오류
pl_pl: Błąd
pt_br: Erro
ru_ru: Ошибка
zh_cn: 错误
zh_tw: 錯誤

# PackageDownloadStateInstalled
source: Installed
cs_cz: Nainstalováno
de_de: Installiert
es_es: Instalado
fr_fr: Installé
it_it: Installato
ja_jp: インストール済み
ko_kr: 설치됨
pl_pl: Zainstalowany
pt_br: Instalado
ru_ru: Установлено
zh_cn: 已安装
zh_tw: 已安裝
