DSCore.ObjectComparer
Implementa la función Compare para dos objetos mediante la regla siguiente.
1. Se asume que los números son los más pequeños, seguidos de booleanos, cadenas y punteros.
2. Si ambos objetos son IComparable y del mismo tipo, se utiliza el mecanismo de comparación
nativo.
3. Si ambos objetos son de tipo valor, pero uno de ellos es booleano, este es mayor.
4. De lo contrario, se convierten todos a dobles y se comparan.
5. Si solo uno es de tipo valor, el objeto de tipo valor es más pequeño.
6. Si solo uno es una cadena, la cadena es más pequeña que el otro objeto.
7. Si no se sabe cómo comparar, se comparan según código hash.