DSCore.CurveMapper.LinearCurve
Representa una curva lineal en CurveMapper.
Una curva lineal es una línea recta entre dos puntos de control.

DSCore.CurveMapper.LinearCurve.LineEquation(System.Double)
Calcula los valores de Y (coordenadas del lienzo) para los valores de X mínimo y máximo.

DSCore.CurveMapper.LinearCurve.SolveForXGivenY(System.Double)
Calcula los valores de X (coordenadas del lienzo) para los valores de Y mínimo y máximo.

DSCore.CurveMapper.LinearCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Devuelve los valores de X e Y distribuidos a lo largo de la curva.