DSCore.CurveMapper.PowerCurve
Representa una curva de función de potencia en CurveMapper.
La curva se define mediante una ecuación de potencia derivada de un punto de control.

DSCore.CurveMapper.PowerCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Devuelve los valores de X e Y distribuidos a lo largo de la curva.