DSCore.IO.Image
Métodos para trabajar con imágenes de mapas de bits.

DSCore.IO.Image.ReadFromFile(System.IO.FileInfo)
Carga el archivo como mapa de bits.
file: Objeto de archivo desde el que cargar la imagen.
Objeto de imagen de archivo.

DSCore.IO.Image.Pixels(System.Drawing.Bitmap,System.Nullable{System.Int32},System.Nullable{System.Int32})
Lee un archivo de imagen y devuelve los valores de color en las ubicaciones de rejilla especificadas.
image: Objeto de imagen desde el que obtener colores de píxeles.
xSamples: Número de puntos de rejilla de muestra en la dirección X.
ySamples: Número de puntos de rejilla de muestra en la dirección Y.
Colores en los puntos de rejilla especificados.
read,image,bitmap,png,jpg,jpeg

DSCore.IO.Image.FromPixels(DSCore.Color[][])
Genera una imagen a partir de una lista 2D de píxeles.
colors: Lista 2D rectangular de colores que representan los píxeles.
Imagen de la lista 2D de píxeles.

DSCore.IO.Image.FromPixels(DSCore.Color[],System.Int32,System.Int32)
Genera una imagen a partir de una lista plana de píxeles, una anchura y una altura.
colors: Lista de colores que representan los píxeles.
width: Anchura de la nueva imagen en píxeles.
height: Altura de la nueva imagen en píxeles.
Imagen de la lista de píxeles.

DSCore.IO.Image.Dimensions(System.Drawing.Bitmap)
Devuelve la anchura y altura de una imagen.
image: Imagen cuyas dimensiones se deben obtener.
Anchura de la imagen en píxeles
Altura de la imagen en píxeles

DSCore.IO.Image.WriteToFile(System.String,System.Drawing.Bitmap)
Escribe la imagen en una ruta y se le da el nombre de archivo especificado.
image: La imagen que se debe escribir.
Objeto de imagen creado
write image,image,file,filepath