DSCore.Math
Métodos para realizar operaciones matemáticas.

DSCore.Math.Random(System.Nullable{System.Int32})
Genera un doble valor aleatorio en el rango de [0, 1).
seed: Valor de semilla del generador de números aleatorios.
Un número aleatorio entre 0 y 1.
random,seed

DSCore.Math.Random(System.Double,System.Double)
Genera un número aleatorio en el rango [lower_number, higher_number).
value1: Extremo inferior del rango del número aleatorio.
value2: Extremo superior del rango del número aleatorio.
Número aleatorio en el rango (número_inferior, número_superior).
random,numberrange

DSCore.Math.Random(System.Double,System.Double,System.Int32)
Genere un número aleatorio en el rango (número_inferior, número_superior) según un valor de semilla inicial.
value1: Extremo inferior del rango del número aleatorio.
value2: Extremo superior del rango del número aleatorio.
seed: Valor de semilla del generador de números aleatorios.
Número aleatorio en el rango (número_inferior, número_superior).
random,numberrange,seed

DSCore.Math.RandomList(System.Int32)
Genera una lista que contiene la cantidad especificada de dobles aleatorios
en el rango de [0, 1).
amount: Cantidad de números aleatorios que contendrá la lista resultante.
Lista de números aleatorios entre 0 y 1.
random,listcontains

DSCore.Math.RandomList(System.Int32,System.Double,System.Double,System.Int32)
Genera una lista que contiene la cantidad especificada de valores dobles aleatorios.
en el rango definido de (número_inferior, número_superior) según un valor de semilla inicial.
amount: Cantidad de números aleatorios que contendrá la lista resultante.
value1: Extremo inferior del rango del número aleatorio.
value2: Extremo superior del rango del número aleatorio.
seed: Valor de semilla del generador de números aleatorios.
Lista de números aleatorios en el rango (número_inferior, número_superior).
random,listcontains,seed

DSCore.Math.PiTimes2
Constante pi multiplicada por 2.
Pi por 2.
2pi,2*pi,twopi,two*pi

DSCore.Math.Average(System.Collections.Generic.IList{System.Double})
Calcula la media de una lista de números.
numbers: Lista de números de los que se debe calcular la media.
Media de la lista de números.
avg,mean

DSCore.Math.Map(System.Double,System.Double,System.Double)
Asigna el valor de entrada a un número entre 0 y 1 según el rango de entrada.
rangeMin: Valor mínimo del rango de entrada.
rangeMax: Valor máximo del rango de entrada.
inputValue: Número que se debe asignar.
Valor asignado.
map,range,minimum,maximum,normalize,scale,remap

DSCore.Math.MapTo(System.Double,System.Double,System.Double,System.Double,System.Double)
Asigna el valor de entrada a un número entre targetRangeMin y targetRangeMax.
rangeMin: Valor mínimo del rango de entrada.
rangeMax: Valor máximo del rango de entrada.
inputValue: Número que se debe asignar.
targetRangeMin: Valor mínimo del rango nuevo.
targetRangeMax: Valor máximo del rango nuevo.
Valor asignado.
map,range,mapto,minimum,maximum,normalize,scale,remap

DSCore.Math.RemapRange(System.Collections.Generic.IList{System.Double},System.Double,System.Double)
Ajusta el rango de una lista de números conservando la
relación de distribución.
numbers: Lista de números cuyos rangos se deben ajustar.
newMin: Nuevo mínimo del rango.
newMax: Nuevo máximo del rango.
Lista reasignada al nuevo rango.
remap range

DSCore.Math.kRadiansToDegrees
mueve las funciones y los métodos de Math.dll a este archivo DSCoreNode.dll

DSCore.Math.PI
La constante matemática pi, 3,14159...
La constante pi.
3.141592653589793

DSCore.Math.E
La constante matemática e, 2,71828...
La constante e.
exp,2.718281828459045

DSCore.Math.GoldenRatio
El número áureo (1 + sqrt(5))/2 = 1.61803...
El número áureo.
golden,ratio,divine,phi,tau,1.61803398875

DSCore.Math.RadiansToDegrees(System.Double)
Convierte un ángulo expresado en radianes en un ángulo expresado en grados.
radians: Ángulo en radianes.
Ángulo en grados.
radians,degrees,angle

DSCore.Math.DegreesToRadians(System.Double)
Convierte un ángulo expresado en grados en un ángulo expresado en radianes.
degrees: Ángulo en grados.
Ángulo en radianes.
degrees,radians,angle

DSCore.Math.Abs(System.Double)
Calcula el valor absoluto de un número.
number: Número desde el que obtener un valor absoluto.
Valor absoluto del número.
absolute value,magnitude

DSCore.Math.Equals(System.Double,System.Double,System.Double)
Este método SOLO lo utiliza el nodo NodeModel de Es igual a (con tolerancia).

DSCore.Math.Abs(System.Int64)
Calcula el valor absoluto de un número.
integer: Un número.
Valor absoluto del número.
absolute value,magnitude

DSCore.Math.Acos(System.Double)
Calcula el coseno inverso, el ángulo cuyo coseno es el valor proporcionado.
ratio: El coseno del ángulo, un número en el rango [-1, 1].
El ángulo cuyo coseno es el valor introducido.
acosine,arccosine

DSCore.Math.Asin(System.Double)
Calcula el seno inverso, el ángulo cuyo seno es el valor proporcionado.
ratio: El seno del ángulo, un número en el rango [-1, 1].
El ángulo cuyo seno es el valor introducido.
asine,arcsin

DSCore.Math.Atan(System.Double)
Calcula la tangente inversa, el ángulo cuya tangente es el valor proporcionado.
ratio: La tangente del ángulo.
El ángulo cuya tangente es el valor introducido.
atangent,arctangent

DSCore.Math.Atan2(System.Double,System.Double)
Calcula la tangente inversa del cociente de dos números. Devuelve el
ángulo cuya tangente es el valor numerador/denominador.
numerator: El numerador de la tangente del ángulo.
denominator: El denominador de la tangente del ángulo.
El ángulo cuya tangente es el numerador/denominador.
atangent,arctangent

DSCore.Math.Ceiling(System.Double)
Devuelve el primer entero mayor que el número.
number: El número que se debe redondear.
Primer entero mayor que el número.
ceiling,round

DSCore.Math.Cos(System.Double)
Calcula el coseno de un ángulo.
angle: Ángulo en grados del cual se debe obtener el coseno.
Coseno del ángulo.
cosine

DSCore.Math.Cosh(System.Double)
Calcula el coseno hiperbólico de un ángulo (en radianes).
angle: Ángulo en radianes.
Coseno hiperbólico del ángulo.
hyperbolic cosine

DSCore.Math.DivRem(System.Int64,System.Int64)
Calcula el resto del dividendo/divisor.
dividend: El número que se debe dividir.
divisor: El número por el que se debe dividir.
El resto de la división.
remainder

DSCore.Math.EvaluateFormula(System.String,System.String[],System.Object[])
Evalúa una fórmula de NCalc con las asignaciones de parámetros especificadas.
formulaString: Fórmula de NCalc
parameters: Nombres de variables
arguments: Enlaces de variables
type: var[]..[] (resultado del cálculo de la fórmula)

DSCore.Math.Exp(System.Double)
Devuelve la función exponencial del número, la constante e elevada al número especificado.
number: Número.
La función exponencial del número.
exponential

DSCore.Math.Floor(System.Double)
Devuelve el primer entero menor que el número.
number: El número que se debe redondear a la baja.
Primer entero menor que el número.
round

DSCore.Math.Log(System.Double)
Calcula el logaritmo natural de un número en el rango (0, ∞).
number: Número mayor que 0.
Logaritmo natural del número.
natural,logarithm,ln

DSCore.Math.Log(System.Double,System.Double)
Calcula el logaritmo de un número con la base especificada.
number: Número mayor que 0.
logBase: Base del logaritmo en el rango [0,1),(1, ∞).
Logaritmo del número.
logarithm,ld,lg

DSCore.Math.Log10(System.Double)
Calcula el logaritmo en base 10 de un número.
number: Número mayor que 0.
Logaritmo del número.
logarithm

DSCore.Math.Max(System.Double,System.Double)
Devuelve el mayor de dos números.
value1: Número que se debe comparar.
value2: Número que se debe comparar.
El mayor de los dos números.
maximum,greater,larger

DSCore.Math.Max(System.Int64,System.Int64)
Devuelve el mayor de dos números.
int1: Número que se debe comparar.
int2: Número que se debe comparar.
El mayor de los dos números.
maximum,greater,larger

DSCore.Math.Min(System.Double,System.Double)
Devuelve el menor de dos números.
value1: Número que se debe comparar.
value2: Número que se debe comparar.
El menor de dos números.
minimum,lesser,smaller

DSCore.Math.Min(System.Int64,System.Int64)
Devuelve el menor de dos números.
int1: Número que se debe comparar.
int2: Número que se debe comparar.
El menor de dos números.
minimum,lesser,smaller

DSCore.Math.Pow(System.Double,System.Double)
Eleva un número a la potencia especificada.
number: Número que se debe elevar a una potencia.
power: Potencia a la que se debe elevar el número.
Número elevado a la potencia especificada.
^,power,raise,exponent

DSCore.Math.Rand
Genera un número aleatorio en el rango [0, 1).
Número aleatorio en el rango [0, 1).
random,numberrange

DSCore.Math.Round(System.Double)
Redondea un número al valor integral más próximo.
Tenga en cuenta que este método devuelve un tipo de datos flotante de precisión doble en lugar de un tipo integral.
number: Número que se debe redondear.
Valor integral más cercano al número.

DSCore.Math.Round(System.Double,System.Int32)
Redondea un número a un determinado número de dígitos fraccionarios.
number: Número que se debe redondear.
digits: Número de dígitos fraccionarios en el valor de retorno.
El número más próximo al valor que contiene un número de dígitos fraccionarios igual a dígitos.

DSCore.Math.Sign(System.Double)
Devuelve el signo de un número: -1, 0 o 1.
number: Número desde el que obtener el signo.
El signo del número: -1, 0 o 1.

DSCore.Math.Sign(System.Int64)
Devuelve el signo de un número: -1, 0 o 1.
int: Entero desde el que obtener el signo.
El signo del número: -1, 0 o 1.

DSCore.Math.Sin(System.Double)
Calcula el seno de un ángulo.
angle: Ángulo en grados del cual se debe obtener el seno.
Seno del ángulo.
sine

DSCore.Math.Sinh(System.Double)
Calcula el seno hiperbólico de un ángulo (en radianes).
angle: Ángulo en radianes.
Seno hiperbólico del ángulo.
hyperbolic

DSCore.Math.Sqrt(System.Double)
Calcula la raíz cuadrada positiva de un número en el rango (0, ∞).
number: Un número en el rango [0, ∞).
Raíz cuadrada positiva de un número.
square,root,radical

DSCore.Math.Tan(System.Double)
Calcula la tangente de un ángulo.
angle: Ángulo en radianes.
Tangente del ángulo.
tangent

DSCore.Math.Tanh(System.Double)
Calcula la tangente hiperbólica de un ángulo (en radianes).
angle: Ángulo en radianes.
Tangente hiperbólica del ángulo.
hyperbolic,tanh

DSCore.Math.Sum(System.Collections.Generic.IEnumerable{System.Double})
Calcula la suma de una serie de números.
values: Números que se añadirán a la suma.
La suma de los valores.
mass addition,massadd

DSCore.Math.Factorial(System.Int64)
Calcula el valor factorial de un entero positivo.
number: Un entero positivo.
El valor factorial del entero.
!

DSCore.Math.Xor(System.Boolean,System.Boolean)
XOR booleano: devuelve True únicamente si solo uno de los valores introducidos es true.
bool: Un valor booleano.
otherBool: Otro valor booleano.
Resultado booleano.
xor,exclusive,or

DSCore.Math.DoCheckedCast(System.Double)
Realiza una proyección demasiado larga en un contexto verificado. Si la operación genera un desbordamiento,
se produce una advertencia y se devuelve el resultado desbordado.
value: Operación que se va a realizar
Returns: El resultado de la operación