DSCore.ColorRange.ByColorsAndParameters(System.Collections.Generic.IList{DSCore.Color},System.Collections.Generic.IList{Autodesk.DesignScript.Geometry.UV})
Crea un ColorRange proporcionando listas de colores y de UV.
colors: Una lista de colores.
parameters: Una lista de parámetros entre (0,0-0,0) y (1,0-1,0).
Returns: Un objeto de ColorRange.

DSCore.ColorRange.GetColorAtParameter(Autodesk.DesignScript.Geometry.UV)
Devuelve el color en este rango de colores dentro del parámetro especificado.
parameter: Un UV entre (0,0-0,0) y (1,0-1,0).
Returns: Un color.