DSCore.Data.ParseJSON(System.String)
Parse convierte una cadena JSON arbitraria en un valor. Es lo contrario de JSON.Stringify.
json: Una cadena JSON
El tipo de resultado depende del contenido de la cadena de entrada. Este tipo puede ser un valor primitivo (por ejemplo, cadena, booleano o doble), una lista o un diccionario.

DSCore.Data.ToNative(Newtonsoft.Json.Linq.JToken)
Analiza la implementación para convertir tipos de JToken en objetos de .NET nativos.
token: JToken que se analizará en N

DSCore.Data.DynamoJObjectToNative(Newtonsoft.Json.Linq.JObject)
Analiza la implementación para convertir tipos de JObject en objetos de Dynamo específicos (por ejemplo, geometría, color, imágenes, etc.)
Throws System.Exception:

DSCore.Data.StringifyJSON(System.Object)
Stringify convierte un valor arbitrario o una lista de valores arbitrarios a JSON. La replicación permite aplicar la operación en una lista, lo que genera una lista de cadenas JSON.
values: Una lista de valores
Una cadena JSON donde los tipos primitivos (por ejemplo, doble, entero o boleano), las listas y el diccionario se convertirán al tipo JSON asociado.

DSCore.Data.CanObjectBeCached(System.Object)
Función auxiliar para determinar si el objeto se puede almacenar en caché o si es nulo, una cadena "null" o una lista vacía.
inputObject: Objeto que comprobar

DSCore.Data.Remember(System.Object,System.String)
Función para controlar el almacenamiento en caché del nodo Data.Remember.
inputObject: Objeto que almacenar en la memoria caché
cachedJson: JSON de caché existente opcional

DSCore.Data.DataNodeDynamoTypeList
Una lista estática de todos los tipos de datos admitidos de Dynamo
Returns: La lista que contiene los tipos de datos admitidos

DSCore.Data.#cctor
Constructor estático

DSCore.Data.SafeExtractDictionaryValue(System.Collections.Generic.Dictionary{System.String,System.Object},System.String)
Una función auxiliar para extraer de forma segura un valor de diccionario
dict: El diccionario del que se extraerá el valor
key: La clave del par de clave/valor

DSCore.Data.EvaluateDefineDataNode(System.Object,System.String,System.Boolean,System.Boolean,System.String)
Esta es la función que utiliza AST para evaluar el nodo "Define Data".
Gestiona parte de la lógica de nodos mientras realiza la validación.
inputValue: Valor de entrada ascendente
typeString: El tipo como cadena (Nota: Es aconsejable transferir un objeto de tipo 'Type' para la comparación directa de tipos)
isList: Si la entrada es de tipo `ArrayList`
isAutoMode: Si el nodo se encuentra en modo automático
playerValue: El valor introducido en el nodo por el Reproductor de Dynamo, si existe.

DSCore.Data.FindCommonAncestor(System.Collections.ArrayList)
Una función para ayudar a encontrar el tipo en caso de que se haya transferido una ArrayList de objetos en AutoMode.
list: El valor de entrada que se espera sea de tipo ArrayList

DSCore.Data.LikelyAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
Una función auxiliar que devuelve el nodo de nivel más bajo de una lista de nodos DataNodeDynamoType.
nodes: La lista de DataNodeDynamoType que se evaluará

DSCore.Data.FindClosestCommonAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
Una función auxiliar para intentar determinar un antecesor común en una lista de tipos de datos.
nodes: La lista de nodos DataType que se evaluarán

DSCore.Data.FindCommonAncestorBetweenTwoNodes(DSCore.Data.DataNodeDynamoType,DSCore.Data.DataNodeDynamoType)
Función recursiva para intentar encontrar un antecesor común entre dos tipos de Dynamo.
Asciende por el árbol jerárquico del likelyAncestor hasta que
node: Compruebe si este nodo deriva del antecesor probable.
likelyAncestor: El antecesor probable del que debería derivarse el nodo

DSCore.Data.GetListFromTypes(System.Collections.ArrayList)
Devuelve una lista de DataNodeDynamoTypes a partir de una ArrayList de objetos.
list: La ArrayList de objetos a los que se va a aplicar un nuevo formato

DSCore.Data.IsUnusedDefineDataInput(System.Object)
Comprueba que no se utiliza la entrada de "Define data" (lista vacía o nula).
inputValue: El valor de entrada del gráfico.
Returns: Devuelve "True" (verdadero) cuando la entrada se debe tratar como no conectada o no utilizada.

DSCore.Data.IsSingleValueOrSingleLevelArrayList(System.Object)
Compruebe si el objeto de entrada es un valor único o una ArrayList de un solo nivel.
obj: El objeto de entrada que se va a evaluar

DSCore.Data.IsSupportedDataNodeDynamoType(System.Object,System.Type,System.Boolean)
Función para validar el tipo de entrada en relación con los tipos de entrada admitidos por Dynamo
inputValue: Los datos entrantes que se validarán
type: El tipo de entrada especificado por el usuario. Debe coincidir con el tipo inputValue.
isList: Este valor booleano determina si la entrada es un único objeto o una lista.

DSCore.Data.IsItemOfType(System.Object,System.Type)
Este método comprueba si un elemento es de un DataType de Dynamo necesario.
'IsInstanceOfType' comprueba recursivamente la herencia ascendente.
item: El elemento para el que se va a comprobar el tipo de datos
dataType: El DataType en relación con el que se va a realizar la comprobación
Returns: Un resultado "true" (verdadero) o "false" (falso) basado en la validación de comprobación

DSCore.Data.IsDerivedFrom(System.Type,System.Type)
Este método comprueba si un tipo se deriva de un tipo base.
derivedType: El tipo que deseamos afirmar
baseType: El tipo base con el que se realiza la comparación