DSCore.CurveMapper.SineWave
Representa una curva de onda sinusoidal en CurveMapper.
La onda sinusoidal se define mediante dos puntos de control y sigue una función trigonométrica.

DSCore.CurveMapper.SineWave.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Devuelve los valores de X e Y distribuidos a lo largo de la curva.