DSCore.ColorRange1D.ByColorsAndParameters(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double})
Crea un ColorRange1D proporcionando listas de colores y parámetros.
colors: Una lista de colores.
parameters: Una lista de parámetros entre 0.0 y 1.0.
Returns: Un objeto ColorRange1D.

DSCore.ColorRange1D.GetColorAtParameter(DSCore.ColorRange1D,System.Double)
Devuelve el color en este rango de colores dentro del parámetro especificado.
parameter: Un valor entre 0.0 y 1.0.
Returns: Un color.

DSCore.ColorRange1D.Default
Crear un ColorRange1D con el esquema de color por defecto.