DSCore.DateTime
Objeto que representa una fecha y una hora específicas.

DSCore.DateTime.MinValue
La primera fecha y hora que se puede representar.
Representación de la DateTime mínima posible.

DSCore.DateTime.MaxValue
La última fecha y hora que se puede representar.
Representación de la DateTime máxima posible.

DSCore.DateTime.Now
La fecha y la hora actual del sistema.
DateTime que representa la hora actual.

DSCore.DateTime.Today
La fecha actual del sistema, con la hora definida en medianoche.
DateTime que representa la fecha actual.

DSCore.DateTime.Format(System.DateTime,System.String)
Devuelve una fecha y una hora concretas como cadena, en el formato especificado.
dateTime: DateTime al que aplicar un formato.
format: Representación de cadena del formato de fecha. Utiliza InvariantCulture, que se genera de manera independiente del idioma del sistema operativo del usuario.
Usa de forma predeterminada el formato estándar "F": "Martes, 21 de febrero de 2017 23:02:43"
Busque "Cadenas de formato de fecha y hora personalizadas de MSDN" para obtener una lista completa de especificadores de formato.
DateTime representado como una cadena.

DSCore.DateTime.ByDate(System.Int32,System.Int32,System.Int32)
Crea una nueva DateTime en una fecha exacta.
year: Año exacto (1-9999)
month: Mes exacto (1-12)
day: Día exacto (1-[días del mes])
DateTime creada a partir de una fecha.

DSCore.DateTime.ByDateAndTime(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
Crea una nueva DateTime en una fecha y una hora exactas.
year: Año exacto (1-9999)
month: Mes exacto (1-12)
day: Día exacto (1-[días del mes])
hour: Hora exacta (0-23)
minute: Minuto exacto (0-59)
second: Segundo exacto (0-59)
millisecond: Milisegundo exacto (0-999)
DateTime creada a partir de una fecha y hora.

DSCore.DateTime.SubtractTimeSpan(System.DateTime,System.TimeSpan)
Resta un TimeSpan de una DateTime y produce una nueva DateTime.
dateTime: DateTime inicial.
timeSpan: Cantidad de tiempo que se restará.
DateTime resultante de la resta.

DSCore.DateTime.AddTimeSpan(System.DateTime,System.TimeSpan)
Añade un TimeSpan a una DateTime y produce una nueva DateTime.
dateTime: DateTime inicial.
timeSpan: Cantidad de tiempo que se añadirá a DateTime.
DateTime resultante de la suma de intervalo de tiempo.

DSCore.DateTime.DaysInMonth(System.Int32,System.Int32)
Calcula el número de días que tiene el mes pertinente en el año indicado.
year: Año exacto (1-9999)
month: Mes exacto (1-12)
Número de días del mes.

DSCore.DateTime.IsDaylightSavingsTime(System.DateTime)
Determina si se aplica el horario de verano en la DateTime especificada.
dateTime: DateTime utilizada para determinar si hay horario de verano.
True si DateTime se encuentra en el horario de verano; False si no.

DSCore.DateTime.IsLeapYear(System.Int32)
Determina si el año especificado es bisiesto.
year: Año exacto (1-9999)
True si el año es bisiesto; False si no.

DSCore.DateTime.FromString(System.String)
Intenta analizar una DateTime a partir de una cadena.
string: Representación de cadena de DateTime.
DateTime de la cadena analizada.

DSCore.DateTime.Date(System.DateTime)
Extrae únicamente la fecha de una DateTime. Los componentes de tiempo se definen en 0.
dateTime: Una DateTime.
Fecha de DateTime
Date

DSCore.DateTime.Components(System.DateTime)
Extrae los componentes individuales de una DateTime.
dateTime: DateTime desde la que obtener componentes.
Representación numérica del año (1-9999).
Representación numérica del mes (1-12).
Representación numérica del día (1-[días del mes]).
Representación numérica de la hora (0-23).
Representación numérica de los minutos (0-59).
Representación numérica de los segundos (0-59).
Representación numérica de los milisegundos (0-999)

DSCore.DateTime.DayOfWeek(System.DateTime)
Devuelve el día de la semana a partir de la DateTime especificada.
dateTime: Objeto DateTime desde el que obtener un día de la semana.
Día de la semana

DSCore.DateTime.DayOfYear(System.DateTime)
Devuelve el día del año (0-366)
dateTime: DateTime desde la que obtener un día del año.
Número de días desde el comienzo del año.

DSCore.DateTime.TimeOfDay(System.DateTime)
Produce un nuevo TimeSpan que representa la cantidad de tiempo que ha pasado desde
la medianoche de la DateTime especificada.
dateTime: Una DateTime.
TimeSpan desde medianoche.