DSCore.IO.FileSystem
Métodos para trabajar con archivos.

DSCore.IO.FileSystem.AbsolutePath(System.String,System.String)
Devuelve la ruta absoluta de la ruta especificada. Si la ruta especificada es
una ruta relativa, se resuelve con respecto al actual
espacio de trabajo. Si el archivo no existe en la ruta relativa pero existe
en el hintPath especificado, se devuelve hintPath.
path: Ruta relativa o ruta completa
hintPath: Última ruta resuelta
Returns: Ruta absoluta

DSCore.IO.FileSystem.FileFromPath(System.String)
Crea un objeto de archivo a partir de la ruta de archivo especificada.

DSCore.IO.FileSystem.ReadText(System.IO.FileInfo)
Lee un archivo de texto y devuelve el contenido como una cadena.
file: Objeto de archivo desde el que se leerá texto
Contenido del archivo de texto.
read file,text,file

DSCore.IO.FileSystem.MoveFile(System.String,System.String,System.Boolean)
Desplaza el archivo especificado a una nueva ubicación.
path: Representación de cadena de la ruta existente.
newPath: Representación de cadena de la nueva ruta.
overwrite: Active o desactive esta opción para sobrescribir los archivos existentes.
El nodo realiza una tarea; no genera un resultado.

DSCore.IO.FileSystem.DeleteFile(System.String)
Suprime el archivo especificado.
path: Ruta de archivo que se suprimirá.
El nodo realiza una tarea; no genera un resultado.

DSCore.IO.FileSystem.CopyFile(System.IO.FileInfo,System.String,System.Boolean)
Copia un archivo.
file: Objeto de archivo que se copiará.
destinationPath: Representación de cadena de la ruta de archivo de destino.
overwrite: Active o desactive esta opción para sobrescribir los archivos existentes.
El nodo realiza una tarea; devuelve "true" cuando la acción de copia se completa correctamente.

DSCore.IO.FileSystem.FileExists(System.String)
Determina si existe un archivo en la ruta especificada.
path: Cadena que representa una ruta de archivo.
True si el archivo existe; False si no.
filepath

DSCore.IO.FileSystem.WriteText(System.String,System.String)
Escribe el contenido de texto al archivo especificado por la ruta.
filePath: Ruta de escritura
text: Contenido de texto
Sin salida
write file,text,file,filepath

DSCore.IO.FileSystem.AppendText(System.String,System.String)
Añada el contenido de texto a un archivo especificado por la ruta.
filePath: Ruta de escritura
text: Contenido de texto
El nodo realiza una tarea; no genera un resultado.
append file,write file,text,file,filepath

DSCore.IO.FileSystem.CombinePath(System.String[])
Combina varias cadenas en una sola ruta de archivo.
strings: Cadenas que se deben combinar en una ruta.
Ruta de archivo combinada.

DSCore.IO.FileSystem.FileExtension(System.String)
Devuelve la extensión a partir de una ruta de archivo.
path: Ruta de la que obtener la extensión.
Extensión del archivo.

DSCore.IO.FileSystem.ChangePathExtension(System.String,System.String)
Cambia la extensión de una ruta de archivo.
path: Ruta en la que cambiar la extensión.
newExtension: Representación de cadena de la nueva extensión.
Ruta de archivo con la extensión modificada.

DSCore.IO.FileSystem.DirectoryName(System.String)
Devuelve el nombre de directorio a partir de una ruta de archivo.
path: Ruta de la que obtener la información de directorio.
Nombre de directorio de la ruta de archivo.
directorypath

DSCore.IO.FileSystem.FileName(System.String,System.Boolean)
Devuelve el nombre de archivo a partir de una ruta de archivo.
path: Ruta de la que obtener el nombre de archivo.
withExtension: Active o desactive esta opción para incluir la extensión en el resultado.
Nombre de archivo de la ruta de archivo.

DSCore.IO.FileSystem.FileHasExtension(System.String)
Determina si la ruta de un archivo contiene o no una extensión.
path: Ruta donde se debe comprobar si existe una extensión.
True si la ruta de archivo contiene la extensión; False si no.

DSCore.IO.FileSystem.GetDirectoryContents(System.IO.DirectoryInfo,System.String,System.Boolean)
Devolverá una lista de archivos y directorios incluidos en el directorio especificado. Se puede utilizar un elemento searchString opcional para filtrar los resultados.
directory: Directorio del que obtener el contenido.
searchString: Cadena de búsqueda utilizada para filtrar los resultados.
includeSubdirectories: Se establece en True para incluir los archivos y carpetas en subdirectorios (recursivo) o en False para incluir resultados solo desde el nivel superior del directorio especificado.
Archivos resultantes de la consulta.
Directorios resultantes de la consulta.

DSCore.IO.FileSystem.CopyDirectory(System.IO.DirectoryInfo,System.String,System.Boolean)
Copia el directorio a la ubicación de destino.
directory: Directorio que copiar.
destinationPath: Destino de la operación de copia en el disco.
overwriteFiles: Active o desactive esta opción para sobrescribir el directorio existente.
El nodo realiza una tarea; no genera un resultado.

DSCore.IO.FileSystem.DeleteDirectory(System.String,System.Boolean)
Suprime un directorio.
path: Ruta a un directorio del disco.
recursive: Si se debe o no suprimir todo el contenido del directorio. Predeterminado: False.
El nodo realiza una tarea; no genera un resultado.

DSCore.IO.FileSystem.DirectoryExists(System.String)
Determina si un directorio existe en la ruta especificada.
path: Ruta a un directorio del disco.
True si el directorio existe; False si no.
directorypath

DSCore.IO.FileSystem.MoveDirectory(System.String,System.String,System.Boolean)
Desplaza un directorio a una nueva ubicación.
path: Representación de cadena de la ruta existente.
newPath: Representación de cadena de la nueva ruta.
overwriteFiles: Active o desactive esta opción para sobrescribir los archivos existentes.
El nodo realiza una tarea; no genera un resultado.