DSCore.CurveMapper.BezierCurve
Representa una curva de Bezier en CurveMapper.
Una curva de Bezier se define mediante cuatro puntos de control y proporciona una interpolación suave.

DSCore.CurveMapper.BezierCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Obtiene los valores de Y interpolados en función de los parámetros y los límites asignados.