DSCore.Quadtree.ByUVs(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.UV})
Genera un Quadtree que abarca el dominio (0,0)->(1,1).
uvs: Un conjunto de UV en el dominio (0,0)->(1,1).
Returns: Un objeto Quadtree

DSCore.Quadtree.FindPointsWithinRadius(Autodesk.DesignScript.Geometry.UV,System.Double)
Busca todos los puntos de árbol cuádruple (UV) en el árbol cuádruple dentro de un radio de la ubicación UV especificada.
center: UV en el centro del área de búsqueda.
radius: El radio del área de búsqueda.
Returns: Una lista de UV.