DSCore.Thread
Funciones para manipular subprocesos de evaluación.

DSCore.Thread.Pause(System.Object,System.Int32)
Pausa el subproceso de evaluación actual durante el tiempo indicado.
object: Objeto que se debe pasar.
msTimeout: Número de milisegundos que el subproceso debe estar en pausa.
Objeto pasado.