DSCore.CurveMapper.ParabolicCurve
Representa una curva parabólica en CurveMapper.
La curva sigue una ecuación cuadrática basada en dos puntos de control.

DSCore.CurveMapper.ParabolicCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Devuelve los valores de X e Y distribuidos a lo largo de la curva.