DSCore.CurveMapper.CurveBase
Representa una clase base para todos los tipos de curvas de CurveMapper.
Proporciona una función habitual para generar y recuperar valores de curva.

DSCore.CurveMapper.CurveBase.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Método abstracto que implementarán las clases derivadas para generar valores de curva.

DSCore.CurveMapper.CurveBase.GetCurveXValues(System.Collections.Generic.List{System.Double},System.Boolean)
Método habitual para recuperar los valores de X.

DSCore.CurveMapper.CurveBase.GetCurveYValues(System.Collections.Generic.List{System.Double},System.Boolean)
Método habitual para recuperar los valores de Y.

DSCore.CurveMapper.CurveBase.GenerateFromDomain(System.Collections.Generic.List{System.Double},System.Func{System.Double,System.Double})
Genera valores de X e Y mediante la asignación de entradas de dominio al espacio del lienzo y la evaluación de una función de curva.