DSCore.CurveMapper.GaussianCurve
Representa una curva gaussiana en CurveMapper.
La curva gaussiana sigue una distribución en forma de campana definida por cuatro puntos de control.

DSCore.CurveMapper.GaussianCurve.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Indica si se cambia de tamaño el nodo, lo que impide actualizaciones no intencionadas de puntos de control.

DSCore.CurveMapper.GaussianCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Devuelve los valores de X e Y distribuidos a lo largo de la curva.