DSCore.TimeSpan
Objeto que representa el periodo de tiempo transcurrido, sin fecha específica de inicio o fin.

DSCore.TimeSpan.ByDateDifference(System.DateTime,System.DateTime)
Produce una nuevo TimeSpan calculado a partir de la diferencia entre dos elementos DateTime.
dateTime: DateTime de la que restar.
otherDateTime: DateTime que se restará.
Diferencia del TimeSpan entre dos fechas.

DSCore.TimeSpan.Zero
Un TimeSpan que representa un tiempo transcurrido de cero.
TimeSpan que representa un tiempo transcurrido de cero.

DSCore.TimeSpan.MaxValue
El mayor TimeSpan que se puede representar.
Representación del TimeSpan máximo posible.

DSCore.TimeSpan.MinValue
El menor TimeSpan que se puede representar.
Representación del TimeSpan mínimo posible.

DSCore.TimeSpan.Create(System.Double,System.Double,System.Double,System.Double,System.Double)
Crea un nuevo TimeSpan a partir de un intervalo de tiempo.
days: Días abarcados.
hours: Horas abarcadas.
minutes: Minutos abarcados.
seconds: Segundos abarcados.
milliseconds: Milisegundos abarcados.
TimeSpan creado.

DSCore.TimeSpan.Scale(System.TimeSpan,System.Double)
Multiplica un TimeSpan por un factor de escala.
timeSpan: TimeSpan que se multiplicará.
scaleFactor: Valor de escala para el TimeSpan. Por ejemplo, un factor de escala de 2 doblará
el tiempo abarcado.
Producto del TimeSpan.

DSCore.TimeSpan.Negate(System.TimeSpan)
Niega un TimeSpan.
timeSpan: TimeSpan que se negará.
TimeSpan negativo.

DSCore.TimeSpan.Add(System.TimeSpan,System.TimeSpan)
Suma dos TimeSpans.
timeSpan1: TimeSpan que se sumará.
timeSpan2: Otro TimeSpan que se sumará.
TimeSpan resultante de la suma.

DSCore.TimeSpan.Subtract(System.TimeSpan,System.TimeSpan)
Resta dos TimeSpans.
timeSpan1: TimeSpan del que se restará.
timeSpan2: TimeSpan que se restará.
TimeSpan resultante de la sustracción

DSCore.TimeSpan.FromString(System.String)
Intenta analizar un TimeSpan a partir de una cadena.
string: Representación de cadena de TimeSpan.
TimeSpan de la cadena analizada.

DSCore.TimeSpan.Components(System.TimeSpan)
Extrae los componentes individuales de un TimeSpan.
timeSpan: TimeSpan desde el que obtener componentes.
Cantidad de días (tipo int)
Cantidad de horas (tipo int)
Cantidad de minutos (tipo int)
Cantidad de segundos (tipo int)
Cantidad de milisegundos (tipo int)

DSCore.TimeSpan.TotalDays(System.TimeSpan)
Convierte la cantidad total de tiempo representada por un TimeSpan en un número
inexacto de días.
timeSpan: TimeSpan desde el que consultar la cantidad total de días.
Cantidad total de días.

DSCore.TimeSpan.TotalHours(System.TimeSpan)
Convierte la cantidad total de tiempo representada por un TimeSpan en un número
inexacto de horas.
timeSpan: TimeSpan desde el que consultar la cantidad total de horas.
Cantidad total de horas.

DSCore.TimeSpan.TotalMinutes(System.TimeSpan)
Convierte la cantidad total de tiempo representada por un TimeSpan en un número
inexacto de minutos.
timeSpan: TimeSpan desde el que consultar la cantidad total de minutos.
Cantidad total de minutos.

DSCore.TimeSpan.TotalSeconds(System.TimeSpan)
Convierte la cantidad total de tiempo representada por un TimeSpan en un número
inexacto de segundos.
timeSpan: TimeSpan desde el que consultar la cantidad total de segundos.
Cantidad total de segundos.

DSCore.TimeSpan.TotalMilliseconds(System.TimeSpan)
Convierte la cantidad total de tiempo representada por un TimeSpan en un número
inexacto de milisegundos.
timeSpan: TimeSpan desde el que consultar la cantidad total de milisegundos.
Cantidad total de milisegundos.