DSCore.Data.MaxDepthJsonTextWriter
Subclase de JsonTextWriter que limita una profundidad máxima de objetos admitida para evitar que se produzcan bloqueos de referencia circular al serializar tipos de objetos .NET arbitrarios.