DSCore.Compare
Métodos de comparación.

DSCore.Compare.GreaterThan(System.Object,System.Object)
Devuelve True si A es mayor que B.
a: Un objeto comparable.
b: Un objeto comparable.
Resultado booleano.
larger,bigger

DSCore.Compare.GreaterThanOrEqual(System.Object,System.Object)
Devuelve True si A es mayor o igual que B.
a: Un objeto comparable.
b: Un objeto comparable.
Resultado booleano.
larger,bigger,equal

DSCore.Compare.LessThan(System.Object,System.Object)
Devuelve True si A es menor que B.
a: Un objeto comparable.
b: Un objeto comparable.
Resultado booleano.
less,smaller

DSCore.Compare.LessThanOrEqual(System.Object,System.Object)
Devuelve True si A es menor o igual que B.
a: Un objeto comparable.
b: Un objeto comparable.
Resultado booleano.
smaller,equal