DSCore.Object
Funciones genéricas que operan en todos los datos.

DSCore.Object.IsNull(System.Object)
Determina si el objeto especificado es nulo.
object: Objeto que se debe probar.
Si el objeto es o no nulo.
is null

DSCore.Object.Identity(System.Object)
Devuelve lo que se le pasa, sin hacer nada.
object: Un objeto.
El mismo objeto

DSCore.Object.Type(System.Object)
Devuelve el tipo de objeto representado como cadena.
object: Objeto del que se consultará el tipo.
Returns: Tipo de objeto.