DSCore.List
Métodos de creación y manipulación de listas.

DSCore.List.Empty
Devuelve una lista vacía.
Lista vacía.
empty list, emptylist,[]

DSCore.List.UniqueItems(System.Collections.IList)
Crea una lista con todos los elementos únicos de la lista especificada.
list: Lista cuyos duplicados se deben filtrar.
Lista filtrada.
removes,duplicates,remove duplicates,cull duplicates,distinct,listcontains

DSCore.List.Contains(System.Collections.IList,System.Object)
Determina si la lista especificada contiene el elemento indicado. Esta función busca en las sublistas que contiene.
list: Lista en la que se buscará.
item: Elemento que se buscará.
True si la lista contiene el elemento; False si no.
item,search,in,listcontains

DSCore.List.IsHomogeneous(System.Collections.IList)
Comprueba si los elementos de la lista son del mismo tipo.
list: Lista que se debe comprobar si es homogénea.
Si la lista es homogénea.
homogeneous,allequal,same,type

DSCore.List.IsRectangular(System.Collections.IList)
Comprueba si el número de elementos de todas las filas de la lista es el mismo.
list: Lista que se debe comprobar si las filas tienen el mismo número de elementos.
Si la lista tiene el mismo número de elementos en todas las filas.
rectangular,isrectangular,same,sublist,row

DSCore.List.IsUniformDepth(System.Collections.IList)
Comprueba si los elementos de la lista tienen la misma profundidad.
list: Lista que se debe comprobar si los elementos tienen la misma profundidad.
Si la profundidad de la lista es uniforme.
depth,uniform,isuniformdepth,sublist,jagged

DSCore.List.SetDifference(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Devuelve una lista nueva con objetos de List1, pero excluye objetos de List2.
list1: Lista de objetos que se incluirán en la lista nueva.
list2: Lista de objetos que se excluirán de la lista nueva.
La lista nueva que contiene objetos en List1, pero no en List2.
difference,setdifference,set

DSCore.List.SetIntersection(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Devuelve una lista nueva con objetos que están en List1 y List2.
list1: Lista de objetos que se compararán con List2.
list2: Lista de objetos que se compararán con List1.
La lista nueva que contiene objetos que están tanto en List1 como en List2.
intersection,setintersection,set,overlap

DSCore.List.SetUnion(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Devuelve una lista nueva con objetos que están en List1 o List2.
list1: Lista de objetos que se incluirán.
list2: Lista de objetos que se incluirán en List1.
La lista nueva que contiene objetos que están en List1 o en List2.
union,setunion,set

DSCore.List.IndexOf(System.Collections.IList,System.Object)
Devuelve el índice del elemento de la lista especificada. La coincidencia entre la lista especificada y el elemento de destino debe ser exacta (es decir, de entero a entero, de doble a doble, de cadena a cadena, de objeto a objeto, etc.).
list: Lista en la que buscar el elemento.
element: Elemento cuyo índice se debe devolver.
El índice del elemento en la lista. Se devolverá el índice no válido -1 si no se encuentra una coincidencia exacta.
index,indexof

DSCore.List.CountFalse(System.Collections.IList)
Devuelve el número de valores booleanos false de la lista especificada.
list: Lista donde buscar valores booleanos false.
Número de valores booleanos false de la lista.
false,count

DSCore.List.CountTrue(System.Collections.IList)
Devuelve el número de valores booleanos true de la lista especificada.
list: Lista donde buscar valores booleanos true.
Número de valores booleanos true de la lista.
true,count

DSCore.List.Insert(System.Collections.IList,System.Object,System.Int32)
Inserta un elemento en una lista en el índice especificado.
list: Lista en la que se insertará el elemento.
element: Elemento que se insertará.
index: Especifica la ubicación en la lista del elemento que se insertará.
Lista con el elemento insertado.
insert,add

DSCore.List.Reorder(System.Collections.IList,System.Collections.IList)
Reordena la lista de entradas según la lista especificada de índices.
list: Lista que se reordenará.
indices: Índices utilizados para reordenar los elementos de la lista.
Lista reordenada.
reorder,index,indices

DSCore.List.SortIndexByValue(System.Collections.Generic.List{System.Double})
Ordena una lista por los elementos y devuelve sus índices.
list: Lista de los elementos que se ordenarán.
Índices de los elementos de la lista ordenada.
sort,index,value

DSCore.List.NormalizeDepth(System.Collections.IList,System.Int32)
Devuelve lista multidimensional según la clasificación especificada.
list: Lista cuya profundidad se debe normalizar según la clasificación.
rank: Clasificación en la que se debe normalizar la lista. El valor por defecto es 1.
Lista con la clasificación normalizada.
depth,normalize

DSCore.List.Reverse(System.Collections.IList)
Crea una lista con los elementos de la lista especificada, pero en el orden inverso.
list: Lista que se debe invertir.
Lista invertida.
flip,listcontains

DSCore.List.__Create(System.Collections.IList)
Crea una nueva lista que contiene los elementos especificados.
items: Los elementos que se deben almacenar en la nueva lista.

DSCore.List.Sublists(System.Collections.IList,System.Collections.IList,System.Int32)
Genera sublistas a partir de una lista mediante la sintaxis de rangos DesignScript.
list: La lista a partir de la cual se deben crear sublistas.
ranges: Los rangos de índice de los elementos de la sublista.
Por ejemplo, \"{0..3,5,2}\"
offset: El desfase que se debe aplicar a la sublista.
Por ejemplo, el rango \"0..3\" con un desfase de 2 produce
{0,1,2,3}{2,3,4,5}{4,5,6,7}...
tipo: var[]..[]
sublists,build sublists,subset,

DSCore.List.Sort(System.Collections.Generic.IEnumerable{System.Object})
Ordena la lista en el orden natural integrado.
list: Lista que se ordenará.
Lista ordenada.
sort,order,sorted

DSCore.List.MinimumItem(System.Collections.Generic.IEnumerable{System.Object})
Devuelve el valor mínimo de una lista.
list: Lista de elementos comparables desde la que se obtendrá el valor mínimo.
Elemento mínimo de la lista.
least,smallest,find min

DSCore.List.MaximumItem(System.Collections.Generic.IEnumerable{System.Object})
Devuelve el valor máximo de una lista.
list: Lista de elementos comparables desde la que se obtendrá el valor máximo.
Elemento máximo de la lista.
greatest,largest,biggest,find max

DSCore.List.FilterByBoolMask(System.Collections.IList,System.Collections.IList)
Filtra una secuencia mediante la búsqueda de los índices correspondientes en una lista separada de
booleanos.
list: Lista que se debe filtrar.
mask: Lista de booleanos que representan una máscara.
Elementos cuyo índice de máscara es True.
Elementos cuyo índice de máscara es False.
filter,in,out,mask,dispatch,bool filter,boolfilter,bool filter

DSCore.List.Deconstruct(System.Collections.IList)
Si se especifica una lista, genera el primer elemento de la lista y una nueva
lista con todos los elementos excepto el primero.
list: Lista que se debe dividir.
Primer elemento de la lista (tipo: var[]..[])
Resto de la lista (tipo: var[]..[])
first,rest,list split,listcontains

DSCore.List.SortByKey(System.Collections.IList,System.Collections.IList)
Clasificar lista según sus claves
list: lista que se debe ordenar
keys: Lista de claves; las claves deben poder ordenarse (por ejemplo, números, cadenas).
tipo: var[]..[]
tipo: var[]..[]
sort;key

DSCore.List.GroupByKey(System.Collections.IList,System.Collections.IList)
Agrupa elementos en sublistas en función de sus valores clave
list: Lista de elementos que se deben agrupar como sublistas
keys: Los valores clave (uno por cada elemento de la lista de entrada) utilizados para agrupar los elementos
lista de sublistas, con elementos agrupados por valores clave
valor clave correspondiente a cada grupo
list;group;groupbykey;

DSCore.List.GroupBySimilarity(System.Collections.IList,System.Double,System.Boolean)
Los clústeres enumeran elementos en función de la adyacencia de sus índices y la similitud de sus valores.
list: Lista de elementos que se agruparán como sublistas en función de la adyacencia y la similitud
tolerance: Valor de umbral para agrupar elementos similares
considerAdjacency: Valor booleano para controlar si el nodo debe tener en cuenta la adyacencia o no
Lista de sublistas con elementos agrupados por valores similares
Lista de sublistas que contienen los índices originales de los valores agrupados
list;group;similar;adjacent;adjacency;groupbyadjacency;groupadjacentitems;groupsimilaritems;cluster;tolerance

DSCore.List.LevenshteinDistance(System.String,System.String)
La distancia de Levenshtein es el algoritmo utilizado para obtener la distancia entre dos cadenas.
| Fuente

DSCore.List.AddItemToFront(System.Object,System.Collections.IList)
Añade un elemento al principio de una lista.
item: El elemento que se debe añadir. El elemento puede ser un objeto o una lista.
list: Lista a la que se debe añadir.
Lista con elementos añadidos.
insert,add,item,front,start,begin

DSCore.List.AddItemToEnd(System.Object,System.Collections.IList)
Añade un elemento al final de una lista.
item: Elemento que se debe añadir. El elemento puede ser un objeto o una lista.
list: Lista a la que se debe añadir.
Lista con elementos añadidos.
insert,add,item,end

DSCore.List.TakeItems(System.Collections.IList,System.Int32)
Recupera una cantidad de elementos del inicio de la lista.
list: Lista de la que se deben recuperar elementos.
amount: Cantidad de elementos que se debe recuperar. Si el valor es negativo, los elementos se recuperan del final de la lista.
Lista de elementos recuperados.
get,sub,sublist,extract

DSCore.List.DropItems(System.Collections.IList,System.Int32)
Elimina un número de elementos del inicio de la lista. Si el número es un valor negativo,
los elementos se eliminan del final de la lista.
list: Lista de la que se deben eliminar elementos.
amount: Cantidad de elementos que se debe eliminar. Si el valor es negativo, los elementos se eliminan del final de la lista.
Lista de elementos restantes.
drop,remove,shorten

DSCore.List.ShiftIndices(System.Collections.IList,System.Int32)
Desplaza a la derecha los índices de la lista aplicando el valor indicado.
list: Lista en la que se debe realizar el desplazamiento.
amount: Valor de desplazamiento que se debe aplicar a los índices. Si es negativo, los índices se desplazarán a la izquierda.
Lista con desplazamiento.
shift,offset

DSCore.List.GetItemAtIndex(System.Collections.IList,System.Int32)
Devuelve un elemento de la lista especificada que se encuentra en el índice indicado.
list: Lista de la cual se debe recuperar un elemento.
index: El índice del elemento que se debe recuperar.
Elemento de la lista en el índice especificado.
get,item,index,fetch,at,getfrom,get from,extract

DSCore.List.ReplaceItemAtIndex(System.Collections.IList,System.Int32,System.Object)
Sustituye un elemento de la lista especificada que se encuentra en el índice indicado.
list: Lista en la que se debe sustituir un elemento.
index: El índice del elemento que se debe sustituir.
item: El elemento que se debe insertar.
Una nueva lista con el artículo sustituido.
replace,switch

DSCore.List.ReplaceItemAtIndices(System.Collections.IList,System.Collections.Generic.IList{System.Int32},System.Object)
Sustituye los elementos de la lista especificada que se encuentran en los índices indicados.
list: Lista en la que se debe sustituir un elemento.
indices: Índices de los elementos que se van a sustituir.
item: El elemento que se debe insertar.
Una nueva lista con los elementos sustituidos.
replace,switch

DSCore.List.Slice(System.Collections.IList,System.Nullable{System.Int32},System.Nullable{System.Int32},System.Int32)
Devuelve una sola sublista de la lista especificada en función del índice inicial, el índice final,
y la cantidad de paso indicados.
list: Lista de la que se debe realizar la extracción.
start: Índice a partir del cual se iniciará la extracción.
end: Índice en que finalizará la extracción.
step: Valor de separación de los elementos de los índices en la lista original.
Elementos en el fragmento extraído de la lista especificada.
list,sub,sublist,subrange,get sublist

DSCore.List.RemoveItemAtIndex(System.Collections.IList,System.Int32[])
Elimina un elemento de la lista especificada en el índice indicado.
list: Lista de la que se debe eliminar uno o varios elementos.
indices: Índices de elementos que se deben eliminar.
Lista con elementos eliminados.
index,indices,cull,remove,item

DSCore.List.DropEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
Elimina elementos de la lista especificada en los índices que son
múltiplos del valor especificado y después del desfase indicado.
list: Lista de la que se deben eliminar elementos/
n: Los índices que sean múltiplos de este argumento se eliminarán.
offset: Cantidad de elementos que se deben ignorar a partir del inicio de la lista.
Lista con elementos eliminados.
nth,remove,cull,every

DSCore.List.TakeEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
Recupera elementos de la lista especificada en los índices que son
múltiplos del valor especificado y después del desfase indicado.
list: Lista de la que se deben recuperar elementos.
n: Se recuperarán los índices que sean múltiplos de este número
(después del desfase).
offset: Cantidad de elementos que se deben ignorar a partir del inicio de la lista.
Elementos de la lista.
fetch,take,every,nth

DSCore.List.IsEmpty(System.Collections.IList)
Determina si la lista especificada está vacía.
list: Lista que se comprobará si está vacía.
True si la lista está vacía; False si no lo está.
test,is,empty,null,count

DSCore.List.AllTrue(System.Collections.IList)
Determina si todos los elementos de la lista especificada son booleanos y tienen un valor true.
list: Lista en la que se debe comprobar si todos los elementos son true.
True si todos los elementos de la lista son verdaderos; False si uno o varios elementos no son verdaderos.
test,all,true,istrue

DSCore.List.AllFalse(System.Collections.IList)
Determina si todos los elementos de la lista especificada son booleanos y tienen un valor false.
list: Lista en la que se debe comprobar si todos los elementos son false.
True si todos los elementos de la lista son falsos; False si uno o varios elementos no son falsos.
test,all,false,isfalse

DSCore.List.AnyTrue(System.Collections.IList)
Determina si un elemento de la lista especificada es un elemento booleano con el valor "true" (verdadero).
list: Lista que se comprobará para ver si hay algún elemento que sea "true" (verdadero).
Determina si hay algún elemento que sea "true" (verdadero).
test,any,true,istrue

DSCore.List.AnyFalse(System.Collections.IList)
Determina si un elemento de la lista especificada es un elemento booleano con el valor "false" (falso).
list: Lista que se comprobará para ver si hay algún elemento que sea "false" (falso).
Determina si hay algún elemento que sea "false" (falso).
test,any,false,isfalse

DSCore.List.Count(System.Collections.IList)
Devuelve el número de elementos almacenados en la lista especificada.
list: Lista de la que se debe obtener el recuento de elementos.
Longitud de la lista.
listlength,list length,count,size,sizeof

DSCore.List.Join(System.Collections.IList[])
Concatena todas las listas especificadas y crea una sola lista.
lists: Listas que se deben combinar para formar una sola lista.
Lista combinada.
join lists,merge,concatenate

DSCore.List.FirstItem(System.Collections.IList)
Devuelve el primer elemento de una lista.
list: Lista de la que se debe obtener el primer elemento.
Primer elemento de la lista.
get,fetch,first,item,start

DSCore.List.RestOfItems(System.Collections.IList)
Elimina el primer elemento de la lista especificada.
list: Lista cuya parte restante se debe recuperar.
Resto de la lista.
get,fetch,rest,end,rest of list

DSCore.List.Chop(System.Collections.IList,System.Collections.Generic.List{System.Int32})
Divide una lista en un conjunto de sublistas conjuntas con la longitud especificada. La división empieza al principio de la lista.
list: Lista que se debe dividir en sublistas
lengths: Longitudes de las sublistas consecutivas que se deben crear a partir de la lista de entrada.
Sublistas creadas a partir de la lista.
sublists,build sublists,slices,partitions,cut,listcontains,chop

DSCore.List.DiagonalRight(System.Collections.IList,System.Int32)
Enumera los elementos a lo largo de cada diagonal de la matriz, desde la parte superior izquierda hasta la parte inferior derecha.
list: Una lista plana.
subLength: Longitud de cada nueva sublista.
Listas de elementos a lo largo de las diagonales de la matriz.
diagonal,right,matrix,get diagonals,diagonal sublists

DSCore.List.DiagonalLeft(System.Collections.IList,System.Int32)
Enumera los elementos a lo largo de cada diagonal de la matriz, desde la parte superior izquierda hasta la parte inferior derecha.
list: Una lista plana.
rowLength: Longitud de cada nueva sublista.
Listas de elementos a lo largo de las diagonales de la matriz.
diagonal,left,matrix,get diagonals,diagonal sublists

DSCore.List.Transpose(System.Collections.IList)
Intercambia filas y columnas en una lista de listas.
Si hay varias filas que son más cortas que otras, se
insertan valores nulos como marcadores de posición en la
matriz resultante, para que sea siempre rectangular.
lists: Lista de listas a las que aplicar la transposición.
Lista de listas a las que se ha aplicado la transposición.
transpose,flip matrix,matrix,swap,rows,columns

DSCore.List.Clean(System.Collections.IList,System.Boolean)
Limpia los datos de los valores nulos y las listas vacías para una lista determinada de una dimensión arbitraria.
list: Lista que contiene los valores nulos y las sublistas vacías que se van a limpiar
preserveIndices: Proporcione una opción para conservar los índices de los datos
Lista de listas a las que se ha aplicado la transposición
de forma que los valores nulos que no estén en posición posterior no se puedan filtrar.
Returns: Una lista sin valores nulos ni listas vacías.

DSCore.List.OfRepeatedItem(System.Object,System.Int32)
Crea una lista que contiene el elemento especificado el número de veces indicado.
item: El elemento que se debe repetir.
amount: El número de veces que se debe repetir.
Lista de elementos repetidos.
repeat,repeated,duplicate,list of item,fill list,copies,listcontains

DSCore.List.Cycle(System.Collections.IList,System.Int32)
Crea una lista mediante la concatenación de copias de la lista especificada.
list: Lista que se debe repetir.
amount: Número de veces que se debe repetir.
Lista de listas repetidas de tipo: var[]..[]
repeat,repeated,duplicate,repeated list,concat list

DSCore.List.LastItem(System.Collections.IList)
Recupera el último elemento de una lista.
list: Lista de la que se obtendrá el último elemento.
Último elemento de la lista.
get,fetch,last,item,end of list

DSCore.List.Shuffle(System.Collections.IList)
Reorganiza una lista colocando sus elementos en orden aleatorio.
list: Lista que se debe reorganizar.
Lista reorganizada en orden aleatorio.
random,randomize,shuffle,jitter,randomness

DSCore.List.Shuffle(System.Collections.IList,System.Int32)
Reorganiza una lista, ordenando de forma aleatoria sus elementos en función de un valor de semilla inicial.
list: Lista que se debe reorganizar.
seed: Valor de semilla del generador de números aleatorios.
Lista reorganizada en orden aleatorio.
random,randomize,shuffle,jitter,randomness,seed

DSCore.List.Permutations(System.Collections.IList,System.Nullable{System.Int32})
Genera todas las permutaciones de la longitud especificada de la lista indicada.
list: Lista que se debe permutar.
length: Longitud de cada permutación.
Permutaciones de la lista de la longitud especificada (tipo: var[]..[])
permutation,permutations

DSCore.List.Combinations(System.Collections.IList,System.Int32,System.Boolean)
Genera todas las combinaciones de la longitud especificada de la lista indicada.
list: Lista a partir de la que se generarán combinaciones.
length: Longitud de cada combinación.
replace: Si se eliminan o no los elementos tras seleccionarse para la combinación.
Predeterminado: False.
Combinaciones de la lista de la longitud especificada.
combo

DSCore.List.FirstIndexOf(System.Collections.IList,System.Object)
Al especificar un elemento, devuelve el índice de base cero de su primera
aparición en la lista. Si el elemento no se encuentra en la lista, se devuelve -1.
list: Lista en la que se debe realizar la búsqueda. Si este argumento tiene un valor nulo, se devuelve -1.
item: Elemento que se debe buscar.
Returns: Índice de base cero del elemento en la lista, o -1 si no se encuentra.

DSCore.List.AllIndicesOf(System.Collections.IList,System.Object)
Al especificar un elemento, devuelve los índices de base cero de todas sus
apariciones en la lista. Si el elemento no se encuentra, se devuelve una lista vacía.
list: Lista en la que se debe realizar la búsqueda. Si este argumento tiene un valor nulo, se devuelve una lista vacía.
item: Elemento que se debe buscar.
Una lista de índices de base cero de todas las apariciones del
elemento si las hay, o bien una lista vacía si el elemento no está presente en la lista.

DSCore.List.Flatten(System.Collections.IList,System.Int32)
Aplana una lista anidada de listas aplicando el valor especificado.
list: Lista que se debe aplanar.
amount: Capas de anidamiento de lista que se van a eliminar (-1 eliminará todos los anidamientos de lista).
Lista aplanada por cantidad.
flatten,completely

DSCore.List.IndexInList(System.Collections.IList,System.Object)
Alternativa a utilizar IList.Contains que utiliza Enumerable.SequenceEqual para comprobar si
el elemento está en la lista si el elemento es una matriz. Devuelve el índice si se ha encontrado,
-1 si no se ha encontrado.
list: Lista que comprobar si contiene el elemento.
item: Elemento que se debe encontrar.
Índice del elemento de la lista.

DSCore.List.GetDepth(System.Object)
Obtiene la profundidad máxima de una lista especificada.
list: Lista de entradas de la que obtener la profundidad.
Profundidad de la lista especificada.

DSCore.List.CountBool(System.Collections.IList,System.Boolean)
Devuelve el número de los valores booleanos indicados de la lista especificada.
list: Lista en la que buscar los valores booleanos.
value: Valor booleano que se debe encontrar
Número del valor booleano especificado de la lista.

DSCore.List.IncreaseDepth(System.Collections.IList,System.Int32)
Incrementa la profundidad de una lista especificada según una cantidad concreta. La profundidad se incrementa
creando una lista nueva con la lista especificada.
list: Lista cuya profundidad se debe incrementar.
amt: Cantidad por la que se debe incrementar la profundidad.
Lista nueva cuya profundidad se incrementa por cantidad.

DSCore.List.DoubleConverter(System.Object)
Convierte un entero en doble o bien devuelve el objeto de entrada.