DSCore.Properties.Resources
Una clase de recurso con tipado fuerte que permite buscar cadenas localizadas, etc.

DSCore.Properties.Resources.ResourceManager
Devuelve el ejemplar de ResourceManager en caché utilizado por esta clase.

DSCore.Properties.Resources.Culture
Elimina la propiedad CurrentUICulture del hilo actual para todas
las búsquedas de recurso que utilizan esta clase de
recurso con tipado fuerte.

DSCore.Properties.Resources.BitmapOverflowError
Busca una cadena localizada similar a Los datos de color proporcionados son demasiado grandes para que quepan en los límites de la imagen.

DSCore.Properties.Resources.CurveMapperEqualMinMaxWarning
Busca una cadena localizada similar a • Los valores mínimo y máximo deben ser diferentes.

DSCore.Properties.Resources.CurveMapperInvalidCountWarning
Busca una cadena localizada similar a • Los valores deben ser una lista de números o un solo número ≥ 2..

DSCore.Properties.Resources.CurveMapperInvalidCurveWarning
Busca una cadena localizada similar a • Los puntos de control de la curva seleccionada no son válidos.

DSCore.Properties.Resources.CurveMapperInvalidXYFormatWarning
Busca una cadena localizada similar a • Las entradas X e Y deben ser números únicos (no listas).

DSCore.Properties.Resources.DefineDataSupportedInputValueExceptionMessage
Busca una cadena localizada similar a La entrada debe ser un único valor o una lista no anidada.

DSCore.Properties.Resources.DefineDataUnexpectedInputExceptionMessage
Busca una cadena localizada similar a Este nodo esperaba una entrada {0}, pero ha recibido una entrada {1}. Proporcione la entrada esperada o elija un nuevo tipo en el menú desplegable del nodo.

DSCore.Properties.Resources.DefineDataUnsupportedCombinationOfDataTypesExceptionMessage
Busca una cadena localizada similar a Este nodo no admite la combinación de tipos de datos de la lista de entrada actual {0}. Asegúrese de que la lista de entrada contiene elementos del mismo tipo de datos o una mezcla de tipos con un tipo principal común.

DSCore.Properties.Resources.DefineDataUnsupportedDataTypeExceptionMessage
Busca una cadena localizada similar a Este nodo no admite el tipo de datos de entrada actual ({0}). Consulte los tipos de datos admitidos en el menú desplegable.

DSCore.Properties.Resources.EnumDateOfWeekFriday
Busca una cadena localizada similar a Viernes.

DSCore.Properties.Resources.EnumDateOfWeekMonday
Busca una cadena localizada similar a Lunes.

DSCore.Properties.Resources.EnumDateOfWeekSaturday
Busca una cadena localizada similar a Sábado.

DSCore.Properties.Resources.EnumDateOfWeekSunday
Busca una cadena localizada similar a Domingo.

DSCore.Properties.Resources.EnumDateOfWeekThursday
Busca una cadena localizada similar a Jueves.

DSCore.Properties.Resources.EnumDateOfWeekTuesday
Busca una cadena localizada similar a Martes.

DSCore.Properties.Resources.EnumDateOfWeekWednesday
Busca una cadena localizada similar a Miércoles.

DSCore.Properties.Resources.Exception_Deserialize_Bad_Format
Busca una cadena localizada similar a El contenido json para el tipo {0} no presenta un formato correcto.

DSCore.Properties.Resources.Exception_Deserialize_Unsupported_Cache
Busca una cadena localizada similar a No se pueden cargar los datos almacenados.

DSCore.Properties.Resources.Exception_Serialize_Depth_Unsupported
Busca una cadena localizada similar a La profundidad {0} supera el valor máximo {1} en la ruta "{2}".

DSCore.Properties.Resources.Exception_Serialize_DesignScript_Unsupported
Busca una cadena localizada similar a No se puede serializar este tipo de geometría.

DSCore.Properties.Resources.Exception_Serialize_Unsupported_Type
Busca una cadena localizada similar a No se pueden almacenar datos del tipo {0}.

DSCore.Properties.Resources.ExportToCSVObsolete
Busca una cadena localizada similar a Utilizar el nodo Data.ExportCSV en su lugar.

DSCore.Properties.Resources.FactorialNegativeInt
Busca una cadena localizada similar a El valor de entrada de Math.Factorial no puede ser negativo.

DSCore.Properties.Resources.FactorialOverflow
Busca una cadena localizada similar a El valor de retorno de Math.Factorial está fuera de rango.

DSCore.Properties.Resources.FindPointsWithinRadiusNullPointMessage
Busca una cadena localizada similar a Debe proporcionar un centro.

DSCore.Properties.Resources.FindPointsWithinRadiusSearchRadiusMessage
Busca una cadena localizada similar a El radio de búsqueda no puede ser cero.

DSCore.Properties.Resources.FromObjectObsolete
Busca una cadena localizada similar a Este nodo es obsoleto, utilice "String from Object".

DSCore.Properties.Resources.IntegerOverflow
Busca una cadena localizada similar a La operación ha generado un desbordamiento de número entero. El resultado puede ser inesperado.

DSCore.Properties.Resources.InvalidDestinationPathErrorMessage
Busca una cadena localizada similar a Ruta de archivo de destino no válida utilizada como ruta de copia.

DSCore.Properties.Resources.InvalidKeysErrorMessage
Busca una cadena localizada similar a Uno o más tipos de entrada no coinciden. No se admiten listas como claves.

DSCore.Properties.Resources.InvalidKeysLenghtErrorMessage
Busca una cadena localizada similar a El número de elementos no coincide con el número de claves. href=InvalidKeysLenghtErrorMessage.html.

DSCore.Properties.Resources.LoadImageFromPathObsolete
Busca una cadena localizada similar a Utiliza los nodos File.FromPath - > Image.ReadFromFile en su lugar.

DSCore.Properties.Resources.MissingPythonEngine
Busca una cadena localizada similar a No se ha podido encontrar el motor de Python seleccionado.

DSCore.Properties.Resources.ObjectArgumentExceptionMessage
Busca una cadena localizada similar a Objeto no puede ser nulo; proporcione el valor adecuado.

DSCore.Properties.Resources.QuadtreeConstructionEmptyUVSetMessage
Busca una cadena localizada similar a No se puede generar un árbol cuádruple a partir de un conjunto vacío de puntos.

DSCore.Properties.Resources.QuadtreeConstructionNullUVSetMessage
Busca una cadena localizada similar a No se puede generar un árbol cuádruple a partir de un conjunto nulo de UV.

DSCore.Properties.Resources.ReadImageObsolete
Busca una cadena localizada similar a Utiliza los nodos File.FromPath - > Image.ReadFromFile - > Image.Pixels en su lugar.

DSCore.Properties.Resources.ReadTextObsolete
Busca una cadena localizada similar a Utiliza los nodos File.FromPath - > File.ReadText en su lugar.

DSCore.Properties.Resources.StringRemoveCountOutOfRangeMessage
Busca una cadena localizada similar a El recuento está fuera de rango.

DSCore.Properties.Resources.StringRemoveStartIndexOutOfRangeMessage
Busca una cadena localizada similar a El startIndex está fuera de rango.

DSCore.Properties.Resources.StringToNumberInvalidNumberMessage
Busca una cadena localizada similar a Este número no es válido..

DSCore.Properties.Resources.WebRequestNullUrlMessage
Busca una cadena localizada similar a La URL no puede ser nula..

DSCore.Properties.Resources.WriteImageObsolete
Busca una cadena localizada similar a Utiliza el nodo Image.WriteToFile en su lugar.