DSCore.Color.Red
Especifica el componente rojo del color, de 0 a 255.
Valor de rojo para el modelo de color RGB, un entero entre 0 y 255 (inclusive).

DSCore.Color.Green
Especifica el componente verde del color, de 0 a 255.
Valor de verde para el modelo de color RGB, un entero entre 0 y 255 (inclusive).

DSCore.Color.Blue
Especifica el componente azul del color, de 0 a 255.
Valor de azul para el modelo de color RGB, un entero entre 0 y 255 (inclusive).

DSCore.Color.Alpha
Especifica el componente alfa del color, de 0 a 255.
Valor de alfa, un entero entre 0 y 255 (inclusive).

DSCore.Color.ByARGB(System.Int32,System.Int32,System.Int32,System.Int32)
Genera un color mediante componentes alfa, rojo, verde y azul.
alpha: Valor alfa (entre 0 y 255, inclusive).
red: Valor rojo para el modelo de color RGB (entre 0 y 255, inclusive).
green: Valor verde para el modelo de color RGB (entre 0 y 255, inclusive).
blue: Valor azul para el modelo de color RGB (entre 0 y 255, inclusive).
Color creado a partir de ARGB.
color

DSCore.Color.Brightness(DSCore.Color)
Devuelve el valor de brillo de este color.
color: Color desde el que se consultará el brillo.
Valor de brillo (entre 0 y 1, inclusive).

DSCore.Color.Saturation(DSCore.Color)
Devuelve el valor de saturación de este color.
Valor de saturación como doble entre 0 y 1 (inclusive).

DSCore.Color.Hue(DSCore.Color)
Devuelve el valor de matiz de este color.
color: Un objeto de color
Valor de matiz para el color, un valor doble entre 0 y 1 (inclusive).
hues

DSCore.Color.Components(DSCore.Color)
Enumera los componentes del color en el orden siguiente: alfa, rojo, verde, azul.
color: Un objeto de color
Valor de alfa, un entero entre 0 y 255 (inclusive)
Valor de rojo para el modelo de color RGB, un entero entre 0 y 255 (inclusive).
Valor de verde para el modelo de color RGB, un entero entre 0 y 255 (inclusive).
Valor de azul para el modelo de color RGB, un entero entre 0 y 255 (inclusive)
alpha,red,green,blue

DSCore.Color.BuildColorFrom1DRange(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double},System.Double)
Devuelve un color de un degradado de color entre un color inicial y un color final.
parameters: Los valores entre 0 y 1 del rango en que desea tomar la muestra de color.
Los colores del rango especificado.
color,range,gradient

DSCore.Color.Lerp(DSCore.Color,DSCore.Color,System.Double)
Interpola linealmente entre dos colores.
start: El color inicial.
end: El color final.
t: Un parámetro entre 0.0 y 1.0.
Returns: El color interpolado o blanco.

DSCore.Color.Blerp(System.Collections.Generic.IList{DSCore.Color.IndexedColor2D},Autodesk.DesignScript.Geometry.UV)
Interpola bilinealmente entre un conjunto de colores.
Returns: El color interpolado o blanco.
This algorithm is not the same as the solution found from wikipedia
(reference: https://en.wikipedia.org/wiki/Bilinear_interpolation)

DSCore.Color.Add(DSCore.Color,DSCore.Color)
Construye un color con la combinación de los valores ARGB de dos colores existentes.
color: Un color que añadir.
otherColor: Otro color que añadir.
Resultado de color de la adición de dos colores.

DSCore.Color.Multiply(DSCore.Color,System.Double)
Multiplica un color de entrada con un multiplicador de número para producir un color más oscuro. El color de entrada debe tener un valor alfa menor que 255.
color: Color que multiplicar.
multiplier: Valor del multiplicador.
Resultado de color de la multiplicación.

DSCore.Color.Divide(DSCore.Color,System.Double)
Divide un color de entrada con un divisor de número para producir un color más claro y eliminar matiz de color
color: Color que dividir.
dividend: Valor de dividendo.
Resultado de color de la división.