DSCore.Data.DataNodeDynamoType
Una clase que representa un DataType admitido por Dynamo

DSCore.Data.DataNodeDynamoType.#ctor(System.Type,System.String,System.String)
Una clase que representa un DataType admitido por Dynamo

DSCore.Data.DataNodeDynamoType.Type
El tipo subyacente

DSCore.Data.DataNodeDynamoType.Name
Un nombre opcional para modificar el nombre de tipo (`Number` en lugar de `long`)

DSCore.Data.DataNodeDynamoType.TypeId
Formato de conductor $typeid (por ejemplo, "autodesk.math:point3d-1.0.0").
Valor nulo para tipos primitivos que no utilizan' serialización $typeid.

DSCore.Data.DataNodeDynamoType.Level
El nivel jerárquico que se mostrará en la interfaz de usuario

DSCore.Data.DataNodeDynamoType.IsLastChild
Determina el tipo es el último elemento secundario de una jerarquía (por motivos de interfaz de usuario).

DSCore.Data.DataNodeDynamoType.Parent
El elemento principal del tipo (si existe)