DSCore.CurveMapper.PerlinNoiseCurve
Representa una curva de ruido de Perlin en CurveMapper.
La curva genera ruido procedimental basado en puntos de control y funciones de ruido de Perlin.

DSCore.CurveMapper.PerlinNoiseCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Devuelve los valores de X e Y distribuidos a lo largo de la curva.