DSCore.String
Métodos de gestión de cadenas.

DSCore.String.ToNumber(System.String)
Convierte una cadena en número entero o doble.
string: Cadena que se convertirá.
Número entero o doble.
2number,str2number,strtonumber,string2number,stringtonumber,int,double,cast

DSCore.String.GetNumber(System.String)
Obtiene todas las cadenas numéricas de la cadena de destino como una cadena.
string: Cadena de destino que se va a obtener
Número en cadena
getnumber,tonumber,strtonumber,numberinstring,string2number,stringtonumber,int,double,cast

DSCore.String.Concat(System.String[])
Concatena varias cadenas y crea una sola cadena.
strings: Lista de cadenas que se deben concatenar.
Cadena hecha a partir de la lista de cadenas.
concatenate,join,combine strings

DSCore.String.Length(System.String)
Devuelve el número de caracteres presentes en la cadena especificada.
string: Cadena de la que se buscará su longitud.
Número de caracteres de la cadena.
count,size,characters,chars,length,sizeof

DSCore.String.Split(System.String,System.String[])
Divide una única cadena en una lista de cadenas. Las cadenas del separador
especificadas determinan las divisiones.
string: Cadena que se dividirá.
separators: Cadenas que, de estar presentes, determinan el final y el inicio de una división.
Lista de cadenas creadas a partir de la cadena de entrada.
divide,separator,delimiter,cut,csv,comma,

DSCore.String.Join(System.String,System.String[])
Concatena varias cadenas en una sola e inserta el separador
especificado entre cada una de las cadenas unidas.
separator: Cadena que se debe insertar entre las cadenas unidas.
strings: Cadenas que se deben unir en una sola cadena.
Una cadena hecha a partir de una lista de cadenas que incluyen el carácter separador.
join,separator,build csv,concat,construct

DSCore.String.ToUpper(System.String)
Pasa la cadena especificada a mayúsculas.
string: Cadena que se pasará a mayúsculas.
Cadena en mayúsculas.
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.ToLower(System.String)
Pasa la cadena especificada a minúsculas.
string: Cadena que se pasará a minúsculas.
Cadena en minúsculas.
2lowercase,to lowercase,tolowercase,lowercase

DSCore.String.ToTitle(System.String)
Convierte la cadena especificada al formato de mayúsculas/minúsculas de título.
str: Cadena que se convertirá al formato de mayúsculas/minúsculas de título.
Cadena para formato de mayúsculas/minúsculas de título.
2titlecase,to titlecase,to title case,totitlecase,titlecase

DSCore.String.ChangeCase(System.String,System.Boolean)
Pasa la cadena especificada a mayúsculas o minúsculas, en
función de un parámetro booleano.
string: Cadena que se pasará a mayúsculas o minúsculas.
upper: True para pasar a mayúsculas, False para pasar a minúsculas.
Cadena con el cambio de caja.
2lowercase,to lowercase,tolowercase,lowercase,
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.Substring(System.String,System.Int32,System.Int32)
Recupera una subcadena de la cadena especificada. La subcadena comienza en la
posición de carácter indicada y tiene la longitud expresada.
string: Cadena de la que se recuperará una subcadena.
startIndex: Posición de carácter inicial de la subcadena en la cadena original.
length: Número de caracteres de la subcadena.
Subcadena creada a partir de la cadena original.
subset,get string,part,smaller string

DSCore.String.Contains(System.String,System.String,System.Boolean)
Determina si la cadena indicada contiene la cadena especificada.
string: Cadena en la que se buscará.
searchFor: Subcadena que se buscará.
ignoreCase: Si la comparación distingue o no entre minúsculas y mayúsculas.
Si la cadena contiene la subcadena.
test,within,in,is in,part of

DSCore.String.CountOccurrences(System.String,System.String,System.Boolean)
Cuenta el número de coincidencias no solapadas de una subcadena en una determinada cadena.
string: Cadena en la que se buscará.
searchFor: Subcadena que se buscará.
ignoreCase: Si la comparación distingue o no entre minúsculas y mayúsculas.
Número de coincidencias no solapadas de la subcadena en la cadena.
count,substring,count occurrences,numberof,search,find,within

DSCore.String.Replace(System.String,System.String,System.String)
Sustituye todas las coincidencias del texto de una cadena por otro texto.
string: Cadena en la que se deben sustituir las subcadenas.
searchFor: Texto que se debe sustituir.
replaceWith: Texto que se debe utilizar para la sustitución.
Cadena con las sustituciones realizadas.
replace,overwrite,override,find and replace

DSCore.String.EndsWith(System.String,System.String,System.Boolean)
Determina si la cadena indicada termina con la subcadena especificada.
string: Cadena de la que se buscará el final.
searchFor: Subcadena para la que se buscará el final.
ignoreCase: True para omitir la distinción de mayúsculas y minúsculas en la comparación; False para tenerla en cuenta.
True si la cadena empieza por una subcadena; False si no.
test,does end,last,str end,terminated

DSCore.String.StartsWith(System.String,System.String,System.Boolean)
Determina si la cadena indicada empieza con la subcadena especificada.
string: Cadena del que se buscará el inicio.
searchFor: Subcadena cuyo inicio se debe buscar.
ignoreCase: True para omitir la distinción de mayúsculas y minúsculas en la comparación; False para tenerla en cuenta.
True si la cadena empieza por una subcadena; False si no.
test,beginswith,start,string start,front

DSCore.String.TrimWhitespace(System.String)
Elimina todos los espacios en el inicio y el final de la cadena especificada.
string: Cadena que se debe recortar.
Cadena con espacios iniciales y finales eliminados.
trimstring,cleanstring,whitespace,blanks,spaces,string trim

DSCore.String.TrimLeadingWhitespace(System.String)
Elimina todos los espacios en el inicio de la cadena especificada.
string: Cadena que se debe recortar.
Cadena con espacios iniciales eliminados.
trim string,clean string,trim leading whitespaces,string trim

DSCore.String.TrimTrailingWhitespace(System.String)
Elimina todos los espacios en el final de la cadena especificada.
string: Cadena que se debe recortar.
Cadena con espacios finales eliminados.
trim string,clean string,trim trailing whitespaces,string trim

DSCore.String.IndexOf(System.String,System.String,System.Boolean)
Busca el índice de base cero de la primera coincidencia de una subcadena dentro de
una cadena. Devuelve -1 si no se encuentra ninguna.
string: Cadena en la que se buscará.
searchFor: Subcadena que se buscará.
ignoreCase: Si la comparación distingue o no entre minúsculas y mayúsculas.
Índice de la primera coincidencia de la subcadena o -1 si no se encuentra ninguna.
index of,find substring,where,search

DSCore.String.AllIndicesOf(System.String,System.String,System.Boolean)
Busca la lista de índices en los que la subcadena aparece dentro de una cadena.
string: Cadena en la que se debe buscar.
searchFor: Subcadena en la que se debe buscar.
ignoreCase: Si la comparación distingue o no entre minúsculas y mayúsculas.
Lista de índices en los que se encuentra la subcadena (tipo: int[])
all indices of,find substring,where,search

DSCore.String.LastIndexOf(System.String,System.String,System.Boolean)
Busca el índice de base cero de la última coincidencia de una subcadena dentro de
una cadena. Devuelve -1 si no se encuentra ninguna.
string: Cadena en la que se buscará.
searchFor: Subcadena en la que se debe buscar.
ignoreCase: Si la comparación distingue entre minúsculas y mayúsculas.
Índice de la última coincidencia de la subcadena o -1 si no se encuentra ninguna.
last index of,find substring,where,search

DSCore.String.PadLeft(System.String,System.Int32,System.String)
Alinea a la derecha los caracteres de la cadena especificada y añade un relleno de
espacios a la izquierda para ajustarla a la longitud total especificada.
string: Cadena que se rellenará.
newLength: Longitud total de la cadena tras el relleno.
padChars: Carácter que se debe utilizar para el relleno; se establece por defecto en un espacio.
Cadenas alineadas a la derecha y con relleno de espacios a la izquierda, que se ajustan a la longitud total especificada.
pad left,right align,right-align,pad,string space,whitespace

DSCore.String.PadRight(System.String,System.Int32,System.String)
Alinea a la izquierda los caracteres de la cadena especificada y añade un relleno de
espacios a la derecha para ajustarla a la longitud total especificada.
string: Cadena que se rellenará
newLength: Longitud total de la cadena tras el relleno
padChars: Carácter que se debe utilizar para el relleno; se establece por defecto en un espacio.
Cadenas alineadas a la izquierda y con relleno de espacios a la derecha, que se ajustan a la longitud total especificada.
pad right,left align,left-align,pad string space,whitespace

DSCore.String.Center(System.String,System.Int32,System.String)
Aumenta la longitud de una cadena mediante la adición de espacios a izquierda y derecha del texto original.
string: Cadena que se centrará.
newLength: Longitud total de la cadena tras centrarla.
padChars: Carácter que se debe utilizar para el centrado; se establece por defecto en un espacio.
Cadenas centradas y con relleno de espacios a izquierda y derecha,
que se ajustan a la longitud total especificada.
center align,center-align,centered,whitespace,expand string,surround

DSCore.String.Insert(System.String,System.Int32,System.String)
Inserta una cadena dentro de otra en el índice especificado.
string: Cadena en la que se debe realizar la inserción.
index: Índice de inserción.
toInsert: Cadena que se debe insertar.
Cadena con la subcadena insertada.
insertstring,insert string

DSCore.String.Remove(System.String,System.Int32,System.Nullable{System.Int32})
Elimina caracteres de una cadena.
string: Cadena de la que se deben eliminar caracteres.
startIndex: Índice de inicio de eliminación.
count: Cantidad de caracteres que se van a eliminar.
Nota: si el recuento es negativo, la eliminación va de derecha a izquierda.
Cadena con caracteres eliminados.
delete,rem,shorten