DSCore.CurveMapper.SquareRootCurve
Representa una curva de raíz cuadrada en CurveMapper.
La curva sigue una función de raíz cuadrada y se ve influida por dos puntos de control.

DSCore.CurveMapper.SquareRootCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Devuelve los valores de X e Y distribuidos a lo largo de la curva.