DSCore.CurveMapper.ParabolicCurve
表示 CurveMapper 中的拋物曲線。
曲線會沿著根據兩個控制點的二次方程式。

DSCore.CurveMapper.ParabolicCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
傳回分佈在曲線上的 X 和 Y 值。