DSCore.Compare
比較方法。

DSCore.Compare.GreaterThan(System.Object,System.Object)
如果 a 大於 b，則傳回 true。
a: 可比較的物件。
b: 可比較的物件。
布林運算結果。
larger,bigger

DSCore.Compare.GreaterThanOrEqual(System.Object,System.Object)
如果 a 大於或等於 b，則傳回 true。
a: 可比較的物件。
b: 可比較的物件。
布林運算結果。
larger,bigger,equal

DSCore.Compare.LessThan(System.Object,System.Object)
如果 a 小於 b，則傳回 true。
a: 可比較的物件。
b: 可比較的物件。
布林運算結果。
less,smaller

DSCore.Compare.LessThanOrEqual(System.Object,System.Object)
如果 a 小於或等於 b，則傳回 true。
a: 可比較的物件。
b: 可比較的物件。
布林運算結果。
smaller,equal