DSCore.CurveMapper.LinearCurve
表示 CurveMapper 中的線性曲線。
線性曲線是兩個控制點之間的一條直線。

DSCore.CurveMapper.LinearCurve.LineEquation(System.Double)
計算最小和最大 X 值的 Y 值 (圖元區座標)

DSCore.CurveMapper.LinearCurve.SolveForXGivenY(System.Double)
計算最小和最大 Y 值的 X 值 (圖元區座標)

DSCore.CurveMapper.LinearCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
傳回分佈在曲線上的 X 和 Y 值。