DSCore.CurveMapper.GaussianCurve
表示 CurveMapper 中的高斯曲線。
高斯曲線會沿著四個控制點定義的一個鐘形分佈。

DSCore.CurveMapper.GaussianCurve.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
指出節點目前是否正調整大小，以防止意外的控制點更新。

DSCore.CurveMapper.GaussianCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
傳回分佈在曲線上的 X 和 Y 值。