DSCore.CurveMapper.SquareRootCurve
表示 CurveMapper 中的平方根曲線。
曲線會沿著一個平方根函數，並受兩個控制點的影響。

DSCore.CurveMapper.SquareRootCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
傳回分佈在曲線上的 X 和 Y 值。