DSCore.List
用於建立和操控清單的方法。

DSCore.List.Empty
傳回空白清單。
空清單。
empty list, emptylist,[]

DSCore.List.UniqueItems(System.Collections.IList)
建立新的清單，其中包含給定清單中所有唯一的項目。
list: 篩選重複項目的清單。
篩選清單。
removes,duplicates,remove duplicates,cull duplicates,distinct,listcontains

DSCore.List.Contains(System.Collections.IList,System.Object)
判定給定清單是否包含給定項目。 此函數可以搜尋子清單包含在其中。
list: 要在其中搜尋的清單
item: 要查看的項目
如果清單包含項目則為 true，如果不包含則為 false
item,search,in,listcontains

DSCore.List.IsHomogeneous(System.Collections.IList)
檢查清單中的項目相同的類型。
list: 清單檢查其是否 ' s 同質。
清單是否是同質的。
homogeneous,allequal,same,type

DSCore.List.IsRectangular(System.Collections.IList)
檢查的項目清單中的所有列均相同。
list: 清單中的列設定為要檢查是否有相同數目的項目。
清單是否具有相同的料件數在所有列。
rectangular,isrectangular,same,sublist,row

DSCore.List.IsUniformDepth(System.Collections.IList)
檢查清單中的項目具有相同的深度。
list: 如果清單中要檢查的項目具有相同的深度。
是否深度的清單會均勻。
depth,uniform,isuniformdepth,sublist,jagged

DSCore.List.SetDifference(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
傳回新清單，該清單包括物件 List1 中但排除 List2 中的物件。
list1: 要包括在新清單中的物件清單
list2: 要排除在新清單中的物件清單
包含在 List1 但不在 List2 的物件的新清單
difference,setdifference,set

DSCore.List.SetIntersection(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
傳回新清單，其中包含的物件會顯示在這兩個清單 1 和 2。
list1: 要與 list2 比較的物件清單
list2: 要與 list1 比較的物件清單
包含同時在 List1 與 List2 的物件的新清單
intersection,setintersection,set,overlap

DSCore.List.SetUnion(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
傳回新清單，其中包含的物件會顯示在清單 1 或 2。
list1: 要包括的物件清單
list2: 要包括在 List1 的物件清單
包含在 List1 或 List2 的物件的新清單
union,setunion,set

DSCore.List.IndexOf(System.Collections.IList,System.Object)
傳回元素在給定清單中的索引。給定清單與目標元素之間的比對必須完全相符 (亦即 int 對 int，double 對 double，string 對 string，object 對 object 等等)。
list: 「 尋找」清單中的元素。
element: 其索引的元素將傳回。
元素在清單中的索引。如果找不到完全相符的項目，則會傳回無效的索引 -1。
index,indexof

DSCore.List.CountFalse(System.Collections.IList)
傳回數假布林值給定清單中。
list: 清單中尋找假布林值。
「 假布林清單中的值。
false,count

DSCore.List.CountTrue(System.Collections.IList)
傳回數值的真實的布林值給定清單中。
list: 清單中尋找的真實的布林值。
「 全布林清單中的值。
true,count

DSCore.List.Insert(System.Collections.IList,System.Object,System.Int32)
將元素插入至清單中的指定索引。
list: 元素將插入到的清單
element: 要插入的元素
index: 指定元素要插入清單中的位置
已插入元素的清單
insert,add

DSCore.List.Reorder(System.Collections.IList,System.Collections.IList)
重新排序根據指定的輸入清單中的索引。
list: 要重新排序的清單
indices: 用來重新排序清單中項目的索引
已重新排序的清單
reorder,index,indices

DSCore.List.SortIndexByValue(System.Collections.Generic.List{System.Double})
排序清單中的項目，並返回其索引。
list: 要排序的項目清單
項目在已排序清單中的索引
sort,index,value

DSCore.List.NormalizeDepth(System.Collections.IList,System.Int32)
傳回多維清單根據給定的等級。
list: 清單中的深度是標準化根據等級。
rank: 在順序清單中將標準化。 預設值是 1。
清單中的標準化等級。
depth,normalize

DSCore.List.Reverse(System.Collections.IList)
建立新的清單，其中包含給定清單的項目，但以逆向順序排列。
list: 要反轉的清單。
已反轉的清單
flip,listcontains

DSCore.List.__Create(System.Collections.IList)
建立新清單，其中包含給定的項目。
items: 要儲存在新清單中的項目。

DSCore.List.Sublists(System.Collections.IList,System.Collections.IList,System.Int32)
使用 DesignScript 範圍語法，從清單建置子清單。
list: 要從中建立子清單的清單。
ranges: 子清單元素的索引範圍。
例如 \"{0..3,5,2}\"
offset: 要套用至子清單的偏移。
例如，範圍 \"0..3\" 與偏移 2，將產生
{0,1,2,3}{2,3,4,5}{4,5,6,7}...
類型: var[]..[]
sublists,build sublists,subset,

DSCore.List.Sort(System.Collections.Generic.IEnumerable{System.Object})
使用內建的自然排序來排序清單。
list: 要排序的清單
已排序的清單
sort,order,sorted

DSCore.List.MinimumItem(System.Collections.Generic.IEnumerable{System.Object})
從清單中傳回最小值。
list: 要從中取得最小值的可比較項目清單
清單中的最小項目。
least,smallest,find min

DSCore.List.MaximumItem(System.Collections.Generic.IEnumerable{System.Object})
從清單中傳回最大值。
list: 要從中取得最大值的可比較項目清單
清單中的最大項目。
greatest,largest,biggest,find max

DSCore.List.FilterByBoolMask(System.Collections.IList,System.Collections.IList)
查看個別布林清單中的對應索引來篩選順序。
list: 要篩選的清單。
mask: 表示遮罩的布林清單。
遮罩索引為 True 的項目。
遮罩索引為 False 的項目。
filter,in,out,mask,dispatch,bool filter,boolfilter,bool filter

DSCore.List.Deconstruct(System.Collections.IList)
若有清單，即會產生清單中的第一個項目，因此新清單包含第一個項目以外的所有項目。
list: 要分割的清單。
清單中的第一個項目 (類型: var[]..[])
清單的其餘部分 (類型: var[]..[])
first,rest,list split,listcontains

DSCore.List.SortByKey(System.Collections.IList,System.Collections.IList)
根據清單鍵排序清單
list: 要排序的清單
keys: 鍵清單，鍵必須可排序 (例如數字、字串)
類型: var[]..[]
類型: var[]..[]
sort;key

DSCore.List.GroupByKey(System.Collections.IList,System.Collections.IList)
根據項目的關鍵值等將項目群組至子清單
list: 要群組為子清單的項目清單
keys: 用於群組項目的關鍵值 (在輸入清單中每一個項目皆有一個)
子清單的清單，包含以關鍵值等群組的項目
對應每個群組的關鍵值
list;group;groupbykey;

DSCore.List.GroupBySimilarity(System.Collections.IList,System.Double,System.Boolean)
根據清單索引的相鄰性和其值的相似性群集清單元素
list: 要根據相鄰性和相似性分組為子清單的項目清單
tolerance: 將類似項目分組的閾值
considerAdjacency: 控制節點是否應考慮相鄰性的布林值。
其項目依相似值分組的子清單的清單
包含分組值原始索引的子清單的清單
list;group;similar;adjacent;adjacency;groupbyadjacency;groupadjacentitems;groupsimilaritems;cluster;tolerance

DSCore.List.LevenshteinDistance(System.String,System.String)
「Levenshtein 距離」是用來取得 2 個字串之間距離的演算法
| 來源

DSCore.List.AddItemToFront(System.Object,System.Collections.IList)
將項目加入至清單開頭。
item: 要加入的項目。項目可以是物件或清單。
list: 要加入至的清單。
已加入項目的清單
insert,add,item,front,start,begin

DSCore.List.AddItemToEnd(System.Object,System.Collections.IList)
將項目加入至清單結尾。
item: 要加入的項目。項目可以是物件或清單。
list: 要加入至的清單。
已加入項目的清單
insert,add,item,end

DSCore.List.TakeItems(System.Collections.IList,System.Int32)
從清單開頭擷取項目數量。
list: 要從中取得的清單。
amount: 要取得的項目數量。 若為負值，則從清單結尾取得項目。
萃取的項目清單。
get,sub,sublist,extract

DSCore.List.DropItems(System.Collections.IList,System.Int32)
從清單開頭移除某個數量的項目。如果數量為負值，
則會從清單結尾移除項目。
list: 要移除項目的清單。
amount: 要移除的項目數量。 若為負值，則從清單結尾移除項目。
剩餘項目的清單。
drop,remove,shorten

DSCore.List.ShiftIndices(System.Collections.IList,System.Int32)
將清單中的索引向右移給定的數量。
list: 要移動的清單。
amount: 索引的移動量。 若為負值，索引將向左移。
已移動的清單。
shift,offset

DSCore.List.GetItemAtIndex(System.Collections.IList,System.Int32)
從位於指定索引的給定清單傳回項目。
list: 要從中擷取項目的清單。
index: 要擷取的項目索引。
清單中位於給定索引的項目。
get,item,index,fetch,at,getfrom,get from,extract

DSCore.List.ReplaceItemAtIndex(System.Collections.IList,System.Int32,System.Object)
從給定清單中取代位於指定索引的項目。
list: 要取代其中項目的清單。
index: 要取代的項目索引。
item: 要插入的項目。
項目已被取代的新清單。
replace,switch

DSCore.List.ReplaceItemAtIndices(System.Collections.IList,System.Collections.Generic.IList{System.Int32},System.Object)
取代給定清單中位於指定索引的項目。
list: 要取代項目的清單。
indices: 要被取代項目的索引。
item: 要插入的項目。
取代項目後的新清單。
replace,switch

DSCore.List.Slice(System.Collections.IList,System.Nullable{System.Int32},System.Nullable{System.Int32},System.Int32)
根據開始索引、結束索引和步長數量從給定清單傳回
單一子清單。
list: 要切割的清單。
start: 開始切割的索引。
end: 結束切割的索引。
step: 項目的索引量與原始清單中的索引量是分開的。
給定清單的切割項目。
list,sub,sublist,subrange,get sublist

DSCore.List.RemoveItemAtIndex(System.Collections.IList,System.Int32[])
從給定清單中移除指定索引中的項目。
list: 要移除項目的清單。
indices: 要移除的項目索引。
項目已被移除的清單。
index,indices,cull,remove,item

DSCore.List.DropEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
在給定的偏移之後，從給定清單中移除索引中的項目，
而這些索引是給定值的倍數。
list: 要移除項目的清單/
n: 將移除此引數倍數的索引。
offset: 要從清單開頭忽略的項目數量。
項目已被移除的清單。
nth,remove,cull,every

DSCore.List.TakeEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
在給定的偏移之後，從給定清單中擷取索引中的項目，
而這些索引是給定值的倍數。
list: 要移除項目的清單。
n: 將擷取此數倍數 (在偏移之後) 的索引。
offset: 要從清單開頭忽略的項目數量。
清單中的項目。
fetch,take,every,nth

DSCore.List.IsEmpty(System.Collections.IList)
判定給定清單是否為空的。
list: 要檢查是否空白的清單
如果清單是空的則為 true，如果不是則為 false
test,is,empty,null,count

DSCore.List.AllTrue(System.Collections.IList)
判定給定清單中的所有項目都是一個布林運算和具有「True」值。
list: 清單中的所有項目均會檢查是否正確。
如果清單中所有項目都成立則為 true，如果一個或多個項目不成立則為 false
test,all,true,istrue

DSCore.List.AllFalse(System.Collections.IList)
判定給定清單中的所有項目都是一個布林運算和具有「False」值。
list: 清單是否要勾選所有項目都 False。
如果清單中所有項目都不成立則為 true，如果一個或多個項目成立則為 false
test,all,false,isfalse

DSCore.List.AnyTrue(System.Collections.IList)
判定給定清單中是否有任何項目為布林值，而且有 true 值。
list: 要檢查是否有任何項目為 true 的清單。
是否有任何項目為 true。
test,any,true,istrue

DSCore.List.AnyFalse(System.Collections.IList)
判定給定清單中是否有任何項目為布林值，而且有 false 值。
list: 要檢查是否有任何項目為 false 的清單。
是否有任何項目為 false。
test,any,false,isfalse

DSCore.List.Count(System.Collections.IList)
傳回給定清單中儲存的項目數目。
list: 要取得項目計數的清單。
清單長度。
listlength,list length,count,size,sizeof

DSCore.List.Join(System.Collections.IList[])
將所有給定清單連接成單一清單。
lists: 要接合為一個清單的清單。
已接合的清單。
join lists,merge,concatenate

DSCore.List.FirstItem(System.Collections.IList)
傳回清單中的第一個項目。
list: 要從中取得第一個項目的清單。
清單中的第一個項目。
get,fetch,first,item,start

DSCore.List.RestOfItems(System.Collections.IList)
從給定清單中移除第一個項目。
list: 要取得其餘部分的清單。
清單的其餘部分。
get,fetch,rest,end,rest of list

DSCore.List.Chop(System.Collections.IList,System.Collections.Generic.List{System.Int32})
將清單細分為一組具有指定長度的連續子清單。清單分割於清單的頂端開始。
list: 要細分為子清單的清單
lengths: 要從輸入清單建立的連續子清單長度
從清單建立的子清單
sublists,build sublists,slices,partitions,cut,listcontains,chop

DSCore.List.DiagonalRight(System.Collections.IList,System.Int32)
沿著矩陣中從左下角到右上角的每一條對角線列出元素。
list: 展開清單
subLength: 每個新子清單的長度。
沿著矩陣對角線的元素清單。
diagonal,right,matrix,get diagonals,diagonal sublists

DSCore.List.DiagonalLeft(System.Collections.IList,System.Int32)
沿著矩陣中從左上角到右下角的每一條對角線列出元素。
list: 展開清單。
rowLength: 每個新子清單的長度。
沿著矩陣對角線的元素清單。
diagonal,left,matrix,get diagonals,diagonal sublists

DSCore.List.Transpose(System.Collections.IList)
置換清單的清單中的「列和欄」。
如果有某些列短於其他列，
空值會作為預留位置在結果
陣列中插入，以便其永遠為矩形。
lists: 要轉置的清單的清單
已轉置清單的清單
transpose,flip matrix,matrix,swap,rows,columns

DSCore.List.Clean(System.Collections.IList,System.Boolean)
從任意標註的指定清單中清除空值和空白清單的資料
list: 包含要清理的空值和空白子清單的清單
preserveIndices: 提供選項，以保留資料的索引
已轉置清單的清單
讓非結尾的空值不會被篩選掉
Returns: 空值和空白清單的清理清單

DSCore.List.OfRepeatedItem(System.Object,System.Int32)
建立一個清單，其中包含給定的項目和給定的項目數。
item: 要重複的項目。
amount: 要重複的項目數。
已重複項目的清單。
repeat,repeated,duplicate,list of item,fill list,copies,listcontains

DSCore.List.Cycle(System.Collections.IList,System.Int32)
透過連接給定清單的複本來建立新清單。
list: 要重複的清單。
amount: 要重複的項目數。
重複清單的清單，類型: var[]..[]
repeat,repeated,duplicate,repeated list,concat list

DSCore.List.LastItem(System.Collections.IList)
擷取清單中的最後一個項目。
list: 要取得其最後一個項目的清單
清單中的最後一個項目
get,fetch,last,item,end of list

DSCore.List.Shuffle(System.Collections.IList)
攪亂清單，將其項目順序隨機化。
list: 要攪亂的清單。
隨機化的清單。
random,randomize,shuffle,jitter,randomness

DSCore.List.Shuffle(System.Collections.IList,System.Int32)
攪亂清單，根據初始種子值將其項目的順序隨機化。
list: 要攪亂的清單。
seed: 隨機數產生器的種子值。
隨機化的清單。
random,randomize,shuffle,jitter,randomness,seed

DSCore.List.Permutations(System.Collections.IList,System.Nullable{System.Int32})
產生給定清單的給定長度的所有排列。
list: 要排列的清單。
length: 每個排列的長度。
給定長度之清單的排列 (類型: var[]..[])
permutation,permutations

DSCore.List.Combinations(System.Collections.IList,System.Int32,System.Boolean)
產生給定清單的給定長度的所有組合。
list: 要產生組合的清單
length: 每個組合的長度
replace: 一旦選取項目進行組合，是否移除這些項目，預設為 False。
給定長度的清單組合
combo

DSCore.List.FirstIndexOf(System.Collections.IList,System.Object)
給定項目，傳回其在清單中第一個發生
的 zero-based 索引。 如果在清單中找不到項目， 則傳回 -1。
list: 要在其中搜尋的清單。如果此引數為空，則傳回 -1。
item: 要查看的項目。
Returns: 清單中項目的 Zero-based 索引，或如果找不到則為 -1。

DSCore.List.AllIndicesOf(System.Collections.IList,System.Object)
給定項目，傳回其在清單中第一個發生
的 zero-based 索引。 如果在清單中找不到項目， 則傳回 -1。
list: 要在其中搜尋的清單。如果此引數為空，則傳回 -1。
item: 要查看的項目。
如果找到，則為項目的所有發生次數的 zero-based 索引的清單
，或如果項目不存在清單中則為空白清單。

DSCore.List.Flatten(System.Collections.IList,System.Int32)
依特定數量展開清單的巢狀清單。
list: 要展開的清單。
amount: 要移除的清單巢狀層數 (-1 將移除所有清單巢狀)
依數量展開清單
flatten,completely

DSCore.List.IndexInList(System.Collections.IList,System.Object)
除了使用 IList.Contains 使用 Enumerable.SequenceEqual 檢查
項目包含在清單，如果是陣列。 如果發現傳回索引
-1 (如果未找到)。
list: 該清單檢查是否包含的項目。
item: 「 料件需要找到。
索引清單中的項目。

DSCore.List.GetDepth(System.Object)
取得最大深度給定清單。
list: 輸入清單以取得深度。
深度給定清單。

DSCore.List.CountBool(System.Collections.IList,System.Boolean)
傳回數值的布林值指定給定清單中。
list: 清單中尋找的布林值。
value: 要尋找的布林值
數字指定的布林值清單中。

DSCore.List.IncreaseDepth(System.Collections.IList,System.Int32)
增加深度的給定清單指定的數量。 深度增加
建立新的清單，其中包含給定清單。
list: 清單中的深度會增加。
amt: 深度數量，來增加。
新清單 (其深度會增加 AMT。

DSCore.List.DoubleConverter(System.Object)
將整數轉換為倍準度整數，否則會傳回輸入物件。