DSCore.ColorRange1D.ByColorsAndParameters(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double})
透過提供顏色和參數的清單來建立 ColorRange1D。
colors: 顏色清單。
parameters: 介於 0.0 和 1.0 之間的參數清單。
Returns: 一個 ColorRange1D 物件。

DSCore.ColorRange1D.GetColorAtParameter(DSCore.ColorRange1D,System.Double)
傳回此顏色範圍中指定參數的顏色。
parameter: 介於 0.0 和 1.0 之間的值。
Returns: 一種顏色。

DSCore.ColorRange1D.Default
使用預設的色彩計畫建立一個 ColorRange1D。