DSCore.Data.DataNodeDynamoType
表示 Dynamo 支援的 DataType 的類別

DSCore.Data.DataNodeDynamoType.#ctor(System.Type,System.String,System.String)
表示 Dynamo 支援的 DataType 的類別

DSCore.Data.DataNodeDynamoType.Type
基本類型

DSCore.Data.DataNodeDynamoType.Name
要取代類型名稱的可選名稱 (`Number` 而非 `long`)

DSCore.Data.DataNodeDynamoType.TypeId
線路格式 $typeid (例如「autodesk.math:point3d-1.0.0」)。
如果是不使用 $typeid 序列化的基本型類型，則為空值。

DSCore.Data.DataNodeDynamoType.Level
要在使用者介面中顯示的階層層級

DSCore.Data.DataNodeDynamoType.IsLastChild
如果類型是階層的最後一個子系 (用於使用者介面)

DSCore.Data.DataNodeDynamoType.Parent
類型的父系 (如果有)