DSCore.ColorRange.ByColorsAndParameters(System.Collections.Generic.IList{DSCore.Color},System.Collections.Generic.IList{Autodesk.DesignScript.Geometry.UV})
建立 ColorRange 提供顏色和 UV 清單。
colors: 顏色清單。
parameters: 介於 (0.0,0.0) 和 (1.0,1.0) 之間的參數清單。
Returns: 一個 ColorRange 物件。

DSCore.ColorRange.GetColorAtParameter(Autodesk.DesignScript.Geometry.UV)
傳回此顏色範圍中指定參數的顏色。
parameter: 介於 (0.0,0.0) 和 (1.0,1.0) 之間的 UV。
Returns: 一種顏色。