DSCore.IO.FileSystem
處理檔案的方法。

DSCore.IO.FileSystem.AbsolutePath(System.String,System.String)
從給定路徑傳回絕對路徑。如果給定路徑是
相對路徑，則會相對於目前工作區
進行解析。如果檔案在相對路徑不存在，但存在於
給定的 hintPath，則會傳回 hintPath。
path: 相對路徑或完整路徑
hintPath: 前一個解析路徑
Returns: 絕對路徑

DSCore.IO.FileSystem.FileFromPath(System.String)
從給定的檔案路徑建立檔案物件。

DSCore.IO.FileSystem.ReadText(System.IO.FileInfo)
讀取文字檔，並將內容傳回為字串。
file: 要從中讀取文字的檔案物件
文字檔的內容。
read file,text,file

DSCore.IO.FileSystem.MoveFile(System.String,System.String,System.Boolean)
將指定的檔案移至新位置
path: 既有路徑的字串表現法
newPath: 新路徑的字串表現法
overwrite: 切換以覆蓋既有檔案
節點執行工作，不產生輸出

DSCore.IO.FileSystem.DeleteFile(System.String)
刪除指定的檔案。
path: 要刪除的檔案路徑
節點執行工作，不產生輸出

DSCore.IO.FileSystem.CopyFile(System.IO.FileInfo,System.String,System.Boolean)
複製檔案。
file: 要複製的檔案物件
destinationPath: 目標檔案路徑的字串表現法
overwrite: 切換以覆蓋既有檔案
節點會執行工作，如果複製動作成功則傳回 true。

DSCore.IO.FileSystem.FileExists(System.String)
判定檔案是否存在於給定路徑中。
path: 表示檔案路徑的字串
如果檔案存在則為 true；如果不存在則為 false
filepath

DSCore.IO.FileSystem.WriteText(System.String,System.String)
將文字內容寫入至路徑指定的檔案
filePath: 要寫入的路徑
text: 文字內容
無輸出
write file,text,file,filepath

DSCore.IO.FileSystem.AppendText(System.String,System.String)
附加文字內容至路徑指定的檔案
filePath: 要寫入的路徑
text: 文字內容
節點執行工作，不產生輸出
append file,write file,text,file,filepath

DSCore.IO.FileSystem.CombinePath(System.String[])
將多個字串結合成單一檔案路徑。
strings: 要合併成路徑的字串
合併的檔案路徑

DSCore.IO.FileSystem.FileExtension(System.String)
從檔案路徑傳回副檔名。
path: 要取得其副檔名的路徑
副檔名

DSCore.IO.FileSystem.ChangePathExtension(System.String,System.String)
變更檔案路徑的副檔名。
path: 要變更其副檔名的路徑
newExtension: 新副檔名的字串表現法
副檔名已變更的檔案路徑

DSCore.IO.FileSystem.DirectoryName(System.String)
傳回檔案路徑的目錄名稱。
path: 要取得其目錄資訊的路徑
檔案路徑的目錄名稱
directorypath

DSCore.IO.FileSystem.FileName(System.String,System.Boolean)
傳回檔案路徑的檔案名稱。
path: 要取得其檔案名稱的路徑
withExtension: 切換以在結果中包含副檔名
來自檔案路徑的檔案名稱

DSCore.IO.FileSystem.FileHasExtension(System.String)
判定檔案路徑是否包含副檔名。
path: 要檢查副檔名的路徑
如果檔案路徑包含副檔名則為 true；如果不包含則為 false

DSCore.IO.FileSystem.GetDirectoryContents(System.IO.DirectoryInfo,System.String,System.Boolean)
將傳回給定目錄中包含的檔案與目錄清單。可使用選擇性的 searchString 篩選結果。
directory: 要取得其內容的目錄
searchString: 用來篩選結果的搜尋字串
includeSubdirectories: 設定為 true 可在子目錄 (遞迴) 中包括檔案和資料夾，設定為 false 就只能在給定目錄的最上層包括結果。
來自查詢的結果檔案
來自查詢的結果目錄

DSCore.IO.FileSystem.CopyDirectory(System.IO.DirectoryInfo,System.String,System.Boolean)
將目錄複製至目標位置。
directory: 要複製的目錄
destinationPath: 複製作業在磁碟上的目標
overwriteFiles: 切換以覆蓋既有目錄
節點執行工作，不產生輸出

DSCore.IO.FileSystem.DeleteDirectory(System.String,System.Boolean)
刪除目錄。
path: 目錄在磁碟上的路徑
recursive: 是否刪除目錄的所有內容，預設為 False。
節點執行工作，不產生輸出

DSCore.IO.FileSystem.DirectoryExists(System.String)
判定目錄是否存在於給定路徑中。
path: 目錄在磁碟上的路徑
如果目錄存在則為 true；如果不存在則為 false
directorypath

DSCore.IO.FileSystem.MoveDirectory(System.String,System.String,System.Boolean)
將目錄移至新位置。
path: 既有路徑的字串表現法
newPath: 新路徑的字串表現法
overwriteFiles: 切換以覆蓋既有檔案
節點執行工作，不產生輸出