DSCore.Object
在所有資料上運算的一般函數。

DSCore.Object.IsNull(System.Object)
判定給定物件是否為空值。
object: 要測試的物件。
物件是否為空值。
is null

DSCore.Object.Identity(System.Object)
傳回傳入的項目，不執行任何動作。
object: 一個物件。
相同物件

DSCore.Object.Type(System.Object)
將表示為字串的物件類型傳回。
object: 要查詢類型的物件
Returns: 物件類型。