DSCore.String
用於管理字串的方法。

DSCore.String.ToNumber(System.String)
將字串轉換為整數或倍精數。
string: 要轉換的字串
整數或倍精度類型數值
2number,str2number,strtonumber,string2number,stringtonumber,int,double,cast

DSCore.String.GetNumber(System.String)
從目標字串中取得所有數字字串做為字串
string: 要取得的目標字串
字串中的數字
getnumber,tonumber,strtonumber,numberinstring,string2number,stringtonumber,int,double,cast

DSCore.String.Concat(System.String[])
將多個字串連接成單一字串。
strings: 要連接的字串清單。
由字串清單構成的字串。
concatenate,join,combine strings

DSCore.String.Length(System.String)
傳回給定字串中包含的字元數。
string: 要找出其長度的字串
字串中的字元數
count,size,characters,chars,length,sizeof

DSCore.String.Split(System.String,System.String[])
將單一字串分割為字串清單，而這些分割是由
給定的分隔符號字串決定。
string: 要分割的字串
separators: 決定分割終點和起點的字串 (如果存在)。
由輸入字串構成的字串清單
divide,separator,delimiter,cut,csv,comma,

DSCore.String.Join(System.String,System.String[])
將多個字串連接成單一字串，在每一個接合的字串之間插入指定的分隔符號。
separator: 要在接合的字串之間插入的字串。
strings: 要接合為單一字串的字串。
由字串清單構成的字串，包括分隔符號字元。
join,separator,build csv,concat,construct

DSCore.String.ToUpper(System.String)
將給定的字串轉換為全部大寫字元。
string: 要變成大寫的字串
大寫字串
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.ToLower(System.String)
將給定的字串轉換為全部小寫字元。
string: 要變成小寫的字串
小寫字串
2lowercase,to lowercase,tolowercase,lowercase

DSCore.String.ToTitle(System.String)
將給定的字串轉換為字首大寫。
str: 要變成字首大寫的字串
字首大寫字串
2titlecase,to titlecase,to title case,totitlecase,titlecase

DSCore.String.ChangeCase(System.String,System.Boolean)
根據布林參數將給定的字串轉換為全部大寫字元或全部小寫字元。
string: 要變成大寫或小寫的字串。
upper: true 表示轉換為大寫，false 表示轉換為小寫。
字體已轉換的字串。
2lowercase,to lowercase,tolowercase,lowercase,
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.Substring(System.String,System.Int32,System.Int32)
從給定的字串擷取子字串。子字串開始於給定的字元位置，且具有給定的長度。
string: 要取得其子字串的字串
startIndex: 原始字串中子字串的開始字元位置
length: 子字串中的字元數
由原始字串構成的子字串
subset,get string,part,smaller string

DSCore.String.Contains(System.String,System.String,System.Boolean)
判定給定的字串是否包含給定的子字串。
string: 要在其中搜尋的字串
searchFor: 要搜尋的子字串
ignoreCase: 比較時是否要將大小寫列入考量
字串是否包含子字串
test,within,in,is in,part of

DSCore.String.CountOccurrences(System.String,System.String,System.Boolean)
計算給定的字串內子字串發生非重疊的次數。
string: 要在其中搜尋的字串
searchFor: 要搜尋的子字串
ignoreCase: 比較時是否要將大小寫列入考量
字串中子字串發生非重疊的次數
count,substring,count occurrences,numberof,search,find,within

DSCore.String.Replace(System.String,System.String,System.String)
將字串中所有出現的文字取代為其他文字。
string: 要取代其中子字串的字串。
searchFor: 要被取代的文字。
replaceWith: 要取代為的文字。
進行取代的字串。
replace,overwrite,override,find and replace

DSCore.String.EndsWith(System.String,System.String,System.Boolean)
判定給定的字串是否以給定的子字串結尾。
string: 要搜尋其結尾的字串
searchFor: 要搜尋其結尾的子字串
ignoreCase: 比較時忽略大小寫則為 true，要將大小寫列入考量則為 false
如果字串以子字串開頭則為 true，如果不是則為 false
test,does end,last,str end,terminated

DSCore.String.StartsWith(System.String,System.String,System.Boolean)
判定給定的字串是否以給定的子字串開頭。
string: 要搜尋其開頭的字串
searchFor: 要搜尋開頭的子字串。
ignoreCase: 比較時忽略大小寫則為 true，要將大小寫列入考量則為 false
如果字串以子字串開頭則為 true，如果不是則為 false
test,beginswith,start,string start,front

DSCore.String.TrimWhitespace(System.String)
從給定字串的開頭和結尾中移除所有空格。
string: 要修剪的字串。
已移除開始和結束空格的字串。
trimstring,cleanstring,whitespace,blanks,spaces,string trim

DSCore.String.TrimLeadingWhitespace(System.String)
從給定字串的開頭中移除所有空格。
string: 要修剪的字串。
已移除前導空格的字串。
trim string,clean string,trim leading whitespaces,string trim

DSCore.String.TrimTrailingWhitespace(System.String)
從給定字串的結尾中移除所有空格。
string: 要修剪的字串。
已在結尾移除空格的字串。
trim string,clean string,trim trailing whitespaces,string trim

DSCore.String.IndexOf(System.String,System.String,System.Boolean)
尋找字串內第一個出現之子字串的零底索引。如果找不到任何索引，則傳回 -1。
string: 要在其中搜尋的字串
searchFor: 要搜尋的子字串
ignoreCase: 比較時是否要將大小寫列入考量
第一個出現之子字串的索引，如果未找到則為 -1
index of,find substring,where,search

DSCore.String.AllIndicesOf(System.String,System.String,System.Boolean)
尋找索引清單，其中子字串顯示在某個字串內。
string: 要在其中搜尋的字串。
searchFor: 要搜尋的子字串。
ignoreCase: 比較時是否要將字體列入考量。
找到子字串的索引清單 (類型: int[])
all indices of,find substring,where,search

DSCore.String.LastIndexOf(System.String,System.String,System.Boolean)
尋找字串內最後一個出現之子字串的零底索引。如果找不到任何索引，則傳回 -1。
string: 要在其中搜尋的字串。
searchFor: 要搜尋的子字串。
ignoreCase: 比較時是否要將字體列入考量。
最後一個出現之字串的索引，或 -1 (如果未找到)。
last index of,find substring,where,search

DSCore.String.PadLeft(System.String,System.Int32,System.String)
將給定字串中的字元靠右對齊，方法為在它們左邊填補空格，以達到指定的總長度。
string: 要填補的字串
newLength: 填補後的字串總長度
padChars: 用來填補的字元，預設為空格
透過以前導空格填補來達到指定的總長度，以靠右對齊的字串。
pad left,right align,right-align,pad,string space,whitespace

DSCore.String.PadRight(System.String,System.Int32,System.String)
將給定字串中的字元靠左對齊，方法為在它們右邊填補空格，以達到指定的總長度。
string: 要填補的字串
newLength: 填補後的字串總長度
padChars: 用來填補的字元，預設為空格
透過以結尾空格填補到指定的總長度而靠左對齊的字串
pad right,left align,left-align,pad string space,whitespace

DSCore.String.Center(System.String,System.Int32,System.String)
在任一側以空格包住原始字元來增加字串的長度。
string: 要置中的字串
newLength: 置中後的字串總長度
padChars: 用來置中的字元，預設為空格
透過以前導和尾隨空格填補來達到指定的總長度，以置中對齊的字串。
center align,center-align,centered,whitespace,expand string,surround

DSCore.String.Insert(System.String,System.Int32,System.String)
在給定索引中將一個字串插入至另一個字串。
string: 要插入至其中的字串。
index: 要插入其中的索引。
toInsert: 要插入的字串。
已插入子字串的字串。
insertstring,insert string

DSCore.String.Remove(System.String,System.Int32,System.Nullable{System.Int32})
移除字串中的字元。
string: 要從中移除字元的字串。
startIndex: 在其中開始移除的索引。
count: 要移除的字元數
注意事項: 如果 Count 為負值，則從右至左執行移除程序。
已移除字元的字串。
delete,rem,shorten