DSCore.CurveMapper.PowerCurve
表示 CurveMapper 中的冪函數曲線。
曲線是由從一個控制點導出的一個冪方程式所定義。

DSCore.CurveMapper.PowerCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
傳回分佈在曲線上的 X 和 Y 值。