DSCore.CurveMapper.PerlinNoiseCurve
表示 CurveMapper 中的柏林噪波曲線。
曲線會根據控制點和柏林噪波函數產生程序性的噪波。

DSCore.CurveMapper.PerlinNoiseCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
傳回分佈在曲線上的 X 和 Y 值。