DSCore.ObjectComparer
使用以下規則，對兩個物件實施比較函數。
1. 編號會假定為最小，接著為布林、字串和指標。
2. 如果兩個物件為 IComparable 且類型相同，則會使用
其原生比較機制。
3. 如果這兩個輸入皆為數值類型，但其中一個為布林，則布林較大
4. 或者，會將它們全部轉換為倍準度並比較。
5. 否則如果只有一個是數值類型，則數值類型物件較小
6. 否則如果只有一個是字串，則字串小於其他類型
7. 若不知道如何比較它們，最好根據雜湊碼比較它們。