DSCore.IO.Image
影像點陣圖的操作方法。

DSCore.IO.Image.ReadFromFile(System.IO.FileInfo)
載入檔案做為點陣圖。
file: 從中載入影像的檔案物件
來自檔案的影像物件

DSCore.IO.Image.Pixels(System.Drawing.Bitmap,System.Nullable{System.Int32},System.Nullable{System.Int32})
讀取影像檔案，然後傳回指定格線位置中的顏色值。
image: 要從中取得像素顏色的影像物件
xSamples: 範例格線點在 X 方向的數量。
ySamples: 範例格線點在 Y 方向的數量。
指定格線點處的顏色
read,image,bitmap,png,jpg,jpeg

DSCore.IO.Image.FromPixels(DSCore.Color[][])
從 2D 像素清單建構影像。
colors: 表示像素的顏色 2D 矩形清單
來自像素 2D 清單的影像

DSCore.IO.Image.FromPixels(DSCore.Color[],System.Int32,System.Int32)
從像素、寬度和高度的展開清單建構影像。
colors: 表示像素的顏色清單
width: 新影像的寬度 (以像素為單位)
height: 新影像的高度 (以像素為單位)
來自像素清單的影像

DSCore.IO.Image.Dimensions(System.Drawing.Bitmap)
傳回影像的寬度和高度。
image: 要取得標註的影像。
影像寬度 (像素)
影像高度 (像素)

DSCore.IO.Image.WriteToFile(System.String,System.Drawing.Bitmap)
將影像寫入至路徑，給與指定的檔案名稱。
image: 要寫入的影像
建立的影像物件
write image,image,file,filepath