DSCore.Data.ParseJSON(System.String)
Parse 會將任意的 JSON 字串轉換成值。與 JSON.Stringify 相反。
json: JSON 字串
結果類型取決於輸入字串的內容。結果類型可以是一個基本值 (例如，字串、布林或倍精度)、一個清單，或一個字典。

DSCore.Data.ToNative(Newtonsoft.Json.Linq.JToken)
剖析將 JToken 類型轉換為原生 .NET 物件的實施。
token: 要剖析為 N 的 JToken

DSCore.Data.DynamoJObjectToNative(Newtonsoft.Json.Linq.JObject)
剖析將 JObject 類型轉換為特定 Dynamo 物件 (例如幾何圖形、顏色、影像等) 的實施
Throws System.Exception:

DSCore.Data.StringifyJSON(System.Object)
Stringify 會將任意值或任意值的清單轉換成 JSON。可以使用複製對清單套用此作業，產生一個 JSON 字串的清單。
values: 值清單
基本類型 (例如，倍精度、整數、布林)、清單和字典將轉換成關聯的 JSON 類型的 JSON 字串。

DSCore.Data.CanObjectBeCached(System.Object)
判斷物件是否可快取，或為空值、「null」字串或空清單的輔助工具函數。
inputObject: 要檢查的物件

DSCore.Data.Remember(System.Object,System.String)
處理 Data.Remember 節點快取的函數
inputObject: 要快取的物件
cachedJson: 可選的既有快取 JSON

DSCore.Data.DataNodeDynamoTypeList
所有 Dynamo 支援的資料類型的靜態清單
Returns: 包含支援的資料類型的清單

DSCore.Data.#cctor
靜態建構函式

DSCore.Data.SafeExtractDictionaryValue(System.Collections.Generic.Dictionary{System.String,System.Object},System.String)
安全地萃取字典值的輔助工具函數
dict: 要從中萃取值的字典
key: 鍵/值對的鍵

DSCore.Data.EvaluateDefineDataNode(System.Object,System.String,System.Boolean,System.Boolean,System.String)
這是 AST 用於評估 Define Data 節點的函數。
執行驗證時，會處理某些節點邏輯
inputValue: 上游輸入值
typeString: 類型，以字串表示 (待辦: 最好傳遞「Type」類型的物件以直接比較類型)
isList: 如果輸入為 `ArrayList` 類型
isAutoMode: 如果節點處於「自動」模式
playerValue: 被 Dynamo 播放器注入節點的值 (如果有)。

DSCore.Data.FindCommonAncestor(System.Collections.ArrayList)
如果在自動模式中傳遞物件的 ArrayList，用於協助尋找類型的函數
list: 輸入值，應為 ArrayList 類型

DSCore.Data.LikelyAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
從 DataNodeDynamoType 節點清單中傳回最低層節點的輔助工具函數
nodes: 要演算的 DataNodeDynamoType 清單

DSCore.Data.FindClosestCommonAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
嘗試決定資料類型清單中共同上層的輔助工具函數
nodes: 要演算的 DataType 節點清單

DSCore.Data.FindCommonAncestorBetweenTwoNodes(DSCore.Data.DataNodeDynamoType,DSCore.Data.DataNodeDynamoType)
嘗試在兩個 Dynamo 類型之間尋找共同上層的遞迴函數
會向上爬升到可能上層的階層樹
node: 檢查此節點是否衍生自可能的上層
likelyAncestor: 節點應衍生自的可能上層

DSCore.Data.GetListFromTypes(System.Collections.ArrayList)
從物件的 ArrayList 傳回 DataNodeDynamoTypes 清單
list: 要重新格式化之物件的 ArrayList

DSCore.Data.IsSingleValueOrSingleLevelArrayList(System.Object)
檢查輸入物件是單一值還是單層 ArrayList。
obj: 要演算的輸入物件

DSCore.Data.IsSupportedDataNodeDynamoType(System.Object,System.Type,System.Boolean)
用於驗證輸入類型是否符合支援的 Dynamo 輸入類型的函數
inputValue: 要驗證的進入資料
type: 使用者提供的輸入類型，必須符合 inputValue 類型
isList: 此布林值決定輸入是單一物件或清單

DSCore.Data.IsItemOfType(System.Object,System.Type)
此方法會檢查項目是否為必要的 Dynamo DataType
「IsInstanceOfType」會遞迴檢查是否為向上繼承
item: 要檢查其資料類型的項目
dataType: 要當作檢查目標的 DataType
Returns: 根據檢查驗證的 True 或 False 結果

DSCore.Data.IsDerivedFrom(System.Type,System.Type)
此方法會檢查類型是否衍生自基準類型
derivedType: 要宣告的類型
baseType: 我們比較的基準類型