DSCore.CurveMapper.BezierCurve
表示 CurveMapper 中的 Bezier 曲線。
Bezier 曲線由四個控制點定義，可提供平滑內插。

DSCore.CurveMapper.BezierCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
根據指定的參數和限制取得內插的 Y 值。