DSCore.TimeSpan
表示已經過之時間段的物件，沒有特定的開始或結束日期。

DSCore.TimeSpan.ByDateDifference(System.DateTime,System.DateTime)
產生新的 TimeSpan，這是根據兩個 DateTime 的時間差計算而得
dateTime: 要被減去的 DateTime
otherDateTime: 要減去的 DateTime
兩個日期之間的 TimeSpan 差

DSCore.TimeSpan.Zero
表示已經過時間為零的 TimeSpan。
表示經過時間為零的 TimeSpan

DSCore.TimeSpan.MaxValue
可以表示的最大 TimeSpan。
可能的最大 TimeSpan 表現法

DSCore.TimeSpan.MinValue
可以表示的最小 TimeSpan。
可能的最小 TimeSpan 表現法

DSCore.TimeSpan.Create(System.Double,System.Double,System.Double,System.Double,System.Double)
根據時間跨距建立新的 TimeSpan。
days: 跨距的天數。
hours: 跨距的小時數。
minutes: 跨距的分鐘數。
seconds: 跨距的秒數。
milliseconds: 跨距的毫秒數。
建立的 TimeSpan

DSCore.TimeSpan.Scale(System.TimeSpan,System.Double)
將 TimeSpan 乘以比例係數
timeSpan: 要相乘的 TimeSpan
scaleFactor: 調整 TimeSpan 比例的數量。 例如，比例係數若為 2，將產生 2 倍的時間跨距量。
TimeSpan 乘積

DSCore.TimeSpan.Negate(System.TimeSpan)
讓 TimeSpan 變成負數
timeSpan: 要變成負數的 TimeSpan
負數的 TimeSpan

DSCore.TimeSpan.Add(System.TimeSpan,System.TimeSpan)
讓兩個 TimeSpan 相加
timeSpan1: 要相加的 TimeSpan
timeSpan2: 要相加的另一個 TimeSpan
相加後的 TimeSpan

DSCore.TimeSpan.Subtract(System.TimeSpan,System.TimeSpan)
讓兩個 TimeSpan 相減
timeSpan1: 要被減去的 TimeSpan
timeSpan2: 要減去的 TimeSpan
減去後的 TimeSpan

DSCore.TimeSpan.FromString(System.String)
嘗試從字串剖析 TimeSpan
string: TimeSpan 的字串表現法。
剖析的字串的 TimeSpan

DSCore.TimeSpan.Components(System.TimeSpan)
萃取 TimeSpan 的個別元件。
timeSpan: 要從中取得組成的 TimeSpan
天數 (類型 int)
小時數 (類型 int)
分鐘數 (類型 int)
秒數 (類型 int)
毫秒數 (類型 int)

DSCore.TimeSpan.TotalDays(System.TimeSpan)
將 TimeSpan 表示的總時間量轉換為不精確的天數。
timeSpan: 要從中查詢總天數的 TimeSpan
總天數

DSCore.TimeSpan.TotalHours(System.TimeSpan)
將 TimeSpan 表示的總時間量轉換為不精確的小時數。
timeSpan: 要從中查詢總時數的 TimeSpan
總時數

DSCore.TimeSpan.TotalMinutes(System.TimeSpan)
將 TimeSpan 表示的總時間量轉換為不精確的分鐘數。
timeSpan: 要從中查詢總分鐘數的 TimeSpan
總分鐘數

DSCore.TimeSpan.TotalSeconds(System.TimeSpan)
將 TimeSpan 表示的總時間量轉換為不精確的秒數。
timeSpan: 要從中查詢總秒數的 TimeSpan
總秒數

DSCore.TimeSpan.TotalMilliseconds(System.TimeSpan)
將 TimeSpan 表示的總時間量轉換為不精確的毫秒數。
timeSpan: 要從中查詢總毫秒數的 TimeSpan
總毫秒數