DSCore.CurveMapper.CurveBase
表示 CurveMapper 中所有曲線類型的基準類別。
提供產生和擷取曲線值的常用功能。

DSCore.CurveMapper.CurveBase.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
由衍生類別實作以產生曲線值的抽象方法。

DSCore.CurveMapper.CurveBase.GetCurveXValues(System.Collections.Generic.List{System.Double},System.Boolean)
擷取 X 值的常用方法。

DSCore.CurveMapper.CurveBase.GetCurveYValues(System.Collections.Generic.List{System.Double},System.Boolean)
擷取 Y 值的常用方法。

DSCore.CurveMapper.CurveBase.GenerateFromDomain(System.Collections.Generic.List{System.Double},System.Func{System.Double,System.Double})
透過將定義域輸入對映至圖元區空間並演算曲線函數，產生 X 和 Y 值。