DSCore.Properties.Resources
一種強型別資源類別，用於查找本土化的字串等等。

DSCore.Properties.Resources.ResourceManager
傳回此類別所使用的已快取 ResourceManager 例證。

DSCore.Properties.Resources.Culture
為使用此強類型資源類別查找的所有資源，
取代目前執行緒的 CurrentUICulture 性質。

DSCore.Properties.Resources.BitmapOverflowError
查找類似於「提供的顏色資料太大，無法佈滿影像邊界。」的本土化字串。

DSCore.Properties.Resources.CurveMapperEqualMinMaxWarning
查找類似於「• 最小值和最大值必須不同。」的本土化字串。

DSCore.Properties.Resources.CurveMapperInvalidCountWarning
查找類似於「• 值必須是一個數字清單或一個 ≥ 2 的數字。」的本土化字串。

DSCore.Properties.Resources.CurveMapperInvalidCurveWarning
查找類似於「• 所選曲線的控制點無效。」的本土化字串。

DSCore.Properties.Resources.CurveMapperInvalidXYFormatWarning
查找類似於「• X 和 Y 輸入必須是一個數字 (不是清單)。」的本土化字串。

DSCore.Properties.Resources.DefineDataSupportedInputValueExceptionMessage
查找類似於「輸入必須是單一值或非巢狀清單。」的本土化字串。

DSCore.Properties.Resources.DefineDataUnexpectedInputExceptionMessage
查找類似於「此節點應為 {0} 輸入，但收到 {1} 輸入。請提供預期的輸入，或在節點的下拉式功能表中點選新類型。」的本土化字串。

DSCore.Properties.Resources.DefineDataUnsupportedCombinationOfDataTypesExceptionMessage
查找類似於「此節點不支援在目前輸入清單 {0} 中結合不同資料類型。請確保輸入清單的項目屬於相同資料類型，或是混合共同父系類型的類型」的本土化字串。

DSCore.Properties.Resources.DefineDataUnsupportedDataTypeExceptionMessage
查找類似於「此節點不支援目前的輸入資料類型 ({0})。請在下拉式功能表中檢視支援的資料類型。」的本土化字串。

DSCore.Properties.Resources.EnumDateOfWeekFriday
查找類似於「星期五」的本土化字串。

DSCore.Properties.Resources.EnumDateOfWeekMonday
查找類似於「星期一」的本土化字串。

DSCore.Properties.Resources.EnumDateOfWeekSaturday
查找類似於「星期六」的本土化字串。

DSCore.Properties.Resources.EnumDateOfWeekSunday
查找類似於「星期日」的本土化字串。

DSCore.Properties.Resources.EnumDateOfWeekThursday
查找類似於「星期四」的本土化字串。

DSCore.Properties.Resources.EnumDateOfWeekTuesday
查找類似於「星期二」的本土化字串。

DSCore.Properties.Resources.EnumDateOfWeekWednesday
查找類似於「星期三」的本土化字串。

DSCore.Properties.Resources.Exception_Deserialize_Bad_Format
查找類似於「類型 {0} 的 json 格式不正確」的本土化字串。

DSCore.Properties.Resources.Exception_Deserialize_Unsupported_Cache
查找類似於「無法載入儲存的資料。」的本土化字串。

DSCore.Properties.Resources.Exception_Serialize_Depth_Unsupported
查找類似於「深度 {0} 超過路徑「{2}」的最大深度 {1}」的本土化字串。

DSCore.Properties.Resources.Exception_Serialize_DesignScript_Unsupported
查找類似於「此類型的幾何圖形無法序列化。」的本土化字串。

DSCore.Properties.Resources.Exception_Serialize_Unsupported_Type
查找類似於「無法儲存類型為 {0} 的資料。」的本土化字串。

DSCore.Properties.Resources.ExportToCSVObsolete
查找類似於「請改用 Data.ExportCSV 節點」的本土化字串。

DSCore.Properties.Resources.FactorialNegativeInt
查找類似於「Math.Factorial 的輸入值不能為負數」的本土化字串。

DSCore.Properties.Resources.FactorialOverflow
查找類似於「Math.Factorial 的傳回值超出範圍」的本土化字串。

DSCore.Properties.Resources.FindPointsWithinRadiusNullPointMessage
查找類似於「您必須提供一個中心點。」的本土化字串。

DSCore.Properties.Resources.FindPointsWithinRadiusSearchRadiusMessage
查找類似於「搜尋半徑不能為零。」的本土化字串。

DSCore.Properties.Resources.FromObjectObsolete
查找類似於「此節點為舊型，請使用「來自物件的字串」」的本土化字串。

DSCore.Properties.Resources.IntegerOverflow
查找類似於「作業造成整數溢位。可能會產生非預期的結果。」的本土化字串。

DSCore.Properties.Resources.InvalidDestinationPathErrorMessage
查找類似於「用作複製路徑的目標檔案路徑無效。」的本土化字串。

DSCore.Properties.Resources.InvalidKeysErrorMessage
查找類似於「一個或多個輸入類型不相符」的本土化字串。列示為「關鍵字」不受支援。

DSCore.Properties.Resources.InvalidKeysLenghtErrorMessage
查找類似於「項目數目與鍵的數目不相符 href=InvalidKeysLenghtErrorMessage.html」的本土化字串。

DSCore.Properties.Resources.LoadImageFromPathObsolete
查找類似於「改用 File.FromPath -> Image.ReadFromFile 節點」的本土化字串。

DSCore.Properties.Resources.MissingPythonEngine
查找類似於「找不到選取的 Python 引擎」的本土化字串。

DSCore.Properties.Resources.ObjectArgumentExceptionMessage
查找類似於「物件不能為空，請提供適當的值。」的本土化字串。

DSCore.Properties.Resources.QuadtreeConstructionEmptyUVSetMessage
查找類似於「您無法從空白的點組建構四元樹狀目錄。」的本土化字串。

DSCore.Properties.Resources.QuadtreeConstructionNullUVSetMessage
查找類似於「無法從空值的 UV 組建置四元樹狀目錄。」的本土化字串。

DSCore.Properties.Resources.ReadImageObsolete
查找類似於「改用 File.FromPath -> Image.ReadFromFile -> Image.Pixels 節點」的本土化字串。

DSCore.Properties.Resources.ReadTextObsolete
查找類似於「改用 File.FromPath ->  File.ReadText 節點。」的本土化字串。

DSCore.Properties.Resources.StringRemoveCountOutOfRangeMessage
查找類似於「Count」的本土化字串超出範圍 ！

DSCore.Properties.Resources.StringRemoveStartIndexOutOfRangeMessage
查找類似於「startIndex」的本土化字串超出範圍 ！

DSCore.Properties.Resources.StringToNumberInvalidNumberMessage
查找類似於「不是一個有效數字。」的本土化字串。

DSCore.Properties.Resources.WebRequestNullUrlMessage
查找類似於「URL 不能為空。」的本土化字串。

DSCore.Properties.Resources.WriteImageObsolete
查找類似於「改用 Image.WriteToFile 節點」的本土化字串。