DSCore.Quadtree.ByUVs(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.UV})
建構一個包含 (0,0) -> (1,1) 網域的四元樹狀目錄。
uvs: (0,0)->(1,1) 定義域中的一組 UV。
Returns: 一個四元樹狀目錄物件。

DSCore.Quadtree.FindPointsWithinRadius(Autodesk.DesignScript.Geometry.UV,System.Double)
在給定的 UV 位置的半徑內，尋找四元樹狀目錄中的所有四元樹狀目錄點 (UV)。
center: 位於搜尋區域中心的 UV。
radius: 搜尋區域的半徑。
Returns: UV 清單。