DSCore.Math
執行數學運算的方法。

DSCore.Math.Random(System.Nullable{System.Int32})
產生範圍為 [0、1) 的隨機倍精數。
seed: 隨機數產生器的種子值。
介於 0 和 1 之間的隨機數。
random,seed

DSCore.Math.Random(System.Double,System.Double)
產生範圍為 [lower_number, higher_number) 的隨機數。
value1: 隨機數的範圍下限。
value2: 隨機數的範圍上限。
範圍為 [lower_number, higher_number) 的隨機數。
random,numberrange

DSCore.Math.Random(System.Double,System.Double,System.Int32)
根據初始種子值，產生範圍為 [lower_number, higher_number) 的隨機數。
value1: 隨機數的範圍下限。
value2: 隨機數的範圍上限。
seed: 隨機數產生器的種子值。
範圍為 [lower_number, highter_number) 的隨機數。
random,numberrange,seed

DSCore.Math.RandomList(System.Int32)
產生一個清單，其中包含給定的隨機倍精數的數量，範圍為 [0、1)。
amount: 結果清單將包含的隨機數的數量。
介於 0 和 1 之間的隨機數清單。
random,listcontains

DSCore.Math.RandomList(System.Int32,System.Double,System.Double,System.Int32)
產生一個清單，其中包含根據初始種子值在定義的
[lower_number, higher_number) 範圍內的給定隨機倍精數數量。
amount: 結果清單將包含的隨機數的數量。
value1: 隨機數的範圍下限。
value2: 隨機數的範圍上限。
seed: 隨機數產生器的種子值。
範圍為 [lower_number, higher_number) 的隨機數清單。
random,listcontains,seed

DSCore.Math.PiTimes2
Pi 常數乘以 2
2 乘 PI。
2pi,2*pi,twopi,two*pi

DSCore.Math.Average(System.Collections.Generic.IList{System.Double})
將數字清單平均。
numbers: 要平均的數字清單。
數字清單的平均值。
avg,mean

DSCore.Math.Map(System.Double,System.Double,System.Double)
根據輸入範圍，將輸入值對映至 0 到 1 之間的數字。
rangeMin: 輸入範圍的最小值。
rangeMax: 輸入範圍的最大值。
inputValue: 要對映的數目。
對映的值。
map,range,minimum,maximum,normalize,scale,remap

DSCore.Math.MapTo(System.Double,System.Double,System.Double,System.Double,System.Double)
將輸入值對映至 targetRangeMin 到 targetRangeMax 之間的數字。
rangeMin: 輸入範圍的最小值。
rangeMax: 輸入範圍的最大值。
inputValue: 要對映的數目。
targetRangeMin: 新範圍的最小值。
targetRangeMax: 新範圍的最大值。
對映的值。
map,range,mapto,minimum,maximum,normalize,scale,remap

DSCore.Math.RemapRange(System.Collections.Generic.IList{System.Double},System.Double,System.Double)
調整數字清單的範圍，同時保留分配比率。
numbers: 調整範圍的數字清單。
newMin: 範圍的新下限。
newMax: 範圍的新上限。
重新對映到新範圍的清單。
remap range

DSCore.Math.kRadiansToDegrees
將函數/方法從 Math.dll 移至此 DSCoreNode.dll

DSCore.Math.PI
數學常數 Pi, 3.14159...
常數 Pi
3.141592653589793

DSCore.Math.E
數學常數 e，2.71828...
常數 e
exp,2.718281828459045

DSCore.Math.GoldenRatio
黃金比率，(1 + sqrt(5))/2 = 1.61803...
黃金比率
golden,ratio,divine,phi,tau,1.61803398875

DSCore.Math.RadiansToDegrees(System.Double)
將以弳度表示的角度轉換為以度表示的角度。
radians: 角度 (以弳度表示)。
角度 (以度表示)。
radians,degrees,angle

DSCore.Math.DegreesToRadians(System.Double)
將以度表示的角度轉換為以弳度表示的角度。
degrees: 角度 (以度表示)。
角度 (以弳度表示)。
degrees,radians,angle

DSCore.Math.Abs(System.Double)
尋找數值的絕對值。
number: 要從其取得絕對值的數值
數值的絕對值
absolute value,magnitude

DSCore.Math.Equals(System.Double,System.Double,System.Double)
此方法只能由「等於 (有公差)」的 NodeModel 節點使用

DSCore.Math.Abs(System.Int64)
尋找數值的絕對值。
integer: 一個數值。
數值的絕對值。
absolute value,magnitude

DSCore.Math.Acos(System.Double)
尋找反餘弦，其餘弦為指定比率的角度。
ratio: 角度的餘弦，範圍 [-1, 1] 中的數值。
其餘弦為輸入比率的角度。
acosine,arccosine

DSCore.Math.Asin(System.Double)
尋找反正弦，其正弦為指定比率的角度。
ratio: 角度的正弦，範圍 [-1, 1] 中的數值。
其正弦是輸入比率的角度
asine,arcsin

DSCore.Math.Atan(System.Double)
尋找反正切，其正切為指定比率的角度。
ratio: 角度的正切。
其正切為輸入比率的角度
atangent,arctangent

DSCore.Math.Atan2(System.Double,System.Double)
尋找兩數之商的反正切。 傳回其正切為下列比率的角度：分子/分母。
numerator: 角度正切的分子。
denominator: 角度正切的分母。
其正切為分子/分母的角度
atangent,arctangent

DSCore.Math.Ceiling(System.Double)
傳回第一個大於數值的整數
number: 要進位的數值。
大於數值的第一個整數
ceiling,round

DSCore.Math.Cos(System.Double)
尋找角度的餘弦。
angle: 要取得其餘弦的角度 (以度表示)。
角度的餘弦
cosine

DSCore.Math.Cosh(System.Double)
尋找角度的變曲餘弦 (弳度)。
angle: 角度 (以弳度表示)。
角度的變曲餘弦
hyperbolic cosine

DSCore.Math.DivRem(System.Int64,System.Int64)
尋找被除數/除數的餘數。
dividend: 要除以的數值。
divisor: 要被除的數值。
除法的餘數
remainder

DSCore.Math.EvaluateFormula(System.String,System.String[],System.Object[])
使用給定的參數對映計算 NCalc 公式。
formulaString: NCalc 公式
parameters: 變數名稱
arguments: 變數繫結
類型: var[]..[] (公式計算的結果)

DSCore.Math.Exp(System.Double)
傳回數值的指數，這是自乘至值數的常數 e。
number: 數值。
數值的指數。
exponential

DSCore.Math.Floor(System.Double)
傳回第一個小於數值的整數
number: 要捨去的數值
小於數值的第一個整數
round

DSCore.Math.Log(System.Double)
尋找數值的自然對數，範圍為 (0, ∞)。
number: 大於 0 的數值。
數值的自然對數。
natural,logarithm,ln

DSCore.Math.Log(System.Double,System.Double)
利用指定的底數尋找數值的對數。
number: 大於 0 的數值。
logBase: 對數的底數，範圍為 [0,1),(1, ∞)。
數值的對數。
logarithm,ld,lg

DSCore.Math.Log10(System.Double)
尋找數值的對數，以 10 為底數。
number: 大於 0 的數值。
數值的對數。
logarithm

DSCore.Math.Max(System.Double,System.Double)
傳回兩個數值的較大者。
value1: 要比較的數值。
value2: 要比較的數值。
兩個數值的較大者。
maximum,greater,larger

DSCore.Math.Max(System.Int64,System.Int64)
傳回兩個數值的較大者。
int1: 要比較的數值。
int2: 要比較的數值。
兩個數值的較大者。
maximum,greater,larger

DSCore.Math.Min(System.Double,System.Double)
傳回兩個數值的較小者。
value1: 要比較的數值。
value2: 要比較的數值。
兩個數值的較小者。
minimum,lesser,smaller

DSCore.Math.Min(System.Int64,System.Int64)
傳回兩個數值的較小者。
int1: 要比較的數值。
int2: 要比較的數值。
兩個數值的較小者。
minimum,lesser,smaller

DSCore.Math.Pow(System.Double,System.Double)
數值的指定次方。
number: 次方的數值。
power: 數值的次方。
次方的數值。
^,power,raise,exponent

DSCore.Math.Rand
產生範圍為 [0, 1) 的隨機數。
範圍為 [0, 1) 的隨機數。
random,numberrange

DSCore.Math.Round(System.Double)
將數值四捨五入為最近的整數值。
請注意，此方法將傳回雙倍精度浮點數值 (而非整數」類型。
number: 要四捨五入的數值。
接近數字的整數值。

DSCore.Math.Round(System.Double,System.Int32)
將數值四捨五入至指定的分數位數。
number: 要四捨五入的數值
digits: 傳回值的小數位數
最接近其值且包含的小數位數等於指定數字的數值

DSCore.Math.Sign(System.Double)
傳回數值的符號：-1、0 或 1。
number: 要從其取得正負號的數值
數值的正負號: -1、0 或 1

DSCore.Math.Sign(System.Int64)
傳回數值的符號：-1、0 或 1。
int: 要從其取得正負號的整數
數值的正負號: -1、0 或 1

DSCore.Math.Sin(System.Double)
尋找角度的正弦。
angle: 要取得其正弦的角度 (以度表示)。
角度的正弦。
sine

DSCore.Math.Sinh(System.Double)
尋找角度的變曲正弦 (弳度)。
angle: 角度 (以弳度表示)。
角度的變曲正弦。
hyperbolic

DSCore.Math.Sqrt(System.Double)
尋找數值的正平方根，範圍為 [0, ∞)。
number: 範圍 [0, ∞) 中的數值。
數值的正平方根。
square,root,radical

DSCore.Math.Tan(System.Double)
尋找角度的正切。
angle: 角度 (以弳度表示)
角度的正切
tangent

DSCore.Math.Tanh(System.Double)
尋找角度的變曲正切 (弳度)。
angle: 角度 (以弳度表示)
角度的雙曲正切
hyperbolic,tanh

DSCore.Math.Sum(System.Collections.Generic.IEnumerable{System.Double})
尋找一系列數值的總和
values: 要加總的數值
值的總和
mass addition,massadd

DSCore.Math.Factorial(System.Int64)
尋找正整數的階乘結果。
number: 正整數
整數的階乘結果。
!

DSCore.Math.Xor(System.Boolean,System.Boolean)
布林 XOR：僅在只有一個輸入為 True 時，才會傳回 True。
bool: 布林
otherBool: 其他布林
布林運算結果
xor,exclusive,or

DSCore.Math.DoCheckedCast(System.Double)
在檢查過的環境中執行轉型為長整數。如果作業產生溢位，
則會產生警告，並傳回溢位結果。
value: 要執行的作業
Returns: 作業結果