DSCore.DateTime
代表特定日期和時間的物件。

DSCore.DateTime.MinValue
可以表示的最早日期與時間。
可能的最小 DateTime 表現法

DSCore.DateTime.MaxValue
可以表示的最晚日期與時間。
可能的最大 DateTime 表現法

DSCore.DateTime.Now
目前的系統日期與時間。
表示目前時間的 DateTime

DSCore.DateTime.Today
目前的系統日期，時間設在午夜。
表示今天的 DateTime

DSCore.DateTime.Format(System.DateTime,System.String)
以指定格式的字串傳回指定的日期與時間。
dateTime: 要格式化的 DateTime
format: 日期格式的字串表現法。使用獨立於使用者作業系統語言輸出的 InvariantCulture。預設為標準格式「F」：「2017 年 2 月 21 日 (星期二) 23:02:43」
若要取得格式指定器的詳盡清單，請搜尋「MSDN 自訂日期及時間格式字串」。
以字串表示的 DateTime

DSCore.DateTime.ByDate(System.Int32,System.Int32,System.Int32)
以精確日期建立新的 DateTime。
year: 精確年份 (1-9999)
month: 精確月份 (1-12)
day: 精確日  (1 - [當月第幾天] )
從日期建立的 DateTime

DSCore.DateTime.ByDateAndTime(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
以精確日期和時間建立新的 DateTime。
year: 精確年份 (1-9999)
month: 精確月份 (1-12)
day: 精確日  (1 - [當月第幾天] )
hour: 精確小時 (0-23)
minute: 精確分鐘 (0-59)
second: 精確秒 (0-59)
millisecond: 精確毫秒 (0-999)
從日期和時間建立的 DateTime

DSCore.DateTime.SubtractTimeSpan(System.DateTime,System.TimeSpan)
將 TimeSpan 從 DateTime 減去，產生新的 DateTime。
dateTime: 開始的 DateTime
timeSpan: 要減去的時間量
相減後的 DateTime

DSCore.DateTime.AddTimeSpan(System.DateTime,System.TimeSpan)
將 TimeSpan 加至 DateTime，產生新的 DateTime。
dateTime: 開始的 DateTime
timeSpan: 要增加到 DateTime 的時間量
增加時間跨距後的 DateTime

DSCore.DateTime.DaysInMonth(System.Int32,System.Int32)
計算給定年給定月有多少天。
year: 精確年份 (1-9999)
month: 精確月份 (1-12)
月的天數

DSCore.DateTime.IsDaylightSavingsTime(System.DateTime)
判定它是否為給定 DateTime 的日光節約時間。
dateTime: 用來決定是否有日光節約的 DateTime
如果 DateTime 是在日光節約時間則為 true；如果不是則為 false

DSCore.DateTime.IsLeapYear(System.Int32)
判定給定年份是否為閏年。
year: 精確年份 (1-9999)
如果年為閏年則為 true，如果不是則為 false

DSCore.DateTime.FromString(System.String)
嘗試從字串剖析 DateTime
string: DateTime 的字串表現法
剖析的字串的 DateTime

DSCore.DateTime.Date(System.DateTime)
僅從 DateTime 萃取日期。 時間元件設為 0。
dateTime: DateTime。
來自 DateTime 的日期
Date

DSCore.DateTime.Components(System.DateTime)
萃取 DateTime 的個別元件。
dateTime: 要從中取得組成的 DateTime
年的數值表現法 (1-9999)
月的數值表現法 (1-12)
日的數值表現法 (1 到 [月的天])
小時的數值表現法 (0-23)
分鐘的數值表現法 (0-59)
秒的數值表現法 (0-59)
毫秒的數值表現法 (0-999)

DSCore.DateTime.DayOfWeek(System.DateTime)
從給定 DateTime 傳回一週的日子。
dateTime: 要從中取得星期幾的 DateTime 物件
一週的日子

DSCore.DateTime.DayOfYear(System.DateTime)
傳回一年的日子 (0-366)
dateTime: 要取得一年的日子的 DateTime
從年初開始的天數

DSCore.DateTime.TimeOfDay(System.DateTime)
產生新的 TimeSpan，表示自從給定 DateTime 的午夜後經過的時間量。
dateTime: DateTime。
自午夜起的 TimeSpan