DSCore.Color.Red
尋找顏色 (0 到 255) 的紅色元件。
RGB 顏色模型的紅色值，介於 0 到 255 (含) 之間的 int。

DSCore.Color.Green
尋找顏色 (0 到 255) 的綠色元件。
RGB 顏色模型的綠色值，介於 0 到 255 (含) 之間的 int。

DSCore.Color.Blue
尋找顏色 (0 到 255) 的藍色元件。
RGB 顏色模型的藍色值，介於 0 到 255 (含) 之間的 int。

DSCore.Color.Alpha
尋找顏色 (0 到 255) 的 Alpha 元件。
Alpha 值，介於 0 到 255 (含) 之間的 int。

DSCore.Color.ByARGB(System.Int32,System.Int32,System.Int32,System.Int32)
依 Alpha、紅色、綠色及藍色元素建構顏色。
alpha: Alpha 值 (介於 0 到 255 (含) 之間)
red: RGB 顏色模型的紅色值 (介於 0 到 255 (含) 之間)
green: RGB 顏色模型的綠色值 (介於 0 到 255 (含) 之間)
blue: RGB 顏色模型的藍色值 (介於 0 到 255 (含) 之間)
從 ARGB 建立的顏色
color

DSCore.Color.Brightness(DSCore.Color)
傳回此顏色的亮度值。
color: 要從中查詢亮度的顏色
亮度值 (介於 0 到 1 (含) 之間)

DSCore.Color.Saturation(DSCore.Color)
傳回此顏色的彩度值。
飽和度值，介於 0 到 1 之間的 double。

DSCore.Color.Hue(DSCore.Color)
傳回此顏色的色相值。
color: 顏色物件
顏色的色相值，介於 0 到 1 (含) 之間的 double。
hues

DSCore.Color.Components(DSCore.Color)
依下列順序列示顏色的元件 ：Alpha、紅色、綠色、藍色。
color: 顏色物件
Alpha 值，介於 0 到 255 (含) 之間的 int。
RGB 顏色模型的紅色值，介於 0 到 255 (含) 之間的 int。
RGB 顏色模型的綠色值，介於 0 到 255 (含) 之間的 int。
RGB 顏色模型的藍色值，介於 0 到 255 (含) 之間的 int。
alpha,red,green,blue

DSCore.Color.BuildColorFrom1DRange(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double},System.Double)
傳回開始顏色和結束顏色之間的顏色漸層中的一個顏色。
parameters: 沿著您想要取樣顏色之範圍的值，介於 0 與 1 之間。
給定範圍內的顏色。
color,range,gradient

DSCore.Color.Lerp(DSCore.Color,DSCore.Color,System.Double)
可用線性方式內插於兩種顏色之間。
start: 開始顏色。
end: 結束顏色。
t: 介於 0.0 和 1.0 之間的參數。
Returns: 內插的顏色或白色。

DSCore.Color.Blerp(System.Collections.Generic.IList{DSCore.Color.IndexedColor2D},Autodesk.DesignScript.Geometry.UV)
可用雙線性方式內插於一組顏色之間。
Returns: 內插的顏色或白色。
This algorithm is not the same as the solution found from wikipedia
(reference: https://en.wikipedia.org/wiki/Bilinear_interpolation)

DSCore.Color.Add(DSCore.Color,DSCore.Color)
透過結合兩個既有顏色的 ARGB 值來建構顏色。
color: 要相加的顏色
otherColor: 要相加的另一個顏色
相加兩種顏色後的顏色結果

DSCore.Color.Multiply(DSCore.Color,System.Double)
以乘以數倍數輸入顏色，從而產生較暗的顏色。輸入顏色必須具有小於 255 的 Alpha。
color: 要相乘的顏色
multiplier: 乘數值
相乘後的顏色結果

DSCore.Color.Divide(DSCore.Color,System.Double)
以數字分隔器分割輸入顏色，從而產生較亮的顏色並移除顏色暈白
color: 要相除的顏色
dividend: 被除數值
相除後的顏色結果