Repository: DynamoDS/Dynamo
Catalog: src/WorkspaceDependencyViewExtension/Properties/Resources.*.resx
Languages: cs_cz, pt_br

# DependencyViewExtensionErrorTemplate
source: Error from WorkspaceDependencyViewExtension: {0}
cs_cz: Chyba položky WorkspaceDependencyViewExtension: {0}
pt_br: Erro de WorkspaceDependencyViewExtension: {0}

# DetailsMessageIncorrectVersion
source: Some nodes in this graph were originally created with {0} v{1}, which you do not have installed. Instead you have a different version of {0} installed, would you keep the installed version?
cs_cz: Některé uzly tohoto grafu byly původně vytvořeny pomocí balíčku {0} verze {1}, kterou nemáte nainstalovánu. Máte však nainstalovánu jinou verzi balíčku {0}, chcete ponechat nainstalovanou verzi?
pt_br: Alguns nós neste gráfico foram originalmente criados com {0} v{1}, que você não tem instalado. Em vez disso, você tem outra versão do {0} instalada. Deseja manter a versão instalada?

# DetailsMessageLoaded
source: {0} {1} is installed and loaded.
cs_cz: Balíček {0} {1} je nainstalován a načten.
pt_br: {0} {1} instalado e carregado.

# DetailsMessageMissing
source: This graph depends on {0} {1}. Would you like to download and install this package?
cs_cz: Tento graf závisí na balíčku {0} {1}. Chcete tento balíček stáhnout a nainstalovat?
pt_br: Este gráfico depende de {0} {1}. Deseja fazer o download e instalar este pacote?

# DetailsMessageRequireRestart
source: The package needs to be uninstalled before you can install a different version of it. Please restart Dynamo and then install the specified version.
cs_cz: Před instalací jiné verze balíčku je nutné balíček odinstalovat. Restartujte aplikaci Dynamo a poté nainstalujte požadovanou verzi.
pt_br: O pacote precisa ser desinstalado para poder instalar uma versão diferente. Reinicie o Dynamo e, em seguida, instale a versão especificada.

# DetailsMessageWarning
source: Some nodes in this graph were originally created with {0} v{1}, which you do not have installed. You may have a different version of {0} installed, or you may have a different package which resolves these nodes.
cs_cz: Některé uzly v tomto grafu byly původně vytvořeny pomocí balíčku {0} verze {1}, kterou nemáte nainstalovánu. Možná máte nainstalovánu jinou verzi balíčku {0}, případně můžete dané uzly vyřešit pomocí jiného balíčku.
pt_br: Alguns nós neste gráfico foram originalmente criados com {0} v{1}, que você não tem instalado. Você pode ter outra versão do {0} instalada ou pode ter outro pacote que resolva esses nós.

# ExtensionName
source: Workspace References
cs_cz: Reference pracovního prostoru
pt_br: Referências dos espaços de trabalho

# ExternalFilesHeaderText
source: External Files
cs_cz: Externí soubory
pt_br: Arquivos externos

# ExternalFilesToolTip
source: External files are external documents in the graph space, such as images or text files. These are computed when the graph is run or by clicking the refresh icon incase the graph is already executed.
cs_cz: Externí soubory jsou externí dokumenty v prostoru grafu, například obrázky nebo textové soubory. Jsou vypočítány při spuštění grafu nebo kliknutím na ikonu Obnovit v případě, že je graf již spuštěn.
pt_br: Os arquivos externos são documentos externos no espaço gráfico, como imagens ou arquivos de texto. Eles são calculados quando o gráfico é executado ou clicando no ícone de atualização, caso o gráfico já tenha sido executado.

# InstallButtonText
source: Install Specified Version
cs_cz: Instalovat určenou verzi
pt_br: Instalar versão especificada

# KeepLocalButtonText
source: Keep Installed Version
cs_cz: Ponechat instalovanou verzi
pt_br: Manter versão instalada

# LocalDefinitionsHeaderText
source: Local Definitions
cs_cz: Místní definice
pt_br: Definições locais

# LocalDefinitionsToolTip
source: Local definitions are Dynamo-specific files corresponding to local custom nodes and local packages. These are computed when the graph is saved or by clicking the refresh icon.
cs_cz: Místní definice jsou soubory specifické pro aplikaci Dynamo odpovídající místním vlastním uzlům a místním balíčkům. Jsou vypočítány při uložení grafu nebo kliknutím na ikonu Obnovit.
pt_br: As definições locais são arquivos específicos do Dynamo correspondentes aos nós personalizados locais e pacotes locais. Eles são calculados quando o gráfico é salvo ou clicando no ícone de atualização.

# MenuItemString
source: Show _Workspace References
cs_cz: Zobrazit _reference pracovního prostoru
pt_br: _Mostrar referências das áreas de trabalho

# NameHeader
source: Name
cs_cz: Název
pt_br: Nome

# PackageHeaderText
source: Packages
cs_cz: Balíčky
pt_br: Pacotes

# PackagesToolTip
source: Packages extend Dynamo's core functionality and are available in the Package Manager. These are computed when the graph is saved or by clicking the refresh icon.
cs_cz: Balíčky rozšiřují základní funkce aplikace Dynamo a jsou k dispozici v nástroji Package Manager. Jsou vypočítány při uložení grafu nebo kliknutím na ikonu Obnovit.
pt_br: Os pacotes estendem a funcionalidade principal do Dynamo e estão disponíveis no Package Manager. Eles são calculados quando o gráfico é salvo ou clicando no ícone de atualização.

# PathHeader
source: Path
cs_cz: Cesta
pt_br: Caminho

# ProvideFeedbackButton
source: Provide Feedback
cs_cz: Zaslat zpětnou vazbu
pt_br: Fornecer feedback

# ProvideFeedbackError
source: Could not redirect to the Dynamo forum page for feedback:
cs_cz: Přesměrování na stránku fóra aplikace Dynamo za účelem zpětné vazby nebylo možné:
pt_br: Não foi possível redirecionar para a página do fórum do Dynamo para feedback:

# RefreshButtonTooltipText
source: Click to recalculate workspace references.
cs_cz: Kliknutím přepočítejte reference pracovního prostoru.
pt_br: Clique para recalcular as referências das áreas de trabalho.

# RestartBannerMessage
source: An installed package is marked for uninstall. To complete the uninstall, please restart Dynamo.
cs_cz: Nainstalovaný balíček je označen k odinstalování. Chcete-li dokončit odinstalaci, restartujte aplikaci Dynamo.
pt_br: Um pacote instalado está marcado para desinstalação. Para concluir a desinstalação, reinicie o Dynamo.

# SizeHeader
source: Size
cs_cz: Velikost
pt_br: Tamanho

# VersionHeader
source: Version
cs_cz: Verze
pt_br: Versão
