DSCore.CurveMapper.PerlinNoiseCurve
Кривая шума Перлина в CurveMapper.
Кривая создает процедурный шум на основе управляющих точек и функций шума Перлина.

DSCore.CurveMapper.PerlinNoiseCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Возврат значений X и Y, распределенных по кривой.