DSCore.ColorRange.ByColorsAndParameters(System.Collections.Generic.IList{DSCore.Color},System.Collections.Generic.IList{Autodesk.DesignScript.Geometry.UV})
Создание объекта ColorRange путем указания списка цветов и координат UV.
colors: Список цветов.
parameters: Список параметров в диапазоне от (0,0;0,0) до (1,0;1,0).
Returns: Объект ColorRange.

DSCore.ColorRange.GetColorAtParameter(Autodesk.DesignScript.Geometry.UV)
Возврат цвета в данном диапазоне цветов с заданным параметром.
parameter: Значение UV в диапазоне от (от 0,0;0,0) до (1,0;1,0).
Returns: Цвет.