DSCore.CurveMapper.CurveBase
Базовый класс для всех типов кривых в CurveMapper.
Предоставляет общие функции создания и извлечения значений кривых.

DSCore.CurveMapper.CurveBase.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Абстрактный метод, который реализуется производными классами для генерации значений кривой.

DSCore.CurveMapper.CurveBase.GetCurveXValues(System.Collections.Generic.List{System.Double},System.Boolean)
Стандартный метод получения значений X.

DSCore.CurveMapper.CurveBase.GetCurveYValues(System.Collections.Generic.List{System.Double},System.Boolean)
Стандартный метод получения значений Y.

DSCore.CurveMapper.CurveBase.GenerateFromDomain(System.Collections.Generic.List{System.Double},System.Func{System.Double,System.Double})
Создание значений X и Y путем сопоставления входных данных области с пространством рабочей области и оценки функции кривой.