DSCore.Thread
Функции для работы с вычислительными потоками.

DSCore.Thread.Pause(System.Object,System.Int32)
Пауза текущего потока оценки в течение заданного количества времени.
object: Объект, через который проходит другой объект.
msTimeout: Количество времени, необходимое для приостановки потока исполнения в миллисекундах.
Объект, проходящий насквозь.