DSCore.ColorRange1D.ByColorsAndParameters(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double})
Создание объекта ColorRange1D путем указания списка цветов и параметров.
colors: Список цветов.
parameters: Список параметров в диапазоне от 0,0 до 1,0.
Returns: Объект ColorRange1D.

DSCore.ColorRange1D.GetColorAtParameter(DSCore.ColorRange1D,System.Double)
Возврат цвета в данном диапазоне цветов с заданным параметром.
parameter: Значение в диапазоне от 0,0 до 1,0.
Returns: Цвет.

DSCore.ColorRange1D.Default
Создать ColorRange1D, используя заданную по умолчанию цветовую схему.