DSCore.Math
Способы выполнения математических операций.

DSCore.Math.Random(System.Nullable{System.Int32})
Создание случайного двойного значения в диапазоне [0; 1).
seed: Случайное значение для формирования случайного числа.
Случайное число из диапазона между 0 и 1.
random,seed

DSCore.Math.Random(System.Double,System.Double)
Получение произвольного числа из в диапазона [lower_number; higher_number).
value1: Нижняя граница диапазона — случайное число.
value2: Верхняя граница диапазона — случайное число.
Случайное число из диапазона [lower_number, higher_number).
random,numberrange

DSCore.Math.Random(System.Double,System.Double,System.Int32)
Получение случайного числа из диапазона [lower_number, higher_number) на основе исходного случайного значения.
value1: Нижняя граница диапазона для случайного числа.
value2: Верхняя граница диапазона для случайного числа.
seed: Случайное значение для формирования случайного числа.
Случайное число из диапазона [lower_number, higher_number).
random,numberrange,seed

DSCore.Math.RandomList(System.Int32)
Формирование списка, содержащего заданное количество произвольных двойных значений
из диапазона [0; 1).
amount: Количество случайных чисел списке результатов.
Список случайных чисел от 0 до 1.
random,listcontains

DSCore.Math.RandomList(System.Int32,System.Double,System.Double,System.Int32)
Создание списка с заданным количеством случайных двойных чисел
в заданном диапазоне [lower_number, higher_number) на основе исходного случайного значения.
amount: Количество случайных чисел списке результатов.
value1: Нижний предел диапазона для случайного числа.
value2: Верхний предел диапазона для случайного числа.
seed: Случайное значение для формирования случайного числа.
Список случайных чисел из диапазона [lower_number, higher_number).
random,listcontains,seed

DSCore.Math.PiTimes2
Константа «пи», умноженная на 2
«Пи», умноженное на 2
2pi,2*pi,twopi,two*pi

DSCore.Math.Average(System.Collections.Generic.IList{System.Double})
Вывод среднего значения для списка чисел.
numbers: Список чисел, которые требуется усреднить.
Среднее значение из списка значений.
avg,mean

DSCore.Math.Map(System.Double,System.Double,System.Double)
Сопоставляет значение ввода с числом в диапазоне от 0 до 1 на основании диапазона входных данных.
rangeMin: Минимальное значение диапазона входных данных.
rangeMax: Максимальное значение диапазона входных данных.
inputValue: Число для сопоставления.
Сопоставляемое значение.
map,range,minimum,maximum,normalize,scale,remap

DSCore.Math.MapTo(System.Double,System.Double,System.Double,System.Double,System.Double)
Сопоставляет значение ввода с числом в диапазоне от targetRangeMin до targetRangeMax.
rangeMin: Минимальное значение диапазона входных данных.
rangeMax: Максимальное значение диапазона входных данных.
inputValue: Число для сопоставления.
targetRangeMin: Минимальное значение нового диапазона.
targetRangeMax: Максимальное значение нового диапазона.
Сопоставляемое значение.
map,range,mapto,minimum,maximum,normalize,scale,remap

DSCore.Math.RemapRange(System.Collections.Generic.IList{System.Double},System.Double,System.Double)
Корректировка диапазона списка чисел при сохранении
коэффициента распределения.
numbers: Список чисел, для которых требуется задать диапазон.
newMin: Новое минимальное значение диапазона.
newMax: Новое максимальное значение диапазона
Список с соответствием новому диапазону.
remap range

DSCore.Math.kRadiansToDegrees
переместить функции/методы из Math.dll в эту библиотеку DSCoreNode.dll

DSCore.Math.PI
Математическая константа «пи»: 3,14159...
Постоянная «пи»
3.141592653589793

DSCore.Math.E
Математическая константа e: 2,71828...
Постоянная e
exp,2.718281828459045

DSCore.Math.GoldenRatio
Золотое отношение, (1 + sqrt(5))/2 = 1,61803...
Золотое отношение
golden,ratio,divine,phi,tau,1.61803398875

DSCore.Math.RadiansToDegrees(System.Double)
Изменение угла в радианах на угол в градусах.
radians: Значение угла в радианах.
Значение угла в градусах.
radians,degrees,angle

DSCore.Math.DegreesToRadians(System.Double)
Изменение угла в градусах на угол в радианах.
degrees: Значение угла в градусах.
Значение угла в радианах.
degrees,radians,angle

DSCore.Math.Abs(System.Double)
Нахождение абсолютного значения числа.
number: Число для получения абсолютного значения
Абсолютное значение числа
absolute value,magnitude

DSCore.Math.Equals(System.Double,System.Double,System.Double)
Этот метод используется ТОЛЬКО в узле равенства (с допуском) NodeModel

DSCore.Math.Abs(System.Int64)
Нахождение абсолютного значения числа.
integer: Число.
Абсолютное значение числа.
absolute value,magnitude

DSCore.Math.Acos(System.Double)
Нахождение арккосинуса — угла, косинус которого равен данному отношению.
ratio: Косинус угла, число в диапазоне [–1; 1].
Угол, косинус которого равен введенному отношению.
acosine,arccosine

DSCore.Math.Asin(System.Double)
Нахождение арксинуса — угла, синус которого равен данному отношению.
ratio: Синус угла, число в диапазоне [–1; 1].
Угол, синус которого равен введенному отношению
asine,arcsin

DSCore.Math.Atan(System.Double)
Нахождение арктангенса — угла, тангенс которого равен данному отношению.
ratio: Тангенс угла.
Угол, тангенс которого равен введенному отношению
atangent,arctangent

DSCore.Math.Atan2(System.Double,System.Double)
Нахождение арктангенса соотношения двух чисел. В результате получается величина угла,
тангенс которого составляет это отношение: числитель/знаменатель.
numerator: Числитель тангенса угла.
denominator: Знаменатель тангенса угла.
Угол, тангенс которого равен значению: числитель/знаменатель
atangent,arctangent

DSCore.Math.Ceiling(System.Double)
Получение первого целого числа, большего, чем данное число
number: Число для округления.
Первое целое число, большее чем данное число
ceiling,round

DSCore.Math.Cos(System.Double)
Нахождение косинуса угла.
angle: Угол в градусах для получения косинуса.
Косинус угла
cosine

DSCore.Math.Cosh(System.Double)
Нахождение гиперболического косинуса угла (в радианах).
angle: Значение угла в радианах.
Гиперболический косинус угла
hyperbolic cosine

DSCore.Math.DivRem(System.Int64,System.Int64)
Нахождение остатка делимого/делителя.
dividend: Число, которое требуется разделить.
divisor: Число, на которое требуется разделить.
Остаток деления
remainder

DSCore.Math.EvaluateFormula(System.String,System.String[],System.Object[])
Оценка формулы NCalc с заданным сопоставлением параметров.
formulaString: Формула NCalc
parameters: Имена переменных
arguments: Привязки переменных
тип: var[]..[] (результат расчета по формуле)

DSCore.Math.Exp(System.Double)
Получение экспоненты числа — константы e, возведенной в определенную степень.
number: Число.
Экспонента числа.
exponential

DSCore.Math.Floor(System.Double)
Получение первого целого числа, меньшего, чем заданное число.
number: Число для округления в меньшую сторону
Первое целое число, меньшее чем данное число
round

DSCore.Math.Log(System.Double)
Нахождение натурального логарифма числа из диапазона (0; ∞).
number: Число больше 0.
Натуральный логарифм числа.
natural,logarithm,ln

DSCore.Math.Log(System.Double,System.Double)
Нахождение логарифма числа с заданным основанием.
number: Число больше 0.
logBase: Основание логарифма в диапазоне [0; 1),(1; ∞).
Логарифм числа.
logarithm,ld,lg

DSCore.Math.Log10(System.Double)
Нахождение десятичного логарифма числа.
number: Число больше 0.
Логарифм числа.
logarithm

DSCore.Math.Max(System.Double,System.Double)
Получение большего из двух чисел.
value1: Число для сравнения.
value2: Число для сравнения.
Большее из двух чисел.
maximum,greater,larger

DSCore.Math.Max(System.Int64,System.Int64)
Получение большего из двух чисел.
int1: Число для сравнения.
int2: Число для сравнения.
Большее из двух чисел.
maximum,greater,larger

DSCore.Math.Min(System.Double,System.Double)
Получение меньшего из двух чисел.
value1: Число для сравнения.
value2: Число для сравнения.
Меньшее из двух чисел.
minimum,lesser,smaller

DSCore.Math.Min(System.Int64,System.Int64)
Получение меньшего из двух чисел.
int1: Число для сравнения.
int2: Число для сравнения.
Меньшее из двух чисел.
minimum,lesser,smaller

DSCore.Math.Pow(System.Double,System.Double)
Возведение числа в указанную степень.
number: Число, возводимое в степень.
power: Степень, в которую требуется возвести число.
Число, возведенное в степень.
^,power,raise,exponent

DSCore.Math.Rand
Получение случайного числа из диапазона [0; 1).
Случайное число из диапазона [0; 1).
random,numberrange

DSCore.Math.Round(System.Double)
Округление числа до ближайшего интегрального значения.
Обратите внимание на то, что этот метод возвращает число с плавающей точкой двойной точности вместо интегрального типа.
number: Число для округления.
Ближайшее интегральное значение.

DSCore.Math.Round(System.Double,System.Int32)
Округление числа до заданного количества цифр дробной части.
number: Округляемое число
digits: Число цифр дробной части в возвращаемом значении
Число, наиболее близкое к значению, в котором содержится количество цифр дробной части, равное цифрам

DSCore.Math.Sign(System.Double)
Получение знака числа: –1, 0 или 1.
number: Число для получения знака
Знак числа: –1, 0 или 1

DSCore.Math.Sign(System.Int64)
Получение знака числа: –1, 0 или 1.
int: Целое число для получения знака
Знак числа: –1, 0 или 1

DSCore.Math.Sin(System.Double)
Нахождение синуса угла.
angle: Угол в градусах для получения синуса.
Синус угла.
sine

DSCore.Math.Sinh(System.Double)
Нахождение гиперболического синуса угла (в радианах).
angle: Значение угла в радианах.
Гиперболический синус угла.
hyperbolic

DSCore.Math.Sqrt(System.Double)
Извлечение положительного квадратного корня из числа в диапазоне [0; ∞).
number: Число в диапазоне [0; ∞).
Положительный квадратный корень числа.
square,root,radical

DSCore.Math.Tan(System.Double)
Нахождение тангенса угла.
angle: Угол в радианах
Тангенс угла
tangent

DSCore.Math.Tanh(System.Double)
Нахождение гиперболического тангенса угла (в радианах).
angle: Угол в радианах
Гиперболический тангенс угла
hyperbolic,tanh

DSCore.Math.Sum(System.Collections.Generic.IEnumerable{System.Double})
Найти сумму последовательности чисел
values: Числа для прибавления к сумме
Сумма значений
mass addition,massadd

DSCore.Math.Factorial(System.Int64)
Нахождение факторного результата положительного целого числа.
number: Положительное целое число
Результат факториала для целого числа.
!

DSCore.Math.Xor(System.Boolean,System.Boolean)
Логическое «XOR»: возвращает значение «истина» только в том случае, если оба ввода имеют значение «истина».
bool: Логическая операция
otherBool: Другие логические операции
Логический результат
xor,exclusive,or

DSCore.Math.DoCheckedCast(System.Double)
Приведение к типу long в проверенном контексте. Если операция
приводит к переполнению, отображается предупреждение
и возвращается результат с переполнением.
value: Операция для выполнения
Returns: Результат операции