DSCore.CurveMapper.LinearCurve
Линейная кривая в CurveMapper.
Линейная кривая — это прямая линия между двумя управляющими точками.

DSCore.CurveMapper.LinearCurve.LineEquation(System.Double)
Вычисление значений Y (координат активного окна) для минимального и максимального значений X

DSCore.CurveMapper.LinearCurve.SolveForXGivenY(System.Double)
Вычисление значений X (координат активного окна) для минимального и максимального значений Y

DSCore.CurveMapper.LinearCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Возврат значений X и Y, распределенных по кривой.