DSCore.CurveMapper.SquareRootCurve
Кривая квадратного корня в CurveMapper.
Кривая управляется функцией квадратного корня и зависит от двух управляющих точек.

DSCore.CurveMapper.SquareRootCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Возврат значений X и Y, распределенных по кривой.