DSCore.Properties.Resources
Класс ресурса со строгим контролем типа, используемый для поиска локализованных строк и т. п.

DSCore.Properties.Resources.ResourceManager
Возврат кэшированного экземпляра ResourceManager, используемого в данном классе.

DSCore.Properties.Resources.Culture
Переопределение свойства CurrentUICulture текущего потока для всех
случаев поиска ресурсов при использовании данного класса ресурса со строгим контролем типа.

DSCore.Properties.Resources.BitmapOverflowError
Поиск локализованной строки, подобной строке «Предоставленные данные цвета слишком велики для вписывания в границы изображения».

DSCore.Properties.Resources.CurveMapperEqualMinMaxWarning
Поиск локализованной строки, подобной строке «• Минимальное и максимальное значения должны отличаться».

DSCore.Properties.Resources.CurveMapperInvalidCountWarning
Поиск локализованной строки, подобной строке «• Значения должны быть списком чисел или одиночным числом ≥ 2».

DSCore.Properties.Resources.CurveMapperInvalidCurveWarning
Поиск локализованной строки, подобной строке «• Недопустимые управляющие точки для выбранной кривой».

DSCore.Properties.Resources.CurveMapperInvalidXYFormatWarning
Поиск локализованной строки, подобной строке «• Входные данные X и Y должны быть одиночными числами (не списками)».

DSCore.Properties.Resources.DefineDataSupportedInputValueExceptionMessage
Поиск локализованной строки, подобной строке «Входное значение должно быть одним значением или не являться вложенным списком».

DSCore.Properties.Resources.DefineDataUnexpectedInputExceptionMessage
Поиск локализованной строки, подобной строке «Для этого узла ожидался ввод {0}, но получен ввод {1}. Введите ожидаемое входное значение или выберите новый тип в раскрывающемся меню узла».

DSCore.Properties.Resources.DefineDataUnsupportedCombinationOfDataTypesExceptionMessage
Поиск локализованной строки, подобной строке «Этот узел не поддерживает комбинацию типов данных в текущем списке ввода {0}. Убедитесь, что список ввода содержит элементы одного типа данных или содержит элементы разных типов с общим родительским типом».

DSCore.Properties.Resources.DefineDataUnsupportedDataTypeExceptionMessage
Поиск локализованной строки, подобной строке «Этот узел не поддерживает текущий тип входных данных ({0}). Просмотрите поддерживаемые типы данных в раскрывающемся меню».

DSCore.Properties.Resources.EnumDateOfWeekFriday
Поиск локализованной строки, подобной строке «Пятница».

DSCore.Properties.Resources.EnumDateOfWeekMonday
Поиск локализованной строки, подобной строке «Понедельник».

DSCore.Properties.Resources.EnumDateOfWeekSaturday
Поиск локализованной строки, подобной строке «Суббота».

DSCore.Properties.Resources.EnumDateOfWeekSunday
Поиск локализованной строки, подобной строке «Воскресенье».

DSCore.Properties.Resources.EnumDateOfWeekThursday
Поиск локализованной строки, подобной строке «Четверг».

DSCore.Properties.Resources.EnumDateOfWeekTuesday
Поиск локализованной строки, подобной строке «Вторник».

DSCore.Properties.Resources.EnumDateOfWeekWednesday
Поиск локализованной строки, подобной строке «Среда».

DSCore.Properties.Resources.Exception_Deserialize_Bad_Format
Поиск локализованной строки, подобной строке «Файл JSON для типа {0} был отформатирован неправильно».

DSCore.Properties.Resources.Exception_Deserialize_Unsupported_Cache
Поиск локализованной строки, подобной строке «Не удается загрузить сохраненные данные».

DSCore.Properties.Resources.Exception_Serialize_Depth_Unsupported
Поиск локализованной строки, подобной строке «Глубина {0} превышает максимальную глубину {1} по пути {2}».

DSCore.Properties.Resources.Exception_Serialize_DesignScript_Unsupported
Поиск локализованной строки, подобной строке «Невозможно сериализовать этот тип геометрии».

DSCore.Properties.Resources.Exception_Serialize_Unsupported_Type
Поиск локализованной строки, подобной строке «Не удается сохранить данные типа {0}».

DSCore.Properties.Resources.ExportToCSVObsolete
Поиск локализованной строки, подобной строке «Используйте узел Data.ExportCSV».

DSCore.Properties.Resources.FactorialNegativeInt
Поиск локализованной строки, подобной строке «Входное значение Math.Factorial не может быть отрицательным».

DSCore.Properties.Resources.FactorialOverflow
Поиск локализованной строки, подобной строке «Возвращаемое значение Math.Factorial находится вне диапазона».

DSCore.Properties.Resources.FindPointsWithinRadiusNullPointMessage
Поиск локализованной строки, подобной строке «Необходимо указать центральную точку».

DSCore.Properties.Resources.FindPointsWithinRadiusSearchRadiusMessage
Поиск локализованной строки, подобной строке «Радиус поиска не может быть равен нулю».

DSCore.Properties.Resources.FromObjectObsolete
Поиск локализованной строки, подобной строке «Этот узел является устаревшим, используйте String from Object».

DSCore.Properties.Resources.IntegerOverflow
Поиск локализованной строки, подобной строке «Операция привела к переполнению целого числа. Результат может быть непредсказуемым».

DSCore.Properties.Resources.InvalidDestinationPathErrorMessage
Поиск локализованной строки, подобной строке «В качестве пути для копирования используется недопустимый путь к конечному файлу».

DSCore.Properties.Resources.InvalidKeysErrorMessage
Поиск локализованной строки, подобной строке «Один или несколько типов ввода не совпадают. Списки ключей не поддерживаются».

DSCore.Properties.Resources.InvalidKeysLenghtErrorMessage
Поиск локализованной строки, подобной строке «Количество элементов не соответствует количеству ключей. href=InvalidKeysLenghtErrorMessage.html».

DSCore.Properties.Resources.LoadImageFromPathObsolete
Поиск локализованной строки, подобной строке «Используйте узлы File.FromPath ->  Image.ReadFromFile».

DSCore.Properties.Resources.MissingPythonEngine
Поиск локализованной строки, подобной строке «Не удалось найти выбранный механизм Python».

DSCore.Properties.Resources.ObjectArgumentExceptionMessage
Поиск локализованной строки, подобной строке «Объект не может быть нулевым, введите соответствующее значение».

DSCore.Properties.Resources.QuadtreeConstructionEmptyUVSetMessage
Поиск локализованной строки, подобной строке «Невозможно сформировать квадрадерево на основе пустого набора точек».

DSCore.Properties.Resources.QuadtreeConstructionNullUVSetMessage
Поиск локализованной строки, подобной строке «Квадрадерево не может быть построено на основе пустого набора UV».

DSCore.Properties.Resources.ReadImageObsolete
Поиск локализованной строки, подобной строке «Используйте узлы File.FromPath ->  Image.ReadFromFile ->  Image.Pixels».

DSCore.Properties.Resources.ReadTextObsolete
Поиск локализованной строки, подобной строке «Используйте узлы File.FromPath ->  File.ReadText».

DSCore.Properties.Resources.StringRemoveCountOutOfRangeMessage
Поиск локализованной строки, подобной строке «Количество выходит за пределы диапазона!».

DSCore.Properties.Resources.StringRemoveStartIndexOutOfRangeMessage
Поиск локализованной строки, подобной строке «StartIndex выходит за пределы диапазона!».

DSCore.Properties.Resources.StringToNumberInvalidNumberMessage
Поиск локализованной строки, подобной строке «Недопустимое число».

DSCore.Properties.Resources.WebRequestNullUrlMessage
Поиск локализованной строки, подобной строке «URL-адрес не может быть пустым».

DSCore.Properties.Resources.WriteImageObsolete
Поиск локализованной строки, подобной строке «Используйте узел Image.WriteToFile».