DSCore.IO.Image
Методы работы с растровыми изображениями.

DSCore.IO.Image.ReadFromFile(System.IO.FileInfo)
Загрузка файла в виде растрового изображения.
file: Файловый объект для загрузки изображения
Объект изображения из файла

DSCore.IO.Image.Pixels(System.Drawing.Bitmap,System.Nullable{System.Int32},System.Nullable{System.Int32})
Файл изображения обрабатывается и значения цветов выводятся в указанных областях сетки.
image: Объект изображения для получения цветов пикселов
xSamples: Количество выборочных точек сетки в направлении Х.
ySamples: Количество выборочных точек сетки в направлении Y.
Цвета в указанных точках сетки
read,image,bitmap,png,jpg,jpeg

DSCore.IO.Image.FromPixels(DSCore.Color[][])
Построение изображения на основе двумерного списка пикселей.
colors: Двумерный прямоугольный список цветов, представляющий пикселы
Изображение из двумерного списка пикселов

DSCore.IO.Image.FromPixels(DSCore.Color[],System.Int32,System.Int32)
Построение изображения на основе плоского списка пикселей, ширины и высоты.
colors: Список цветов, представляющих пикселы
width: Ширина нового изображения в пикселах
height: Высота нового изображения в пикселах
Изображение из списка пикселов

DSCore.IO.Image.Dimensions(System.Drawing.Bitmap)
Возврат ширины и высоты изображения.
image: Изображение, для которого требуется получить размеры.
ширина изображения в пикселях
высота изображения в пикселях

DSCore.IO.Image.WriteToFile(System.String,System.Drawing.Bitmap)
Запись изображения в файл с заданным именем.
image: Изображение для записи
Созданный объект изображения
write image,image,file,filepath