DSCore.String
Методы управления строками.

DSCore.String.ToNumber(System.String)
Преобразование строки в целое число или двойное значение.
string: Строка для преобразования
Целое число или число двойного типа
2number,str2number,strtonumber,string2number,stringtonumber,int,double,cast

DSCore.String.GetNumber(System.String)
Получение всех строк с числами из целевой строки в виде строки
string: Целевая строка для получения
Число в строке
getnumber,tonumber,strtonumber,numberinstring,string2number,stringtonumber,int,double,cast

DSCore.String.Concat(System.String[])
Объединение нескольких строк в одну строку.
strings: Список строк для объединения.
Строка, созданная на основе списка строк.
concatenate,join,combine strings

DSCore.String.Length(System.String)
Получение числа символов, содержащихся в данной строке.
string: Строка для поиска длины
Количество символов в строке
count,size,characters,chars,length,sizeof

DSCore.String.Split(System.String,System.String[])
Разделение одной строки на список строк, деления которого
определяются заданными строками-разделителями.
string: Строка для разделения
separators: Строки, которые (при наличии) определяют конец и начало разделения.
Список строк, созданных на основе строки ввода
divide,separator,delimiter,cut,csv,comma,

DSCore.String.Join(System.String,System.String[])
Объединение нескольких строк в одну строку со вставкой данного
разделителя между всеми соединенными строками.
separator: Строка для вставки между объединенными строками.
strings: Строки, которые будут объединены в одну строку.
Строка из списка строк, в том числе символ-разделитель.
join,separator,build csv,concat,construct

DSCore.String.ToUpper(System.String)
Преобразование символов данной строки в символы верхнего регистра.
string: Строка, регистр которой требуется изменить на верхний
Строка с символами в верхнем регистре
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.ToLower(System.String)
Перевод всех символов данной строки в нижний регистр.
string: Строка, регистр которой требуется изменить на нижний
Строка с символами в нижнем регистре
2lowercase,to lowercase,tolowercase,lowercase

DSCore.String.ToTitle(System.String)
Капитализация начальных букв всех слов данной строки.
str: Строка, начальные буквы всех слов которой требуется сделать заглавными
Строка с капитализацией начальных букв всех слов
2titlecase,to titlecase,to title case,totitlecase,titlecase

DSCore.String.ChangeCase(System.String,System.Boolean)
Перевод всех символов данной строки в верхний регистр или
в нижний в зависимости от логического параметра.
string: Строка, регистр которой требуется изменить
upper: Значение «истина» для преобразования в верхний регистр, значение «ложь» для преобразования в нижний регистр
Строка с измененным регистром.
2lowercase,to lowercase,tolowercase,lowercase,
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.Substring(System.String,System.Int32,System.Int32)
Извлечение подстроки из данной строки. Подстрока начинается с указанного
положения символов и имеет заданную длину.
string: Строка для извлечения подстроки
startIndex: Начальная позиция символа подстроки в исходной строке
length: Количество символов в подстроке
Подстрока на основе исходной строки
subset,get string,part,smaller string

DSCore.String.Contains(System.String,System.String,System.Boolean)
Определение того, содержит ли данная строка подстроку.
string: Строка, в которой требуется выполнить поиск
searchFor: Подстрока для поиска
ignoreCase: Определение того, учитывается ли при сравнении регистр
Определение того, содержится ли в строке подстрока
test,within,in,is in,part of

DSCore.String.CountOccurrences(System.String,System.String,System.Boolean)
Подсчет количества неперекрывающихся вхождений подстроки внутри заданной строки.
string: Строка, в которой требуется выполнить поиск
searchFor: Подстрока для поиска
ignoreCase: Определение того, учитывается ли при сравнении регистр
Количество неперекрывающихся вхождений подстроки в строку
count,substring,count occurrences,numberof,search,find,within

DSCore.String.Replace(System.String,System.String,System.String)
Замена всех текстовых вхождений строки другим текстом.
string: Строка, в которой требуется заменить подстроки.
searchFor: Текст, который требуется заменить.
replaceWith: Текст для замены.
Строка с произведенными заменами.
replace,overwrite,override,find and replace

DSCore.String.EndsWith(System.String,System.String,System.Boolean)
Определение того, заканчивается ли данная строка данной подстрокой.
string: Строка, в конце которой требуется осуществить поиск
searchFor: Подстрока, которую требуется найти в конце строки
ignoreCase: True — игнорировать регистр при сравнении, False — учитывать регистр при сравнении
True — строка начинается подстрокой, False — не начинается
test,does end,last,str end,terminated

DSCore.String.StartsWith(System.String,System.String,System.Boolean)
Определение того, начинается ли данная строка с данной подстроки.
string: Строка, в начале которой требуется осуществить поиск
searchFor: Подстрока для поиска начала.
ignoreCase: True — игнорировать регистр при сравнении, False — учитывать регистр при сравнении
True — строка начинается подстрокой, False — не начинается
test,beginswith,start,string start,front

DSCore.String.TrimWhitespace(System.String)
Удаление всех пробелов в начале и в конце данной строки.
string: Строка для сокращения.
Строка, в которой удалены пробелы в начале и в конце.
trimstring,cleanstring,whitespace,blanks,spaces,string trim

DSCore.String.TrimLeadingWhitespace(System.String)
Удаление всех пробелов в начале данной строки.
string: Строка для сокращения.
Строки, в начале которых удален пробел.
trim string,clean string,trim leading whitespaces,string trim

DSCore.String.TrimTrailingWhitespace(System.String)
Удаление всех пробелов в конце данной строки.
string: Строка для сокращения.
Строки, в конце которых удален пробел.
trim string,clean string,trim trailing whitespaces,string trim

DSCore.String.IndexOf(System.String,System.String,System.Boolean)
Нахождение индекса первого вхождения в подстроки внутри строки, отсчитываемого от нуля.
Получение значения –1, если индекс не найден.
string: Строка, в которой требуется выполнить поиск
searchFor: Подстрока для поиска
ignoreCase: Определение того, учитывается ли при сравнении регистр
Индекс первого вхождения подстроки или –1, если он не найден
index of,find substring,where,search

DSCore.String.AllIndicesOf(System.String,System.String,System.Boolean)
Поиск списка индексов, в котором подстрока отображается внутри строки.
string: Строка, в которой требуется выполнить поиск.
searchFor: Подстрока, которую требуется найти.
ignoreCase: Определение того, учитывается ли при сравнении регистр.
Список индексов, где найдена подстрока (тип: int[])
all indices of,find substring,where,search

DSCore.String.LastIndexOf(System.String,System.String,System.Boolean)
Нахождение индекса последнего вхождения в подстроки внутри строки, отсчитываемого от нуля.
Получение значения –1, если индекс не найден.
string: Строка, в которой требуется выполнить поиск.
searchFor: Подстрока для поиска.
ignoreCase: Учитывается ли при сравнении регистр.
Индекс последнего вхождения подстроки или –1, если он не найден.
last index of,find substring,where,search

DSCore.String.PadLeft(System.String,System.Int32,System.String)
Выравнивание символов данной строки по правому краю путем добавления к ним пробелов слева
для достижения определенной общей длины.
string: Строка для заполнения
newLength: Общая длина строки после заполнения
padChars: Символ для заполнения: по умолчанию пробел
Строки, выровненные по правому краю путем добавления пробелов в начале для достижения определенной общей длины.
pad left,right align,right-align,pad,string space,whitespace

DSCore.String.PadRight(System.String,System.Int32,System.String)
Выравнивание символов данной строки по левому краю путем добавления к ним пробелов справа
для достижения определенной общей длины.
string: Строка для заполнения
newLength: Общая длина строки после заполнения
padChars: Символ для заполнения: по умолчанию пробел
Строки, выровненные по левому краю путем добавления пробелов в конце для достижения определенной общей длины
pad right,left align,left-align,pad string space,whitespace

DSCore.String.Center(System.String,System.Int32,System.String)
Увеличение длины строки путем добавления к исходным символам пробелов с обеих сторон.
string: Строка для центрирования
newLength: Общая длина строки после центрирования
padChars: Символ для выравнивания: по умолчанию — пробел
Строки, выровненные по центру путем добавления пробелов в начале и в конце, для достижения определенной общей длины.
center align,center-align,centered,whitespace,expand string,surround

DSCore.String.Insert(System.String,System.Int32,System.String)
Вставка строки в другую строку с заданным индексом.
string: Строка, в которой требуется выполнить вставку.
index: Индекс для вставки.
toInsert: Строка для вставки.
Строки со вставленной подстрокой.
insertstring,insert string

DSCore.String.Remove(System.String,System.Int32,System.Nullable{System.Int32})
Удаление символов из строки.
string: Строка, из которой требуется удалить символы.
startIndex: Индекс для запуска процесса удаления.
count: Количество символов для удаления.
Примечание. При отрицательном значении удаление выполняется справа налево.
Строка с удаленными символами.
delete,rem,shorten