DSCore.List
Способы создания и управления списками.

DSCore.List.Empty
Возвращение пустого списка.
Пустой список.
empty list, emptylist,[]

DSCore.List.UniqueItems(System.Collections.IList)
Создание нового списка, содержащего все уникальные элементы из заданного списка.
list: Список, который требуется отфильтровать, исключив повторы.
Отфильтрованный список.
removes,duplicates,remove duplicates,cull duplicates,distinct,listcontains

DSCore.List.Contains(System.Collections.IList,System.Object)
Определяет, содержит ли выбранный список указанный элемент. Эта функция позволяет выполнять поиск по вложенным спискам.
list: Список, в котором требуется выполнить поиск
item: Элементы для поиска
True — список содержит элемент, False — не содержит
item,search,in,listcontains

DSCore.List.IsHomogeneous(System.Collections.IList)
Установите флажок, если элементы в списке принадлежат к одному типу.
list: Список для проверки в случае однородности.
Однородность списка.
homogeneous,allequal,same,type

DSCore.List.IsRectangular(System.Collections.IList)
Установите флажок, если количество элементов во всех строках списка совпадает.
list: Список для проверки в случае, если строки имеют одинаковое количество элементов.
Наличие во всех строках списка одинакового количества элементов.
rectangular,isrectangular,same,sublist,row

DSCore.List.IsUniformDepth(System.Collections.IList)
Установите флажок, если элементы в списке имеют одинаковую глубину.
list: Список для проверки в случае, если элементы имеют одинаковую глубину.
Равномерная глубина списка.
depth,uniform,isuniformdepth,sublist,jagged

DSCore.List.SetDifference(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Возвращает новый список, в котором содержатся объекты из Списка1, но отсутствуют объекты из Списка2.
list1: Список объектов для включения в новый список
list2: Список объектов для исключения из нового списка
Новый список, в котором содержатся объекты из Списка1 и отсутствуют объекты из Списка2
difference,setdifference,set

DSCore.List.SetIntersection(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Возвращает новый список, содержащий объекты из Списка1 и Списка2.
list1: Список объектов для сравнения со Списком2
list2: Список объектов для сравнения со Списком1
Новый список, в котором содержатся объекты из Списка1 и Списка2
intersection,setintersection,set,overlap

DSCore.List.SetUnion(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Возвращает новый список, содержащий объекты из Списка1 или из Списка2.
list1: Список включаемых объектов
list2: Список объектов, включаемых в Список1
Новый список, в котором содержатся объекты из Списка1 или Списка2
union,setunion,set

DSCore.List.IndexOf(System.Collections.IList,System.Object)
Возврат индекса элемента в указанном списке. Между указанным списком и целевым элементом необходимо соблюдать строгое соответствие (то есть целое число должно соответствовать целому числу, двойное значение — двойному значению, строка — строке, объект — объекту и т. д.).
list: Список для поиска элемента.
element: Элемент, индекс которого следует вернуть.
Индекс элемента в списке. Если строгое соответствие не обнаружено, возвращается недопустимый индекс –1.
index,indexof

DSCore.List.CountFalse(System.Collections.IList)
Возвращает число логических значений «False» в указанном списке.
list: Список для поиска логических значений «False».
Количество логических значений «False» в списке.
false,count

DSCore.List.CountTrue(System.Collections.IList)
Возвращает количество логических значений «True» в указанном списке.
list: Список для поиска логических значений «True».
Количество логических значений «True» в списке.
true,count

DSCore.List.Insert(System.Collections.IList,System.Object,System.Int32)
Вставка элемента в список по заданному индексу.
list: Список, в который будет вставлен элемент
element: Элемент для вставки
index: Указание места для вставки в списке элементов
Список со вставленным элементом
insert,add

DSCore.List.Reorder(System.Collections.IList,System.Collections.IList)
Переупорядочивание списка ввода на основании указанного списка индексов.
list: Список для переупорядочивания
indices: Индексы для переупорядочивания элементов в списке
Переупорядоченный список
reorder,index,indices

DSCore.List.SortIndexByValue(System.Collections.Generic.List{System.Double})
Сортировка списка по элементам и возврат их индексов.
list: Список элементов для сортировки
Индексы элементов в отсортированном списке
sort,index,value

DSCore.List.NormalizeDepth(System.Collections.IList,System.Int32)
Получение многопланового списка в соответствии с заданным рангом.
list: Список, глубину которого необходимо нормализовать согласно рангу.
rank: Ранг списка, который должен быть нормализован. По умолчанию используется значение 1.
Список с нормализованным рангом.
depth,normalize

DSCore.List.Reverse(System.Collections.IList)
Создание нового списка, содержащего элементы из заданного списка, перечисленные в обратном порядке.
list: Список, в котором требуется изменить направление расстановки данных.
Обращенный список
flip,listcontains

DSCore.List.__Create(System.Collections.IList)
Создание нового списка, содержащего данные элементы.
items: Элементы для хранения в новом списке.

DSCore.List.Sublists(System.Collections.IList,System.Collections.IList,System.Int32)
Создание подсписков на основе списка с помощью синтаксиса диапазона DesignScript.
list: Список, в котором требуется создать подсписки.
ranges: Диапазоны индексов элементов подсписка.
Напр., \"{0..3,5,2}\"
offset: Значение смещения для применения к подсписку.
Например, диапазон \"0..3\" со смещениям 2 даст в результате
{0,1,2,3}{2,3,4,5}{4,5,6,7}...
тип: var[]..[]
sublists,build sublists,subset,

DSCore.List.Sort(System.Collections.Generic.IEnumerable{System.Object})
Сортировка списка в соответствии с предопределенным естественным порядком.
list: Список для сортировки
Отсортированный список
sort,order,sorted

DSCore.List.MinimumItem(System.Collections.Generic.IEnumerable{System.Object})
Получение минимального значения из списка.
list: Список сравниваемых элементов, из которого требуется взять минимальное значение
Минимальное значение элемента из списка
least,smallest,find min

DSCore.List.MaximumItem(System.Collections.Generic.IEnumerable{System.Object})
Получение максимального значения из списка.
list: Список сравниваемых элементов, из которого требуется взять максимальное значение
Максимальное значение элемента из списка
greatest,largest,biggest,find max

DSCore.List.FilterByBoolMask(System.Collections.IList,System.Collections.IList)
Фильтрация последовательности путем поиска соответствующих индексов в отдельном списке
логических операций.
list: Список, который требуется отфильтровать.
mask: Список логических операций, представляющих маску.
Элементы, индекс маски которых имеет значение «истина».
Элементы, индекс маски которых имеет значение «ложь».
filter,in,out,mask,dispatch,bool filter,boolfilter,bool filter

DSCore.List.Deconstruct(System.Collections.IList)
При наличии списка создается первый элемент из него и новый список, состоящий из всех элементов,
кроме первого.
list: Список для разделения.
Первый элемент в списке (тип: var[]..[])
Остальная часть списка (тип: var[]..[])
first,rest,list split,listcontains

DSCore.List.SortByKey(System.Collections.IList,System.Collections.IList)
Сортировка списка на основе ключей
list: список, который требуется отсортировать
keys: список ключей, ключи должны быть сортируемыми (например, числа или строки)
тип: var[]..[]
тип: var[]..[]
sort;key

DSCore.List.GroupByKey(System.Collections.IList,System.Collections.IList)
Группирование элементов для получения вложенных списков на основе их ключевых значений
list: Список элементов, которые требуется сгруппировать во вложенные списки
keys: Ключевые значения, одно для каждого элемента в списке ввода, используемые для группирования элементов
список вложенных списков с элементами, сгруппированными по ключевым значениям
ключевое значение для каждой группы
list;group;groupbykey;

DSCore.List.GroupBySimilarity(System.Collections.IList,System.Double,System.Boolean)
Группирование элементов списка на основе смежности их индексов и сходства их значений
list: Список элементов, которые требуется сгруппировать во вложенные списки по смежности и сходству
tolerance: Пороговое значение для группировки схожих элементов
considerAdjacency: Логическое значение, определяющее, должен ли узел учитывать смежность.
Список вложенных списков с элементами, сгруппированными по сходным значениям
Список вложенных списков, содержащих исходные индексы сгруппированных значений
list;group;similar;adjacent;adjacency;groupbyadjacency;groupadjacentitems;groupsimilaritems;cluster;tolerance

DSCore.List.LevenshteinDistance(System.String,System.String)
Расстояние Левенштейна — это алгоритм, используемый для получения расстояния между двумя строками
| Источник

DSCore.List.AddItemToFront(System.Object,System.Collections.IList)
Добавление элемента в начало списка.
item: Элемент, который требуется добавить. Элемент может быть объектом или списком.
list: Целевой список для добавления.
Список с добавленными элементами
insert,add,item,front,start,begin

DSCore.List.AddItemToEnd(System.Object,System.Collections.IList)
Добавление элемента в конец списка.
item: Элемент, который требуется добавить. Элемент может быть объектом или списком.
list: Целевой список для добавления.
Список с добавленными элементами
insert,add,item,end

DSCore.List.TakeItems(System.Collections.IList,System.Int32)
Выборка некоторого количества элементов в начале списка.
list: Список, из которого требуется извлечь элемент.
amount: Количество элементов для переноса. Если значение отрицательное, элементы переносятся с конца списка.
Список извлеченных элементов.
get,sub,sublist,extract

DSCore.List.DropItems(System.Collections.IList,System.Int32)
Удаление определенного количества элементов в начале списка. Если количество представляет собой отрицательное значение,
элементы удаляются с конца списка.
list: Список, из которого требуется удалить элементы.
amount: Количество элементов для удаления. Если значение отрицательное, элементы удаляются с конца списка.
Список остальных элементов.
drop,remove,shorten

DSCore.List.ShiftIndices(System.Collections.IList,System.Int32)
Смещение индексов в списке направо на заданную величину.
list: Список, который требуется сместить.
amount: Значение сдвига индексов. Если значение отрицательное, индексы будут сдвинуты влево.
Смещенный список.
shift,offset

DSCore.List.GetItemAtIndex(System.Collections.IList,System.Int32)
Получение элемента из данного списка, расположенного по указанному индексу.
list: Список, из которого требуется извлечь элемент.
index: Индекс элемента для включения в выборку.
Элемент в списке по заданному индексу.
get,item,index,fetch,at,getfrom,get from,extract

DSCore.List.ReplaceItemAtIndex(System.Collections.IList,System.Int32,System.Object)
Замена элемента из данного списка, расположенного по указанному индексу.
list: Список, в котором требуется заменить элемент.
index: Индекс элемента для замены.
item: Элемент для вставки.
Новый список с замененным элементом.
replace,switch

DSCore.List.ReplaceItemAtIndices(System.Collections.IList,System.Collections.Generic.IList{System.Int32},System.Object)
Замена элементов из заданного списка, которые расположены по указанным индексам.
list: Список, в котором требуется заменить элемент.
indices: Индексы элементов, которые требуется заменить.
item: Элемент для вставки.
Новый список с замененными элементами.
replace,switch

DSCore.List.Slice(System.Collections.IList,System.Nullable{System.Int32},System.Nullable{System.Int32},System.Int32)
Получение одного вложенного списка из данного списка на основе начального индекса, конечного индекса
и величины шага.
list: Список, часть которого нужно взять.
start: Индекс, с которого начинается часть.
end: Индекс, которым заканчивается часть.
step: Число, на которое разделены индексы элементов в исходном списке.
Элементы, содержащиеся в части данного списка.
list,sub,sublist,subrange,get sublist

DSCore.List.RemoveItemAtIndex(System.Collections.IList,System.Int32[])
Удаление элемента из данного списка по заданному индексу.
list: Список, из которого требуется удалить один или несколько элементов.
indices: Индекс или индексы одного или нескольких элементов, подлежащие удалению.
Список, из которого удалены элементы.
index,indices,cull,remove,item

DSCore.List.DropEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
Удаление элементов из данного списка по индексам, которые являются множителями
данного значения после применения заданного смещения.
list: Список, из которого требуется удалить элементы/
n: Индексы, являющиеся множителями для данного аргумента, будут удалены.
offset: Количество элементов с начала списка, которые будут игнорироваться.
Список, из которого удалены элементы.
nth,remove,cull,every

DSCore.List.TakeEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
Выборка элементов из данного списка по индексам, которые являются множителями
указанного значения после применения заданного смещения.
list: Список, из которого требуется извлечь элементы.
n: Индексы, являющиеся множителями этого числа (после применения смещения),
будут добавлены в выборку.
offset: Количество элементов с начала списка, которые будут игнорироваться.
Элементы из списка.
fetch,take,every,nth

DSCore.List.IsEmpty(System.Collections.IList)
Определение того, пуст ли данный список.
list: Проверка того, является ли список пустым
True — список пуст, False — не пуст
test,is,empty,null,count

DSCore.List.AllTrue(System.Collections.IList)
Определяет, являются ли все элементы заданного списка логическими и имеют ли они значение «True».
list: Список, который необходимо проверить на присвоение всем элементам значения «True».
True — всем элементам списка присвоено значение True, False — одному или нескольким элементам не присвоено значение True
test,all,true,istrue

DSCore.List.AllFalse(System.Collections.IList)
Определяет, являются ли все элементы заданного списка логическими и имеют ли они значение «False».
list: Список, который необходимо проверить на присвоение всем элементам значения «False».
True — всем элементам списка присвоено значение False, False — одному или нескольким элементам не присвоено значение False
test,all,false,isfalse

DSCore.List.AnyTrue(System.Collections.IList)
Определение того, является ли какой-либо элемент данного списка логическим и имеет ли он истинное значение.
list: Список, который требуется проверить на наличие элементов с истинным значением.
Наличие элементов с истинным значением.
test,any,true,istrue

DSCore.List.AnyFalse(System.Collections.IList)
Определение того, является ли какой-либо элемент данного списка логическим и имеет ли он ложное значение.
list: Список, который требуется проверить на наличие элементов с ложным значением.
Наличие элементов с ложным значением.
test,any,false,isfalse

DSCore.List.Count(System.Collections.IList)
Получение количества элементов, хранящихся в данном списке.
list: Список, элементы которого требуется сосчитать.
Длина списка.
listlength,list length,count,size,sizeof

DSCore.List.Join(System.Collections.IList[])
Объединение всех имеющихся списков в один.
lists: Списки для объединения в один.
Объединенный список.
join lists,merge,concatenate

DSCore.List.FirstItem(System.Collections.IList)
Получение первого элемента в списке.
list: Список, из которого требуется получить первый элемент.
Первый элемент в списке.
get,fetch,first,item,start

DSCore.List.RestOfItems(System.Collections.IList)
Удаление первого элемента данного списка.
list: Список, из которого требуется получить все остальные элементы.
Остальная часть списка.
get,fetch,rest,end,rest of list

DSCore.List.Chop(System.Collections.IList,System.Collections.Generic.List{System.Int32})
Обрезка списка для получения набора последовательных вложенных списков заданной длины. Деление списка начинается в верхней части списка.
list: Списки, которые требуется обрезать для получения вложенных списков
lengths: Длины последовательных вложенных списков, которые будут созданы из списка ввода
Вложенные списки, созданные из списка
sublists,build sublists,slices,partitions,cut,listcontains,chop

DSCore.List.DiagonalRight(System.Collections.IList,System.Int32)
Перечисление элементов вдоль каждой из диагоналей в матрице слева снизу вправо вверх.
list: Неструктурированный список
subLength: Длина каждого нового подсписка.
Списки элементов вдоль диагоналей матрицы.
diagonal,right,matrix,get diagonals,diagonal sublists

DSCore.List.DiagonalLeft(System.Collections.IList,System.Int32)
Перечисление элементов вдоль каждой из диагоналей в матрице слева сверху вправо вниз.
list: Неструктурированный список.
rowLength: Длина каждого нового подсписка.
Списки элементов вдоль диагоналей матрицы.
diagonal,left,matrix,get diagonals,diagonal sublists

DSCore.List.Transpose(System.Collections.IList)
Замена строк и столбцов в перечне списков.
Если некоторые строки короче других, то в результирующий
массив в качестве заполнителей вставляются нулевые значения,
благодаря чему он всегда остается прямоугольным.
lists: Перечень списков для переноса
Перечень перенесенных списков
transpose,flip matrix,matrix,swap,rows,columns

DSCore.List.Clean(System.Collections.IList,System.Boolean)
Удаление нулевых данных и очистка списков из заданного списка произвольных размеров
list: Список с нулями и пустыми вложенными списками для очистки
preserveIndices: Возможность сохранения индексов данных
Перечень перенесенных списков,
благодаря чему незамыкающие нули могут не отфильтровываться
Returns: Список очищен от нулей и пустых списков

DSCore.List.OfRepeatedItem(System.Object,System.Int32)
Создание списка, содержащего данный элемент, заданное количество раз.
item: Элемент для повтора.
amount: Число повторений.
Список повторяющихся элементов.
repeat,repeated,duplicate,list of item,fill list,copies,listcontains

DSCore.List.Cycle(System.Collections.IList,System.Int32)
Создание нового списка путем объединения копий данного списка.
list: Список для повтора.
amount: Число повторений.
Список повторяющихся списков с типом var[]..[]
repeat,repeated,duplicate,repeated list,concat list

DSCore.List.LastItem(System.Collections.IList)
Извлечение последнего элемента в списке.
list: Список, из которого требуется получить последний элемент
Последний элемент в списке
get,fetch,last,item,end of list

DSCore.List.Shuffle(System.Collections.IList)
Перемешивание элементов в списке в случайном порядке.
list: Список, в котором требуется перемешать элементы.
Список с элементами в случайном порядке.
random,randomize,shuffle,jitter,randomness

DSCore.List.Shuffle(System.Collections.IList,System.Int32)
Перемешивание элементов списка произвольным образом для упорядочения на основе исходного случайного значения.
list: Список, в котором требуется перемешать элементы.
seed: Случайное значение для формирования случайного числа.
Список с элементами в случайном порядке.
random,randomize,shuffle,jitter,randomness,seed

DSCore.List.Permutations(System.Collections.IList,System.Nullable{System.Int32})
Создание всех перестановок заданной длины для данного списка.
list: Список, в котором требуется перестановка элементов.
length: Длина каждой перестановки.
Перестановки в списке заданной длины (тип: var[]..[])
permutation,permutations

DSCore.List.Combinations(System.Collections.IList,System.Int32,System.Boolean)
Создание всех сочетаний заданной длины для данного списка.
list: Список для создания сочетаний
length: Длина каждого сочетания
replace: Удаляются ли элементы при выборе для создания комбинации. Значение по умолчанию —
«ложь».
Сочетания из списка заданной длины
combo

DSCore.List.FirstIndexOf(System.Collections.IList,System.Object)
Возвращает индекс, отсчитанный от нуля, для первого вхождения элемента
в списке. Если элемент не найден в списке, возвращает -1.
list: Список, в котором выполняется поиск. Если этот аргумент является нулевым, возвращает -1.
item: Элемент для поиска.
Returns: Индекс, отсчитанный от нуля, для элемента списка, либо -1, если элемент не найден.

DSCore.List.AllIndicesOf(System.Collections.IList,System.Object)
Возвращает индекс, отсчитанный от нуля, для всех вхождений элемента
в списке. Если элемент не найден, возвращает пустой список.
list: Список, в котором выполняется поиск. Если этот аргумент является нулевым, возвращает пустой список.
item: Элемент для поиска.
Список индексов, отсчитываемых от нуля, для всех вхождений элемента (если
элемент найден) или пустой список (если элемент отсутствует в списке).

DSCore.List.Flatten(System.Collections.IList,System.Int32)
Выравнивание вложенного списка списков по определенному количественному значению.
list: Список для выравнивания.
amount: Слои в списке, которые требуется исключить (–1 приведет к удалению всех вложенных в список слоев)
Список с выравниванием по объему
flatten,completely

DSCore.List.IndexInList(System.Collections.IList,System.Object)
Альтернатива использованию метода IList.Contains, при которой используется метод Enumerable.SequenceEqual для проверки присутствия элемента в списке и в массиве. При обнаружении возвращает индекс, при отсутствии возвращает -1.
list: Список, проверяемый на наличие элемента.
item: Элемент, который требуется найти.
Индекс элемента в списке.

DSCore.List.GetDepth(System.Object)
Получение максимальной глубины заданного списка.
list: Список ввода для получения глубины.
Глубина заданного списка.

DSCore.List.CountBool(System.Collections.IList,System.Boolean)
Возвращает количество указанных логических значений в заданном списке.
list: Список для поиска логических значений.
value: Искомое логическое значение
Количество заданных логических значений в списке.

DSCore.List.IncreaseDepth(System.Collections.IList,System.Int32)
Увеличение глубины заданного списка на определенную величину. Глубина увеличивается путем создания нового списка, содержащего данный список.
list: Список, глубина которого должна быть увеличена.
amt: Значение, на которое должна быть увеличена глубина.
Новый список, глубина которого увеличивается на указанное значение.

DSCore.List.DoubleConverter(System.Object)
Преобразование целого числа в двойное значение. При его отсутствии - возврат объекта входных данных.