DSCore.Compare
Методы сравнения.

DSCore.Compare.GreaterThan(System.Object,System.Object)
Возврат значения «Истина», если a больше b.
a: Объект для сравнения.
b: Объект для сравнения.
Логический результат.
larger,bigger

DSCore.Compare.GreaterThanOrEqual(System.Object,System.Object)
Возврат значения «Истина», если a больше или равно b.
a: Объект для сравнения.
b: Объект для сравнения.
Логический результат.
larger,bigger,equal

DSCore.Compare.LessThan(System.Object,System.Object)
Возврат значения «Истина», если a меньше b.
a: Объект для сравнения.
b: Объект для сравнения.
Логический результат.
less,smaller

DSCore.Compare.LessThanOrEqual(System.Object,System.Object)
Возврат значения «Истина», если a меньше или равно b.
a: Объект для сравнения.
b: Объект для сравнения.
Логический результат.
smaller,equal