DSCore.CurveMapper.PowerCurve
Кривая степенной функции в CurveMapper.
Кривая определяется степенным уравнением, полученным на основе управляющей точки.

DSCore.CurveMapper.PowerCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Возврат значений X и Y, распределенных по кривой.