DSCore.ObjectComparer
Реализация функций для сравнения двух объектов с использованием следующих правил.
1. Числа принимаются начиная с наименьших, затем логические значения, строки и указатели.
2. Если два сравниваемых объекта имеют один и тот же тип, используйте
их специальный механизм сравнения.
3. Если оба объекта входных данных являются значениями, но одно из них - логическое значение, оно считается наибольшим.
4. В противном случае можно преобразовать все объекты в двойные значения и сравнить.
5. Else If: если один из объектов является значением, он является наименьшим.
6. Else If: если один из объектов является строкой, он является наименьшим.
7. Else: оптимальный метод сравнения неизвестен - лучше всего сравнивать объекты по хэш-коду.