DSCore.Color.Red
Найти красную составляющую цвета: от 0 до 255.
Значение красного цвета для цветовой модели RGB, целое число от 0 до 255 включительно.

DSCore.Color.Green
Найти зеленую составляющую цвета, от 0 до 255.
Значение зеленого цвета для цветовой модели RGB, целое число от 0 до 255 включительно.

DSCore.Color.Blue
Найти синюю составляющую цвета, от 0 до 255.
Значение синего цвета для цветовой модели RGB, целое число от 0 до 255 включительно.

DSCore.Color.Alpha
Найти альфа-составляющую цвета, от 0 до 255.
Значение «альфа», целое число от 0 до 255 включительно.

DSCore.Color.ByARGB(System.Int32,System.Int32,System.Int32,System.Int32)
Создание цвета по значению "альфа" и компонентам красного, зеленого и синего.
alpha: Значение альфа (от 0 до 255 включительно)
red: Значение красного для цветовой модели RGB (от 0 до 255 включительно)
green: Значение зеленого для цветовой модели RGB (от 0 до 255 включительно)
blue: Значение синего для цветовой модели RGB (от 0 до 255 включительно)
Цвет, созданный из ARGB
color

DSCore.Color.Brightness(DSCore.Color)
Получение значения яркости для данного цвета.
color: Цвет для запроса яркости
Значение яркости (между 0 и 1 включительно)

DSCore.Color.Saturation(DSCore.Color)
Получение значения насыщенности для данного цвета.
Значение насыщенности, двойное значение от 0 до 1 включительно.

DSCore.Color.Hue(DSCore.Color)
Получение значения оттенка для данного цвета.
color: Цветной объект
Значение оттенка, двойное значение между 0 и 1 включительно.
hues

DSCore.Color.Components(DSCore.Color)
Список составляющих цвета в следующем порядке: альфа, красная, зеленая и синяя.
color: Цветной объект
Значение «альфа», целое число от 0 до 255 включительно.
Значение красного цвета для цветовой модели RGB, целое число от 0 до 255 включительно.
Значение зеленого цвета для цветовой модели RGB, целое число от 0 до 255 включительно.
Значение синего цвета для цветовой модели RGB, целое число от 0 до 255 включительно.
alpha,red,green,blue

DSCore.Color.BuildColorFrom1DRange(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double},System.Double)
Получение цвета на основе цветового градиента между начальным и конечным цветом.
parameters: Значения от 0 до 1 в диапазоне, в котором требуется протестировать цвета.
Цвета в заданном диапазоне.
color,range,gradient

DSCore.Color.Lerp(DSCore.Color,DSCore.Color,System.Double)
Линейная интерполяция между двумя цветами.
start: Начальный цвет.
end: Конечный цвет.
t: Параметр в диапазоне от 0,0 до 1,0.
Returns: Интерполированный или белый цвет.

DSCore.Color.Blerp(System.Collections.Generic.IList{DSCore.Color.IndexedColor2D},Autodesk.DesignScript.Geometry.UV)
Билинейная интерполяция между цветами в наборе.
Returns: Интерполированный или белый цвет.
This algorithm is not the same as the solution found from wikipedia
(reference: https://en.wikipedia.org/wiki/Bilinear_interpolation)

DSCore.Color.Add(DSCore.Color,DSCore.Color)
Создание цвета путем объединения значений ARGB двух существующих цветов.
color: Цвет для добавления
otherColor: Другой цвет для добавления
Итоговый цвет после добавления двух цветов

DSCore.Color.Multiply(DSCore.Color,System.Double)
Умножение входного цвета на числовой множитель для получения более темного цвета. Альфа-значение входного цвета должно быть меньше 255.
color: Цвет для умножения
multiplier: Значение множителя
Итоговый цвет после умножения

DSCore.Color.Divide(DSCore.Color,System.Double)
Деление входного цвета на числовой делитель для получения более яркого цвета и удаления оттенка.
color: Цвет для деления
dividend: Значение делимого
Итоговый цвет после деления