DSCore.CurveMapper.ParabolicCurve
Параболическая кривая в CurveMapper.
Кривая определяется квадратным уравнением на основе двух управляющих точек.

DSCore.CurveMapper.ParabolicCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Возврат значений X и Y, распределенных по кривой.