DSCore.IO.FileSystem
Методы для работы с файлами.

DSCore.IO.FileSystem.AbsolutePath(System.String,System.String)
Получение абсолютного пути из заданного пути. Если указанный путь
является относительным, то он будет обработан в рамках текущего
рабочего пространства. Если файл не существует по относительному
пути, но существует по указанному hintPath, то будет возвращен hintPath.
path: Относительный или полный путь
hintPath: Последний обработанный путь
Returns: Абсолютный путь

DSCore.IO.FileSystem.FileFromPath(System.String)
Создание файлового объекта на основе указанного пути к файлу.

DSCore.IO.FileSystem.ReadText(System.IO.FileInfo)
Чтение текстового файла с выводом содержимого в виде строки.
file: Файловый объект с текстом для чтения
Содержимое текстового файла.
read file,text,file

DSCore.IO.FileSystem.MoveFile(System.String,System.String,System.Boolean)
Перемещение указанного файла в новое местоположение
path: Строковое представление существующего пути
newPath: Строковое представление нового пути
overwrite: Переключатель для перезаписи существующих файлов
Узел выполняет задачу, но не создает выходные данные

DSCore.IO.FileSystem.DeleteFile(System.String)
Удаление указанного файла.
path: Путь к удаляемому файлу
Узел выполняет задачу, но не создает выходные данные

DSCore.IO.FileSystem.CopyFile(System.IO.FileInfo,System.String,System.Boolean)
Копирование файла.
file: Файловый объект для копирования
destinationPath: Строковое представление пути к конечному файлу
overwrite: Переключатель для перезаписи существующих файлов
Узел выполняет задачу, при успешном копировании возвращается значение «Истина».

DSCore.IO.FileSystem.FileExists(System.String)
Определение, содержится ли файл в указанной папке.
path: Строка, представляющая путь к файлу
True — файл существует, False — не существует
filepath

DSCore.IO.FileSystem.WriteText(System.String,System.String)
Запись текстового содержимого в файл по заданному пути
filePath: Путь для записи
text: Текстовое содержимое
Без вывода
write file,text,file,filepath

DSCore.IO.FileSystem.AppendText(System.String,System.String)
Добавить текстовое содержимое в файл по заданному пути
filePath: Путь для записи
text: Текстовое содержимое
Узел выполняет задачу, но не создает выходные данные
append file,write file,text,file,filepath

DSCore.IO.FileSystem.CombinePath(System.String[])
Объединение нескольких строк в один путь к файлу.
strings: Строки для объединения в один путь
Объединенный путь к файлу

DSCore.IO.FileSystem.FileExtension(System.String)
Получение расширения на основе пути файла.
path: Путь для получения расширения
Расширение файла

DSCore.IO.FileSystem.ChangePathExtension(System.String,System.String)
Изменение расширения для пути к файлу.
path: Путь для изменения расширения
newExtension: Строковое представление нового расширения
Путь к файлу с измененным расширением

DSCore.IO.FileSystem.DirectoryName(System.String)
Получение имени папки для пути к файлу.
path: Путь для получения информации о каталоге
Имя каталога из пути к файлу
directorypath

DSCore.IO.FileSystem.FileName(System.String,System.Boolean)
Получение имени файла для пути к файлу.
path: Путь для получения имени файла
withExtension: Переключатель для добавления расширения в результат
Имя файла из пути к файлу

DSCore.IO.FileSystem.FileHasExtension(System.String)
Определение, содержит ли путь к файлу расширение.
path: Путь для проверки расширения
True — путь к файлу содержит расширение, False — не содержит

DSCore.IO.FileSystem.GetDirectoryContents(System.IO.DirectoryInfo,System.String,System.Boolean)
Вывод списка файлов и папок, которые содержатся в данном каталоге. Для фильтрации результатов можно использовать searchString (необязательно).
directory: Каталог для получения содержимого
searchString: Строка поиска для фильтрации результатов
includeSubdirectories: Задайте значение True, чтобы включить файлы и папки во вложенные каталоги (рекурсивные), или значение False, чтобы включить результаты только из указанного каталога верхнего уровня.
Файлы, полученные по запросу
Каталоги, полученные по запросу

DSCore.IO.FileSystem.CopyDirectory(System.IO.DirectoryInfo,System.String,System.Boolean)
Копирование папки в целевое местоположение.
directory: Каталог для копирования
destinationPath: Целевое расположение на диске для операции копирования
overwriteFiles: Переключатель для перезаписи существующего каталога
Узел выполняет задачу, но не создает выходные данные

DSCore.IO.FileSystem.DeleteDirectory(System.String,System.Boolean)
Удаление папки.
path: Путь к каталогу на диске
recursive: Удаление всего содержимого папки. По умолчанию устанавливается значение false.
Узел выполняет задачу, но не создает выходные данные

DSCore.IO.FileSystem.DirectoryExists(System.String)
Определение того, находится ли папка по указанному пути.
path: Путь к каталогу на диске
True — каталог существует, False — не существует
directorypath

DSCore.IO.FileSystem.MoveDirectory(System.String,System.String,System.Boolean)
Перемещение папки в новое местоположение.
path: Строковое представление существующего пути
newPath: Строковое представление нового пути
overwriteFiles: Переключатель для перезаписи существующих файлов
Узел выполняет задачу, но не создает выходные данные