DSCore.CurveMapper.SineWave
Синусоидальная кривая в CurveMapper.
Синусоида определяется двумя управляющими точками и управляется тригонометрической функцией.

DSCore.CurveMapper.SineWave.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Возврат значений X и Y, распределенных по кривой.