DSCore.CurveMapper.GaussianCurve
Кривая Гаусса в CurveMapper.
Кривая Гаусса следует воронкообразному распределению, определяемому четырьмя управляющими точками.

DSCore.CurveMapper.GaussianCurve.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Указание того, изменяется ли размер узла в данный момент, что позволяет избежать непреднамеренного обновления управляющих точек.

DSCore.CurveMapper.GaussianCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Возврат значений X и Y, распределенных по кривой.