DSCore.Data.MaxDepthJsonTextWriter
Подкласс JsonTextWriter, ограничивающий максимальную глубину поддерживаемого объекта для предотвращения сбоев циклических ссылок при сериализации произвольных типов объектов .NET.