DSCore.Data.DataNodeDynamoType
Класс, представляющий элемент DataType, поддерживаемый Dynamo

DSCore.Data.DataNodeDynamoType.#ctor(System.Type,System.String,System.String)
Класс, представляющий элемент DataType, поддерживаемый Dynamo

DSCore.Data.DataNodeDynamoType.Type
Базовый тип

DSCore.Data.DataNodeDynamoType.Name
Необязательное имя для переопределения имени типа (`Number` вместо `long`)

DSCore.Data.DataNodeDynamoType.TypeId
Формат провода $typeid (например, autodesk.math:point3d-1.0.0).
Null для типов примитивов, которые не используют сериализацию $typeid.

DSCore.Data.DataNodeDynamoType.Level
Иерархический уровень, который требуется отобразить в пользовательском интерфейсе

DSCore.Data.DataNodeDynamoType.IsLastChild
Если тип является последним дочерним элементом иерархии (для целей пользовательского интерфейса)

DSCore.Data.DataNodeDynamoType.Parent
Родительский элемент Type, если имеется