DSCore.CurveMapper.BezierCurve
Кривая Безье в CurveMapper.
Кривая Безье определяется четырьмя управляющими точками и обеспечивает плавную интерполяцию.

DSCore.CurveMapper.BezierCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Получение интерполированных значений Y на основе назначенных параметров и ограничений.