DSCore.DateTime
Объект, представляющий определенную дату и время.

DSCore.DateTime.MinValue
Самая ранняя дата и время, которые возможно отобразить.
Минимально возможное представление DateTime

DSCore.DateTime.MaxValue
Самая поздняя дата и время, которые возможно отобразить.
Максимально возможное представление DateTime

DSCore.DateTime.Now
Текущая дата и время в системе.
Значение DateTime, представляющее настоящее время

DSCore.DateTime.Today
Текущая дата в системе и время, установленное на полночь.
Значение DateTime, представляющее сегодняшний день

DSCore.DateTime.Format(System.DateTime,System.String)
Возвращает указанные дату и время в качестве строки в определенном формате.
dateTime: Значение DateTime для формата
format: Строчное представление формата даты. По умолчанию используется стандартный формат «F», соответствующий региональному стандарту операционной системы: «Вторник, 21 февраля 2017 23:02:43».
Чтобы найти полный список форматов, выполните поиск по запросу «Строки настраиваемых форматов даты и времени».
Значение DateTime в виде строки

DSCore.DateTime.ByDate(System.Int32,System.Int32,System.Int32)
Создание нового значения DateTime с точной датой.
year: Точный год (1–9999)
month: Точный месяц (1–12)
day: Точный день (1–[дней в месяце])
Значение DateTime, полученное из даты

DSCore.DateTime.ByDateAndTime(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
Создание нового значения DateTime с точной датой и временем.
year: Точный год (1–9999)
month: Точный месяц (1–12)
day: Точный день (1–[дней в месяце])
hour: Точное количество часов (0–23)
minute: Точное количество минут (0–59)
second: Точное количество секунд (0–59)
millisecond: Точное количество миллисекунд (0–999)
Значение DateTime, полученное из даты и времени

DSCore.DateTime.SubtractTimeSpan(System.DateTime,System.TimeSpan)
Вычитание значения TimeSpan из DateTime с получением в итоге нового значения DateTime.
dateTime: Начальное значение DateTime
timeSpan: Количество времени для вычитания
Итоговое значение DateTime после вычитания

DSCore.DateTime.AddTimeSpan(System.DateTime,System.TimeSpan)
Добавление значения TimeSpan к DateTime с получением в результате нового значения DateTime.
dateTime: Начальное значение DateTime
timeSpan: Количество времени для прибавления к DateTime
Итоговое значение DateTime после прибавления временного диапазона

DSCore.DateTime.DaysInMonth(System.Int32,System.Int32)
Расчет количества дней в одном месяце данного года.
year: Точный год (1–9999)
month: Точный месяц (1–12)
Количество дней в месяце

DSCore.DateTime.IsDaylightSavingsTime(System.DateTime)
Определение того, имеются ли настройки перехода на летнее время для указанного значения DateTime.
dateTime: Значение DateTime для определения того, применяется ли переход на летнее время
True — для DateTime применяется переход на летнее времени, False — не применяется

DSCore.DateTime.IsLeapYear(System.Int32)
Определение того, является ли указанный год високосным.
year: Точный год (1–9999)
True — високосный год, False — не високосный

DSCore.DateTime.FromString(System.String)
Попытка выполнить разбор свойства DateTime из строки
string: Строковое представление DateTime
Значение DateTime из проанализированной строки

DSCore.DateTime.Date(System.DateTime)
Извлечение только даты из значения DateTime. Для компонентов времени задано значение 0.
dateTime: Значение DateTime.
дата из значения DateTime
Date

DSCore.DateTime.Components(System.DateTime)
Извлечение отдельных компонентов DateTime.
dateTime: Значение DateTime для получения компонентов
Числовое представление года (1–9999)
Числовое представление месяца (1–12)
Числовое представление дня (1–[число дней в месяце])
Числовое представление часа (0–23)
Числовое представление минут (0–59)
Числовое представление секунд (0–59)
Числовое представление миллисекунд (0–999)

DSCore.DateTime.DayOfWeek(System.DateTime)
Получение дня недели из указанного значения DateTime.
dateTime: Объект DateTime для получения дня недели
День недели

DSCore.DateTime.DayOfYear(System.DateTime)
Получение дня года (0–366)
dateTime: Значение DateTime для получения дня в году
Количество дней с начала года

DSCore.DateTime.TimeOfDay(System.DateTime)
Получение нового значения TimeSpan, обозначающего период времени, прошедший с
полуночи указанного дня, из значения DateTime.
dateTime: Значение DateTime.
Значение TimeSpan с полуночи