DSCore.Data.ParseJSON(System.String)
Анализ преобразует произвольную строку формата JSON в значение. Противоположно методу JSON.Stringify.
json: Строка формата JSON
Тип результата зависит от содержимого строки ввода. Результат может быть элементарным значением (например, строковым, логическим или двойным значением), списком либо словарем.

DSCore.Data.ToNative(Newtonsoft.Json.Linq.JToken)
Реализация синтаксического анализа для преобразования типов JToken в нативные объекты .NET.
token: Синтаксический анализ JToken в N

DSCore.Data.DynamoJObjectToNative(Newtonsoft.Json.Linq.JObject)
Реализация синтаксического анализа для преобразования типов JObject в определенные объекты Dynamo (например, в геометрию, цвет, изображения и т. д.)
Throws System.Exception:

DSCore.Data.StringifyJSON(System.Object)
При получении строкового представления произвольное значение или список произвольных значений преобразуются в формат JSON. Можно использовать репликацию для применения операции к списку, чтобы сформировать список строк формата JSON.
values: Список значений
Строка формата JSON, в котором элементарные значения (например, двойные, целые или логические значения), списки и словари будут преобразованы в соответствующий тип JSON.

DSCore.Data.CanObjectBeCached(System.Object)
Вспомогательная функция для определения того, можно ли кэшировать объект либо он имеет нулевое значение, является нулевой строкой или пустым списком.
inputObject: Объект для проверки

DSCore.Data.Remember(System.Object,System.String)
Функция для обработки кэширования узла Data.Remember
inputObject: Объект для кэширования
cachedJson: Дополнительный существующий кэшированный файл JSON

DSCore.Data.DataNodeDynamoTypeList
Статический список для всех типов данных, поддерживаемых Dynamo
Returns: Список поддерживаемых типов данных

DSCore.Data.#cctor
Статический конструктор

DSCore.Data.SafeExtractDictionaryValue(System.Collections.Generic.Dictionary{System.String,System.Object},System.String)
Вспомогательная функция для безопасного извлечения значения словаря
dict: Словарь, из которого требуется извлечь значение
key: Ключ пары «ключ — значение»

DSCore.Data.EvaluateDefineDataNode(System.Object,System.String,System.Boolean,System.Boolean,System.String)
Эта функция используется AST для оценки узла Define Data.
Она обрабатывает некоторые логические операции узла при выполнении проверки
inputValue: Предшествующее входное значение
typeString: Тип как строка (Todo: лучше передать объект типа Type для непосредственного сравнения типов)
isList: Если входные данные имеют тип `ArrayList`
isAutoMode: Если узел находится в режиме «Авто»
playerValue: Значение, введенное в узел проигрывателем Dynamo, если оно существует.

DSCore.Data.FindCommonAncestor(System.Collections.ArrayList)
Функция для поиска типа в случае, если в AutoMode был передан список объектов ArrayList
list: Входное значение, которое должно иметь тип ArrayList

DSCore.Data.LikelyAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
Вспомогательная функция, возвращающая узел самого низкого уровня из списка узлов DataNodeDynamoType
nodes: Список DataNodeDynamoType для оценки

DSCore.Data.FindClosestCommonAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
Вспомогательная функция для определения общего предка в списке типов данных
nodes: Список узлов DataType для оценки

DSCore.Data.FindCommonAncestorBetweenTwoNodes(DSCore.Data.DataNodeDynamoType,DSCore.Data.DataNodeDynamoType)
Рекурсивная функция для поиска общего предка между двумя типами Dynamo
Восходит вверх по иерархическому дереву likelyAncestor до тех пор, пока
node: Проверьте, является ли этот узел производным от вероятного предка
likelyAncestor: Вероятный предок, из которого должен быть создан узел

DSCore.Data.GetListFromTypes(System.Collections.ArrayList)
Возврат списка DataNodeDynamoTypes из списка объектов ArrayList
list: Список объектов ArrayList для переформатирования

DSCore.Data.IsSingleValueOrSingleLevelArrayList(System.Object)
Проверьте, является ли входной объект отдельным значением или одноуровневым списком ArrayList.
obj: Входной объект для оценки

DSCore.Data.IsSupportedDataNodeDynamoType(System.Object,System.Type,System.Boolean)
Функция для проверки типа входных данных на соответствие поддерживаемым типам Dynamo
inputValue: Входные данные для проверки
type: Тип входных данных, предоставленный пользователем. Он должен соответствовать типу inputValue
isList: Значение этого логического выражения определяет, является ли входной параметр отдельным объектом или списком

DSCore.Data.IsItemOfType(System.Object,System.Type)
Этот метод проверяет, относится ли элемент к обязательному типу DataType Dynamo
IsInstanceOfType рекурсивно проверяет наследование вверх
item: Элемент, тип данных которого проверяется
dataType: Тип DataType, на соответствие которому выполняется проверка
Returns: Результат True или False на основе проверки

DSCore.Data.IsDerivedFrom(System.Type,System.Type)
Этот метод проверяет, является ли тип производным от базового типа
derivedType: Тип, который требуется утвердить
baseType: Базовый тип для сравнения