DSCore.Quadtree.ByUVs(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.UV})
Создание квадрадерева, охватывающего область (0;0)->(1;1).
uvs: Набор UV в области (0,0)->(1,1).
Returns: Объект квадрадерева.

DSCore.Quadtree.FindPointsWithinRadius(Autodesk.DesignScript.Geometry.UV,System.Double)
Найти все точки (UV) квадрадерева в квадрадереве, которое расположено в радиусе до указанного местоположения  UV.
center: UV в центре области поиска.
radius: Радиус области поиска.
Returns: Список UV.