DSCore.TimeSpan
Объект, представляющий временную задержку без определенной начальной или конечной даты.

DSCore.TimeSpan.ByDateDifference(System.DateTime,System.DateTime)
Получение нового значения TimeSpan, вычисленного на основе разницы во времени между двумя значениями DateTime
dateTime: Значение DateTime для вычитания
otherDateTime: DateTime для вычитания
Разница значений TimeSpan между двумя датами

DSCore.TimeSpan.Zero
Значение TimeSpan, равное нулевому времени задержки.
Значение TimeSpan, представляющее собой нулевое время задержки

DSCore.TimeSpan.MaxValue
Максимальное значение TimeSpan, которое может быть представлено.
Максимально возможное представление TimeSpan

DSCore.TimeSpan.MinValue
Минимальное значение TimeSpan, которое может быть представлено.
Минимально возможное представление TimeSpan

DSCore.TimeSpan.Create(System.Double,System.Double,System.Double,System.Double,System.Double)
Создание нового элемента TimeSpan на основе интервала времени.
days: Интервал в днях.
hours: Интервал в часах.
minutes: Интервал в минутах.
seconds: Интервал в секундах.
milliseconds: Интервал в миллисекундах.
Созданное значение TimeSpan

DSCore.TimeSpan.Scale(System.TimeSpan,System.Double)
Умножение значения TimeSpan на масштабный коэффициент
timeSpan: Значение TimeSpan для умножения
scaleFactor: Число для пересчета интервала времени. Например, при масштабном коэффициенте 2
значение интервала времени умножается на 2.
Произведение TimeSpan

DSCore.TimeSpan.Negate(System.TimeSpan)
Преобразование значения TimeSpan в противоположное
timeSpan: Значение TimeSpan для преобразования в противоположное
Отрицательное значение TimeSpan

DSCore.TimeSpan.Add(System.TimeSpan,System.TimeSpan)
Прибавление двух значений TimeSpan
timeSpan1: Значение TimeSpan для прибавления
timeSpan2: Другое значение TimeSpan для прибавления
Итоговое значение TimeSpan после прибавления

DSCore.TimeSpan.Subtract(System.TimeSpan,System.TimeSpan)
Вычитание двух значений TimeSpan
timeSpan1: Значение TimeSpan для вычитания
timeSpan2: TimeSpan для вычитания
Значение TimeSpan, полученное в результате вычитания

DSCore.TimeSpan.FromString(System.String)
Попытка выполнить разбор значения TimeSpan из строки
string: Строковое представление TimeSpan.
Значение TimeSpan из проанализированной строки

DSCore.TimeSpan.Components(System.TimeSpan)
Извлечение отдельных компонентов TimeSpan.
timeSpan: Значение TimeSpan для получения компонентов
Количество дней (тип: целое число)
Количество часов (тип: целое число)
Количество минут (тип: целое число)
Количество секунд (тип: целое число)
Количество миллисекунд (тип: целое число)

DSCore.TimeSpan.TotalDays(System.TimeSpan)
Преобразование общего количества времени, обозначаемого TimeSpan, в
приблизительное количество дней.
timeSpan: Значение TimeSpan для запроса общего количества дней
Общее количество дней

DSCore.TimeSpan.TotalHours(System.TimeSpan)
Преобразование общего количества времени, обозначаемого TimeSpan, в
приблизительное количество часов.
timeSpan: Значение TimeSpan для запроса общего количества часов
Общее количество часов

DSCore.TimeSpan.TotalMinutes(System.TimeSpan)
Преобразование общего количества времени, обозначаемого TimeSpan, в
приблизительное количество минут.
timeSpan: Значение TimeSpan для запроса общего количества минут
Общее количество минут

DSCore.TimeSpan.TotalSeconds(System.TimeSpan)
Преобразование общего количества времени, обозначаемого TimeSpan, в
приблизительное количество секунд.
timeSpan: Значение TimeSpan для запроса общего количества секунд
Общее количество секунд

DSCore.TimeSpan.TotalMilliseconds(System.TimeSpan)
Преобразование общего количества времени, обозначаемого TimeSpan, в
приблизительное количество миллисекунд.
timeSpan: Значение TimeSpan для запроса общего количества миллисекунд
Общее количество миллисекунд