DSCore.Object
Типовые функции, которые используются для всех видов данных.

DSCore.Object.IsNull(System.Object)
Определение того, имеет ли данный объект нулевое значение.
object: Объект для проверки.
Установлено ли для объекта нулевое значение.
is null

DSCore.Object.Identity(System.Object)
Возврат предъявленных значений, отсутствие действия.
object: Объект.
Тот же объект

DSCore.Object.Type(System.Object)
Возврат типа объекта, представленного в виде строки.
object: Объект для запроса типа
Returns: Тип объекта.