DSCore.Sorting
Служебные методы сортировки по ключам. Следует блокировать их преобразование в узлы —
вместо этого они будут заключены в оболочки элементов DS, которые поддерживают функцию сопоставления ключей.