DSCore.CurveMapper.BezierCurve
Représente une courbe de Bézier dans le CurveMapper.
Une courbe de Bézier est définie par quatre points de contrôle et permet une interpolation fluide.

DSCore.CurveMapper.BezierCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Obtient des valeurs Y interpolées en fonction des paramètres et des limites attribués.