DSCore.CurveMapper.SineWave
Représente une courbe d'onde sinusoïdale dans le CurveMapper.
L'onde sinusoïdale est définie par deux points de contrôle et suit une fonction trigonométrique.

DSCore.CurveMapper.SineWave.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Renvoie les valeurs X et Y réparties sur toute la courbe.