DSCore.List
Méthodes de création et de manipulation des listes.

DSCore.List.Empty
Renvoie une liste vide.
Liste vide.
empty list, emptylist,[]

DSCore.List.UniqueItems(System.Collections.IList)
Crée une liste contenant tous les éléments uniques dans la liste indiquée.
list: Filtrer les doublons dans cette liste.
Liste filtrée.
removes,duplicates,remove duplicates,cull duplicates,distinct,listcontains

DSCore.List.Contains(System.Collections.IList,System.Object)
Détermine si la liste indiquée contient l'élément indiqué. Cette fonction recherche parmi les sous-listes contenues dans celui-ci.
list: Effectuer la recherche dans cette liste
item: Élément à rechercher
True si la liste contient l'élément, False sinon
item,search,in,listcontains

DSCore.List.IsHomogeneous(System.Collections.IList)
Vérifiez si les éléments figurant dans la liste sont du même type.
list: Liste dans laquelle vérifier l'homogénéité.
Si la liste est homogène.
homogeneous,allequal,same,type

DSCore.List.IsRectangular(System.Collections.IList)
Vérifiez si le nombre d'éléments dans toutes les lignes de la liste sont identiques.
list: Liste dans laquelle vérifier si les lignes ont le même nombre d'éléments.
Si la liste contient le même nombre d'éléments dans toutes les lignes.
rectangular,isrectangular,same,sublist,row

DSCore.List.IsUniformDepth(System.Collections.IList)
Vérifiez si les éléments de la liste ont la même profondeur.
list: Liste dans laquelle vérifier si les éléments possèdent la même profondeur.
Si la profondeur de la liste est uniforme.
depth,uniform,isuniformdepth,sublist,jagged

DSCore.List.SetDifference(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Renvoie une nouvelle liste qui contient les objets de List1 mais exclut les objets de List2.
list1: Liste des objets à inclure dans la nouvelle liste
list2: Liste des objets à exclure de la nouvelle liste
Nouvelle liste contenant les objets de List1, mais pas ceux de List2
difference,setdifference,set

DSCore.List.SetIntersection(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Renvoie une nouvelle liste qui inclut les objets présents dans List1 et List2.
list1: Liste d'objets à comparer à List2
list2: Liste d'objets à comparer à List1
Nouvelle liste contenant les objets présents à la fois dans List1 et dans List2
intersection,setintersection,set,overlap

DSCore.List.SetUnion(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Renvoie une nouvelle liste qui inclut les objets présents dans List1 ou List2.
list1: Liste des objets à inclure
list2: Liste des objets à inclure dans List1
Nouvelle liste contenant les objets présents dans List1 ou dans List2
union,setunion,set

DSCore.List.IndexOf(System.Collections.IList,System.Object)
Renvoie l'index de l'élément dans la liste indiquée. La correspondance entre la liste donnée et l'élément cible doit être stricte (par exemple, entre deux entiers, deux doubles, deux chaînes, deux objets, etc.)
list: Liste dans laquelle rechercher l'élément.
element: Elément dont l'index doit être renvoyé.
Index de l'élément dans la liste. L'index non valide -1 sera renvoyé si aucune correspondance stricte n'est trouvée.
index,indexof

DSCore.List.CountFalse(System.Collections.IList)
Renvoie le nombre de valeurs booléennes False dans la liste indiquée.
list: La liste recherche les valeurs booléennes False.
Nombre de valeurs booléennes False dans la liste.
false,count

DSCore.List.CountTrue(System.Collections.IList)
Renvoie le nombre de valeurs booléennes True dans la liste indiquée.
list: La liste recherche les valeurs booléennes True.
Nombre de valeurs booléennes True dans la liste.
true,count

DSCore.List.Insert(System.Collections.IList,System.Object,System.Int32)
Insère un élément dans une liste au niveau de l'index spécifié.
list: Liste dans laquelle l'élément doit être inséré
element: Élément à insérer
index: Indique l'emplacement où insérer l'élément dans la liste
Liste avec l'élément inséré
insert,add

DSCore.List.Reorder(System.Collections.IList,System.Collections.IList)
Réorganise la liste d'entrée en fonction de la liste indiquée d'index.
list: Liste à réorganiser
indices: Index utilisés pour réorganiser les éléments dans la liste
Liste réorganisée
reorder,index,indices

DSCore.List.SortIndexByValue(System.Collections.Generic.List{System.Double})
Trie la liste par éléments et renvoie leurs index.
list: Liste des éléments à trier
Index des éléments dans la liste triée
sort,index,value

DSCore.List.NormalizeDepth(System.Collections.IList,System.Int32)
Renvoie la liste multidimensionnelle en fonction du classement donné.
list: Liste dont la profondeur doit être normalisée conformément au classement.
rank: Le classement de la liste doit être normalisé avec la valeur par défaut de 1.
Liste avec le classement normalisé.
depth,normalize

DSCore.List.Reverse(System.Collections.IList)
Crée une liste contenant les éléments de la liste indiquée, mais dans l'ordre inverse.
list: Liste à inverser.
Liste inversée
flip,listcontains

DSCore.List.__Create(System.Collections.IList)
Crée une nouvelle liste contenant les éléments spécifiés.
items: Eléments à stocker dans la nouvelle liste.

DSCore.List.Sublists(System.Collections.IList,System.Collections.IList,System.Int32)
Créer des sous-listes à partir d'une liste à l'aide de la syntaxe d'intervalle DesignScript.
list: Créer les sous-listes à partir de cette liste.
ranges: Intervalle d'index des éléments de sous-liste.
ex. \"{0..3,5,2}\"
offset: Décalage à appliquer à la sous-liste.
Par exemple, l'intervalle \"0.. 3\" avec un décalage de 2 génère
{0,1,2,3}{2,3,4,5}{4,5,6,7}...
type: var[]..[]
sublists,build sublists,subset,

DSCore.List.Sort(System.Collections.Generic.IEnumerable{System.Object})
Trie une liste dans l'ordre standard intégré.
list: Liste à trier
Liste triée
sort,order,sorted

DSCore.List.MinimumItem(System.Collections.Generic.IEnumerable{System.Object})
Renvoie la valeur minimale d'une liste.
list: Obtenir la valeur minimale parmi ces éléments comparables
Valeur minimale de la liste.
least,smallest,find min

DSCore.List.MaximumItem(System.Collections.Generic.IEnumerable{System.Object})
Renvoie la valeur maximale d'une liste.
list: Obtenir la valeur maximale parmi ces éléments comparables
Valeur maximale de la liste.
greatest,largest,biggest,find max

DSCore.List.FilterByBoolMask(System.Collections.IList,System.Collections.IList)
Filtre une séquence en recherchant les index correspondants dans une liste distincte de
booléens.
list: Liste à filtrer.
mask: Liste de booléens représentant un masque.
Eléments dont l'index de masque est True.
Eléments dont l'index de masque est False.
filter,in,out,mask,dispatch,bool filter,boolfilter,bool filter

DSCore.List.Deconstruct(System.Collections.IList)
En fonction d'une liste donnée, génère le premier élément de la liste, et une nouvelle liste contenant tous les éléments
à l'exception du premier.
list: Liste à scinder.
Premier élément de la liste (type: var[]..[])
Reste de la liste (type: var[]..[])
first,rest,list split,listcontains

DSCore.List.SortByKey(System.Collections.IList,System.Collections.IList)
Trier la liste en fonction de ses clés
list: liste à trier
keys: liste des clés, les clés doivent être triables (par exemple: nombres, chaînes)
type: var[]..[]
type: var[]..[]
sort;key

DSCore.List.GroupByKey(System.Collections.IList,System.Collections.IList)
Regrouper les éléments dans des sous-listes par valeurs clé similaires
list: Liste d'éléments à regrouper dans des sous-listes
keys: Valeurs clé, une par élément dans la liste d'entrée, utilisées pour regrouper les éléments
liste des sous-listes, avec les éléments regroupés par valeurs clé similaires
valeur clé correspondant à chaque groupe
list;group;groupbykey;

DSCore.List.GroupBySimilarity(System.Collections.IList,System.Double,System.Boolean)
Les clusters établissent la liste des éléments en fonction de la contiguïté de leurs indices et de la similitude de leurs valeurs
list: Liste des éléments à regrouper en sous-listes en fonction de la contiguïté et de la similitude
tolerance: Valeur seuil pour le regroupement d'éléments similaires
considerAdjacency: Valeur booléenne pour contrôler si le noeud doit considérer la contiguïté ou non.
liste de sous-listes avec des éléments regroupés selon des valeurs similaires
liste de sous-listes contenant les index originaux des valeurs regroupées
list;group;similar;adjacent;adjacency;groupbyadjacency;groupadjacentitems;groupsimilaritems;cluster;tolerance

DSCore.List.LevenshteinDistance(System.String,System.String)
La distance de Levenshtein est l'algorithme utilisé pour obtenir la distance entre 2 chaînes
| Source

DSCore.List.AddItemToFront(System.Object,System.Collections.IList)
Ajoute un élément au début d'une liste.
item: Elément à ajouter. L'élément peut être un objet ou une liste.
list: Ajouter à cette liste.
Liste contenant les éléments ajoutés
insert,add,item,front,start,begin

DSCore.List.AddItemToEnd(System.Object,System.Collections.IList)
Ajoute un élément à la fin d'une liste.
item: Elément à ajouter. L'élément peut être un objet ou une liste.
list: Ajouter à cette liste.
Liste contenant les éléments ajoutés
insert,add,item,end

DSCore.List.TakeItems(System.Collections.IList,System.Int32)
Récupère une quantité d'éléments du début de la liste.
list: Liste de laquelle récupérer les éléments.
amount: Quantité d'éléments à récupérer. Si la valeur est négative, les éléments sont récupérés de la fin de la liste.
Liste des éléments extraits.
get,sub,sublist,extract

DSCore.List.DropItems(System.Collections.IList,System.Int32)
Supprime une quantité d'éléments du début de la liste. Si la quantité est à une valeur négative,
les éléments sont supprimés de la fin de la liste.
list: Supprimer les éléments de cette liste.
amount: Quantité d'éléments à supprimer. Si la valeur est négative, les éléments sont supprimés de la fin de la liste.
Liste des éléments restants.
drop,remove,shorten

DSCore.List.ShiftIndices(System.Collections.IList,System.Int32)
Décale les index dans la liste vers la droite en fonction de la quantité indiquée.
list: Liste à décaler.
amount: Décaler les index en fonction de cette quantité. Si la valeur est négative, les index sont déplacés vers la gauche.
Liste décalée.
shift,offset

DSCore.List.GetItemAtIndex(System.Collections.IList,System.Int32)
Renvoie un élément de la liste indiquée qui se trouve au niveau de l'index spécifié.
list: Récupérer un élément de cette liste.
index: Index de l'élément à récupérer.
Elément de la liste au niveau de l'index donné.
get,item,index,fetch,at,getfrom,get from,extract

DSCore.List.ReplaceItemAtIndex(System.Collections.IList,System.Int32,System.Object)
Remplacer un élément de la liste indiquée qui se trouve au niveau de l'index spécifié.
list: Remplacer un élément de cette liste.
index: Index de l'élément à remplacer.
item: Elément à insérer.
Nouvelle liste contenant l'élément remplacé.
replace,switch

DSCore.List.ReplaceItemAtIndices(System.Collections.IList,System.Collections.Generic.IList{System.Int32},System.Object)
Remplace les éléments de la liste donnée qui se trouvent aux index spécifiés.
list: Remplacer un élément de cette liste.
indices: Index du ou des éléments à remplacer.
item: Elément à insérer.
Une nouvelle liste avec le ou les éléments remplacés.
replace,switch

DSCore.List.Slice(System.Collections.IList,System.Nullable{System.Int32},System.Nullable{System.Int32},System.Int32)
Renvoie une seule sous-liste de la liste indiquée, en fonction de l'index de départ, de l'index de fin
et d'une quantité de pas.
list: Obtenir de cette liste.
start: Index de début de l'extraction.
end: Index de fin de l'extraction.
step: Quantité séparant les index des éléments dans la liste d'origine.
Eléments dans la section extraite de la liste indiquée.
list,sub,sublist,subrange,get sublist

DSCore.List.RemoveItemAtIndex(System.Collections.IList,System.Int32[])
Supprime un élément de la liste indiquée à l'index spécifié.
list: Supprimer un élément ou des éléments de cette liste.
indices: Index des éléments à supprimer.
Liste avec les éléments supprimés.
index,indices,cull,remove,item

DSCore.List.DropEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
Supprime les éléments de la liste indiquée aux index qui sont des multiples
de la valeur indiquée, après le décalage indiqué.
list: Supprimer les éléments de cette liste/
n: Les index qui sont des multiples de cet argument seront supprimés.
offset: Quantité d'éléments à ignorer à partir du début de la liste.
Liste avec les éléments supprimés.
nth,remove,cull,every

DSCore.List.TakeEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
Récupère les éléments de la liste indiquée aux index qui sont des multiples
de la valeur indiquée, après le décalage indiqué.
list: Récupérer les éléments de cette liste.
n: Les index qui sont des multiples de ce nombre (après le décalage)
seront récupérés.
offset: Quantité d'éléments à ignorer à partir du début de la liste.
Eléments de la liste.
fetch,take,every,nth

DSCore.List.IsEmpty(System.Collections.IList)
Détermine si la liste indiquée est vide.
list: Vérifier si cette liste est vide
True si la liste est vide, False sinon
test,is,empty,null,count

DSCore.List.AllTrue(System.Collections.IList)
Détermine si tous les éléments de la liste indiquée ont une valeur booléenne True.
list: Liste dans laquelle vérifier si tous les éléments sont True.
True si tous les éléments de la liste sont définis sur True, False si un ou plusieurs éléments ne sont pas définis sur True
test,all,true,istrue

DSCore.List.AllFalse(System.Collections.IList)
Détermine si les éléments de la liste indiquée ont une valeur booléenne False.
list: Liste dans laquelle vérifier si tous les éléments sont False.
True si tous les éléments de la liste sont définis sur False, False si un ou plusieurs éléments ne sont pas définis sur False
test,all,false,isfalse

DSCore.List.AnyTrue(System.Collections.IList)
Détermine si un élément de la liste donnée est un élément booléen et a la valeur True.
list: Liste dans laquelle vérifier si un élément a la valeur True.
Indique si un élément a la valeur True.
test,any,true,istrue

DSCore.List.AnyFalse(System.Collections.IList)
Détermine si un élément de la liste donnée est un élément booléen et a la valeur False.
list: Liste dans laquelle vérifier si un élément a la valeur False.
Indique si un élément a la valeur False.
test,any,false,isfalse

DSCore.List.Count(System.Collections.IList)
Renvoie le nombre d'éléments stockés dans la liste indiquée.
list: Obtenir le nombre d'éléments de cette liste.
Longueur de la liste.
listlength,list length,count,size,sizeof

DSCore.List.Join(System.Collections.IList[])
Concatène toutes les listes indiquées dans une liste unique.
lists: Listes à fusionner dans une liste unique.
Liste finale.
join lists,merge,concatenate

DSCore.List.FirstItem(System.Collections.IList)
Renvoie le premier élément d'une liste.
list: Obtenir le premier élément de cette liste.
Premier élément de la liste.
get,fetch,first,item,start

DSCore.List.RestOfItems(System.Collections.IList)
Supprime le premier élément de la liste indiquée.
list: Obtenir les éléments restants de cette liste.
Reste de la liste.
get,fetch,rest,end,rest of list

DSCore.List.Chop(System.Collections.IList,System.Collections.Generic.List{System.Int32})
Couper une liste dans un jeu de sous-listes consécutives avec les longueurs spécifiées. La division de liste commence en haut de la liste.
list: Liste à couper en sous-listes
lengths: Longueurs de sous-listes consécutives à créer à partir de la liste d'entrée
Sous-listes créées à partir de la liste
sublists,build sublists,slices,partitions,cut,listcontains,chop

DSCore.List.DiagonalRight(System.Collections.IList,System.Int32)
Répertorier les éléments le long de chaque diagonale de la matrice de la partie inférieure gauche à la partie supérieure droite.
list: Liste simple
subLength: Longueur de chaque nouvelle sous-liste.
Listes des éléments le long des diagonales de la matrice.
diagonal,right,matrix,get diagonals,diagonal sublists

DSCore.List.DiagonalLeft(System.Collections.IList,System.Int32)
Répertorier les éléments le long de chaque diagonale de la matrice de la partie supérieure gauche à la partie inférieure droite.
list: Liste simple.
rowLength: Longueur de chaque nouvelle sous-liste.
Listes des éléments le long des diagonales de la matrice.
diagonal,left,matrix,get diagonals,diagonal sublists

DSCore.List.Transpose(System.Collections.IList)
Permute des lignes et des colonnes dans une liste des listes.
Si certaines lignes sont plus courtes que d'autres,
les valeurs nulles sont insérées en tant qu'espaces réservés
dans le réseau obtenu de sorte qu'il est toujours rectangulaire.
lists: Liste de listes à transposer
Liste des listes transposées
transpose,flip matrix,matrix,swap,rows,columns

DSCore.List.Clean(System.Collections.IList,System.Boolean)
Nettoie les données des listes vides et valeurs nulles d'une liste donnée de cotes arbitraires
list: Liste contenant les sous-listes nulles et vides à nettoyer
preserveIndices: Fournit une option permettant de conserver les index de données dans la
listes des listes transposées
pour éviter que les valeurs NULL qui ne sont pas des valeurs de fin ne soient éliminées par filtrage
Returns: Une liste nettoyée des listes vides et valeurs nulles

DSCore.List.OfRepeatedItem(System.Object,System.Int32)
Crée une liste contenant l'élément indiqué, le nombre de fois indiqué.
item: Elément à répéter.
amount: Nombre de répétitions.
Liste des éléments répétés.
repeat,repeated,duplicate,list of item,fill list,copies,listcontains

DSCore.List.Cycle(System.Collections.IList,System.Int32)
Crée une liste en concaténant des copies d'une liste donnée.
list: Liste à répéter.
amount: Nombre de répétitions.
Liste des listes répétées de type: var[]..[]
repeat,repeated,duplicate,repeated list,concat list

DSCore.List.LastItem(System.Collections.IList)
Récupère le dernier élément d'une liste.
list: Obtenir le dernier élément de cette liste
Dernier élément de la liste
get,fetch,last,item,end of list

DSCore.List.Shuffle(System.Collections.IList)
Rend l'ordre des éléments de la liste aléatoire.
list: Liste à classer de manière aléatoire.
Liste classée de manière aléatoire.
random,randomize,shuffle,jitter,randomness

DSCore.List.Shuffle(System.Collections.IList,System.Int32)
Classe les éléments d'une liste de manière aléatoire en fonction d'une valeur de départ initiale.
list: Liste à classer de manière aléatoire.
seed: Valeur de départ pour le générateur de nombres aléatoires.
Liste classée de manière aléatoire.
random,randomize,shuffle,jitter,randomness,seed

DSCore.List.Permutations(System.Collections.IList,System.Nullable{System.Int32})
Crée toutes les permutations de la longueur indiquée d'une liste indiquée.
list: Liste à permuter.
length: Longueur de chaque permutation.
Permutations de la liste de la longueur indiquée (type: var[]..[])
permutation,permutations

DSCore.List.Combinations(System.Collections.IList,System.Int32,System.Boolean)
Crée toutes les combinaisons de la longueur indiquée d'une liste indiquée.
list: Générer des combinaisons de cette liste
length: Longueur de chaque combinaison
replace: Si des éléments sont supprimés une fois sélectionnés pour la combinaison
(valeur par défaut: faux).
Combinaisons de la liste de la longueur indiquée
combo

DSCore.List.FirstIndexOf(System.Collections.IList,System.Object)
Renvoie l'index de base 0 de la première occurrence d'un élément donné
dans la liste. Si l'élément est introuvable dans la liste, la valeur -1
est renvoyée.
list: Liste dans laquelle effectuer la recherche. Si cet argument est nul, la valeur -1 est renvoyée.
item: Elément à rechercher.
Returns: Index de base 0 de l'élément dans la liste ou valeur -1 si l'élément est introuvable.

DSCore.List.AllIndicesOf(System.Collections.IList,System.Object)
Renvoie les index de base 0 de toutes les occurrences d'un élément donné
dans la liste. Si l'élément est introuvable, une liste vide est renvoyée.
list: Liste dans laquelle effectuer la recherche. Si cet argument est nul, une liste vide est renvoyée.
item: Elément à rechercher.
Une liste d'index de base 0 de toutes les occurrences de l'élément
trouvé ou une liste vide si l'élément n'existe pas dans la liste.

DSCore.List.Flatten(System.Collections.IList,System.Int32)
Aplanit une liste imbriquée de listes en fonction d'une quantité spécifique.
list: Liste à aplanir.
amount: Couches d'imbrication de liste à supprimer (-1 pour supprimer toutes les imbrications de liste)
Liste aplanie selon la quantité
flatten,completely

DSCore.List.IndexInList(System.Collections.IList,System.Object)
Une alternative à l'utilisation de IList.Contains qui utilise Enumerable.SequenceEqual pour vérifier si
l'élément est contenu dans la liste si l'élément est un réseau. Renvoie l'index s'il est trouvé,
-1 s'il est introuvable.
list: Liste dans laquelle vérifier la présence de l'élément.
item: Elément devant être présent.
Index de l'élément dans la liste.

DSCore.List.GetDepth(System.Object)
Obtenez la profondeur maximale d'une liste indiquée.
list: Liste d'entrée depuis laquelle obtenir la profondeur.
Profondeur de la liste indiquée.

DSCore.List.CountBool(System.Collections.IList,System.Boolean)
Renvoie le nombre des valeurs booléennes spécifiées dans la liste indiquée.
list: La liste recherche les valeurs booléennes.
value: Valeur booléenne à rechercher
Nombre de la valeur booléenne spécifiée dans la liste.

DSCore.List.IncreaseDepth(System.Collections.IList,System.Int32)
Augmentez la profondeur d'une liste en fonction d'une valeur spécifique. La profondeur est augmentée
en créant une nouvelle liste contenant la liste indiquée.
list: Liste dont la profondeur doit être augmentée.
amt: Valeur d'augmentation de la profondeur.
Nouvelle liste dont la profondeur est augmentée par la valeur.

DSCore.List.DoubleConverter(System.Object)
Convertit un nombre entier en double, sinon, renvoie l'objet d'entrée.