DSCore.CurveMapper.PowerCurve
Représente une courbe de fonction de puissance dans le CurveMapper.
La courbe est définie par une équation de puissance dérivée d'un point de contrôle.

DSCore.CurveMapper.PowerCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Renvoie les valeurs X et Y réparties sur toute la courbe.