DSCore.ColorRange1D.ByColorsAndParameters(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double})
Créer un ColorRange1D en indiquant les listes des couleurs et des paramètres.
colors: Une liste de couleurs.
parameters: Une liste de paramètres entre 0.0 et 1.0.
Returns: Un objet ColorRange1D.

DSCore.ColorRange1D.GetColorAtParameter(DSCore.ColorRange1D,System.Double)
Renvoie la couleur dans cet intervalle de couleurs selon le paramètre spécifié.
parameter: Une valeur comprise entre 0.0 et 1.0.
Returns: Une couleur.

DSCore.ColorRange1D.Default
Créer un ColorRange1D avec le choix des couleurs par défaut.