DSCore.String
Méthodes de gestion des chaînes.

DSCore.String.ToNumber(System.String)
Convertit une chaîne en nombre entier ou double.
string: Chaîne à convertir
Nombre entier ou valeur double
2number,str2number,strtonumber,string2number,stringtonumber,int,double,cast

DSCore.String.GetNumber(System.String)
Obtenir toutes les chaînes numériques de la chaîne cible sous forme de chaîne
string: Chaîne cible à obtenir
Nombre dans la chaîne
getnumber,tonumber,strtonumber,numberinstring,string2number,stringtonumber,int,double,cast

DSCore.String.Concat(System.String[])
Concatène plusieurs chaînes en une seule chaîne.
strings: Liste de chaînes à concaténer.
Chaîne constituée d'une liste de chaînes.
concatenate,join,combine strings

DSCore.String.Length(System.String)
Renvoie le nombre de caractères contenu dans la chaîne indiquée.
string: Obtenir la longueur de cette chaîne
Nombre de caractères dans la chaîne
count,size,characters,chars,length,sizeof

DSCore.String.Split(System.String,System.String[])
Divise une chaîne unique en une liste de chaînes, les chaînes
de séparation indiquées déterminant les divisions.
string: Chaîne à diviser
separators: Ces chaînes, si elles sont présentes, déterminent le début et la fin d'une division.
Liste des chaînes créées à partir de la chaîne spécifiée
divide,separator,delimiter,cut,csv,comma,

DSCore.String.Join(System.String,System.String[])
Concatène plusieurs chaînes en une seule chaîne et insère le
séparateur indiqué entre chaque chaîne jointe.
separator: Chaîne à insérer entre les chaînes jointes.
strings: Chaînes à joindre dans une chaîne unique.
Chaîne créée à partir de la liste de chaînes, y compris le caractère de séparation.
join,separator,build csv,concat,construct

DSCore.String.ToUpper(System.String)
Met tous les caractères de la chaîne indiquée en majuscules.
string: Chaîne à mettre en majuscules
Chaîne en majuscules
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.ToLower(System.String)
Met tous les caractères de la chaîne indiquée en minuscules.
string: Chaîne à mettre en minuscules
Chaîne en minuscules
2lowercase,to lowercase,tolowercase,lowercase

DSCore.String.ToTitle(System.String)
Convertit la casse de la chaîne indiquée en casse de titre.
str: Chaîne à convertir en casse de titre
Chaîne en casse de titre
2titlecase,to titlecase,to title case,totitlecase,titlecase

DSCore.String.ChangeCase(System.String,System.Boolean)
Convertit la chaîne indiquée en majuscules ou en
minuscules en fonction d'un paramètre booléen.
string: Chaîne à convertir en majuscules ou minuscules.
upper: True pour convertir en majuscules, False pour convertir en minuscules.
Chaîne dont la casse a été modifiée.
2lowercase,to lowercase,tolowercase,lowercase,
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.Substring(System.String,System.Int32,System.Int32)
Obtient une sous-chaîne de la chaîne indiquée. La sous-chaîne commence à la
position de caractère indiquée et possède la longueur indiquée.
string: Obtenir une sous-chaîne de cette chaîne
startIndex: Position du premier caractère de la sous-chaîne dans la chaîne d'origine
length: Nombre de caractères dans la sous-chaîne
Sous-chaîne créée à partir de la chaîne d'origine
subset,get string,part,smaller string

DSCore.String.Contains(System.String,System.String,System.Boolean)
Détermine si la chaîne indiquée contient la sous-chaîne indiquée.
string: Chaîne dans laquelle effectuer la recherche
searchFor: Sous-chaîne à rechercher
ignoreCase: Indique si la comparaison prend en compte la casse
Indique si la chaîne contient la sous-chaîne
test,within,in,is in,part of

DSCore.String.CountOccurrences(System.String,System.String,System.Boolean)
Calcule le nombre d'occurrences ne se chevauchant pas d'une sous-chaîne à l'intérieur d'une chaîne donnée.
string: Chaîne dans laquelle effectuer la recherche
searchFor: Sous-chaîne à rechercher
ignoreCase: Indique si la comparaison prend en compte la casse
Nombre d'occurrences ne se chevauchant pas de la sous-chaîne dans la chaîne
count,substring,count occurrences,numberof,search,find,within

DSCore.String.Replace(System.String,System.String,System.String)
Remplace toutes les occurrences de texte dans une chaîne par un autre texte.
string: Chaîne dans laquelle remplacer les sous-chaînes.
searchFor: Texte à remplacer.
replaceWith: Texte de remplacement.
Chaîne avec les remplacements effectués.
replace,overwrite,override,find and replace

DSCore.String.EndsWith(System.String,System.String,System.Boolean)
Détermine si la chaîne indiquée se termine par la sous-chaîne indiquée.
string: Rechercher la fin de cette chaîne
searchFor: Recherche la fin pour cette sous-chaîne
ignoreCase: True pour ignorer la casse dans la comparaison, False pour la prendre en compte
True si la chaîne commence par la sous-chaîne, False sinon
test,does end,last,str end,terminated

DSCore.String.StartsWith(System.String,System.String,System.Boolean)
Détermine si la chaîne indiquée commence par la sous-chaîne indiquée.
string: Rechercher le début de cette chaîne
searchFor: Rechercher le début pour cette sous-chaîne.
ignoreCase: True pour ignorer la casse dans la comparaison, False pour la prendre en compte
True si la chaîne commence par la sous-chaîne, False sinon
test,beginswith,start,string start,front

DSCore.String.TrimWhitespace(System.String)
Supprime tous les espaces entre le début et la fin de la chaîne indiquée.
string: Chaîne à ajuster.
Chaîne dans laquelle les espaces de début et de fin ont été supprimés.
trimstring,cleanstring,whitespace,blanks,spaces,string trim

DSCore.String.TrimLeadingWhitespace(System.String)
Supprime tous les espaces du début de la chaîne.
string: Chaîne à ajuster.
Chaîne dans laquelle les espaces de début ont été supprimés.
trim string,clean string,trim leading whitespaces,string trim

DSCore.String.TrimTrailingWhitespace(System.String)
Supprime tous les espaces de la fin de la chaîne indiquée.
string: Chaîne à ajuster.
Chaîne dans laquelle les espaces de fin ont été supprimés.
trim string,clean string,trim trailing whitespaces,string trim

DSCore.String.IndexOf(System.String,System.String,System.Boolean)
Recherche l'index de base 0 de la première occurrence d'une sous-chaîne dans une chaîne.
Renvoie -1 si aucun index n'a été trouvé.
string: Chaîne dans laquelle effectuer la recherche
searchFor: Sous-chaîne à rechercher
ignoreCase: Indique si la comparaison prend en compte la casse
Index de la première occurrence de la sous-chaîne ou -1 si elle est introuvable
index of,find substring,where,search

DSCore.String.AllIndicesOf(System.String,System.String,System.Boolean)
Recherche la liste des index où la sous-chaîne apparaît dans une chaîne.
string: Chaîne dans laquelle effectuer la recherche.
searchFor: Sous-chaîne à rechercher.
ignoreCase: Indique si la comparaison prend en compte la casse.
Liste des index pour lesquels la sous-chaîne est trouvée (type: int[])
all indices of,find substring,where,search

DSCore.String.LastIndexOf(System.String,System.String,System.Boolean)
Recherche l'index de base 0 de la dernière occurrence d'une sous-chaîne dans une chaîne.
Renvoie -1 si aucun index n'a été trouvé.
string: Chaîne dans laquelle effectuer la recherche.
searchFor: Sous-chaîne à rechercher.
ignoreCase: Si la comparaison prend en compte la casse.
Index de la dernière occurrence de la sous-chaîne ou -1 si introuvable.
last index of,find substring,where,search

DSCore.String.PadLeft(System.String,System.Int32,System.String)
Aligne à droite les caractères dans la chaîne indiquée en les faisant précéder par des espaces,
pour une longueur totale indiquée.
string: Chaîne à laquelle ajouter des caractères
newLength: Longueur totale de la chaîne après l'ajout des caractères
padChars: Caractère à ajouter, l'espace est utilisé par défaut
Chaînes alignées à droite par ajout d'espaces de début sur la longueur totale indiquée.
pad left,right align,right-align,pad,string space,whitespace

DSCore.String.PadRight(System.String,System.Int32,System.String)
Aligne à gauche les caractères dans la chaîne indiquée en les faisant suivre par des espaces,
pour une longueur totale indiquée.
string: Chaîne à laquelle ajouter des caractères
newLength: Longueur totale de la chaîne après l'ajout des caractères
padChars: Caractère à ajouter, l'espace est utilisé par défaut
Chaînes alignées à gauche par ajout d'espaces de fin sur la longueur totale indiquée
pad right,left align,left-align,pad string space,whitespace

DSCore.String.Center(System.String,System.Int32,System.String)
Augmente la longueur d'une chaîne en plaçant des espaces de chaque côté des caractères d'origine.
string: Chaîne à centrer
newLength: Longueur totale de la chaîne après centrage
padChars: Caractère à ajouter pour le centrage, l'espace est utilisé par défaut
Chaînes centrées par ajout d'espaces de début et de fin
sur la longueur totale indiquée.
center align,center-align,centered,whitespace,expand string,surround

DSCore.String.Insert(System.String,System.Int32,System.String)
Insère une chaîne dans une autre chaîne à un index donné.
string: Chaîne dans laquelle effectuer l'insertion.
index: Index au niveau duquel insérer.
toInsert: Chaîne à insérer.
Chaîne avec la sous-chaîne insérée.
insertstring,insert string

DSCore.String.Remove(System.String,System.Int32,System.Nullable{System.Int32})
Supprime des caractères d'une chaîne.
string: Chaîne de laquelle supprimer des caractères.
startIndex: Index de début de la suppression.
count: Quantité de caractères à supprimer
Remarque: si le nombre est négatif, le processus de suppression est exécuté de droite à gauche.
Chaîne après suppression des caractères.
delete,rem,shorten