DSCore.ObjectComparer
Applique la fonction de comparaison à deux objets à l'aide de la règle ci-dessous.
1. Les nombres sont supposés être plus petits, booléens, une chaîne et des pointeurs.
2. Si les deux objets sont IComparable et du même type, alors utiliser
le mécanisme de comparaison d'origine.
3. Si les deux entrées sont un type de valeur, mais l'une d'elles est un booléen, le booléen est supérieur
4. Sinon, les convertir en double et comparer.
5. Sinon, si seule l'une d'elles est un type de valeur, l'objet de type de valeur est plus petit
6. Sinon, si seule l'une d'elles est une chaîne, alors la chaîne est plus petite que l'autre
7. Sinon, si vous ne savez pas comment les comparer, il est conseillé de les comparer en fonction de HashCode.