DSCore.Quadtree.ByUVs(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.UV})
Construire un arbre quadratique englobant le domaine (0,0)->(1,1).
uvs: Un jeu d'UV dans le domaine (0,0)->(1,1).
Returns: Un objet d'arbre quadratique.

DSCore.Quadtree.FindPointsWithinRadius(Autodesk.DesignScript.Geometry.UV,System.Double)
Rechercher tous les points de l'arbre quadratique (UV) dans l'arbre quadratique dans un rayon de l'emplacement d'UV spécifié.
center: L'UV au centre de la zone de recherche.
radius: Le rayon de la zone de recherche.
Returns: Une liste d'UV.