DSCore.Data.MaxDepthJsonTextWriter
Sous-classe de JsonTextWriter qui limite une profondeur d'objet maximale prise en charge pour éviter les blocages de références circulaires lors de la sérialisation de types d'objets .NET arbitraires.