DSCore.Properties.Resources
Une classe de ressource fortement typée, pour la recherche de chaînes localisées, etc.

DSCore.Properties.Resources.ResourceManager
Renvoie l'instance ResourceManager mise en cache utilisée par cette classe.

DSCore.Properties.Resources.Culture
Remplace la propriété CurrentUICulture du thread actuel pour toutes
les recherches de ressources qui utilisent cette classe de ressource fortement typée.

DSCore.Properties.Resources.BitmapOverflowError
Recherche une chaîne localisée similaire à Les données de couleur fournies sont trop grandes pour tenir dans les limites de l'image.

DSCore.Properties.Resources.CurveMapperEqualMinMaxWarning
Recherche une chaîne localisée similaire à • Les valeurs Min et Max doivent être différentes.

DSCore.Properties.Resources.CurveMapperInvalidCountWarning
Recherche une chaîne localisée similaire à • Les valeurs doivent être indiquées sous forme de liste de nombres ou en un seul nombre ≥ 2.

DSCore.Properties.Resources.CurveMapperInvalidCurveWarning
Recherche une chaîne localisée semblable à • Les points de contrôle de la courbe sélectionnée ne sont pas valides.

DSCore.Properties.Resources.CurveMapperInvalidXYFormatWarning
Recherche une chaîne localisée similaire à • Les entrées X et Y doivent être des nombres uniques (et non des listes).

DSCore.Properties.Resources.DefineDataSupportedInputValueExceptionMessage
Recherche une chaîne localisée similaire à "L'entrée doit être une valeur unique ou une liste non imbriquée.".

DSCore.Properties.Resources.DefineDataUnexpectedInputExceptionMessage
Recherche une chaîne localisée similaire à "Ce noeud attendait une entrée {0} mais a reçu une entrée {1}. Veuillez fournir l'entrée attendue ou choisir un nouveau type dans le menu déroulant du noeud.".

DSCore.Properties.Resources.DefineDataUnsupportedCombinationOfDataTypesExceptionMessage
Recherche une chaîne localisée similaire à "Ce noeud ne prend pas en charge la combinaison de types de données dans la liste d'entrée actuelle {0}. Vérifiez que la liste d'entrée contient des éléments du même type de données ou une combinaison de types avec un type parent commun.".

DSCore.Properties.Resources.DefineDataUnsupportedDataTypeExceptionMessage
Recherche une chaîne localisée similaire à "Ce noeud ne prend pas en charge le type de données d'entrée actuel ({0}). Affichez les types de données pris en charge dans le menu déroulant.".

DSCore.Properties.Resources.EnumDateOfWeekFriday
Recherche une chaîne localisée similaire à Vendredi.

DSCore.Properties.Resources.EnumDateOfWeekMonday
Recherche une chaîne localisée similaire à Lundi.

DSCore.Properties.Resources.EnumDateOfWeekSaturday
Recherche une chaîne localisée similaire à Samedi.

DSCore.Properties.Resources.EnumDateOfWeekSunday
Recherche une chaîne localisée similaire à Dimanche.

DSCore.Properties.Resources.EnumDateOfWeekThursday
Recherche une chaîne localisée similaire à Jeudi.

DSCore.Properties.Resources.EnumDateOfWeekTuesday
Recherche une chaîne localisée similaire à Mardi.

DSCore.Properties.Resources.EnumDateOfWeekWednesday
Recherche une chaîne localisée similaire à Mercredi.

DSCore.Properties.Resources.Exception_Deserialize_Bad_Format
Recherche une chaîne localisée similaire à Le fichier JSON pour le type {0} n'a pas été formaté correctement.

DSCore.Properties.Resources.Exception_Deserialize_Unsupported_Cache
Recherche une chaîne localisée similaire à Les données stockées ne peuvent pas être chargées.

DSCore.Properties.Resources.Exception_Serialize_Depth_Unsupported
Recherche une chaîne localisée similaire à Profondeur {0} Dépasse la profondeur maximale {1} au niveau du chemin d'accès "{2}".

DSCore.Properties.Resources.Exception_Serialize_DesignScript_Unsupported
Recherche une chaîne localisée similaire à Ce type de géométrie ne peut pas être sérialisé.

DSCore.Properties.Resources.Exception_Serialize_Unsupported_Type
Recherche une chaîne localisée similaire à Impossible de stocker les données de type {0}.

DSCore.Properties.Resources.ExportToCSVObsolete
Recherche une chaîne localisée similaire à Utiliser le noeud Data.ExportCSV à la place.

DSCore.Properties.Resources.FactorialNegativeInt
Recherche une chaîne localisée similaire à La valeur d'entrée de Math.Factorial ne peut pas être négative..

DSCore.Properties.Resources.FactorialOverflow
Recherche une chaîne localisée similaire à La valeur renvoyée de Math.Factorial est hors intervalle..

DSCore.Properties.Resources.FindPointsWithinRadiusNullPointMessage
Recherche une chaîne localisée similaire à Vous devez indiquer un point central..

DSCore.Properties.Resources.FindPointsWithinRadiusSearchRadiusMessage
Recherche une chaîne localisée similaire à Le rayon de recherche ne peut pas être égal à zéro..

DSCore.Properties.Resources.FromObjectObsolete
Recherche une chaîne localisée similaire à Ce noeud est obsolète, utilisez "String from Object".

DSCore.Properties.Resources.IntegerOverflow
Recherche une chaîne localisée semblable à L'opération a entraîné un dépassement de l'entier. Son résultat peut être inattendu.

DSCore.Properties.Resources.InvalidDestinationPathErrorMessage
Recherche une chaîne localisée semblable au chemin d'accès au fichier de destination incorrect utilisé comme chemin de copie.

DSCore.Properties.Resources.InvalidKeysErrorMessage
Recherche une chaîne localisée similaire à Un ou plusieurs types d'entrées ne correspondent pas. Les listes sous forme de clés ne sont pas prises en charge.

DSCore.Properties.Resources.InvalidKeysLenghtErrorMessage
Recherche une chaîne localisée semblable à la suivante: Le nombre d'éléments ne correspond pas au nombre de clés. href=InvalidKeysLenghtErrorMessage.html.

DSCore.Properties.Resources.LoadImageFromPathObsolete
Recherche une chaîne localisée similaire à Utiliser les noeuds File.FromPath -> Image.ReadFromFile à la place.

DSCore.Properties.Resources.MissingPythonEngine
Recherche une chaîne localisée semblable à la suivante: Le moteur Python sélectionné est introuvable.

DSCore.Properties.Resources.ObjectArgumentExceptionMessage
Recherche une chaîne localisée similaire à L'objet ne peut pas être nul, entrez une valeur appropriée..

DSCore.Properties.Resources.QuadtreeConstructionEmptyUVSetMessage
Recherche une chaîne localisée similaire à Vous ne pouvez pas créer un arbre quadratique à partir d'un jeu de points vide..

DSCore.Properties.Resources.QuadtreeConstructionNullUVSetMessage
Recherche une chaîne localisée similaire à Un arbre quadratique ne peut pas être créé à partir d'un jeu d'UV nul..

DSCore.Properties.Resources.ReadImageObsolete
Recherche une chaîne localisée similaire à Utiliser les noeuds File.FromPath ->  Image.ReadFromFile ->  Image.Pixels à la place.

DSCore.Properties.Resources.ReadTextObsolete
Recherche une chaîne localisée similaire à Utilisez les noeuds File.FromPath -> File.ReadText à la place..

DSCore.Properties.Resources.StringRemoveCountOutOfRangeMessage
Recherche une chaîne localisée similaire à Le nombre est hors intervalle..

DSCore.Properties.Resources.StringRemoveStartIndexOutOfRangeMessage
Recherche une chaîne localisée similaire à StartIndex est hors intervalle..

DSCore.Properties.Resources.StringToNumberInvalidNumberMessage
Recherche une chaîne localisée similaire à Nombre incorrect..

DSCore.Properties.Resources.WebRequestNullUrlMessage
Recherche une chaîne localisée similaire à L'URL ne peut pas être nulle..

DSCore.Properties.Resources.WriteImageObsolete
Recherche une chaîne localisée similaire à Utiliser le noeud Image.WriteToFile à la place.