DSCore.Compare
Méthodes de comparaison.

DSCore.Compare.GreaterThan(System.Object,System.Object)
Renvoie la valeur True si A est supérieur à B.
a: Un objet comparable.
b: Un objet comparable.
Résultat booléen.
larger,bigger

DSCore.Compare.GreaterThanOrEqual(System.Object,System.Object)
Renvoie la valeur True si A est supérieur ou égal à B.
a: Un objet comparable.
b: Un objet comparable.
Résultat booléen.
larger,bigger,equal

DSCore.Compare.LessThan(System.Object,System.Object)
Renvoie la valeur True si A est inférieur à B.
a: Un objet comparable.
b: Un objet comparable.
Résultat booléen.
less,smaller

DSCore.Compare.LessThanOrEqual(System.Object,System.Object)
Renvoie la valeur True si A est inférieur ou égal à B.
a: Un objet comparable.
b: Un objet comparable.
Résultat booléen.
smaller,equal