DSCore.CurveMapper.LinearCurve
Représente une courbe linéaire dans le CurveMapper.
Une courbe linéaire est une ligne droite entre deux points de contrôle.

DSCore.CurveMapper.LinearCurve.LineEquation(System.Double)
Calcule les valeurs Y (coordonnées de la zone de dessin) pour les valeurs X minimales et maximales

DSCore.CurveMapper.LinearCurve.SolveForXGivenY(System.Double)
Calcule les valeurs X (coordonnées de la zone de dessin) pour les valeurs Y minimales et maximales

DSCore.CurveMapper.LinearCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Renvoie les valeurs X et Y réparties sur toute la courbe.