DSCore.Sorting
Méthodes d'utilitaire pour le tri par clés. Elles ne doivent pas se convertir en noeuds. Au lieu de cela,
elles seront encapsulées par des mises en oeuvre DS qui acceptent une fonction de mappage de clés.