DSCore.DateTime
Objet représentant une date et une heure spécifiques.

DSCore.DateTime.MinValue
Les date et heure les plus proches qui peuvent être représentées.
Représentation minimale possible de DateTime

DSCore.DateTime.MaxValue
Les date et heure les plus éloignées qui peuvent être représentées.
Représentation maximale possible de DateTime

DSCore.DateTime.Now
Date et heure actuelles du système.
DateTime représentant l'heure et la date actuelles

DSCore.DateTime.Today
Date actuelle du système (heure définie sur minuit).
DateTime représentant aujourd'hui

DSCore.DateTime.Format(System.DateTime,System.String)
Renvoyer une date et une heure spécifiées sous forme de chaîne, dans le format spécifié.
dateTime: DateTime dans un format
format: Représentation sous forme de chaîne du format de date. Utilise InvariantCulture, dont le résultat ne dépend pas de la langue du système d'exploitation de l'utilisateur.
Le format par défaut est le format "F" standard: "Mardi, 21 février 2017 23:02:43"
Recherchez "Chaînes de format de date et d'heure personnalisées MSDN" pour obtenir une liste complète des spécificateurs de format.
DateTime représentée sous forme de chaîne

DSCore.DateTime.ByDate(System.Int32,System.Int32,System.Int32)
Crée une DateTime à une date exacte.
year: Année exacte (1-9999)
month: Mois exact (1-12)
day: Jour exact (1-[jours dans le mois])
DateTime créée à partir de la date

DSCore.DateTime.ByDateAndTime(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
Crée une DateTime à une date et une heure exactes.
year: Année exacte (1-9999)
month: Mois exact (1-12)
day: Jour exact (1-[jours dans le mois])
hour: Heure exacte (0-23)
minute: Minute exacte (0-59)
second: Seconde exacte (0-59)
millisecond: Milliseconde exacte (0-999)
DateTime créée à partir de la date et de l'heure

DSCore.DateTime.SubtractTimeSpan(System.DateTime,System.TimeSpan)
Soustrait un TimeSpan d'une DateTime, ce qui donne une nouvelle DateTime.
dateTime: DateTime de départ
timeSpan: Durée à soustraire
DateTime obtenue avec la soustraction

DSCore.DateTime.AddTimeSpan(System.DateTime,System.TimeSpan)
Ajoute un TimeSpan à une DateTime, ce qui donne une nouvelle DateTime.
dateTime: DateTime de départ
timeSpan: Durée à ajouter à DateTime
DateTime obtenue avec l'ajout de la TimeSpan

DSCore.DateTime.DaysInMonth(System.Int32,System.Int32)
Calcule le nombre de jours dans le mois donné de l'année donnée.
year: Année exacte (1-9999)
month: Mois exact (1-12)
Nombre de jours dans le mois

DSCore.DateTime.IsDaylightSavingsTime(System.DateTime)
Détermine s'il s'agit de l'heure d'été à la DateTime indiquée.
dateTime: DateTime utilisée pour déterminer s'il s'agit de l'heure d'été
True si DateTime correspond à l'heure d'été, False sinon

DSCore.DateTime.IsLeapYear(System.Int32)
Détermine si l'année indiquée est une année bissextile.
year: Année exacte (1-9999)
True s'il s'agit d'une année bissextile, False sinon

DSCore.DateTime.FromString(System.String)
Tentative d'analyse d'une DateTime à partir d'une chaîne
string: Représentation d'une DateTime sous forme de chaîne
DateTime obtenue à partir de la chaîne analysée

DSCore.DateTime.Date(System.DateTime)
Obtient uniquement la date d'une DateTime. Les composants de temps sont définis sur 0.
dateTime: DateTime.
date de DateTime
Date

DSCore.DateTime.Components(System.DateTime)
Obtient les composants individuels d'une DateTime.
dateTime: DateTime à partir de laquelle obtenir des composants
Représentation numérique de l'année (1-9999)
Représentation numérique du mois (1-12)
Représentation numérique du jour (1-[jours dans le mois])
Représentation numérique de l'heure (0-23)
Représentation numérique des minutes (0-59)
Représentation numérique des secondes (0-59)
Représentation numérique des millisecondes (0-999)

DSCore.DateTime.DayOfWeek(System.DateTime)
Renvoie le jour de la semaine à partir d'une DateTime donnée.
dateTime: Objet DateTime à partir duquel obtenir le jour de la semaine
Jour de la semaine

DSCore.DateTime.DayOfYear(System.DateTime)
Renvoie le jour de l'année (0-366)
dateTime: DateTime à partir de laquelle obtenir le jour de l'année
Nombre de jours depuis le début de l'année

DSCore.DateTime.TimeOfDay(System.DateTime)
Génère un TimeSpan représentant le temps écoulé depuis minuit de la
DateTime indiquée.
dateTime: DateTime.
TimeSpan depuis minuit