DSCore.CurveMapper.SquareRootCurve
Représente une courbe de racine carrée dans le CurveMapper.
La courbe suit une fonction de racine carrée et est influencée par deux points de contrôle.

DSCore.CurveMapper.SquareRootCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Renvoie les valeurs X et Y réparties sur toute la courbe.