DSCore.CurveMapper.CurveBase
Représente une classe de base pour tous les types de courbes dans le CurveMapper.
Fournit des fonctionnalités communes pour la génération et la récupération des valeurs de courbe.

DSCore.CurveMapper.CurveBase.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Méthode abstraite à implémenter par les classes dérivées pour la génération des valeurs de courbe.

DSCore.CurveMapper.CurveBase.GetCurveXValues(System.Collections.Generic.List{System.Double},System.Boolean)
Méthode courante pour la récupération des valeurs X.

DSCore.CurveMapper.CurveBase.GetCurveYValues(System.Collections.Generic.List{System.Double},System.Boolean)
Méthode courante pour la récupération des valeurs Y.

DSCore.CurveMapper.CurveBase.GenerateFromDomain(System.Collections.Generic.List{System.Double},System.Func{System.Double,System.Double})
Génère des valeurs X et Y en mappant les entrées de domaine à l'espace de la zone de dessin et en évaluant une fonction de courbe.