DSCore.Data.ParseJSON(System.String)
L'analyse convertit une chaîne JSON arbitraire en valeur. C'est l'opposé de JSON.Stringify.
json: Chaîne JSON
Le type de résultat dépend du contenu de la chaîne d'entrée. Le type de résultat peut être une valeur primitive (par exemple, chaîne, valeur booléenne, double), une liste ou un dictionnaire.

DSCore.Data.ToNative(Newtonsoft.Json.Linq.JToken)
Implémentation d'analyse pour convertir les types JToken en objets .NET natifs.
token: JToken à analyser sur N

DSCore.Data.DynamoJObjectToNative(Newtonsoft.Json.Linq.JObject)
Implémentation d'analyse pour convertir les types JObject en objets Dynamo spécifiques (géométrie, couleur, images, etc.)
Throws System.Exception:

DSCore.Data.StringifyJSON(System.Object)
La fonction Stringify permet de convertir une valeur arbitraire ou une liste de valeurs arbitraires au format JSON. La réplication peut être utilisée pour appliquer l'opération sur une liste, générant ainsi une liste de chaînes JSON.
values: Liste de valeurs
Une chaîne JSON où les types primitifs (par exemple, double, entier, valeur booléenne), les listes et les dictionnaires sont convertis en valeurs JSON du type correspondant.

DSCore.Data.CanObjectBeCached(System.Object)
Fonction d'assistance permettant de déterminer si l'objet peut être mis en cache ou s'il s'agit de la valeur null, d'une chaîne "null" ou d'une liste vide.
inputObject: Objet à vérifier

DSCore.Data.Remember(System.Object,System.String)
Fonction permettant de gérer la mise en cache pour le noeud Data.Remember
inputObject: Objet à mettre en cache
cachedJson: Fichier JSON de cache existant facultatif

DSCore.Data.DataNodeDynamoTypeList
Liste statique de tous les types de données pris en charge par Dynamo
Returns: Liste contenant les types de données pris en charge

DSCore.Data.#cctor
Constructeur statique

DSCore.Data.SafeExtractDictionaryValue(System.Collections.Generic.Dictionary{System.String,System.Object},System.String)
Fonction d'assistance permettant d'extraire une valeur de dictionnaire en toute sécurité
dict: Dictionnaire à partir duquel extraire la valeur
key: Clé de la paire clé/valeur

DSCore.Data.EvaluateDefineDataNode(System.Object,System.String,System.Boolean,System.Boolean,System.String)
Fonction utilisée par AST pour évaluer le noeud Define Data.
Gère une partie de la logique du noeud lors de la validation
inputValue: Valeur d'entrée en amont
typeString: Type sous forme de chaîne (à faire : il est préférable de transmettre un objet de type 'Type' pour une comparaison directe des types)
isList: Si l'entrée est de type `ArrayList`
isAutoMode: Si le noeud est en mode Auto
playerValue: Valeur injectée dans le noeud par le Lecteur Dynamo, le cas échéant.

DSCore.Data.FindCommonAncestor(System.Collections.ArrayList)
Fonction permettant de trouver le type au cas où une ArrayList d'objets était passé en mode Auto
list: Valeur d'entrée attendue de type ArrayList

DSCore.Data.LikelyAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
Fonction d'assistant renvoyant le noeud de niveau inférieur à partir d'une liste de noeuds DataNodeDynamoType
nodes: Liste de noeuds DataNodeDynamoType à évaluer

DSCore.Data.FindClosestCommonAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
Fonction d'assistant permettant de déterminer un ancêtre commun dans une liste de types de données
nodes: Liste des noeuds DataType à évaluer

DSCore.Data.FindCommonAncestorBetweenTwoNodes(DSCore.Data.DataNodeDynamoType,DSCore.Data.DataNodeDynamoType)
Fonction récursive permettant de rechercher un ancêtre commun entre deux types Dynamo
Remonte l'arborescence hiérarchique de l'ancêtre probable jusqu'à ce que
node: Vérifier si ce noeud est dérivé de l'ancêtre probable
likelyAncestor: Ancêtre probable à partir duquel le noeud devrait dériver

DSCore.Data.GetListFromTypes(System.Collections.ArrayList)
Renvoyer une liste de DataNodeDynamoTypes à partir d'une ArrayList d'objets
list: ArrayList des objets à reformater

DSCore.Data.IsUnusedDefineDataInput(System.Object)
Vérifie si l'entrée de Define Data est inutilisée (valeur nulle ou liste vide).
inputValue: Valeur d'entrée du graphique.
Returns: True lorsque l'entrée doit être traitée comme non connectée ou inutilisée.

DSCore.Data.IsSingleValueOrSingleLevelArrayList(System.Object)
Vérifier si l'objet d'entrée est une valeur unique ou une ArrayList de niveau unique.
obj: Objet d'entrée à évaluer

DSCore.Data.IsSupportedDataNodeDynamoType(System.Object,System.Type,System.Boolean)
Fonction permettant de valider le type d'entrée par rapport aux types d'entrée Dynamo pris en charge
inputValue: Données entrantes à valider
type: Type d'entrée fourni par l'utilisateur. Doit correspondre au type inputValue
isList: Cette valeur booléenne détermine si l'entrée est un objet unique ou une liste

DSCore.Data.IsItemOfType(System.Object,System.Type)
Cette méthode vérifie si un élément fait partie d'un type de données Dynamo requis
'IsInstanceOfType' vérifie de manière récursive l'héritage vers le haut
item: Elément dont le type de données doit être vérifié
dataType: DataType à vérifier
Returns: Résultat True ou False basé sur la validation de la vérification

DSCore.Data.IsDerivedFrom(System.Type,System.Type)
Cette méthode vérifie si un type est dérivé d'un type de base
derivedType: Type à vérifier
baseType: Type de base à comparer