DSCore.Object
Fonctions génériques qui fonctionnent sur toutes les données.

DSCore.Object.IsNull(System.Object)
Détermine si l'objet indiqué est nul.
object: Objet à tester.
Si l'objet est nul.
is null

DSCore.Object.Identity(System.Object)
Indique ce qui a été transmis, sans effectuer d'action.
object: Objet.
Même objet

DSCore.Object.Type(System.Object)
Renvoie le type d'objet représenté sous forme de chaîne.
object: Obtenir le type de cet objet
Returns: Type d'objet.