DSCore.ColorRange.ByColorsAndParameters(System.Collections.Generic.IList{DSCore.Color},System.Collections.Generic.IList{Autodesk.DesignScript.Geometry.UV})
Créer un ColorRange en fournissant des listes de couleurs et d'UV.
colors: Une liste de couleurs.
parameters: Une liste de paramètres compris entre (0.0,0.0) et (1.0,1.0).
Returns: Un objet ColorRange.

DSCore.ColorRange.GetColorAtParameter(Autodesk.DesignScript.Geometry.UV)
Renvoie la couleur dans cet intervalle de couleurs selon le paramètre spécifié.
parameter: Un UV compris entre (0.0,0.0) et (1.0,1.0).
Returns: Une couleur.