DSCore.Thread
Fonctions de manipulation des threads d'évaluation.

DSCore.Thread.Pause(System.Object,System.Int32)
Interrompt le thread d'évaluation en cours pendant une durée donnée.
object: Objet à transmettre.
msTimeout: Durée de pause du thread, en millisecondes.
Objet transmis.