DSCore.Color.Red
Rechercher le composant rouge d'une couleur, de 0 à 255.
Valeur du rouge pour le modèle de couleur RVB, nombre entier compris entre 0 et 255 inclus.

DSCore.Color.Green
Rechercher le composant vert d'une couleur, de 0 à 255.
Valeur du vert pour le modèle de couleur RVB, nombre entier compris entre 0 et 255 inclus.

DSCore.Color.Blue
Rechercher le composant bleu d'une couleur, de 0 à 255.
Valeur du bleu pour le modèle de couleur RVB, nombre entier compris entre 0 et 255 inclus.

DSCore.Color.Alpha
Rechercher le composant alpha d'une couleur, de 0 à 255.
Valeur alpha, nombre entier compris entre 0 et 255 inclus.

DSCore.Color.ByARGB(System.Int32,System.Int32,System.Int32,System.Int32)
Créer une couleur au moyen de composants alpha, rouges, verts et bleus.
alpha: Valeur alpha (comprise entre 0 et 255 inclus)
red: Valeur du rouge pour le modèle de couleur RVB (comprise entre 0 et 255 inclus)
green: Valeur du vert pour le modèle de couleur RVB (comprise entre 0 et 255 inclus)
blue: Valeur du bleu pour le modèle de couleur RVB (comprise entre 0 et 255 inclus)
Couleur créée à partir d'ARGB
color

DSCore.Color.Brightness(DSCore.Color)
Renvoie la valeur de luminosité de cette couleur.
color: Obtenir la luminosité de cette couleur
Valeur de luminosité (comprise entre 0 et 1 inclus)

DSCore.Color.Saturation(DSCore.Color)
Renvoie la valeur de saturation de cette couleur.
Valeur de saturation, nombre double compris entre 0 et 1 inclus.

DSCore.Color.Hue(DSCore.Color)
Renvoie la valeur de teinte de cette couleur.
color: Objet de couleur
Valeur de teinte pour la couleur, nombre double compris entre 0 et 1 inclus.
hues

DSCore.Color.Components(DSCore.Color)
Répertorie les composants de la couleur dans l'ordre suivant: alpha, rouge, vert, bleu.
color: Objet de couleur
Valeur alpha, nombre entier compris entre 0 et 255 inclus.
Valeur du rouge pour le modèle de couleur RVB, nombre entier compris entre 0 et 255 inclus.
Valeur du vert pour le modèle de couleur RVB, nombre entier compris entre 0 et 255 inclus.
Valeur du bleu pour le modèle de couleur RVB, nombre entier compris entre 0 et 255 inclus.
alpha,red,green,blue

DSCore.Color.BuildColorFrom1DRange(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double},System.Double)
Renvoie une couleur à partir d'un dégradé de couleurs entre une couleur de départ et une couleur de fin.
parameters: Les valeurs comprises entre 0 et 1 le long de l'intervalle pour lequel vous souhaitez échantillonner la couleur.
Couleurs dans l'intervalle spécifié.
color,range,gradient

DSCore.Color.Lerp(DSCore.Color,DSCore.Color,System.Double)
Interpoler linéairement entre deux couleurs.
start: La couleur de départ.
end: La couleur de fin.
t: Un paramètre compris entre 0.0 et 1.0.
Returns: Couleur interpolée ou blanc.

DSCore.Color.Blerp(System.Collections.Generic.IList{DSCore.Color.IndexedColor2D},Autodesk.DesignScript.Geometry.UV)
Interpoler de façon bilinéaire dans un jeu de couleurs.
Returns: Couleur interpolée ou blanc.
This algorithm is not the same as the solution found from wikipedia
(reference: https://en.wikipedia.org/wiki/Bilinear_interpolation)

DSCore.Color.Add(DSCore.Color,DSCore.Color)
Créez une couleur en combinant les valeurs ARGB de deux couleurs existantes.
color: Couleur à ajouter
otherColor: Autre couleur à ajouter
Couleur obtenue après l'ajout des deux couleurs

DSCore.Color.Multiply(DSCore.Color,System.Double)
Multiplier une couleur d'entrée avec un multiplicateur afin d'obtenir une couleur plus sombre. La couleur d'entrée doit disposer d'un composant alpha inférieur à 255.
color: Couleur à multiplier
multiplier: Valeur du multiplicateur
Couleur obtenue avec la multiplication

DSCore.Color.Divide(DSCore.Color,System.Double)
Diviser une couleur d'entrée avec un diviseur afin d'obtenir une couleur plus claire et supprimer la teinte de la couleur
color: Couleur à diviser
dividend: Valeur de division
Couleur obtenue avec la division