DSCore.Math
Méthodes d'exécution des opérations mathématiques.

DSCore.Math.Random(System.Nullable{System.Int32})
Génère un double aléatoire compris dans l'intervalle [0, 1).
seed: Valeur de départ pour le générateur de nombres aléatoires.
Nombre aléatoire compris entre 0 et 1.
random,seed

DSCore.Math.Random(System.Double,System.Double)
Produire un nombre aléatoire compris dans l'intervalle [lower_number, higher_number).
value1: Partie inférieure de l'intervalle pour le nombre aléatoire.
value2: Partie supérieure de l'intervalle pour le nombre aléatoire.
Nombre aléatoire compris dans l'intervalle [lower_number, higher_number).
random,numberrange

DSCore.Math.Random(System.Double,System.Double,System.Int32)
Générez un nombre aléatoire compris dans l'intervalle [lower_number, higher_number) en fonction d'une valeur de départ initiale.
value1: Partie inférieure de l'intervalle pour le nombre aléatoire.
value2: Partie supérieure de l'intervalle pour le nombre aléatoire.
seed: Valeur de départ pour le générateur de nombres aléatoires.
Nombre aléatoire compris dans l'intervalle [lower_number, higher_number).
random,numberrange,seed

DSCore.Math.RandomList(System.Int32)
Génère une liste contenant la quantité indiquée de doubles aléatoires
dans l'intervalle [0, 1).
amount: Quantité de nombres aléatoires que doit contenir la liste obtenue.
Liste de nombres aléatoires compris entre 0 et 1.
random,listcontains

DSCore.Math.RandomList(System.Int32,System.Double,System.Double,System.Int32)
Produit une liste contenant la quantité donnée de doubles aléatoires
dans l'intervalle défini [lower_number, higher_number) en fonction d'une valeur de départ initiale.
amount: Quantité de nombres aléatoires que doit contenir la liste obtenue.
value1: Partie inférieure de l'intervalle pour le nombre aléatoire.
value2: Partie supérieure de l'intervalle pour le nombre aléatoire.
seed: Valeur de départ pour le générateur de nombres aléatoires.
Liste de nombres aléatoires compris dans l'intervalle [lower_number, higher_number).
random,listcontains,seed

DSCore.Math.PiTimes2
Constante Pi multipliée par 2
2 fois Pi.
2pi,2*pi,twopi,two*pi

DSCore.Math.Average(System.Collections.Generic.IList{System.Double})
Calcule la moyenne d'une liste de nombres.
numbers: Calculer la moyenne de cette liste de nombres.
Moyenne de la liste de nombres.
avg,mean

DSCore.Math.Map(System.Double,System.Double,System.Double)
Associe la valeur d'entrée à un nombre compris entre 0 et 1 en fonction de l'intervalle d'entrée.
rangeMin: Valeur minimale de l'intervalle d'entrée.
rangeMax: Valeur maximale de l'intervalle d'entrée.
inputValue: Nombre à affecter.
Valeur affectée.
map,range,minimum,maximum,normalize,scale,remap

DSCore.Math.MapTo(System.Double,System.Double,System.Double,System.Double,System.Double)
Associe la valeur d'entrée à un nombre compris entre targetRangeMin et targetRangeMax.
rangeMin: Valeur minimale de l'intervalle d'entrée.
rangeMax: Valeur maximale de l'intervalle d'entrée.
inputValue: Nombre à affecter.
targetRangeMin: Valeur minimale du nouvel intervalle.
targetRangeMax: Valeur maximale du nouvel intervalle.
Valeur affectée.
map,range,mapto,minimum,maximum,normalize,scale,remap

DSCore.Math.RemapRange(System.Collections.Generic.IList{System.Double},System.Double,System.Double)
Ajuste l'intervalle d'une liste de nombres, tout en conservant le
rapport de distribution.
numbers: Ajuster l'intervalle de nombres de cette liste.
newMin: Nouveau minimum de l'intervalle.
newMax: Nouveau maximum de l'intervalle
Liste remappée en fonction du nouvel intervalle.
remap range

DSCore.Math.kRadiansToDegrees
déplacer les fonctions/méthodes de Math.dll vers DSCoreNode.dll

DSCore.Math.PI
Constante mathématique Pi, 3,14159...
Constante pi
3.141592653589793

DSCore.Math.E
Constante mathématique e, 2,71828...
Constante e
exp,2.718281828459045

DSCore.Math.GoldenRatio
Nombre d'or (1 + racine carrée(5))/2 = 1,61803...
Nombre d'or
golden,ratio,divine,phi,tau,1.61803398875

DSCore.Math.RadiansToDegrees(System.Double)
Convertit un angle en radians en angle en degrés.
radians: Angle en radians.
Angle en degrés.
radians,degrees,angle

DSCore.Math.DegreesToRadians(System.Double)
Convertit un angle en degrés en angle en radians.
degrees: Angle en degrés.
Angle en radians.
degrees,radians,angle

DSCore.Math.Abs(System.Double)
Détermine la valeur absolue d'un nombre.
number: Obtenir la valeur absolue de ce nombre
Valeur absolue du nombre
absolute value,magnitude

DSCore.Math.Equals(System.Double,System.Double,System.Double)
Cette méthode est UNIQUEMENT utilisée par le noeud Est égal à (avec tolérance) NodeModel

DSCore.Math.Abs(System.Int64)
Détermine la valeur absolue d'un nombre.
integer: Nombre.
Valeur absolue du nombre.
absolute value,magnitude

DSCore.Math.Acos(System.Double)
Détermine le cosinus inverse, l'angle dont le cosinus correspond au rapport indiqué.
ratio: Cosinus de l'angle, un nombre compris dans l'intervalle [-1, 1].
Angle dont le cosinus correspond au rapport d'entrée.
acosine,arccosine

DSCore.Math.Asin(System.Double)
Détermine l'arc sinus, l'angle dont le sinus correspond au rapport indiqué.
ratio: Sinus de l'angle, un nombre compris dans l'intervalle [-1, 1].
Angle dont le sinus correspond au rapport d'entrée
asine,arcsin

DSCore.Math.Atan(System.Double)
Détermine l'arc tangente, l'angle dont la tangente correspond au rapport indiqué.
ratio: Tangente de l'angle.
Angle dont la tangente correspond au rapport d'entrée
atangent,arctangent

DSCore.Math.Atan2(System.Double,System.Double)
Détermine l'arc tangente du quotient de deux nombres. Renvoie l'angle
dont la tangente correspond au rapport suivant: numérateur/dénominateur.
numerator: Numérateur de la tangente de l'angle.
denominator: Dénominateur de la tangente de l'angle.
Angle dont la tangente est le numérateur/dénominateur
atangent,arctangent

DSCore.Math.Ceiling(System.Double)
Renvoie le premier nombre entier supérieur au nombre
number: Nombre à arrondir à l'entier supérieur.
Premier nombre entier supérieur au nombre
ceiling,round

DSCore.Math.Cos(System.Double)
Détermine le cosinus d'un angle.
angle: Obtenir le cosinus de cet angle en degrés.
Cosinus de l'angle
cosine

DSCore.Math.Cosh(System.Double)
Détermine le cosinus hyperbolique d'un angle (radians).
angle: Angle en radians.
Cosinus hyperbolique de l'angle
hyperbolic cosine

DSCore.Math.DivRem(System.Int64,System.Int64)
Détermine le reste du dividende/diviseur.
dividend: Nombre à diviser.
divisor: Nombre par lequel diviser.
Reste de la division
remainder

DSCore.Math.EvaluateFormula(System.String,System.String[],System.Object[])
Evalue une formule NCalc avec les mappages de paramètres donnés.
formulaString: Formule NCalc
parameters: Noms de variables
arguments: Liaisons de variables
type: var[]..[] (résultat du calcul de la formule)

DSCore.Math.Exp(System.Double)
Renvoie la forme exponentielle du nombre, la constante e élevée à la valeur numérique.
number: Nombre.
Forme exponentielle du nombre.
exponential

DSCore.Math.Floor(System.Double)
Renvoie le premier nombre entier inférieur au nombre.
number: Nombre à arrondir à l'entier inférieur
Premier nombre entier inférieur au nombre
round

DSCore.Math.Log(System.Double)
Détermine le logarithme naturel d'un nombre compris dans l'intervalle (0, ∞).
number: Nombre supérieur à 0.
Logarithme naturel du nombre.
natural,logarithm,ln

DSCore.Math.Log(System.Double,System.Double)
Détermine le logarithme d'un nombre avec la base indiquée.
number: Nombre supérieur à 0.
logBase: Base du logarithme dans l'intervalle [0,1),(1, ∞).
Logarithme du nombre.
logarithm,ld,lg

DSCore.Math.Log10(System.Double)
Détermine le logarithme de base 10 d'un nombre.
number: Nombre supérieur à 0.
Logarithme du nombre.
logarithm

DSCore.Math.Max(System.Double,System.Double)
Renvoie le plus grand de deux nombres.
value1: Nombre à comparer.
value2: Nombre à comparer.
Le plus grand des deux nombres.
maximum,greater,larger

DSCore.Math.Max(System.Int64,System.Int64)
Renvoie le plus grand de deux nombres.
int1: Nombre à comparer.
int2: Nombre à comparer.
Le plus grand des deux nombres.
maximum,greater,larger

DSCore.Math.Min(System.Double,System.Double)
Renvoie le plus petit de deux nombres.
value1: Nombre à comparer.
value2: Nombre à comparer.
Le plus petit des deux nombres.
minimum,lesser,smaller

DSCore.Math.Min(System.Int64,System.Int64)
Renvoie le plus petit de deux nombres.
int1: Nombre à comparer.
int2: Nombre à comparer.
Le plus petit des deux nombres.
minimum,lesser,smaller

DSCore.Math.Pow(System.Double,System.Double)
Elève un nombre à la puissance spécifiée.
number: Nombre à élever à une puissance.
power: Puissance à laquelle élever le nombre.
Nombre élevé à la puissance.
^,power,raise,exponent

DSCore.Math.Rand
Générer un nombre aléatoire dans l'intervalle [0, 1).
Nombre aléatoire dans l'intervalle [0, 1).
random,numberrange

DSCore.Math.Round(System.Double)
Arrondit un nombre à l'entier le plus proche.
Notez que cette méthode renvoie un nombre à virgule flottante en double précision au lieu d'un nombre entier.
number: Nombre à arrondir.
Valeur entière la plus proche du nombre.

DSCore.Math.Round(System.Double,System.Int32)
Arrondit un nombre au nombre spécifié de chiffres fractionnaires.
number: Nombre à arrondir
digits: Nombre de chiffres après la virgule dans la valeur de retour
Nombre le plus proche de la valeur et présentant le nombre de chiffres après la virgule spécifié

DSCore.Math.Sign(System.Double)
Renvoie le signe du nombre: -1, 0 ou 1.
number: Obtenir le signe de ce nombre
Signe du nombre: -1, 0 ou 1

DSCore.Math.Sign(System.Int64)
Renvoie le signe du nombre: -1, 0 ou 1.
int: Obtenir le signe de ce nombre entier
Signe du nombre: -1, 0 ou 1

DSCore.Math.Sin(System.Double)
Détermine le sinus d'un angle.
angle: Obtenir le sinus de cet angle en degrés.
Sinus de l'angle.
sine

DSCore.Math.Sinh(System.Double)
Détermine le sinus hyperbolique d'un angle (radians).
angle: Angle en radians.
Sinus hyperbolique de l'angle.
hyperbolic

DSCore.Math.Sqrt(System.Double)
Détermine la racine carrée positive d'un nombre compris dans l'intervalle [0, ∞).
number: Nombre compris dans l'intervalle [0, ∞).
Racine carrée positive du nombre.
square,root,radical

DSCore.Math.Tan(System.Double)
Détermine la tangente d'un angle.
angle: Angle en radians
Tangente de l'angle
tangent

DSCore.Math.Tanh(System.Double)
Détermine la tangente hyperbolique d'un angle (radians).
angle: Angle en radians
Tangente hyperbolique de l'angle
hyperbolic,tanh

DSCore.Math.Sum(System.Collections.Generic.IEnumerable{System.Double})
Rechercher la somme d'une série de nombres
values: Nombres à additionner
Somme des valeurs
mass addition,massadd

DSCore.Math.Factorial(System.Int64)
Recherche le résultat factoriel d'un nombre entier positif.
number: Nombre entier positif
Résultat factoriel du nombre entier.
!

DSCore.Math.Xor(System.Boolean,System.Boolean)
Fonction XOR booléenne: renvoie True si et uniquement si l'une des entrées est True.
bool: Valeur booléenne
otherBool: Autre valeur booléenne
Résultat booléen
xor,exclusive,or

DSCore.Math.DoCheckedCast(System.Double)
Effectue une projection longue dans un contexte vérifié. Si l'opération entraîne un dépassement,
un avertissement est généré et le résultat du dépassement est renvoyé.
value: Opération à effectuer
Returns: Résultat de l'opération