DSCore.Data.DataNodeDynamoType
Classe représentant un type de données pris en charge par Dynamo

DSCore.Data.DataNodeDynamoType.#ctor(System.Type,System.String,System.String)
Classe représentant un type de données pris en charge par Dynamo

DSCore.Data.DataNodeDynamoType.Type
Type sous-jacent

DSCore.Data.DataNodeDynamoType.Name
Nom facultatif remplaçant le nom du type (`Numéro` au lieu de `long`)

DSCore.Data.DataNodeDynamoType.TypeId
$typeid au format filaire (par exemple, "autodesk.math:point3d-1.0.0").
Null pour les types primitifs qui n'utilisent pas la sérialisation $typeid.

DSCore.Data.DataNodeDynamoType.Level
Niveau hiérarchique à afficher dans l'interface utilisateur

DSCore.Data.DataNodeDynamoType.IsLastChild
Si le type est le dernier enfant d'une hiérarchie (à des fins d'interface utilisateur)

DSCore.Data.DataNodeDynamoType.Parent
Parent du type (le cas échéant)