DSCore.CurveMapper.ParabolicCurve
Représente une courbe parabolique dans le CurveMapper.
La courbe suit une équation quadratique basée sur deux points de contrôle.

DSCore.CurveMapper.ParabolicCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Renvoie les valeurs X et Y réparties sur toute la courbe.