DSCore.IO.FileSystem
Méthodes d'utilisation des fichiers.

DSCore.IO.FileSystem.AbsolutePath(System.String,System.String)
Renvoie le chemin d'accès absolu à partir du chemin d'accès indiqué. Si ce dernier est
le chemin d'accès relatif, il est résolu par rapport à
l'espace de travail actuel. Si le fichier n'existe pas dans le chemin d'accès relatif, mais existe
dans le hintPath indiqué, le hintPath est renvoyé.
path: Chemin d'accès relatif ou chemin d'accès complet
hintPath: Dernier chemin résolu
Returns: Chemin absolu

DSCore.IO.FileSystem.FileFromPath(System.String)
Crée un objet de fichier à partir du chemin d'accès au fichier indiqué.

DSCore.IO.FileSystem.ReadText(System.IO.FileInfo)
Lit un fichier texte et renvoie le contenu sous la forme d'une chaîne.
file: Objet de fichier à partir duquel lire le texte
Contenu du fichier texte.
read file,text,file

DSCore.IO.FileSystem.MoveFile(System.String,System.String,System.Boolean)
Déplace un fichier spécifié vers un nouvel emplacement
path: Représentation du chemin d'accès existant sous forme de chaîne
newPath: Représentation du nouveau chemin d'accès sous forme de chaîne
overwrite: Indique si les fichiers existants doivent être remplacés
Le noeud effectue une tâche, aucune sortie n'est générée

DSCore.IO.FileSystem.DeleteFile(System.String)
Supprime le fichier spécifié.
path: Chemin de fichier à supprimer
Le noeud effectue une tâche, aucune sortie n'est générée

DSCore.IO.FileSystem.CopyFile(System.IO.FileInfo,System.String,System.Boolean)
Copie un fichier.
file: Objet de fichier à copier
destinationPath: Représentation du chemin du fichier de destination sous forme de chaîne
overwrite: Indique si les fichiers existants doivent être remplacés
Le noeud effectue une tâche et renvoie la valeur true pour l'action de copie effectuée avec succès.

DSCore.IO.FileSystem.FileExists(System.String)
Détermine si un fichier existe déjà dans le chemin d'accès spécifié.
path: Chaîne représentant un chemin de fichier
True si le fichier existe, False sinon
filepath

DSCore.IO.FileSystem.WriteText(System.String,System.String)
Ecrire le contenu du texte dans un fichier spécifié par le chemin d'accès
filePath: Ecrire dans ce chemin d'accès
text: Contenu du texte
Aucune sortie
write file,text,file,filepath

DSCore.IO.FileSystem.AppendText(System.String,System.String)
Ajouter le contenu du texte dans un fichier spécifié par le chemin d'accès
filePath: Ecrire dans ce chemin d'accès
text: Contenu du texte
Le noeud effectue une tâche, aucune sortie n'est générée
append file,write file,text,file,filepath

DSCore.IO.FileSystem.CombinePath(System.String[])
Combine plusieurs chaînes en un seul chemin de fichier.
strings: Chaînes à combiner en un chemin
Chemin de fichier combiné

DSCore.IO.FileSystem.FileExtension(System.String)
Renvoie l'extension d'un chemin de fichier.
path: Obtenir l'extension de ce chemin d'accès
Extension du fichier

DSCore.IO.FileSystem.ChangePathExtension(System.String,System.String)
Modifie l'extension d'un chemin de fichier.
path: Modifier l'extension de ce chemin d'accès
newExtension: Représentation de la nouvelle extension sous forme de chaîne
Chemin de fichier avec l'extension modifiée

DSCore.IO.FileSystem.DirectoryName(System.String)
Renvoie le nom de répertoire d'un chemin de fichier.
path: Obtenir les informations de répertoire de ce chemin d'accès
Nom de répertoire du chemin de fichier
directorypath

DSCore.IO.FileSystem.FileName(System.String,System.Boolean)
Renvoie le nom de fichier d'un chemin de fichier.
path: Obtenir le nom de fichier de ce chemin d'accès
withExtension: Indique si l'extension doit être incluse dans le résultat
Nom de fichier du chemin d'accès

DSCore.IO.FileSystem.FileHasExtension(System.String)
Détermine si un chemin de fichier contient une extension.
path: Rechercher une extension dans ce chemin d'accès
True si le chemin de fichier contient l'extension, False sinon

DSCore.IO.FileSystem.GetDirectoryContents(System.IO.DirectoryInfo,System.String,System.Boolean)
Renvoie une liste de fichiers et de répertoires contenus dans un répertoire donné. Une chaîne de recherche facultative peut être utilisée pour filtrer les résultats.
directory: Obtenir le contenu de ce répertoire
searchString: Chaîne de recherche utilisée pour filtrer les résultats
includeSubdirectories: Choisissez True pour inclure les fichiers et les dossiers des sous-répertoires (récursifs) ou False pour obtenir uniquement les résultats du niveau supérieur du répertoire spécifié.
Fichiers résultant de la requête
Répertoires résultant de la requête

DSCore.IO.FileSystem.CopyDirectory(System.IO.DirectoryInfo,System.String,System.Boolean)
Copie un répertoire dans un emplacement de destination.
directory: Répertoire à copier
destinationPath: Emplacement de destination de la copie sur le disque
overwriteFiles: Indique si le répertoire existant doit être remplacé
Le noeud effectue une tâche, aucune sortie n'est générée

DSCore.IO.FileSystem.DeleteDirectory(System.String,System.Boolean)
Supprime un répertoire.
path: Chemin d'accès à un répertoire sur le disque
recursive: Supprimer ou non tout le contenu du répertoire. Valeur par défaut: False.
Le noeud effectue une tâche, aucune sortie n'est générée

DSCore.IO.FileSystem.DirectoryExists(System.String)
Détermine si un répertoire existe dans le chemin d'accès indiqué.
path: Chemin d'accès à un répertoire sur le disque
True si le répertoire existe, False sinon
directorypath

DSCore.IO.FileSystem.MoveDirectory(System.String,System.String,System.Boolean)
Déplace un répertoire vers un nouvel emplacement.
path: Représentation du chemin d'accès existant sous forme de chaîne
newPath: Représentation du nouveau chemin d'accès sous forme de chaîne
overwriteFiles: Indique si les fichiers existants doivent être remplacés
Le noeud effectue une tâche, aucune sortie n'est générée