DSCore.TimeSpan
Objet représentant une période de temps écoulée, sans date de début ou de fin spécifique.

DSCore.TimeSpan.ByDateDifference(System.DateTime,System.DateTime)
Génère une nouvelle TimeSpan calculée à partir de la différence temporelle entre deux DateTimes
dateTime: DateTime à partir de laquelle effectuer la soustraction
otherDateTime: DateTime à soustraire
Différence de TimeSpan entre deux dates

DSCore.TimeSpan.Zero
TimeSpan représentant un temps écoulé de zéro.
TimeSpan représentant un temps écoulé nul

DSCore.TimeSpan.MaxValue
TimeSpan la plus longue pouvant être représentée.
Représentation maximale possible de TimeSpan

DSCore.TimeSpan.MinValue
TimeSpan la plus courte pouvant être représentée.
Représentation minimale possible de TimeSpan

DSCore.TimeSpan.Create(System.Double,System.Double,System.Double,System.Double,System.Double)
Crée une nouvelle TimeSpan à partir d'une durée.
days: Jours couverts.
hours: Heures couvertes.
minutes: Minutes couvertes.
seconds: Secondes couvertes.
milliseconds: Millisecondes couvertes.
TimeSpan créée

DSCore.TimeSpan.Scale(System.TimeSpan,System.Double)
Multiplie une TimeSpan par un facteur d'échelle
timeSpan: TimeSpan à multiplier
scaleFactor: Quantité de mise à l'échelle de la TimeSpan. Par exemple, un facteur d'échelle de 2 génère
une durée écoulée double.
TimeSpan obtenue avec la multiplication

DSCore.TimeSpan.Negate(System.TimeSpan)
Inverse une TimeSpan
timeSpan: TimeSpan à inverser
TimeSpan négative

DSCore.TimeSpan.Add(System.TimeSpan,System.TimeSpan)
Ajoute deux TimeSpans
timeSpan1: TimeSpan à ajouter
timeSpan2: Autre TimeSpan à ajouter
TimeSpan obtenue avec l'addition

DSCore.TimeSpan.Subtract(System.TimeSpan,System.TimeSpan)
Soustrait une TimeSpan à une autre
timeSpan1: TimeSpan à partir de laquelle effectuer la soustraction
timeSpan2: TimeSpan à soustraire
TimeSpan résultant de la soustraction

DSCore.TimeSpan.FromString(System.String)
Tentative d'analyse d'une TimeSpan à partir d'une chaîne
string: Représentation d'une TimeSpan sous forme de chaîne.
TimeSpan obtenue à partir de la chaîne analysée

DSCore.TimeSpan.Components(System.TimeSpan)
Obtient les composants individuels d'une TimeSpan.
timeSpan: TimeSpan à partir de laquelle obtenir des composants
Nombre de jours (entier)
Nombre d'heures (entier)
Nombre de minutes (entier)
Nombre de secondes (entier)
Nombre de millisecondes (entier)

DSCore.TimeSpan.TotalDays(System.TimeSpan)
Convertit la durée totale représentée par une TimeSpan en un
nombre de jours inexact.
timeSpan: Obtenir le nombre total de jours total de cette TimeSpan
Nombre total de jours

DSCore.TimeSpan.TotalHours(System.TimeSpan)
Convertit la durée totale représentée par une TimeSpan en un
nombre d'heures inexact.
timeSpan: Obtenir le nombre total d'heures de cette TimeSpan
Nombre total d'heures

DSCore.TimeSpan.TotalMinutes(System.TimeSpan)
Convertit la durée totale représentée par une TimeSpan en un
nombre de minutes inexact.
timeSpan: Obtenir le nombre total de minutes de cette TimeSpan
Nombre total de minutes

DSCore.TimeSpan.TotalSeconds(System.TimeSpan)
Convertit la durée totale représentée par une TimeSpan en un
nombre de secondes inexact.
timeSpan: Obtenir le nombre total de secondes de cette TimeSpan
Nombre total de secondes

DSCore.TimeSpan.TotalMilliseconds(System.TimeSpan)
Convertit la durée totale représentée par une TimeSpan en un
nombre de millisecondes inexact.
timeSpan: Obtenir le nombre de millisecondes de cette TimeSpan
Nombre total de millisecondes