DSCore.IO.Image
Méthodes d'utilisation sur les images Bitmap.

DSCore.IO.Image.ReadFromFile(System.IO.FileInfo)
Charger le fichier en tant que bitmap.
file: Charger l'image depuis cet objet de fichier
Objet d'image obtenu à partir du fichier

DSCore.IO.Image.Pixels(System.Drawing.Bitmap,System.Nullable{System.Int32},System.Nullable{System.Int32})
Lit un fichier image et renvoie les valeurs de couleur aux emplacements de quadrillage spécifiés.
image: Obtenir les couleurs de pixels à partir de cet objet d'image
xSamples: Nombre d'exemples de points de quadrillage dans la direction X.
ySamples: Nombre d'exemples de points de quadrillage dans la direction Y.
Couleurs aux points spécifiés de la grille
read,image,bitmap,png,jpg,jpeg

DSCore.IO.Image.FromPixels(DSCore.Color[][])
Crée une image à partir d'une liste 2D de pixels.
colors: Liste rectangulaire 2D de couleurs représentant les pixels
Image obtenue à partir de la liste 2D de pixels

DSCore.IO.Image.FromPixels(DSCore.Color[],System.Int32,System.Int32)
Crée une image à partir d'une liste simple de pixels, une largeur et une hauteur.
colors: Liste de couleurs représentant les pixels
width: Largeur de la nouvelle image, en pixels
height: Hauteur de la nouvelle image, en pixels
Image obtenue à partir de la liste de pixels

DSCore.IO.Image.Dimensions(System.Drawing.Bitmap)
Renvoie la largeur et la hauteur d'une image.
image: Obtenir les dimensions de cette image.
largeur de l'image en pixels
hauteur de l'image en pixels

DSCore.IO.Image.WriteToFile(System.String,System.Drawing.Bitmap)
Ecrire l'image dans un chemin d'accès avec le nom de fichier spécifié.
image: Image à enregistrer
Objet d'image créé
write image,image,file,filepath