DSCore.CurveMapper.PerlinNoiseCurve
Représente une courbe de bruit Perlin dans le CurveMapper.
La courbe génère un bruit procédural basé sur des points de contrôle et des fonctions de bruit de Perlin.

DSCore.CurveMapper.PerlinNoiseCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Renvoie les valeurs X et Y réparties sur toute la courbe.