DSCore.CurveMapper.GaussianCurve
Représente une courbe gaussienne dans le CurveMapper.
La courbe gaussienne suit une distribution en forme de cloche définie par quatre points de contrôle.

DSCore.CurveMapper.GaussianCurve.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Indique si le noeud est en cours de redimensionnement, empêchant ainsi les mises à jour involontaires des points de contrôle.

DSCore.CurveMapper.GaussianCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Renvoie les valeurs X et Y réparties sur toute la courbe.