Repository: DynamoDS/Dynamo
Catalog: src/DynamoCore/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# BuildSublistsDescription
source: Build sublists from a list using DesignScript range syntax.
cs_cz: Sestaví dílčí seznamy ze seznamu pomocí syntaxe rozsahu DesignScript.
de_de: Erstellt unter Verwendung von DesignScript-Bereichssyntax Unterlisten aus einer Liste.
es_es: Genera sublistas a partir de una lista con sintaxis de rango de DesignScript.
fr_fr: Créer des sous-listes à partir d'une liste à l'aide de la syntaxe d'intervalle DesignScript.
it_it: Crea sottoelenchi da un elenco mediante la sintassi di intervallo DesignScript.
ja_jp: DesignScript 範囲構文を使用してリストからサブリストを作成します。
ko_kr: 리스트에서 DesignScript 범위 구문을 사용하여 하위 리스트를 작성합니다.
pl_pl: Utwórz podlisty z listy ze składnią zakresu DesignScript.
pt_br: Crie sublistas a partir de uma lista usando a sintaxe de faixa DesignScript.
ru_ru: Создание подсписков на основе списка с помощью синтаксиса диапазона DesignScript.
zh_cn: 使用 DesignScript 范围语法由列表构建子列表。
zh_tw: 使用 DesignScript 範圍語法，從清單建置子清單。

# CodeBlockNodeDescription
source: Allows for DesignScript code to be authored directly
cs_cz: Umožňuje přímé vytváření kódu DesignScript.
de_de: Ermöglicht die direkte Erstellung von DesignScript-Code.
es_es: Permite creación directa de código de DesignScript
fr_fr: Permet de créer le code DesignScript directement
it_it: Consente la creazione diretta di codice DesignScript
ja_jp: DesignScript のコードを直接作成することができます。
ko_kr: DesignScript 코드를 직접 작성할 수 있습니다
pl_pl: Umożliwia bezpośrednie utworzenie kodu DesignScript.
pt_br: Permite que o código DesignScript seja criado diretamente
ru_ru: Обеспечивает возможность непосредственного авторства кода DesignScript
zh_cn: 允许直接编写 DesignScript 代码
zh_tw: 允許直接編寫 DesignScript 程式碼

# NumberNodeDescription
source: Creates a number.
cs_cz: Vytvoří číslo.
de_de: Erstellt eine Zahl.
es_es: Crea un número
fr_fr: Crée un nombre.
it_it: Crea un numero.
ja_jp: 数値を作成します。
ko_kr: 숫자를 만듭니다.
pl_pl: Tworzy numer.
pt_br: Cria um número.
ru_ru: Создание числа.
zh_cn: 创建数字。
zh_tw: 建立一個數字。

# StringNodeDescription
source: Creates a string.
cs_cz: Vytvoří řetězec.
de_de: Erstellt eine Zeichenfolge.
es_es: Crea una cadena
fr_fr: Crée une chaîne.
it_it: Crea una stringa.
ja_jp: 文字列を作成します。
ko_kr: 문자열을 작성합니다.
pl_pl: Tworzy ciąg znaków.
pt_br: Cria uma sequência de caracteres.
ru_ru: Создание строки.
zh_cn: 创建字符串。
zh_tw: 建立一個字串。

# FunctionNodeDescription
source: DesignScript Builtin Functions
cs_cz: Integrované funkce aplikace DesignScript
de_de: DesignScript Builtin-Funktionen
es_es: Funciones integradas de DesignScript
fr_fr: Fonctions intégrées DesignScript
it_it: Funzioni incorporate DesignScript
ja_jp: DesignScript 組み込み関数
ko_kr: DesignScript 내장 함수
pl_pl: Wbudowane funkcje DesignScript
pt_br: Funções incorporadas no DesignScript
ru_ru: Встроенные функции DesignScript
zh_cn: DesignScript 内置函数
zh_tw: DesignScript 內建函數

# CustomNodeDesciption
source: Instance of a Custom Node
cs_cz: Instance uživatelského uzlu
de_de: Instanz eines benutzerdefinierten Blocks
es_es: Ejemplar de nodo personalizado
fr_fr: Occurrence d'un noeud personnalisé
it_it: Istanza di un nodo personalizzato
ja_jp: カスタム ノードのインスタンス
ko_kr: 사용자 노드의 인스턴스(instance)
pl_pl: Wystąpienie węzła niestandardowego
pt_br: Instância de um nó personalizado
ru_ru: Экземпляр пользовательского узла
zh_cn: 自定义节点的实例
zh_tw: 自訂節點的例證

# ComposeFunctionNodeDescription
source: Composes two single parameter functions into one function.
cs_cz: Sloučí dvě funkce s jedním parametrem do jedné funkce.
de_de: Verbindet zwei Einzelparameterfunktionen zu einer Funktion.
es_es: Compone dos funciones de parámetros en una sola función
fr_fr: Compose deux fonctions de paramètre uniques dans une fonction.
it_it: Unisce due funzioni parametro distinte in un'unica funzione.
ja_jp: 2 つの単一パラメータ関数を 1 つの関数に構成します。
ko_kr: 두 개의 단일 매개변수 함수를 하나의 함수로 통합합니다.
pl_pl: Łączy dwie odrębne funkcje parametrów w jedną.
pt_br: Crie duas funções de parâmetro único em uma função.
ru_ru: Создаются две однопараметрические функции в одной.
zh_cn: 将两个单参数函数复合为一个函数。
zh_tw: 將兩個單一參數函數組成一個函數。

# OutputNodeDescription
source: A function output, use with custom nodes
cs_cz: Výstup funkce, použijte s vlastními uzly
de_de: Eine Funktionsausgabe zur Verwendung mit benutzerdefinierten Blöcken
es_es: Una función de salida, se debe utilizar con nodos personalizados
fr_fr: Sortie de fonction, utiliser avec les noeuds personnalisés
it_it: Output di funzione da utilizzare con nodi personalizzati
ja_jp: 関数の出力、カスタム ノードで使用
ko_kr: 함수 출력(사용자 노드와 함께 사용)
pl_pl: Wynik funkcji, należy użyć z węzłami niestandardowymi
pt_br: Uma saída da função, utilize com os nós personalizados
ru_ru: Результат функции, применять с пользовательскими узлами
zh_cn: 函数输出，请使用自定义节点
zh_tw: 函數輸出，與自訂節點搭配使用

# InputNodeDescription
source: A function parameter, use with custom nodes
cs_cz: Parametr funkce, použijte s vlastními uzly.
de_de: Ein Funktionsparameter zur Verwendung mit benutzerdefinierten Blöcken
es_es: Parámetro de función, se debe utilizar con nodos personalizados
fr_fr: Un paramètre de fonction, utiliser avec les noeuds personnalisés
it_it: Parametro di funzione da utilizzare con nodi personalizzati
ja_jp: 関数のパラメータ、カスタムノードで使用
ko_kr: 함수 매개변수(사용자 노드와 함께 사용)
pl_pl: Parametr funkcji, należy użyć z węzłami niestandardowymi
pt_br: Um parâmetro de função, utilize com os nós personalizados
ru_ru: Параметр функции, использовать с пользовательскими узлами
zh_cn: 函数参数，请使用自定义节点
zh_tw: 函數參數，與自訂節點搭配使用

# ComposeFunctionPortDataFunctionToolTip
source: A Function
cs_cz: Funkce
de_de: Eine Funktion
es_es: Una función
fr_fr: Fonction
it_it: Funzione
ja_jp: Function
ko_kr: 함수
pl_pl: Funkcja
pt_br: Uma função
ru_ru: Функция
zh_cn: 函数
zh_tw: 函數

# ComposeFunctionPortDataResultToolTip
source: Composed function: g(f(x))
cs_cz: Vytvořená funkce: g(f(x))
de_de: Zusammengesetzte Funktion: g(f(x))
es_es: Función compuesta: g(f(x))
fr_fr: Fonction composée: g(f(x))
it_it: Funzione composta: g(f(x))
ja_jp: 構成された関数: g(f(x))
ko_kr: 구성된 함수: g(f(x))
pl_pl: Funkcja złożona: g(f(x))
pt_br: Função composta: g(f(x))
ru_ru: Создана функция: g(f(x))
zh_cn: 复合函数: G(f(x))
zh_tw: 構成函數：g(f(x))

# RangePortDataAmountToolTip
source: Amount of numbers or letters in the sequence Default value: 10
cs_cz: Počet čísel nebo písmen v posloupnosti Výchozí hodnota: 10
de_de: Anzahl der Zahlen oder Buchstaben in der Folge Vorgabewert: 10
es_es: Cantidad de números o letras en la secuencia Valor por defecto: 10
fr_fr: Quantité de chiffres ou de lettres dans la séquence Valeur par défaut: 10
it_it: Quantità di numeri o lettere nella sequenza Valore di default: 10
ja_jp: シーケンス内の数字または文字の数 既定値: 10
ko_kr: 시퀀스의 숫자 또는 문자 수 기본값: 10
pl_pl: Liczba cyfr lub liter w sekwencji Wartość domyślna: 10
pt_br: Quantidade de números ou letras na sequência Valor padrão: 10
ru_ru: Количество цифр или букв в последовательности Значение по умолчанию: 10
zh_cn: 序列中数字或字母的数量 默认值: 10
zh_tw: 順序中的數字或字母數量 預設值: 10

# RangePortDataEndToolTip
source: Number or letter to end the sequence at Default value: 9
cs_cz: Číslo nebo písmeno, u kterých bude ukončena posloupnost Výchozí hodnota: 9
de_de: Endzahl oder -buchstabe für die Folge Vorgabewert: 9
es_es: El número o letra final de la secuencia Valor por defecto: 9
fr_fr: Nombre ou lettre à la fin de la séquence à Default value: 9
it_it: Lettera o numero finale della sequenza al Valore di default: 9
ja_jp: シーケンスが終了する数字または文字 既定値: 9
ko_kr: 시퀀스를 종료할 숫자 또는 문자 기본값: 9
pl_pl: Numer lub litera kończąca sekwencję w Wartość domyślna: 9
pt_br: Número ou letra com o qual finalizar a sequência Valor padrão: 9
ru_ru: Число или буква, которой завершится последовательность Значение по умолчанию: 9
zh_cn: 序列结束的数字或字母 默认值：9
zh_tw: 數字或字母順序結束於 預設值：9

# RangePortDataSeqToolTip
source: New list of type: var[]..[]
cs_cz: Nový seznam typu: var[]..[]
de_de: Neue Liste von type: var[]..[]
es_es: Nueva lista de tipo: var[]..[]
fr_fr: Nouvelle liste de type: var[]..[]
it_it: Nuovo elenco di tipo: var[]..[]
ja_jp: 新しいリスト(タイプ: var[]..[])
ko_kr: 유형의 새 리스트: var[]..[]
pl_pl: Nowa lista typu: var[]..[]
pt_br: Nova lista do tipo: var[]..[]
ru_ru: Новый список с типом var[]..[]
zh_cn: 新列表(类型: var[]..[])
zh_tw: 新清單，類型: var[]..[]

# RangePortDataStartToolTip
source: Number or letter to start the sequence at Default value: 0
cs_cz: Číslo nebo písmeno, u kterých bude zahájena posloupnost Výchozí hodnota: 0
de_de: Startzahl oder -buchstabe für die Folge Vorgabewert: 0
es_es: El número o letra inicial de la secuencia Valor por defecto: 0
fr_fr: Nombre ou lettre pour le début de la séquence à Valeur par défaut: 0
it_it: Numero o lettera iniziale della sequenza al Valore di default: 0
ja_jp: シーケンスを開始する数字または文字 既定値: 0
ko_kr: 시퀀스를 시작할 숫자 또는 문자 기본값: 0
pl_pl: Numer lub litera rozpoczynająca sekwencję w Wartość domyślna: 0
pt_br: Número ou letra com o qual iniciar a sequência Valor padrão: 0
ru_ru: Число или буква, с которой начнется последовательность Значение по умолчанию: 0
zh_cn: 序列开始的数字或字母 默认值：0
zh_tw: 數字或字母順序開始於 預設值：0

# RangePortDataStepToolTip
source: Space between numbers or letters Default value: 1
cs_cz: Prostor mezi čísly nebo písmeny Výchozí hodnota: 1
de_de: Abstand zwischen Zahlen oder Buchstaben Vorgabewert: 1
es_es: Espacio entre números o letras Valor por defecto: 1
fr_fr: Espace entre les nombres ou les lettres Valeur par défaut: 1
it_it: Spazio tra numeri o lettere Valore di default: 1
ja_jp: 数字や文字間のスペース 既定値: 1
ko_kr: 숫자 또는 문자 사이 공백 기본값: 1
pl_pl: Przestrzeń między numerami lub literami Wartość domyślna: 1
pt_br: Espaço entre números ou letras Valor padrão: 1
ru_ru: Пространство между цифрами или буквами Значение по умолчанию: 1
zh_cn: 数字或字母之间的空间 默认值：1
zh_tw: 數字或字母之間的空間 預設值：1

# PortDataParameterToolTip
source: parameter
cs_cz: parametr
es_es: parámetro
fr_fr: paramètre
it_it: parametro
ja_jp: パラメータ
ko_kr: 매개변수
pl_pl: parametr
pt_br: parâmetro
ru_ru: параметр
zh_cn: 参数
zh_tw: 參數

# PortDataVariableToolTip
source: variable
cs_cz: proměnná
it_it: variabile
ja_jp: 変数
ko_kr: 변수
pl_pl: zmienna
pt_br: variável
ru_ru: переменная
zh_cn: 变量
zh_tw: 變數

# SublistPortDataResultToolTip
source: The sublists.
cs_cz: Žádné dílčí seznamy.
de_de: Die Unterlisten.
es_es: Las sublistas
fr_fr: Sous-listes.
it_it: Sottoelenchi.
ja_jp: サブリスト。
ko_kr: 하위 리스트.
pl_pl: Podlisty.
pt_br: As sublistas.
ru_ru: Вложенные списки.
zh_cn: 子列表。
zh_tw: 子清單。

# SublistsPortDataListToolTip
source: The list from which to create sublists.
cs_cz: Seznam, ze kterého chcete vytvořit dílčí seznamy.
de_de: Die Liste, aus der die Unterlisten erstellt werden sollen
es_es: La lista a partir de la cual desea crear sublistas.
fr_fr: Créer les sous-listes à partir de cette liste.
it_it: Elenco dal quale creare i sottoelenchi.
ja_jp: サブリストの作成元となるリスト。
ko_kr: 하위 리스트를 작성할 리스트.
pl_pl: Lista, z której zostaną utworzone podlisty.
pt_br: A lista a partir da qual deseja criar sublistas.
ru_ru: Список, в котором требуется создать вложенные списки.
zh_cn: 要用于创建子列表的列表。
zh_tw: 要從中建立子清單的清單。

# SublistsPortDataOffsetToolTip
source: The offset to apply to the sub-list. Ex. The range "0..2" with an offset of 1 will yield sublists {0,1,2}{1,2,3}{2,3,4}...
cs_cz: Odsazení, které chcete použít pro dílčí seznam. Př.: Rozsah „0..2“ s odsazením 1 povolí dílčí seznamy {0,1,2}{1,2,3}{2,3,4}...
de_de: Der auf die Unterliste anzuwendende Versatz. Beispiel: Mit dem Bereich "0..2" und dem Versatz 1 erhalten Sie die Unterlisten {0,1,2}{1,2,3}{2,3,4}...
es_es: El desfase que se aplica a la sublista. Por ejemplo, el rango "0..2" con un desfase de 1 generará sublistas {0,1,2}{1,2,3}{2,3,4}...
fr_fr: Décalage à appliquer à la sous-liste. Par exemple, l'intervalle "0..2" avec un décalage de 1 génère les sous-listes {0,1,2}{1,2,3}{2,3,4}...
it_it: Offset da applicare al sottoelenco. Ad esempio, l'intervallo "0..2" con offset 1 restituisce i sottoelenchi {0,1,2}{1,2,3}{2,3,4} e così via...
ja_jp: サブリストに適用するオフセット。例: 範囲 "0..2"、オフセットが 1 の場合、生成されるサブリストは {0,1,2}{1,2,3}{2,3,4}... となります
ko_kr: 하위 리스트에 적용할 간격띄우기. 예: 범위가 "0..2"이고 간격띄우기가 1이면 하위 리스트 {0,1,2}{1,2,3}{2,3,4}가 생성됩니다...
pl_pl: Odsunięcie do zastosowania do podlisty. Np. zakres „0.. 2” z odsunięciem 1 wygeneruje podlisty {0,1,2}{1,2,3}{2, 3, 4}...
pt_br: O deslocamento para aplicar à sublista. Ex. A faixa "0.. 2" com um deslocamento de 1 irá produzir as sublistas {0,1,2}{1,2,3}{2,3,4}...
ru_ru: Значение смещения, которое требуется применить вложенному списку. Например, при использовании диапазона «0..2» со смещением 1 в результате получатся вложенные списки со значениями {0,1,2}{1,2,3}{2,3,4}...
zh_cn: 可应用到子列表的偏移。例如，偏移为 1 的范围“0..2”将产生子列表 {0,1,2}{1,2,3}{2,3,4}...
zh_tw: 要套用至子清單的偏移。範例：偏移為 1 的範圍 "0.. 2" 將產生子清單 {0,1,2}{1,2,3}{2,3,4}...

# PortDataFunctionOutputToolTip
source: function output
cs_cz: výstup funkce
de_de: Funktionsausgabe
es_es: salida de función
fr_fr: sortie de fonction
it_it: Output della funzione
ja_jp: 関数の出力
ko_kr: 함수 출력
pl_pl: wynik funkcji
pt_br: saída da função
ru_ru: вывод функции
zh_cn: 函数输出
zh_tw: 函數輸出

# PortDataInputToolTip
source: Input #{0}
cs_cz: Zadejte #{0}.
de_de: Eingabe #{0}
es_es: Núm. de entrada {0}
fr_fr: Entrée #{0}
it_it: Input n. {0}
ja_jp: 入力番号{0}
ko_kr: 입력 #{0}
pl_pl: Dane wejściowe #{0}
pt_br: Entrada nº {0}
ru_ru: Ввод #{0}
zh_cn: 输入 #{0}
zh_tw: 輸入 #{0}

# PortDataOutputToolTip
source: Output #{0}
cs_cz: Výstup č. {0}
de_de: Ausgabe #{0}
es_es: Núm. de salida {0}
fr_fr: Sortie #{0}
it_it: N. output {0}
ja_jp: 出力番号 {0}
ko_kr: 출력 #{0}
pl_pl: Dane wyjściowe #{0}
pt_br: Saída Nº{0}
ru_ru: Вывод #{0}
zh_cn: 输出 #{0}
zh_tw: 輸出 #{0}

# PortDataPathToFileToolTip
source: Path to the file
cs_cz: Cesta k souboru
de_de: Pfad zur Datei
es_es: Ruta del archivo
fr_fr: Chemin d'accès au fichier
it_it: Percorso del file
ja_jp: ファイルへのパス
ko_kr: 파일 경로
pl_pl: Ścieżka do pliku
pt_br: Caminho para o arquivo
ru_ru: Путь к файлу
zh_cn: 文件路径
zh_tw: 檔案路徑

# PortDataReturnValueToolTip
source: return value
cs_cz: návratová hodnota
de_de: Rückgabewert
es_es: valor de retorno
fr_fr: valeur de retour
it_it: Valore di restituzione
ja_jp: 戻り値
ko_kr: 반환 값
pl_pl: wartość zwracana
pt_br: valor de retorno
ru_ru: возвращаемое значение
zh_cn: 返回值
zh_tw: 傳回值

# PortDataSymbolToolTip
source: Symbol
es_es: Símbolo
fr_fr: Symbole
it_it: Simbolo
ja_jp: 記号
ko_kr: 기호
pt_br: Símbolo
ru_ru: Обозначение
zh_cn: 符号
zh_tw: 符號

# ButtonDownloadLastest
source: Download latest version
cs_cz: Stáhněte si nejnovější verzi.
de_de: Aktuelle Version herunterladen
es_es: Descargar versión más reciente
fr_fr: Télécharger la dernière version
it_it: Scarica la versione più recente
ja_jp: 最新バージョンをダウンロード
ko_kr: 최신 버전 다운로드
pl_pl: Pobierz najnowszą wersję
pt_br: Download da versão mais recente
ru_ru: Загрузить последнюю версию
zh_cn: 下载最新版本
zh_tw: 下載最新版本

# ButtonProcess
source: Proceed anyway
cs_cz: Přesto pokračovat.
de_de: Trotzdem fortfahren
es_es: Continuar de todos modos
fr_fr: Continuer malgré tout
it_it: Continuare
ja_jp: 続行
ko_kr: 계속 진행
pl_pl: Kontynuuj operację
pt_br: Continuar assim mesmo
ru_ru: Все равно продолжить
zh_cn: 仍然继续
zh_tw: 無論如何都要繼續嗎？

# CancelButton
source: Cancel
cs_cz: Storno
de_de: Abbrechen
es_es: Cancelar
fr_fr: Annuler
it_it: Annulla
ja_jp: キャンセル
ko_kr: 취소
pl_pl: Anuluj
pt_br: Cancelar
ru_ru: Отмена
zh_cn: 取消
zh_tw: 取消

# CannotOpenFile
source: Your file cannot be opened
cs_cz: Soubor nelze otevřít.
de_de: Die Datei kann nicht geöffnet werden.
es_es: El archivo no se puede abrir
fr_fr: Le fichier ne peut pas être ouvert
it_it: Impossibile aprire il file
ja_jp: ファイルを開くことができません
ko_kr: 파일을 열 수 없습니다
pl_pl: Nie można otworzyć pliku
pt_br: Seu arquivo não pode ser aberto
ru_ru: Не удается открыть файл
zh_cn: 文件无法打开
zh_tw: 無法開啟您的檔案

# DisplayEngineFailureMessageDescription
source: The virtual machine that powers Dynamo is experiencing some unexpected errors internally and is likely having great difficulties pulling itself together. It is recommended that you save your work now and reload the file. Giving the Dynamo VM a new lease of life can potentially make it feel happier and behave better. If you don't mind, it would be helpful for you to send us your file. That will make it quicker for us to get these issues fixed.
cs_cz: Ve virtuálním počítači, na kterém běží aplikace Dynamo, došlo k neočekávaným​ vnitřním chybám a pravděpodobně se potýká s velkými potížemi. Doporučujeme vám uložit si nyní svou práci a znovu načíst soubor. Dáte tak virtuálnímu počítači Dynamo novou příležitost k dalšímu bezproblémovému fungování. Pokud je to možné, pošlete nám váš soubor. Pak budeme moci tyto problémy rychleji vyřešit.
de_de: Bei der virtuellen Maschine, auf der Dynamo ausgeführt wird, sind unerwartete interne Fehler aufgetreten, die möglicherweise die Funktion erheblich beeinträchtigen. Es wird empfohlen, dass Sie Ihre Arbeit speichern und die Datei erneut laden. Wenn Sie die Dynamo-VM neu starten, können die Fehler möglicherweise behoben. Sie können uns Ihre Datei auch zusenden. Damit können wir diese Probleme schneller beheben.
es_es: La máquina virtual que ejecuta Dynamo sufre algunos errores internos inesperados y es probable que le cueste mucho recuperarse. Se recomienda guardar el trabajo y volver a cargar el archivo. Proporcionar un nuevo ciclo de vida a la máquina virtual de Dynamo puede beneficiarla y hacer que funcione mejor. Sería de agradecer que nos enviase su archivo para que podamos solucionar estos problemas con mayor rapidez.
fr_fr: La machine virtuelle qui alimente Dynamo rencontre des erreurs inattendues en interne et semble avoir des difficultés à se ressaisir. Il vous est recommandé d'enregistrer votre travail maintenant et de recharger le fichier. Donner un nouveau souffle à la machine virtuelle Dynamo peut améliorer son comportement. Si vous n'y voyez pas d'inconvénient, envoyez-nous votre fichier. Nous pourrons ainsi corriger ces erreurs plus rapidement.
it_it: Nella macchina virtuale in cui è in esecuzione Dynamo si sono verificati alcuni errori interni imprevisti. Si consiglia di salvare il lavoro e ricaricare il file. Per migliorare le prestazioni, è consigliabile potenziare la macchina virtuale di Dynamo. Per una risoluzione più rapida dei problemi, inviare il file a GitHub.
ja_jp: Dynamo を使用するための仮想マシンの内部で予期しないエラーが発生し、回復が困難な状況になっていると考えられます。作業を今すぐに保存し、ファイルを再ロードすることをお勧めします。Dynamo VM を再起動することで、状況が改善される可能性があります。 お手数をおかけしますが、問題を早期に解決できるようにファイルをお送りください。
ko_kr: Dynamo에 전원을 공급하는 가상 컴퓨터에 내부적으로 예기치 않은 오류가 일부 발생하여 심각한 문제를 야기할 수 있습니다. 지금 작업을 저장하고 파일을 다시 로드하는 것이 좋습니다. Dynamo VM의 수명을 늘이면 보다 안심하고 사용하실 수 있으며 성능도 향상됩니다. 괜찮으시다면 저희에게 파일을 보내주십시오. 보다 신속하게 문제를 해결하는 데 도움이 될 것입니다.
pl_pl: Na maszynie wirtualnej obsługującej dodatek Dynamo wystąpiły nieoczekiwane błędy wewnętrzne, przez co aplikacja może nie działać prawidłowo. Zaleca się natychmiastowe zapisanie pracy i ponowne wczytanie pliku. Aktualizacja oprogramowania może poprawić funkcjonalność maszyny wirtualnej Dynamo. Jeśli prześlesz do nas plik, będziemy mogli szybciej rozwiązać napotkane problemy.
pt_br: A máquina virtual que aciona o Dynamo está enfrentando alguns erros inesperados internamente e é provável que tenha uma grande dificuldade em funcionar corretamente. Recomenda-se que você salve o seu trabalho agora e recarregar o arquivo. Dar uma nova chance ao Dynamo VM pode deixá-lo mais feliz e fazer com que se comporte melhor. Se você não se importar, ele seria útil para você para nos enviar o arquivo. Que irá tornar mais rápido para obter esses problemas corrigidos.
ru_ru: На виртуальной машине, от которой зависит работа Dynamo, в данный момент возникли некоторые внутренние неполадки, так что, скорее всего, имеются сложности в возвращении к нормальному режиму работы. Рекомендуется сохранить работу и перезагрузить файл прямо сейчас. Если виртуальной машине Dynamo дать немного отдохнуть, она восстановится и заработает как раньше. Если вам не сложно, отправьте текущий файл нам — это будет полезно для вас и позволит нам ускорить решение возникших проблем.
zh_cn: 支持 Dynamo 的虚拟机在内部遇到一些意外错误，并可能在将自身拉在一起时非常困难。建议您立即保存您的工作，然后重新加载该文件。使 Dynamo VM 重获新生可能会使其体验氛围和行为更好。 如果您不介意，它将有助于您向我们发送您的文件。这将使我们可以更快地修复这些问题。
zh_tw: 提供 Dynamo 電源的虛擬機器內部遇到一些非預期的錯誤，可能非常難以處理。建議您立即儲存您的工作，並重新載入檔案。提供 Dynamo VM 新的租賃壽命，可能可以讓它感覺更好而更加順暢。 如果您不介意，請傳送檔案給我們，這樣有助於我們更快修正這些問題。

# FileNotOpenedCorrectly
source: Your file may not open correctly
cs_cz: Soubor se nemusí správně otevírat.
de_de: Die Datei wird möglicherweise nicht ordnungsgemäß geöffnet.
es_es: Es posible que el archivo no se abra correctamente
fr_fr: Votre fichier risque de ne pas s'ouvrir correctement
it_it: È possibile che il file non venga aperto correttamente
ja_jp: ファイルを正しく開くことができない場合があります
ko_kr: 파일이 올바로 열리지 않을 수도 있습니다
pl_pl: Plik może nie zostać otwarty poprawnie
pt_br: Seu arquivo pode não abrir corretamente
ru_ru: Возможно, файл откроется с ошибками
zh_cn: 您的文件可能无法正确打开
zh_tw: 您的檔案可能無法正確地開啟

# IncompatibleOfFileAndDynamo
source: Your file '{0}' of version '{1}' cannot be opened by this version of Dynamo ({2})
cs_cz: Váš soubor „{0}“ ve verzi „{1}“ nelze otevřít v této verzi aplikace Dynamo ({2}).
de_de: Die Datei '{0}' aus Version '{1}' kann in dieser Version von Dynamo ({2}) nicht geöffnet werden.
es_es: Su archivo '{0}' de la versión '{1}' no se puede abrir con esta versión de Dynamo ({2})
fr_fr: Le fichier '{0}', version '{1}', ne peut pas être ouvert par cette version de Dynamo ({2})
it_it: Impossibile aprire il file '{0}' versione '{1}' con la versione corrente di Dynamo ({2})
ja_jp: このバージョンの Dynamo ({2})では、バージョン '{1}' の ファイル '{0}' を開くことができません
ko_kr: 이 Dynamo 버전({2})으로는 버전 '{1}'의 '{0}' 파일을 열 수 없습니다
pl_pl: Plik '{0}' w wersji '{1}' nie może zostać otwarty w tej wersji dodatku Dynamo ({2})
pt_br: O arquivo '{0}' da versão '{1}' não pode ser aberto por esta versão do Dynamo ({2})
ru_ru: Файл '{0}' версии '{1}' не может быть открыт в данной версии Dynamo ({2})
zh_cn: 该版本的 Dynamo ({2}) 无法打开您 '{1}' 版本的文件 '{0}'
zh_tw: 此版本的 Dynamo ({2}) 無法開啟您的檔案 '{0}' (版本為 '{1}')

# IncorrectVersionToOpenFile
source: Your file '{0}' was created in future version '{1}' and may not open correctly in your installed version of Dynamo '{2}'
cs_cz: Váš soubor „{0}“ byl vytvořen v budoucí verzi „{1}“ a nemusí se správně spouštět v nainstalované verzi aplikace Dynamo „{2}“.
de_de: Die Datei '{0}' wurde in der späteren Version '{1}' erstellt und kann eventuell in der bei Ihnen installierten Version Dynamo '{2}' nicht ordnungsgemäß geöffnet werden.
es_es: El archivo '{0}' se ha creado en la versión posterior '{1}' y quizá no se pueda abrir en su versión instalada de Dynamo '{2}'
fr_fr: Le fichier "{0}" a été créé dans une version ultérieure ('{1}') et risque de ne pas s'ouvrir correctement dans la version installée de Dynamo ('{2}')
it_it: Il file '{0}' è stato creato nella versione successiva '{1}' e potrebbe non essere aperto correttamente nella versione di Dynamo installata ({2})
ja_jp: ファイル '{0}' は新しいバージョン '{1}' で作成されており、インストールされているバージョンの Dynamo '{2}' では正しく開くことができない場合があります
ko_kr: '{0}' 파일은 이후 버전 '{1}'에서 작성되어 현재 설치된 Dynamo '{2}' 버전에서는 올바로 열리지 않을 수도 있습니다
pl_pl: Plik '{0}' został utworzony w nowszej wersji '{1}' i może nie zostać otwarty poprawnie w zainstalowanej wersji dodatku Dynamo '{2}'
pt_br: O arquivo '{0}' foi criado em uma versão futura '{1}' e não pode ser aberto corretamente em sua versão instalada do Dynamo '{2}'
ru_ru: Файл '{0}' был создан в более поздней версии '{1}', и в установленной версии Dynamo '{2}' он может открываться с ошибками
zh_cn: 未来版本 '{1}' 中创建了文件 '{0}'，该文件在安装的 Dynamo 版本 '{2}' 中可能无法正确打开
zh_tw: 檔案 '{0}' 已建立在未來版本 '{1}' 中，而且可能無法在安裝的 Dynamo '{2}' 版本中正確開啟

source: Submit Bug To Github
cs_cz: Odeslat chybu na Github
de_de: Fehler an Github senden
es_es: Enviar error a Github
fr_fr: Envoyer le bogue à GitHub
it_it: Invia bug a GitHub
ja_jp: バグを Github に送信
ko_kr: Github에 버그 제출
pl_pl: Zgłoś błąd do Github
pt_br: Enviar o bug para Github
ru_ru: Отправить ошибку в Github
zh_cn: 将错误提交至 Github
zh_tw: 將錯誤提交至 Github
