Repository: DynamoDS/Dynamo
Catalog: src/DynamoCore/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# GroupDefaultText
source: <Double click here to edit group description>
cs_cz: Popis <Dvojitým kliknutím sem upravte popis skupiny>
de_de: Beschreibung <Hier doppelklicken, um die Gruppenbeschreibung zu bearbeiten>
es_es: Descripción <Haga doble clic aquí para editar la descripción del grupo>
fr_fr: Description <Double-cliquer ici pour modifier la description du groupe>
it_it: Descrizione <Fare doppio clic qui per modificare la descrizione del gruppo>
ja_jp: 説明<グループの説明を編集するにはここをダブル クリック>
ko_kr: 설명 <그룹 설명을 편집하려면 여기를 두 번 클릭하십시오.>
pl_pl: Opis <Kliknij dwukrotnie tutaj, aby edytować opis grupy>
pt_br: Descrição <Clique duas vezes aqui para editar a descrição do grupo>
ru_ru: Описание <Дважды нажмите здесь, чтобы изменить описание группы>
zh_cn: 说明 <双击此处编辑组说明>
zh_tw: 描述 <按兩下這裡以編輯群組描述>

# GroupNameDefaultText
source: <Double click here to edit group title>
cs_cz: Název <Dvojitým kliknutím sem upravte název skupiny>
de_de: Titel <Hier doppelklicken, um den Gruppentitel zu bearbeiten>
es_es: Título <Haga doble clic aquí para editar el título del grupo>
fr_fr: Titre <Double-cliquer ici pour modifier le titre du groupe>
it_it: Titolo <Fare doppio clic qui per modificare il titolo del gruppo>
ja_jp: タイトル<グループのタイトルを編集するにはここをダブル クリック>
ko_kr: 제목 <그룹 제목을 편집하려면 여기를 두 번 클릭하십시오.>
pl_pl: Tytuł <Kliknij dwukrotnie tutaj, aby edytować tytuł grupy>
pt_br: Título <Clique duas vezes aqui para editar o título do grupo>
ru_ru: Заголовок <Дважды нажмите здесь, чтобы изменить заголовок группы>
zh_cn: 标题 <双击此处编辑组标题>
zh_tw: 標題 <按兩下這裡以編輯群組標題>

# OutputPortAlternativeName
source: output
cs_cz: výstup
de_de: Ausgabe
es_es: salida
fr_fr: sortie
ja_jp: 出力
ko_kr: 출력
pt_br: saída
ru_ru: вывод
zh_cn: 输出
zh_tw: 輸出

# InputPortAlternativeName
source: input
cs_cz: vstup
de_de: Eingabe
es_es: entrada
fr_fr: entrée
ja_jp: 入力
ko_kr: 입력
pt_br: entrada
ru_ru: ввод
zh_cn: 输入
zh_tw: 輸入

# BackupSavedMsg
source: Backup file is saved
cs_cz: Záložní soubor je uložen
de_de: Sicherungsdatei wird gespeichert
es_es: Se ha guardado el archivo de copia de seguridad.
fr_fr: Le fichier de sauvegarde est enregistré
it_it: File di backup salvato
ja_jp: バックアップファイルが保存されました
ko_kr: 백업 파일이 저장되었습니다.
pl_pl: Plik kopii zapasowej został zapisany
pt_br: O arquivo de backup foi salvo
ru_ru: Резервная копия файла сохранена
zh_cn: 备份文件已保存
zh_tw: 備份檔案已儲存

# NodeDeprecatedMsg
source: Node '{0}' is now deprecated.
cs_cz: Uzel '{0}' je nyní vyřazen.
de_de: Block '{0}' wird nicht mehr unterstützt.
es_es: El nodo '{0}' está obsoleto.
fr_fr: Le noeud '{0}' est obsolète.
it_it: Il nodo '{0}' è ora obsoleto.
ja_jp: ノード '{0}' は廃止されました。
ko_kr: '{0}' 노드는 이제 더 이상 사용되지 않습니다.
pl_pl: Węzeł {0} jest teraz nieaktualny.
pt_br: O nó '{0}' está obsoleto.
ru_ru: Узел «{0}» теперь исключен.
zh_cn: 节点“{0}”现已弃用。
zh_tw: 節點「{0}」現在已棄用。

# NodeNotResolvedMsg
source: Node '{0}' cannot be resolved.
cs_cz: Uzel '{0}' nelze vyhodnotit.
de_de: Block '{0}' kann nicht aufgelöst werden.
es_es: El nodo '{0}' no se puede resolver.
fr_fr: Impossible de résoudre le noeud '{0}'.
it_it: Impossibile risolvere il nodo '{0}'.
ja_jp: ノード '{0}' を解決できません。
ko_kr: '{0}' 노드를 해석할 수 없습니다.
pl_pl: Nie można rozwiązać węzła {0}.
pt_br: Não é possível resolver o nó '{0}'.
ru_ru: Невозможно разрешить узел «{0}».
zh_cn: 无法解析节点“{0}”。
zh_tw: 無法解析節點「{0}」。

# NodeOfTypeDeprecatedMsg
source: Node of type '{0}',from assembly '{1}', is now deprecated.
cs_cz: Uzel typu '{0}' ze sestavy '{1}' je nyní vyřazen.
de_de: Block des Typs '{0}', aus Assembly '{1}', wird nicht mehr unterstützt.
es_es: El nodo de tipo '{0}' del montaje '{1}' está obsoleto.
fr_fr: Le noeud de type '{0}', de l'ensemble '{1}' est obsolète.
it_it: Il nodo di tipo '{0}' dell'assieme '{1}' è ora obsoleto.
ja_jp: タイプ '{0}' のノード(アセンブリ '{1}')は廃止されました。
ko_kr: '{1}' 조립품의 '{0}' 유형에 대한 노드는 이제 더 이상 사용되지 않습니다.
pl_pl: Węzeł typu {0} z zespołu {1} jest obecnie nieaktualny.
pt_br: O nó do tipo '{0}', da montagem '{1}', está obsoleto.
ru_ru: Узел типа «{0}» из сборки «{1}» теперь исключен.
zh_cn: 部件“{1}”中类型为“{0}”的节点现已弃用。
zh_tw: 現在已棄用組合「{1}」中類型為「{0}」的節點。

# NodeOfTypeNotResolvedMsg
source: Node of type '{0}', from assembly '{1}', cannot be resolved.
cs_cz: Uzel typu '{0}' ze sestavy '{1}' nelze vyhodnotit.
de_de: Block des Typs '{0}', aus Assembly '{1}', kann nicht aufgelöst werden.
es_es: El nodo de tipo '{0}' del montaje '{1}' no se puede resolver.
fr_fr: Impossible de résoudre le noeud de type '{0}' de l'ensemble '{1}'.
it_it: Impossibile risolvere il nodo di tipo '{0}' dell'assieme '{1}'.
ja_jp: タイプ '{0}' のノード(アセンブリ '{1}')を解決できません。
ko_kr: '{1}' 조립품에서 '{0}' 유형의 노드를 해석할 수 없습니다.
pl_pl: Nie można rozwiązać węzła typu {0} z zespołu {1}.
pt_br: Não é possível resolver o nó do tipo '{0}', da montagem '{1}'.
ru_ru: Невозможно обработать узел типа «{0}» из сборки «{1}».
zh_cn: 无法解析部件“{1}”中类型为“{0}”的节点。
zh_tw: 無法解析組合「{1}」中類型為「{0}」的節點。

# NodeUnhandledMsg
source: Unhandled 'DummyNode.NodeNature' value: {0}
cs_cz: Nezpracovaná hodnota DummyNode.NodeNature: {0}
de_de: Nicht behandelter 'DummyNode.NodeNature'-Wert: {0}
es_es: Valor 'DummyNode.NodeNature' sin gestionar: {0}
fr_fr: Valeur 'DummyNode.NodeNature' non gérée: {0}
it_it: Valore 'DummyNode.NodeNature' non gestito: {0}
ja_jp: 未処理の 'DummyNode.NodeNature' 値: {0}
ko_kr: 처리되지 않은 'DummyNode.NodeNature' 값: {0}
pl_pl: Nieobsługiwana wartość „DummyNode.NodeNature”: {0}
pt_br: Valor 'DummyNode.NodeNature' não tratado: {0}
ru_ru: Необработанное значение DummyNode.NodeNature: {0}
zh_cn: 未处理的“DummyNode.NodeNature”值: {0}
zh_tw: 未處理的「DummyNode.NodeNature」值: {0}

# CoreLibraryLoadFailureForBlockedAssembly
source: {0} This assembly is likely blocked. Try restarting Dynamo after unblocking this assembly and all other core assemblies that might be blocked. If you are running a downloaded DynamoSandbox build that is extracted from a .zip file, try using 7zip to extract the Dynamo binaries and try again.
cs_cz: {0} Tato sestava je pravděpodobně blokována. Zkuste aplikaci Dynamo restartovat po odblokování této sestavy a všech dalších hlavních sestav, které mohou být blokovány. Pokud používáte stažené sestavení DynamoSandbox, které je extrahováno ze souboru ZIP, zkuste extrahovat binární soubory aplikace Dynamo pomocí aplikace 7zip a akci zopakovat.
de_de: {0} Diese Assembly ist wahrscheinlich blockiert. Starten Sie Dynamo neu, nachdem Sie die Blockierung dieser Assembly und aller anderen möglicherweise blockierten Kern-Assemblys aufgehoben haben. Wenn Sie einen heruntergeladenen DynamoSandbox-Build ausführen, der aus einer ZIP-Datei extrahiert wurde, verwenden Sie 7zip, um die Dynamo-Binärdateien zu extrahieren, und versuchen Sie es erneut.
es_es: {0} Es probable que este montaje esté bloqueado. Pruebe a reiniciar Dynamo después de desbloquear este montaje y todos los demás montajes principales que puedan estar bloqueados. Si está ejecutando una compilación de DynamoSandbox descargada que se ha extraído de un archivo .zip, pruebe a usar 7zip para extraer los archivos binarios de Dynamo y vuelva a intentarlo.
fr_fr: {0} Cet ensemble est probablement bloqué. Essayez de redémarrer Dynamo après avoir débloqué cet ensemble et tous les autres ensembles principaux qui peuvent être bloqués. Si vous exécutez une version téléchargée de Dynamo Sandbox qui est extraite d'un fichier .zip, utilisez 7zip pour extraire les fichiers binaires Dynamo et réessayez.
it_it: {0} Questo assieme è probabilmente bloccato. Provare a riavviare Dynamo dopo lo sblocco di questo assieme e di tutti gli altri assiemi principali che potrebbero essere bloccati. Se si sta eseguendo una build di DynamoSandbox scaricata estratta da un file .zip, provare a utilizzare 7zip per estrarre i file binari di Dynamo e riprovare.
ja_jp: {0} このアセンブリはブロックされている可能性があります。このアセンブリおよびブロックされている可能性のあるその他すべてのコア アセンブリのブロックを解除した後で、Dynamo を再起動してください。ダウンロードした .zip ファイルから抽出した DynamoSandbox ビルドを実行している場合は、7zip を使用して Dynamo バイナリを抽出し、もう一度実行してください。
ko_kr: {0} \이 조립품은 차단되었을 수 있습니다. 이 조립품과 차단된 다른 모든 코어 조립품을 차단 해제한 후 Dynamo를 다시 시작해 보십시오. .zip 파일에서 추출된 다운로드한 DynamoSandbox 빌드를 실행 중인 경우 7zip을 사용하여 Dynamo 바이너리를 추출한 후 다시 시도하십시오.
pl_pl: {0} Ten zespół prawdopodobnie jest zablokowany. Spróbuj ponownie uruchomić dodatek Dynamo po odblokowaniu tego zespołu i wszystkich innych zespołów podstawowych, które mogą być zablokowane. Jeśli używasz pobranej kompilacji dodatku DynamoSandbox wyodrębnionej z pliku .zip, spróbuj wyodrębnić pliki binarne dodatku Dynamo za pomocą programu 7zip i spróbuj ponownie.
pt_br: {0} Esta montagem provavelmente está bloqueada. Tente reiniciar o Dynamo após desbloquear essa montagem e todas as outras montagens de núcleo que possam estar bloqueadas. Se você estiver executando uma compilação do DynamoSandbox transferida por download e extraída de um arquivo .zip, tente usar 7zip para extrair os binários do Dynamo e tente novamente.
ru_ru: {0} Вероятно, эта сборка заблокирована. Попробуйте перезапустить Dynamo после разблокирования этой сборки и всех других основных сборок, которые могут быть заблокированы. Если запущена скачанная сборка DynamoSandbox, которая распакована из ZIP-файла, попробуйте использовать 7-Zip для извлечения двоичных файлов Dynamo и повторите попытку.
zh_cn: {0} 此部件可能已被阻止。请在解除阻止此部件以及可能被阻止的所有其他核心部件后，尝试重新启动 Dynamo。如果您运行的是从 .zip 文件提取的已下载 DynamoSandbox 内部版本，请尝试使用 7zip 提取 Dynamo 二进制文件，然后重试。
zh_tw: {0} 此組合可能已被封鎖。請在解除封鎖此組合和可能被封鎖的所有其他核心組合後，嘗試重新啟動 Dynamo。如果您執行的是從 .zip 檔案解壓縮的已下載 DynamoSandbox 建置，請嘗試使用 7zip 解壓縮 Dynamo 二進位檔案，然後再試一次。

# LibraryLoadFailureForBlockedAssembly
source: {0} This assembly is likely blocked. Try importing it again after unblocking the assembly.
cs_cz: {0} Tato sestava je pravděpodobně blokována. Po odblokování sestavy ji zkuste znovu importovat.
de_de: {0} Diese Assembly ist wahrscheinlich blockiert. Versuchen Sie, sie erneut zu importieren, nachdem Sie die Blockierung der Assembly aufgehoben haben.
es_es: {0} Es probable que este montaje esté bloqueado. Intente importarlo de nuevo después de desbloquearlo.
fr_fr: {0} Cet ensemble est probablement bloqué. Réessayez de l'importer après avoir débloqué l'ensemble.
it_it: {0} Questo assieme è probabilmente bloccato. Provare a importarlo nuovamente dopo averlo sbloccato.
ja_jp: {0} このアセンブリはブロックされている可能性があります。アセンブリのブロックを解除した後に再度読み込んでください。
ko_kr: {0} 이 조립품은 차단되었을 수 있습니다. 조립품을 차단 해제한 후 가져오기를 다시 시도하십시오.
pl_pl: {0} Ten zespół prawdopodobnie jest zablokowany. Spróbuj zaimportować ponownie po odblokowaniu zespołu.
pt_br: {0} Esta montagem provavelmente está bloqueada. Tente importá-la novamente após desbloquear a montagem.
ru_ru: {0} Вероятно, эта сборка заблокирована. После разблокирования сборки попробуйте импортировать ее повторно.
zh_cn: {0} 此部件可能被阻止。请在解除阻止该部件后再次尝试导入。
zh_tw: {0} 此組合可能已被封鎖。請在解除封鎖組合後嘗試再匯入一次。

# PackageLoadFailureForBlockedAssembly
source: {0} This package likely contains an assembly that is blocked. You will need to load the package again after unblocking the assembly. Restart Dynamo to reload the package.
cs_cz: {0} Tento balíček pravděpodobně obsahuje sestavu, která je blokována. Po odblokování sestavy bude nutné balíček znovu načíst. Chcete-li balíček znovu načíst, restartujte aplikaci Dynamo.
de_de: {0} Dieses Paket enthält wahrscheinlich eine blockierte Assembly. Sie müssen das Paket erneut laden, nachdem Sie die Blockierung der Assembly aufgehoben haben. Starten Sie Dynamo neu, um das Paket erneut zu laden.
es_es: {0} Es probable que este paquete contenga un montaje bloqueado. Deberá cargar de nuevo el paquete después de desbloquearlo. Reinicie Dynamo para volver a cargar el paquete.
fr_fr: {0} Ce package contient probablement un ensemble qui est bloqué. Vous devrez charger le package à nouveau après avoir débloqué l'ensemble. Redémarrez Dynamo pour recharger le package.
it_it: {0} Questo pacchetto probabilmente contiene un assieme bloccato. Sarà necessario caricare nuovamente il pacchetto dopo lo sblocco dell'assieme. Riavviare Dynamo per ricaricare il pacchetto.
ja_jp: {0} このパッケージにはブロックされたアセンブリが含まれている可能性があります。アセンブリのブロックを解除した後で、パッケージを再ロードする必要があります。パッケージを再ロードするには、Dynamo を再起動してください。
ko_kr: {0} 이 패키지에는 차단된 조립품이 포함되어 있을 수 있습니다. 조립품을 차단 해제한 후 패키지를 다시 로드해야 합니다. 패키지를 다시 로드하려면 Dynamo를 다시 시작하십시오.
pl_pl: {0} Ten pakiet prawdopodobnie zawiera zablokowany zespół. Po odblokowaniu zespołu należy ponownie wczytać pakiet. Uruchom ponownie dodatek Dynamo, aby ponownie wczytać pakiet.
pt_br: {0} Este pacote provavelmente contém uma montagem bloqueada. Será necessário carregar o pacote novamente após desbloquear a montagem. Reinicie o Dynamo para recarregar o pacote.
ru_ru: {0} Вероятно, этот пакет содержит сборку, которая заблокирована. После разблокирования сборки потребуется загрузить пакет повторно. Перезапустите Dynamo, чтобы перезагрузить пакет.
zh_cn: {0} 此软件包可能包含被阻止的部件。在解除阻止该部件后，您需要重新加载该软件包。重新启动 Dynamo 以重新加载软件包。
zh_tw: {0} 此套件可能包含被封鎖的組合。解除封鎖組合後，您必須再次載入套件。請重新啟動 Dynamo 以重新載入套件。

# CoreLibraryLoadFailureMessageBoxTitle
source: Core library load failure
cs_cz: Načtení hlavní knihovny se nezdařilo
de_de: Fehler beim Laden der Hauptbibliothek
es_es: Fallo al cargar la biblioteca principal
fr_fr: Échec du chargement de la bibliothèque principale
it_it: Errore di caricamento della libreria centrale
ja_jp: コア ライブラリのロードに失敗しました
ko_kr: 코어 라이브러리 로드 실패
pl_pl: Niepowodzenie wczytywania biblioteki podstawowej
pt_br: Falha ao carregar a biblioteca principal
ru_ru: Сбой загрузки библиотеки Core
zh_cn: 型芯库加载失败
zh_tw: 核心資源庫載入失敗

# LibraryLoadFailureMessageBoxTitle
source: Library load failure
cs_cz: Načtení knihovny se nezdařilo
de_de: Fehler beim Laden der Bibliothek
es_es: Fallo al cargar la biblioteca
fr_fr: Échec du chargement de la bibliothèque
it_it: Errore di caricamento della libreria
ja_jp: ライブラリのロードに失敗しました
ko_kr: 라이브러리 로드 실패
pl_pl: Niepowodzenie wczytywania biblioteki
pt_br: Falha ao carregar a biblioteca
ru_ru: Сбой загрузки библиотеки
zh_cn: 库加载失败
zh_tw: 資源庫載入失敗

# FileLoadFailureMessageBoxTitle
source: File load failure
cs_cz: Načtení souboru se nezdařilo.
de_de: Fehler beim Laden der Datei
es_es: Error al cargar archivo
fr_fr: Échec du chargement du fichier
it_it: Errore di caricamento del file
ja_jp: ファイルのロードに失敗しました
ko_kr: 파일 로드 실패
pl_pl: Błąd wczytywania pliku
pt_br: Falha ao carregar arquivo
ru_ru: Сбой при загрузке файла
zh_cn: 文件加载失败
zh_tw: 檔案載入失敗

# GroupStyleDefaultActions
source: Actions
cs_cz: Akce
de_de: Aktionen
es_es: Acciones
it_it: Azioni
ja_jp: アクション
ko_kr: 작업
pl_pl: Działania
pt_br: Ações
ru_ru: Действия
zh_cn: 操作
zh_tw: 動作

# GroupStyleDefaultInputs
source: Inputs
cs_cz: Vstupy
de_de: Eingaben
es_es: Entradas
fr_fr: Entrées
it_it: Input
ja_jp: 入力
ko_kr: 입력
pl_pl: Dane wejściowe
pt_br: Entradas
ru_ru: Входные данные
zh_cn: 输入
zh_tw: 輸入

# GroupStyleDefaultOutputs
source: Outputs
cs_cz: Výstupy
de_de: Ausgaben
es_es: Salidas
fr_fr: Sorties
it_it: Output
ja_jp: 出力
ko_kr: 출력
pl_pl: Dane wyjściowe
pt_br: Saídas
ru_ru: Выходные данные
zh_cn: 输出
zh_tw: 輸出

# GroupStyleDefaultReview
source: Review
cs_cz: Kontrola
de_de: Überprüfung
es_es: Revisar
fr_fr: Réviser
it_it: Rivedi
ja_jp: 確認
ko_kr: 검토
pl_pl: Przegląd
pt_br: Revisão
ru_ru: Просмотр
zh_cn: 审核
zh_tw: 檢閱

# ToolTipInputData
source: Input Data
cs_cz: Vstupní data
de_de: Eingabedaten
es_es: Datos de entrada
fr_fr: Données d'entrée
it_it: Dati di input
ja_jp: 入力データ
ko_kr: 입력 데이터
pl_pl: Dane wejściowe
pt_br: Dados de entrada
ru_ru: Входные данные
zh_cn: 输入数据
zh_tw: 輸入資料

# SplashScreenInitPreferencesSettings
source: Initializing preferences...
cs_cz: Inicializace předvoleb...
de_de: Einstellungen werden initialisiert...
es_es: Inicializando preferencias...
fr_fr: Initialisation des préférences…
it_it: Inizializzazione delle preferenze in corso...
ja_jp: 基本設定を初期化中...
ko_kr: 기본 설정을 초기화 중...
pl_pl: Inicjowanie parametrów...
pt_br: Inicializando as preferências...
ru_ru: Инициализация настроек...
zh_cn: 正在初始化系统配置...
zh_tw: 正在初始化偏好...

# SplashScreenLoadNodeLibrary
source: Loading Node Library...
cs_cz: Načítání knihovny uzlů...
de_de: Blockbibliothek wird geladen...
es_es: Cargando biblioteca de nodos...
fr_fr: Chargement de la bibliothèque de noeuds…
it_it: Caricamento della libreria di nodi in corso...
ja_jp: ノード ライブラリをロードしています...
ko_kr: 노드 라이브러리를 로드하는 중...
pl_pl: Wczytywanie biblioteki węzłów...
pt_br: Carregando a biblioteca de nós...
ru_ru: Загрузка библиотеки узлов...
zh_cn: 正在加载节点库…
zh_tw: 正在載入節點資源庫...

# AutocompleteNoRecommendationsTitle
source: No recommendations
cs_cz: Žádná doporučení
de_de: Keine Empfehlungen
es_es: Sin recomendaciones
fr_fr: Aucune recommandation
it_it: Nessun suggerimento
ja_jp: 推奨事項なし
ko_kr: 권장 사항 없음
pl_pl: Brak zaleceń
pt_br: Nenhuma recomendação
ru_ru: Нет рекомендаций
zh_cn: 无建议
zh_tw: 沒有建議

# AutocompleteLowConfidenceTitle
source: Low confidence
cs_cz: Nízká spolehlivost
de_de: Geringe Zuverlässigkeit
es_es: Confianza baja
fr_fr: Confiance faible
it_it: Bassa affidabilità
ja_jp: 低信頼度
ko_kr: 낮은 신뢰도
pl_pl: Niska pewność
pt_br: Baixa confiança
ru_ru: Низкая надежность
zh_cn: 置信度低
zh_tw: 低信賴

# AutocompleteNoRecommendationsMessage
source: There are no recommendations yet. You can try switching to node type match autocomplete.
cs_cz: Zatím nejsou žádná doporučení. Můžete zkusit přepnout na automatické dokončování shody typu uzlů.
de_de: Es gibt noch keine Empfehlungen. Wechseln Sie ggf. zur Blockttyp-Autovervollständigung.
es_es: Aún no hay recomendaciones. Puede intentar cambiar a la coincidencia de tipo de nodo Autocompletar.
fr_fr: Il n'y a pas encore de recommandation. Vous pouvez essayer de passer à la saisie automatique de type de noeud.
it_it: Non sono ancora presenti suggerimenti. È possibile provare a passare al completamento automatico per tipo di nodo.
ja_jp: 推奨事項がまだありません。ノード タイプ一致のオートコンプリートに切り替えてみてください。
ko_kr: 아직 추천받은 항목이 없습니다. 노드 유형 일치 자동 완성으로 전환해 볼 수 있습니다.
pl_pl: Nie ma jeszcze żadnych zaleceń. Możesz spróbować przełączyć na autouzupełnianie zgodnego typu węzła.
pt_br: Ainda não há recomendações. É possível tentar alternar para o preenchimento automático da correspondência do tipo nó.
ru_ru: Рекомендации пока отсутствуют. Попробуйте использовать метод автозаполнения «Соответствие типа узла».
zh_cn: 还没有建议。可以尝试切换到节点类型匹配自动完成。
zh_tw: 還沒有任何建議。您可以嘗試切換到節點類型相符自動完成。

# AutocompleteLowConfidenceMessage
source: All recommendations are below the specified confidence level. You can try them or adjust the confidence settings in Preferences.
cs_cz: Všechna doporučení mají nízkou spolehlivost. Můžete je vyzkoušet nebo upravit nastavení spolehlivosti v dialogu Předvolby.
de_de: Alle Empfehlungen liegen unterhalb der definierten Zuverlässigkeit. Sie können sie ausprobieren oder die Zuverlässigkeitseinstellungen in den Voreinstellungen anpassen.
es_es: Todas las recomendaciones están por debajo del nivel de confianza especificado. Puede probarlas o ajustar la configuración de confianza en Preferencias.
fr_fr: Toutes les recommandations sont inférieures au niveau de confiance. Vous pouvez les essayer ou ajuster les paramètres de confiance dans Préférences.
it_it: Tutti i suggerimenti sono sotto il livello di affidabilità specificato. È possibile provarli ora o regolare le impostazioni dell'affidabilità in Preferenze.
ja_jp: すべての推奨事項は、信頼度が指定されたレベルより低い推奨事項です。試してみるか、[基本設定]で信頼度の設定を調整できます。
ko_kr: 모든 추천이 지정된 신뢰도 수준보다 낮습니다. 해당 추천을 사용해 보거나 기본 설정에서 신뢰도 설정을 조정할 수 있습니다.
pl_pl: Wszystkie zalecenia wypadają poniżej określonego poziomu pewności. Możesz je wypróbować lub dostosować ustawienia pewności w preferencjach.
pt_br: Todas as recomendações estão abaixo do nível de confiança especificado. Você pode experimentá-las ou ajustar as configurações de confiança em Preferências.
ru_ru: Все рекомендации находятся за пределами указанного уровня надежности. Можно использовать их или скорректировать настройки конфиденциальности в разделе «Настройки».
zh_cn: 所有建议都低于指定的置信度级别。您可以尝试它们或在“首选项”中调整置信度设置。
zh_tw: 所有建議都低於指定的信賴水準。您可以嘗試這些建議，或在「偏好」中調整信賴設定。

# AutocompleteLowConfidenceTooltip
source: Show Recommendations that are below the confidence level.
cs_cz: Zobrazení doporučení s nízkou spolehlivostí.
de_de: Empfehlungen anzeigen, die als nicht zuverlässig gelten.
es_es: Visualice las recomendaciones que están por debajo del nivel de confianza.
fr_fr: Afficher les recommandations inférieures au niveau de confiance.
it_it: Mostra i suggerimenti che sono sotto il livello di affidabilità.
ja_jp: 信頼度がそのレベルより低い推奨事項を表示します。
ko_kr: 신뢰도 수준보다 낮은 추천 표시
pl_pl: Pokaż zalecenia wypadające poniżej poziomu pewności.
pt_br: Exiba recomendações que estejam abaixo do nível de confiança.
ru_ru: Показывать рекомендации за пределами уровня надежности.
zh_cn: 显示低于置信度级别的建议。
zh_tw: 展示低於信賴水準的建議。

# LoginNeededTitle
source: Not authenticated
cs_cz: Neověřeno
de_de: Nicht authentifiziert
es_es: No autenticado
fr_fr: Non authentifié
it_it: Non autenticato
ja_jp: 未認証
ko_kr: 인증되지 않음
pl_pl: Nieuwierzytelnione
pt_br: Não autenticado
ru_ru: Проверка подлинности не выполнена
zh_cn: 未经过验证
zh_tw: 未驗證

# LoginNeededMessage
source: You need to login to your account to get recommendations. Please log in or switch to node type match autocomplete.
cs_cz: Chcete-li získat doporučení, přihlaste se ke svému účtu. Přihlaste se nebo přepněte na automatické dokončování shody typu uzlů.
de_de: Sie müssen sich bei Ihrem Konto anmelden, um Empfehlungen zu erhalten. Melden Sie sich an, oder wechseln Sie zur Blocktyp-Autovervollständigung.
es_es: Debe iniciar sesión en su cuenta para obtener recomendaciones. Inicie sesión o cambie a la coincidencia de tipo de nodo Autocompletar.
fr_fr: Vous devez vous connecter à votre compte pour obtenir des recommandations. Connectez-vous ou passez à la saisie automatique de type de noeud.
it_it: Per ottenere suggerimenti, è necessario accedere all'account. Eseguire l'accesso o passare al completamento automatico per tipo di nodo.
ja_jp: 推奨事項を取得するには、アカウントにログインする必要があります。ログインするか、ノード タイプ一致のオートコンプリートに切り替えてください。
ko_kr: 추천을 받으려면 계정에 로그인해야 합니다. 로그인하거나 노드 유형 일치 자동 완성으로 전환하십시오.
pl_pl: Aby uzyskać zalecenia, należy zalogować się na konto. Zaloguj się lub przełącz na autouzupełnianie zgodnego typu węzła.
pt_br: É necessário efetuar login na conta para obter recomendações. Efetue login ou alterne para o preenchimento automático da correspondência do tipo nó.
ru_ru: Для получения рекомендаций необходимо войти в учетную запись. Войдите в систему или выберите метод автозаполнения «Соответствие типа узла».
zh_cn: 您需要登录帐户，才能获得建议。请登录或切换到节点类型匹配自动完成。
zh_tw: 您必須登入帳戶才能獲得建議。請登入或切換到節點類型相符自動完成。

# FailedInsertFileNodeExistNotification
source: Failed to insert the file as some of the nodes already exist in the current worspace.
cs_cz: Vložení souboru se nezdařilo, protože některé uzly již v aktuálním pracovním prostoru existují.
de_de: Einfügen der Datei fehlgeschlagen, da einige Blöcke bereits im aktuellen Arbeitsbereich vorhanden sind.
es_es: No se ha podido insertar el archivo porque algunos de los nodos ya existen en el espacio de trabajo actual.
fr_fr: Echec de l'insertion du fichier, car certains noeuds existent déjà dans l'espace de travail courant.
it_it: Impossibile inserire il file perché alcuni nodi esistono già nell'area di lavoro corrente.
ja_jp: 現在のワークスペースに既にノードが存在するため、ファイルの挿入に失敗しました。
ko_kr: 일부 노드가 현재 작업공간에 이미 있으므로 파일을 삽입하지 못했습니다.
pl_pl: Nie można wstawić pliku, ponieważ niektóre węzły już istnieją w bieżącym obszarze roboczym.
pt_br: Falha durante a inserção do arquivo, pois alguns dos nós já existem no espaço de trabalho atual.
ru_ru: Не удалось вставить файл, так как некоторые узлы уже существуют в текущем рабочем пространстве.
zh_cn: 由于某些节点已存在于当前工作空间中，因此无法插入文件。
zh_tw: 無法插入檔案，因為某些節點已存在於目前工作區中。

# ArggOKButton
source: Arrrrg, ok
de_de: OK
es_es: Vaya, de acuerdo
