Repository: DynamoDS/Dynamo
Catalog: src/DynamoCore/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

source: Default value
cs_cz: Výchozí hodnota
de_de: Vorgabewert
es_es: Valor por defecto
fr_fr: Valeur par défaut
it_it: Valore di default
ja_jp: 既定値
ko_kr: 기본값
pl_pl: Wartość domyślna
pt_br: Valor padrão
ru_ru: Значение по умолчанию
zh_cn: 默认值
zh_tw: 預設值

# DefaultValueDisabled
source: (disabled)
cs_cz: (vypnuto)
de_de: (deaktiviert)
es_es: (desactivado)
fr_fr: (désactivé)
it_it: (disabilitato)
ja_jp: (無効)
ko_kr: (사용 불가능)
pl_pl: (wyłączony)
pt_br: (desativada)
ru_ru: (откл.)
zh_cn: (禁用)
zh_tw: (已停用)

# DefaultCustomNodeCategory
source: Custom nodes
cs_cz: Uživatelské uzly
de_de: Benutzerdefinierte Blöcke
es_es: Nodos personalizados
fr_fr: Noeuds personnalisés
it_it: Nodi personalizzati
ja_jp: カスタム ノード
ko_kr: 사용자 노드
pl_pl: Węzły niestandardowe
pt_br: Nós personalizados
ru_ru: Пользовательские узлы
zh_cn: 自定义节点
zh_tw: 自訂節點

# InvalidCustomNodeFolderWarning
source: The folder '{0}' does not exist
cs_cz: Složka {0} neexistuje.
de_de: Der Ordner '{0}' ist nicht vorhanden
es_es: La carpeta '{0}' no existe
fr_fr: Le dossier '{0}' n'existe pas
it_it: La cartella '{0}' non esiste
ja_jp: フォルダ '{0}' は存在しません
ko_kr: '{0}' 폴더가 존재하지 않습니다
pl_pl: Folder '{0}' nie istnieje
pt_br: A pasta '{0}' não existe
ru_ru: Папка '{0}' не существует
zh_cn: 文件夹“{0}”不存在
zh_tw: '{0}' 資料夾不存在

# DirectoryNotFound
source: Directory not found : {0}
cs_cz: Nenalezený adresář: {0}
de_de: Verzeichnis wurde nicht gefunden: {0}
es_es: Directorio no encontrado : {0}
fr_fr: Répertoire introuvable: {0}
it_it: Directory non trovata: {0}
ja_jp: フォルダが見つかりません: {0}
ko_kr: 디렉토리를 찾을 수 없음: {0}
pl_pl: Nie znaleziono katalogu: {0}
pt_br: Diretório não encontrado: {0}
ru_ru: Папка не найдена: {0}
zh_cn: 未发现目录: {0}
zh_tw: 找不到目錄：{0}

# CustomNodeFolderLoadFailure
source: Failed to load custom node directory. Do you have permission to access {0}?
cs_cz: Nepodařilo se načíst adresář vlastních uzlů. Máte oprávnění k přístupu ke složce {0}?
de_de: Fehler beim Laden des Verzeichnisses für benutzerdefinierte Blöcke. Sind Sie zum Zugriff auf {0} berechtigt?
es_es: No se ha podido cargar el directorio del nodo personalizado. ¿Dispone de permiso para acceder a {0}?
fr_fr: Echec du chargement du répertoire de noeud personnalisé. Disposez-vous de l'autorisation d'accès à {0}?
it_it: Impossibile caricare la directory del nodo personalizzata. Si dispone dell'autorizzazione per accedere a {0}?
ja_jp: カスタム ノード フォルダのロードに失敗しました。{0} へのアクセス権限を確認してください。
ko_kr: 사용자 노드 디렉토리를 로드하지 못했습니다. {0}에 액세스할 권한이 있습니까?
pl_pl: Nie udało się wczytać katalogu węzła niestandardowego. Nie masz uprawnień, aby uzyskać dostęp do {0}?
pt_br: Falha ao carregar o diretório de nó personalizado. Você tem permissão para acessar {0}?
ru_ru: Не удалось загрузить папку пользовательского узла. У вас есть права доступа к {0}?
zh_cn: 无法加载自定义节点目录。您是否有权访问 {0}？
zh_tw: 無法載入自訂節點目錄。您是否有權限可以存取 {0}？

# PortsNameDescriptionDoNotEqualWarningMessage
source: Number of port names does not equal number of port descriptions.
cs_cz: Počet názvů portů se nerovná počtu popisů portů.
de_de: Anzahl der Anschlussnamen stimmt nicht mit der Anzahl der Anschlussbeschreibungen überein.
es_es: El número de nombres de puerto no es igual al número de descripciones de puerto.
fr_fr: Le nombre de noms de port n'est pas égal au nombre de descriptions de port.
it_it: Il numero di nomi porta non corrisponde al numero di descrizioni porta.
ja_jp: ポート名の数とポートの説明の数が等しくありません。
ko_kr: 포트 이름 수가 포트 설명 수와 같지 않습니다
pl_pl: Liczba nazw portów nie jest równa liczbie opisów portów.
pt_br: O número de nomes de porta não é igual ao número de descrições de porta.
ru_ru: Количество названий портов отличается от количества их описаний.
zh_cn: 端口名称数量与端口说明数量不等。
zh_tw: 連接埠名稱的數量不等於連接埠描述的數量。

# DescriptionResource1
source: some description
cs_cz: určitý popis
de_de: Eine Beschreibung
es_es: alguna descripción
fr_fr: une description
it_it: una descrizione
ja_jp: 説明
ko_kr: 설명
pl_pl: niektóre opisy
pt_br: alguma descrição
ru_ru: описание
zh_cn: 某些说明
zh_tw: 某些描述

# ResourcePropertyIsNotStringTypeMessage
source: Resource Property is not String Type
cs_cz: Vlastnost zdroje není typ řetězce.
de_de: Ressourceneigenschaft ist nicht vom Typ Zeichenfolge
es_es: La propiedad de recurso no es de tipo cadena
fr_fr: La propriété de ressource n'est pas un type de chaîne
it_it: La proprietà della risorsa non è di tipo Stringa
ja_jp: Resource Property は String Type ではありません
ko_kr: Resource Property는 String Type이 아닙니다
pl_pl: Właściwość zasobu inna niż Typ ciągu
pt_br: A propriedade do recurso não é de tipo sequência de caracteres
ru_ru: Свойство ресурса не является свойством «Тип строки»
zh_cn: 资源特性不是字符串类型
zh_tw: 資源性質不是字串類型

# ResourceTypeDoesNotHavePropertyMessage
source: Resource Type does not have Property
cs_cz: Typ zdroje nemá vlastnost.
de_de: Ressourcentyp verfügt nicht über Eigenschaft
es_es: El tipo de recurso no tiene propiedad
fr_fr: Le type de ressource ne possède pas de propriété
it_it: Il tipo di risorsa non dispone di proprietà
ja_jp: Resource Type に Property がありません
ko_kr: Resource Type에 Property가 없습니다
pl_pl: Typ zasobu nie ma Właściwości
pt_br: O tipo de recurso não tem uma propriedade
ru_ru: У типа ресурса отсутствует свойство
zh_cn: 资源类型没有特性
zh_tw: 資源類型沒有性質

# WarningInvalidOutput
source: Only comments and single variable are allowed in output node.
cs_cz: Ve výstupním uzlu jsou povoleny pouze komentáře a jedna proměnná.
de_de: Im Ausgabeblock sind nur Kommentare und einzelne Variablen erlaubt.
es_es: Solo se permiten comentarios y una sola variable en el nodo de entrada.
fr_fr: Seuls les commentaires et une variable unique sont autorisés dans le noeud de sortie.
it_it: Solo i commenti e la singola variabile sono consentiti nel nodo di output.
ja_jp: 出力ノード中で使用できるのはコメントと単一の変数のみです。
ko_kr: 주석 및 단일 변수만 출력 노드에서 사용할 수 있습니다.
pl_pl: Dla węzła wyjściowego dozwolone są jedynie komentarze i jedna zmienna.
pt_br: Somente os comentários e variável única são permitidos no nó de saída.
ru_ru: В узле вывода разрешены только комментарии и одна переменная.
zh_cn: 输出节点中只允许注释和单个变量。
zh_tw: 在輸出節點中僅允許註解和單一變數。

# FailedToLoadLibrary
source: Failed to load library: {0}
cs_cz: Nepodařilo se načíst tuto knihovnu: {0}.
de_de: Laden der Bibliothek fehlgeschlagen: {0}
es_es: No se ha podido cargar la biblioteca: {0}
fr_fr: Echec du chargement de la bibliothèque: {0}
it_it: Impossibile caricare la libreria: {0}
ja_jp: 次のライブラリをロードできませんでした: {0}
ko_kr: 라이브러리를 로드하지 못했습니다. {0}
pl_pl: Wczytywanie biblioteki nie powiodło się: {0}
pt_br: Falha ao carregar a biblioteca: {0}
ru_ru: Не удалось загрузить библиотеку: {0}
zh_cn: 无法加载库: {0}
zh_tw: 無法載入資源庫：{0}

# NoneString
source: none
cs_cz: žádné
de_de: Keine
es_es: ninguno
fr_fr: aucun
it_it: Nessuno
ja_jp: なし
ko_kr: 없음
pl_pl: brak
pt_br: nenhum
ru_ru: нет
zh_cn: 无
zh_tw: 無

# DefaultHomeWorkspaceName
source: Home
cs_cz: Výchozí
de_de: Start
es_es: Inicio
fr_fr: Accueil
it_it: Inizio
ja_jp: ホーム
ko_kr: 홈
pl_pl: Narzędzia główne
pt_br: Início
ru_ru: Главная
zh_cn: 主页
zh_tw: 主視圖

# UnresolvedNodesWarningShortMessage
source: The graph has unresolved nodes and cannot be saved.
cs_cz: Graf obsahuje nevyřešené uzly a nelze jej uložit.
de_de: Dieses Diagramm hat ungelöste Blöcke und kann nicht gespeichert werden.
es_es: El gráfico tiene nodos sin resolver y no se puede guardar.
fr_fr: Ce graphique comporte des noeuds non résolus et ne peut pas être enregistré.
it_it: Questo grafico contiene nodi irrisolti e non può essere salvato.
ja_jp: グラフに未解決のノードがあるため、保存できません。
ko_kr: 그래프에 해결되지 않은 노드가 있어 그래프를 저장할 수 없습니다.
pl_pl: Wykres zawiera nierozstrzygnięte węzły i nie można go zapisać.
pt_br: Este gráfico contém nós não resolvidos e não pode ser salvo.
ru_ru: График имеет необработанные узлы и не может быть сохранен.
zh_cn: 图形有未解析的节点，无法保存。
zh_tw: 圖表有未解決的節點，無法儲存。

# UnresolvedNodesWarningTitle
source: Unable to save graph
cs_cz: Graf nelze uložit.
de_de: Diagramm kann nicht gespeichert werden
es_es: No se puede guardar el gráfico
fr_fr: Impossible d'enregistrer le graphique
it_it: Impossibile salvare il grafico
ja_jp: グラフを保存できません
ko_kr: 그래프를 저장할 수 없음
pl_pl: Nie można zapisać wykresu
pt_br: Não é possível salvar o gráfico
ru_ru: Невозможно сохранить график
zh_cn: 无法保存图形
zh_tw: 無法儲存圖表

# UnresolvedNodesWarningMessage
source: This may be caused by a missing package, incompatible package version, or missing host program. If you Save As, the unresolved nodes will be removed. Resolve or remove the unresolved nodes and try again.
cs_cz: To může být způsobeno chybějícím balíčkem, nekompatibilní verzí balíčku nebo chybějícím programem hostitele. Pokud použijete funkci Uložit jako, nevyřešené uzly budou odstraněny. Vyřešte nebo odstraňte nevyřešené uzly a zkuste to znovu.
de_de: Der Grund hierfür können ein fehlendes Paket, inkompatible Paketversionen oder ein fehlendes Host-Programm sein. Wenn Sie Speichern unter verwenden, werden die ungelösten Blöcke entfernt. Lösen oder entfernen Sie die ungelösten Blöcke, oder versuchen Sie es erneut.
es_es: Esto puede deberse a la falta de un paquete, a una versión incompatible del paquete o a la falta de un programa anfitrión. Si utiliza la opción Guardar como, se eliminarán los nodos no resueltos. Resuelva o elimine los nodos no resueltos e inténtelo de nuevo.
fr_fr: Cela peut venir d'un package manquant, d'une version de package incompatible ou d'un programme hôte manquant. Si vous choisissez d'Enregistrer sous, les noeuds non résolus seront supprimés. Résolvez les noeuds ou supprimez-les, puis réessayez.
it_it: Questo problema può essere causato da un pacchetto mancante, una versione del pacchetto non compatibile o un programma host mancante. Se si utilizza Salva con nome, i nodi irrisolti verranno rimossi. Risolvere o rimuovere i nodi irrisolti e riprovare.
ja_jp: これは、パッケージの欠落、互換性のないパッケージ バージョン、あるいはホスト プログラムの欠落が原因である可能性があります。[名前を付けて保存]を使用してグラフを保存すると、未解決のノードは削除されます。 未解決のノードを解決または削除してから再度お試しください。
ko_kr: 이 문제는 누락된 패키지, 호환되지 않는 패키지 버전 또는 누락된 호스트 프로그램으로 인해 발생할 수 있습니다. 다른 이름으로 저장하면 해결되지 않은 노드가 제거됩니다. 해결되지 않은 노드를 해결하거나 제거한 후 다시 시도하십시오.
pl_pl: Może to być spowodowane brakującym pakietem, niezgodną wersją pakietu lub brakującym programem hosta. Jeśli skorzystasz z polecenia Zapisz jako, nierozstrzygnięte węzły zostaną usunięte. Rozstrzygnij lub usuń nierozstrzygnięte węzły i spróbuj ponownie.
pt_br: Isso pode ser causado por um pacote ausente, uma versão de pacote incompatível ou um programa hospedeiro ausente. Se a opção Salvar como for usada, os nós não resolvidos serão removidos. Resolva ou remova os nós não resolvidos e tente novamente.
ru_ru: Причиной может быть отсутствующий пакет, несовместимая версия пакета или отсутствие управляющей программы. Если использовать команду «Сохранить как», необработанные узлы будут удалены. Обработайте или удалите необработанные узлы и повторите попытку.
zh_cn: 这可能是由于缺少软件包、软件包版本不兼容或缺少主机程序造成的。如果使用“另存为”，将删除未解析的节点。 解析或删除未解析的节点，然后重试。
zh_tw: 這可能是因為缺少套件、不相容的套件版本或缺少主程式。如果您「另存新檔」，將會移除未解決的節點。 請解決或移除未解決的節點，然後再試一次。

# CodeBlockTempIdentifierOutputLabel
source: Value of expression at line {0}
cs_cz: Hodnota výrazu na řádku {0}
de_de: Wert des Ausdrucks in Zeile {0}
es_es: Valor de la expresión en la línea {0}
fr_fr: Valeur de l'expression à la ligne {0}
it_it: Valore dell'espressione alla riga {0}
ja_jp: 行 {0} の式の値
ko_kr: 선 {0}의 표현식 값
pl_pl: Wartość wyrażenia w wierszu {0}
pt_br: Valor da expressão na linha {0}
ru_ru: Значение выражения в строке {0}
zh_cn: 行 {0} 中的表达式值
zh_tw: 表示式在第 {0} 行的值

# InvalidInputSymbolCustomNodeWarning
source: This custom node contains an invalid input. Please fix the input before saving the custom node.
cs_cz: Tento vlastní uzel obsahuje neplatný vstup. Opravte vstup před uložením vlastního uzlu.
de_de: Dieser benutzerdefinierte Block enthält eine ungültige Eingabe. Korrigieren Sie die Eingabe vor dem Speichern des benutzerdefinierten Blocks.
es_es: Este nodo personalizado contiene una entrada no válida. Corrija la entrada antes de guardar el nodo personalizado.
fr_fr: Ce noeud personnalisé contient une entrée non valide. Corrigez l'entrée avant d'enregistrer le noeud personnalisé.
it_it: Questo nodo personalizzato contiene un input non valido. Correggere l'input prima di salvare il nodo personalizzato.
ja_jp: このカスタム ノードには無効な入力が含まれています。入力を修正してから、カスタム ノードを保存してください。
ko_kr: 이 사용자 노드에 잘못된 입력이 있습니다. 사용자 노드를 저장하기 전에 입력을 수정하십시오.
pl_pl: Ten węzeł niestandardowy zawiera niepoprawne dane wejściowe. Przed zapisaniem węzła niestandardowego popraw dane wejściowe.
pt_br: Este nó personalizado contém uma entrada inválida. Corrija a entrada antes de salvá-lo.
ru_ru: Этот пользовательский узел содержит недопустимый параметр ввода. Исправьте его перед сохранением пользовательского узла.
zh_cn: 此自定义节点中包含无效输入。请修复此输入，然后再保存自定义节点。
zh_tw: 此自訂節點包含無效的輸入。請先修正輸入後再儲存自訂節點。

# InvalidInputSymbolErrorMessage
source: This input symbol is not currently valid, and cannot be saved until it is fixed. Valid inputs take the form: name : type = defaultValue The input name should be a valid variable name, without spaces. An input type and default value are optional.
cs_cz: Tento vstup symbolu aktuálně není platný a nelze jej uložit, dokud nebude opraven. Platné vstupní hodnoty jsou: název : typ = výchozíHodnota Název musí být platným názvem proměnné bez mezer. Typ vstupu a výchozí hodnota jsou volitelné.
de_de: Dieses Eingabesymbol ist derzeit nicht gültig und kann nicht gespeichert werden, bis es korrigiert wurde. Gültige Eingaben haben folgende Form: Name : Typ = Vorgabewert Der Eingabename muss ein gültiger Variablenname ohne Leerzeichen sein. Eingabetyp und Vorgabewert sind optional.
es_es: Este símbolo de entrada no es válido actualmente y no se puede guardar hasta que se haya corregido. Las entradas válidas presentan la forma: nombre : tipo = valorPorDefecto El nombre de entrada debe ser un nombre de variable válido, sin espacios. Un tipo de entrada y un valor predeterminado son opcionales.
fr_fr: Ce symbole d'entrée n'est actuellement pas valide et ne peut pas être enregistré tant qu'il n'a pas été corrigé. Exemple d'entrées valides: nom: type = valeurDéfaut Le nom d'entrée doit être un nom de variable valide, sans espace. Le type d'entrée et la valeur par défaut sont facultatifs.
it_it: Questo simbolo di input non è valido e non può essere salvato finché non è stato corretto. Gli input validi hanno il formato: nome : tipo = Valoredefault Il nome dell'input deve essere un nome di variabile valido, senza spazi. Il tipo di input e il valore di default sono opzionali.
ja_jp: この入力シンボルは現在有効でないため、修正されるまで保存できません。有効な入力は次の形式です: 名前 : タイプ = 既定値 入力名は、スペースを含まない有効な変数名にする必要があります。入力タイプと既定値は省略可能です。
ko_kr: 현재 이 입력 기호가 잘못되었으며, 수정해야 저장할 수 있습니다. 유효한 입력 형식은 다음과 같습니다. 이름: 유형 = 기본값 입력 이름은 공백이 없는 유효한 변수 이름이어야 합니다. 입력 유형과 기본 값은 선택 사항입니다.
pl_pl: Ten symbol wejściowy nie jest obecnie poprawny i nie można go zapisać, dopóki nie zostanie poprawiony. Poprawne dane wejściowe mają postać: nazwa : typ = wartość_domyślna Nazwa danych wejściowych powinna być poprawną nazwą zmiennej, bez odstępów. Typ i wartość domyślna danych wejściowych są opcjonalne.
pt_br: Este símbolo de entrada não é atualmente válido e não pode ser salvo até ser corrigido. As entradas válidas devem ter o formato seguinte: nome : tipo = valor padrão O nome da entrada deve ser um nome de variável válido, sem espaços. O tipo de entrada e o valor padrão são opcionais.
ru_ru: В настоящее время этот символ ввода является недопустимым и не может быть сохранен без исправления. Действительный параметр ввода должен иметь следующий формат: имя : тип = стандартноеЗначение Имя ввода должно быть действительным именем переменной без пробелов. Указывать тип ввода и стандартное значение необязательно.
zh_cn: 此输入符号当前无效，在修复之前无法保存。有效输入形式为: 名称 : 类型 = 默认值 输入名称应该为有效变量名称，不含空格。输入类型和默认值可选。
zh_tw: 此輸入符號目前無效，必須先修正，才能儲存。有效輸入的形式如下: 名稱 : 類型 = 預設值 輸入名稱必須是有效的變數名稱，不含空格。輸入類型與預設值是可選的。

# InvalidInputSymbolWarningMessage
source: This custom node currently contains some invalid inputs, and cannot be saved until the inputs are fixed. If the custom node is saved using SaveAs, the invalid inputs will revert to generic inputs. Valid inputs take the form: name : type = defaultValue The input name should be a valid variable name, without spaces. An input type and default value are optional.
cs_cz: Tento vlastní uzel aktuálně obsahuje neplatné vstupy a nelze jej uložit, dokud nebudou opraveny. Pokud bude vlastní uzel uložen pomocí příkazu ULOŽITJAKO, položky neplatných vstupů se navrátí na obecné vstupy. Platné vstupní hodnoty jsou: název : typ = výchozíHodnota Název musí být platným názvem proměnné bez mezer. Typ vstupu a výchozí hodnota jsou volitelné.
de_de: Dieser benutzerdefinierte Block beinhaltet derzeit ungültige Eingaben und kann erst gespeichert werden, wenn die Eingaben korrigiert wurden. Beim Speichern des benutzerdefinierten Blocks mit Speichern unter werden ungültige Eingaben in allgemeine Eingaben umgewandelt. Gültige Eingaben haben folgende Form: Name : Typ = Vorgabewert Der Eingabename muss ein gültiger Variablenname ohne Leerzeichen sein. Eingabetyp und Vorgabewert sind optional.
es_es: Este nodo personalizado contiene actualmente algunas entradas no válidas y no se puede guardar hasta que se hayan corregido las entradas. Si el nodo personalizado se guarda mediante GuardarComo, las entradas no válidas se restablecerán como entradas genéricas. Las entradas válidas presentan la forma: nombre : tipo = valorPorDefecto El nombre de entrada debe ser un nombre de variable válido, sin espacios. Un tipo de entrada y un valor predeterminado son opcionales.
fr_fr: Ce noeud personnalisé contient actuellement certaines entrées non valides et ne peut pas être enregistré tant que les entrées ne sont pas corrigées. Si le noeud personnalisé est enregistré via Enregistrer sous, les entrées non valides sont remplacées par les entrées génériques. Exemple d'entrées valides: nom: type = valeurDéfaut Le nom d'entrée doit être un nom de variable valide, sans espace. Le type d'entrée et la valeur par défaut sont facultatifs.
it_it: Questo nodo personalizzato attualmente contiene alcuni input non validi e non può essere salvato finché gli input non stati corretti. Se il nodo personalizzato viene salvato utilizzando Salva con nome, gli input non validi torneranno ad essere input generici. Gli input validi hanno il formato: nome : tipo = Valoredefault Il nome dell'input deve essere un nome di variabile valido, senza spazi. Il tipo di input e il valore di default sono opzionali.
ja_jp: このカスタム ノードには、一部の無効な入力が現在含まれているため、入力が修正されるまで保存できません。[名前を付けて保存]を使用してカスタム ノードを保存した場合、無効な入力は一般的な入力値に戻ります。有効な入力は次の形式になります: 名前 : タイプ = 既定値 入力名は、スペースを含まない有効な変数名にする必要があります。入力タイプと既定値は省略可能です。
ko_kr: 현재 이 사용자 노드에 잘못된 입력이 몇 개 있으며, 입력을 수정해야 사용자 노드를 저장할 수 있습니다. 사용자 노드가 "다른 이름으로 저장"을 사용하여 저장된 경우 잘못된 입력이 일반 입력으로 되돌아갑니다. 유효한 입력 형식은 다음과 같습니다. 이름: 유형 = 기본값 입력 이름은 공백이 없는 유효한 변수 이름이어야 합니다. 입력 유형과 기본 값은 선택 사항입니다.
pl_pl: Ten węzeł niestandardowy zawiera obecnie pewne niepoprawne dane wejściowe i nie można go zapisać, dopóki dane wejściowe nie zostaną poprawione. W razie zapisania węzła niestandardowego za pomocą opcji „Zapisz jako” niepoprawne dane wejściowe zostaną zmienione na ogólne dane wejściowe. Poprawne dane wejściowe mają postać: nazwa : typ = wartość_domyślna Nazwa danych wejściowych powinna być poprawną nazwą zmiennej, bez odstępów. Typ i wartość domyślna danych wejściowych są opcjonalne.
pt_br: Este nó personalizado atualmente contém algumas entradas inválidas e não pode ser salvo até que as entradas sejam corrigidas. Se o nó personalizado for salvo usando Salvar como, as entradas inválidas serão revertidas para entradas genéricas. As entradas válidas devem ter o formato seguinte: nome : tipo = valor padrão O nome da entrada deve ser um nome de variável válido, sem espaços. O tipo de entrada e o valor padrão são opcionais.
ru_ru: В настоящее время этот пользовательский узел содержит несколько недопустимых параметров ввода и не может быть сохранен, пока они не будут исправлены. Если пользовательский узел сохраняется с помощью функции «Сохранить как», недопустимые параметры ввода будут преобразованы в родовые параметры. Действительный параметр ввода должен иметь следующий формат: имя : тип = стандартноеЗначение Имя ввода должно быть действительным именем переменной без пробелов. Указывать тип ввода и стандартное значение необязательно.
zh_cn: 此自定义节点中当前包含一些无效输入，并且在输入得到修复之前无法保存。如果使用“另存为”保存该自定义节点，则无效输入将恢复为通用输入。有效输入形式为: 名称 : 类型 = 默认值 输入名称应该为有效变量名称，不含空格。输入类型和默认值可选。
zh_tw: 此自訂節點目前包含某些無效的輸入，必須先修正輸入才能儲存。如果使用「另存」儲存自訂節點，無效的輸入將會轉換為一般輸入。有效輸入的形式如下: 名稱 : 類型 = 預設值 輸入名稱必須是有效的變數名稱，不含空格。輸入類型與預設值是可選的。

# InvalidInputSymbolWarningShortMessage
source: This custom node cannot be saved until invalid inputs are removed or fixed.
cs_cz: Tento vlastní uzel nelze uložit, dokud nebudou neplatné vstupy odebrány nebo opraveny.
de_de: Dieser benutzerdefinierte Block kann erst gespeichert werden, wenn die ungültigen Eingaben entfernt oder korrigiert wurden.
es_es: Este nodo personalizado no se puede guardar hasta que se eliminen o se corrijan las entradas no válidas.
fr_fr: Impossible d'enregistrer ce noeud personnalisé tant que les entrées non valides n'ont pas été enlevées ou corrigées.
it_it: Questo nodo personalizzato non può essere salvato finché gli input non validi non sono stati rimossi o corretti.
ja_jp: このカスタム ノードは無効な入力が削除または修正されるまで保存できません。
ko_kr: 잘못된 입력을 제거하거나 수정해야 이 사용자 노드를 저장할 수 있습니다.
pl_pl: Nie można zapisać tego węzła, dopóki niepoprawne dane wejściowe nie zostaną usunięte lub poprawione.
pt_br: Este nó personalizado não pode ser salvo até que as entradas inválidas sejam removidas ou corrigidas.
ru_ru: Этот пользовательский узел не может быть сохранен, пока недопустимые параметры ввода не будут удалены или исправлены.
zh_cn: 在删除或修复无效输入之前，无法保存此自定义节点。
zh_tw: 必須先移除或修正無效的輸入，才能儲存此自訂節點。

# InvalidInputSymbolWarningTitle
source: Custom Node Contains Invalid Inputs and Cannot Be Saved.
cs_cz: Vlastní uzel obsahuje neplatné vstupy a nelze jej uložit.
de_de: Benutzerdefinierter Block enthält ungültige Eingaben und kann nicht gespeichert werden.
es_es: El nodo personalizado contiene entradas no válidas y no se puede guardar.
fr_fr: Le noeud personnalisé contient des entrées non valides et ne peut pas être enregistré.
it_it: Il nodo personalizzato contiene input non validi e non può essere salvato.
ja_jp: カスタム ノードに無効な入力が含まれているため、保存できません。
ko_kr: 사용자 노드에 잘못된 입력이 있어 저장할 수 없습니다.
pl_pl: Węzeł niestandardowy zawiera niepoprawne dane wejściowe i nie można go zapisać.
pt_br: O nó personalizado contém entradas inválidas e não pode ser salvo.
ru_ru: Пользовательский узел содержит недопустимые параметры ввода и не может быть сохранен.
zh_cn: 自定义节点中包含无效输入，无法保存。
zh_tw: 自訂節點包含無效的輸入，因此無法儲存。

# PythonTemplateAppData
source: Python template loaded from AppData
cs_cz: Šablona Python načtena ze složky AppData
de_de: Python-Vorlage aus AppData geladen
es_es: Plantilla de Python cargada desde AppData.
fr_fr: Template Python chargé depuis AppData
it_it: Modello Python caricato da AppData
ja_jp: AppData からロードされた Python テンプレート
ko_kr: AppData에서 로드된 Python 템플릿
pl_pl: Szablon w języku Python wczytany z AppData
pt_br: Modelo Python carregado de AppData
ru_ru: Шаблон Python загружен из AppData
zh_cn: 从 AppData 中加载的 Python 模板
zh_tw: 從 AppData 載入的 Python 樣板

# PythonTemplateDefaultFile
source: Python template set to default.
cs_cz: Šablona Python nastavena na výchozí.
de_de: Python-Vorlage als Vorgabe festgelegt.
es_es: Plantilla de Python establecida como por defecto.
fr_fr: Template Python défini par défaut.
it_it: Modello Python impostato su default.
ja_jp: 既定に設定されている Python テンプレート。
ko_kr: Python 템플릿이 기본값으로 설정되었습니다.
pl_pl: Szablon w języku Python ustawiony jako domyślny.
pt_br: Modelo Python definido como padrão.
ru_ru: В качестве шаблона Python задан файл по умолчанию.
zh_cn: Python 模板设置为默认。
zh_tw: 設定為預設的 Python 樣板。
