Repository: DynamoDS/Dynamo
Catalog: src/DynamoCore/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# PythonTemplateDefinedByHost
source: Python template set by host integrator
cs_cz: Šablona Python nastavena integrátorem hostitele
de_de: Python-Vorlage durch Basisbauteil-Integrator festgelegt
es_es: Plantilla de Python establecida por el integrador de host.
fr_fr: Template Python défini par l'intégrateur hôte
it_it: Modello Python impostato dall'integratore host
ja_jp: ホスト インテグレータによって設定された Python テンプレート
ko_kr: 호스트 통합 응용 프로그램에서 설정한 Python 템플릿 세트
pl_pl: Szablon w języku Python ustawiony przez integratora nadrzędnego
pt_br: Modelo Python definido por integrador de hospedeiros
ru_ru: Шаблон Python задан основным интегратором
zh_cn: 按主体积分器设置的 Python 模板
zh_tw: 主體整合程式設定的 Python 樣板

# PythonTemplateUserFile
source: Python template loaded from DynamoSettings.xml path
cs_cz: Šablona Python načtena z cesty souboru DynamoSettings.xml
de_de: Python-Vorlage aus dem Pfad von DynamoSettings.xml geladen
es_es: Plantilla de Python cargada desde la ruta de DynamoSettings.xml.
fr_fr: Template Python chargé depuis le chemin DynamoSettings.xml
it_it: Modello Python caricato al percorso di DynamoSettings.xml
ja_jp: DynamoSettings.xml パスからロードされた Python テンプレート
ko_kr: DynamoSettings.xml 경로에서 로드된 Python 템플릿
pl_pl: Szablon w języku Python wczytany ze ścieżki DynamoSettings.xml
pt_br: Modelo Python carregado do caminho do DynamoSettings.xml
ru_ru: Шаблон Python загружен из пути DynamoSettings.xml
zh_cn: 从 DynamoSettings.xml 路径加载的 Python 模板
zh_tw: 從 DynamoSettings.xml 路徑載入的 Python 樣板

# MessageCustomNodePackageFailedToLoad
source: {1} cannot be loaded. Installing it will conflict with one or more node definitions that already exist in {0}, which is currently loaded. To install {1}, Dynamo needs to first uninstall {0}. Restart Dynamo to complete the uninstall.
cs_cz: Položku {1} není možné načíst. Instalace této položky je v konfliktu s jednou nebo více definicemi uzlů, které již v aktuálně načtené položce {0} existují. K instalaci položky {1} potřebuje aplikace Dynamo nejprve odinstalovat položku {0}. Restartováním aplikace Dynamo dokončíte odinstalaci.
de_de: {1} kann nicht geladen werden. Die Installation führt zu Konflikten mit mindestens einer Blockdefinition, die bereits in {0} (aktuell geladen) vorhanden ist. Um {1} zu installieren, muss Dynamo zunächst {0} deinstallieren. Starten Sie Dynamo neu, um die Deinstallation abzuschließen.
es_es: {1} no se puede cargar. Su instalación entrará en conflicto con una o más definiciones de nodo que existen en {0}, que ya se ha cargado. Para instalar {1}, Dynamo debe desinstalar primero {0}. Reinicie Dynamo para completar la desinstalación.
fr_fr: Impossible de charger {1}. L'installation va entrer en conflit avec une ou plusieurs définitions de noeud qui existent déjà dans {0}, qui est en cours de chargement. Pour installer {1}, Dynamo doit d'abord désinstaller {0}. Redémarrez Dynamo pour terminer la désinstallation.
it_it: Impossibile caricare {1}. L'installazione sarà in conflitto con una o più definizioni dei nodi già esistenti in {0}, attualmente caricato. Per installare {1}, Dynamo deve prima disinstallare {0}. Per completare la disinstallazione, riavviare Dynamo.
ja_jp: {1} をロードできません。これをインストールすると、現在ロードされている {0} に既に存在する 1 つまたは複数のノードの定義と競合します。{1} をインストールするには、事前に Dynamo で {0} をアンインストールする必要があります。Dynamo を再起動してアンインストールを完了します。
ko_kr: {1}을(를) 로드할 수 없습니다. 이를 설치하면 현재 로드되어 있는 {0}에 이미 존재하는 1개 이상의 노드 정의와 충돌하게 됩니다. {1}을(를) 설치하려면 Dynamo에서 먼저 {0}을(를) 설치제거해야 합니다. 설치제거를 완료하려면 Dynamo를 재시작하십시오.
pl_pl: Nie można wczytać składnika {1}. Zainstalowanie tego składnika spowoduje konflikt z co najmniej jedną definicją węzła już istniejącą w obecnie wczytanym składniku {0}. Aby zainstalować składnik {1}, dodatek Dynamo musi najpierw odinstalować składnik {0}. Uruchom ponownie dodatek Dynamo, aby zakończyć dezinstalację.
pt_br: Não é possível carregar {1}. A instalação vai conflitar com uma ou mais definições de nós que já existem em {0}, que está atualmente carregado. Para instalar {1}, o Dynamo precisa de desinstalar {0} primeiro. Reinicie o Dynamo para concluir a desinstalação.
ru_ru: Невозможно загрузить {1}. Установка приведет к конфликту с одним или несколькими определениями узлов, которые уже существуют в загруженном в данный момент пакете {0}. Для установки {1} Dynamo требуется сначала удалить {0}. Для завершения удаления перезапустите Dynamo.
zh_cn: {1} 无法加载。 安装它会与当前加载的 {0} 中已存在的一个或多个节点定义产生冲突。 要安装 {1}，Dynamo 需要先卸载 {0}。 重新启动 Dynamo 以完成卸载。
zh_tw: 無法載入 {1}。 安裝它將會與已經在 {0} (目前已載入) 的一個或多個節點定義衝突。 若要安裝 {1}，Dynamo 必須先解除安裝 {0}。 請重新啟動 Dynamo 以完成解除安裝。

# FunctionDefinitionOverwrittenMessage
source: Attempting to load customNode {0} loaded by package {1}, but a previous definition named {2} exists with no associated package. The new customNode definition has been loaded, but Dynamo may be in an unstable state, please avoid loading multiple custom nodes with the id.
cs_cz: Byl proveden pokus o načtení položky customNode {0} načtené balíčkem {1}, existuje však předchozí definice s názvem {2} bez asociovaného balíčku. Nová definice položky customNode byla načtena, ale aplikace Dynamo se může dostat do nestabilního stavu. Vyhněte se načítání více vlastních uzlů se stejným ID.
de_de: Es wird versucht, customNode {0} (von Paket {1} geladen) zu laden, doch es ist eine zuvor erstellte Definition mit dem Namen {2} vorhanden, die keine Paketverknüpfung hat. Die neue customNode-Definition wurde geladen, doch der Dynamo-Status kann instabil sein. Vermeiden Sie es, mehrere benutzerdefinierte Blöcke für die ID zu laden.
es_es: Intentando cargar el elemento customNode {0} cargado por el paquete {1}, pero existe una definición anterior denominada {2} sin paquete asociado. Se ha cargado la nueva definición de CustomNode, pero es posible que Dynamo presente un estado inestable; evite cargar varios nodos personalizados con el ID.
fr_fr: Tentative de chargement de customNode {0} chargé par le package {1}, mais il existe une définition précédente nommée {2}, qui n'est associée à aucun package. La nouvelle définition de customNode a été chargée, mais il se peut que Dynamo soit dans un état instable. Évitez de charger plusieurs noeuds personnalisés avec cet ID.
it_it: È il corso il tentativo di caricamento di customNode {0} caricato dal pacchetto {1}, ma esiste una precedente definizione denominata {2} senza alcun pacchetto associato. La nuova definizione di customNode è stata caricata, ma Dynamo potrebbe trovarsi in uno stato instabile. Evitare di caricare più nodi personalizzati con ID.
ja_jp: パッケージ {1} によってロードされた customNode {0} をロードしようとしましたが、関連付けられたパッケージを持たない以前の定義 {2} が存在します。新しい customNode 定義はロードされましたが、Dynamo が不安定な状態になる可能性があるため、その ID で複数のカスタム ノードをロードしないようにしてください。
ko_kr: 패키지 {1}에서 로드된 customNode {0}을 로드하려고 시도하였으나 연관된 패키지가 없는, 이름이 {2}인 이전 정의가 존재합니다. 새로운 customNode 정의가 로드되었지만 Dynamo는 불안정한 상태일 수 있습니다. 해당 ID를 사용하는 여러 사용자 노드를 로드하지 마십시오.
pl_pl: Próbowano wczytać węzeł customNode {0} wczytany przez pakiet {1}, ale istnieje poprzednia definicja o nazwie {2} bez skojarzonego pakietu. Wczytano nową definicję węzła customNode, ale dodatek Dynamo może być niestabilny. Należy unikać wczytywania wielu węzłów niestandardowych o tym identyfikatorze.
pt_br: A tentar carregar o customNode {0} carregado pelo pacote {1}, mas existe uma definição anterior denominada {2} sem um pacote associado. A nova definição de customNode foi carregada, mas o Dynamo pode estar em um estado instável. Evite carregar vários nós personalizados com a ID.
ru_ru: Выполняется попытка загрузить узел customNode {0}, загруженный пакетом {1}, однако предыдущее определение с именем {2} не имеет связанного пакета. Новое определение customNode загружено, но Dynamo может работать нестабильно. Избегайте загрузки нескольких пользовательских узлов с данным идентификатором.
zh_cn: 尝试加载由软件包 {1} 加载的自定义节点 {0}，但存在与软件包无关的名为 {2} 的以前定义。新的自定义节点定义已加载，但 Dynamo 可能处于不稳定状态，请避免加载具有该 ID 的多个自定义节点。
zh_tw: 嘗試載入套件 {1} 載入的 customNode {0}，但是名為 {2} 的舊定義卻沒有相關聯的套件。新的 customNode 定義已載入，但 Dynamo 可能處於不穩定的狀態，請避免載入有該 ID 的多個自訂節點。

# Preview3DOutageTitle
source: 3D preview has been deactivated
cs_cz: 3D náhled byl deaktivován
de_de: 3D-Vorschau wurde deaktiviert
es_es: Se ha desactivado vista preliminar en 3D.
fr_fr: L'aperçu 3D a été désactivé
it_it: L'anteprima 3D è stata disattivata
ja_jp: 3D プレビューは無効になりました
ko_kr: 3D 미리보기가 비활성화됨
pl_pl: Podgląd 3D został wyłączony
pt_br: A visualização 3D foi desativada
ru_ru: 3D-просмотр отключен
zh_cn: 三维预览已停用
zh_tw: 3D 預覽已停用

# MissingXmlTagConsoleMessage
source: {0} is missing some XML documentation tags.
cs_cz: V položce {0} chybí některé tagy formátu XML.
de_de: In {0} fehlen einige XML-Dokumentations-Tags.
es_es: En {0}, faltan algunas etiquetas de documentación XML.
fr_fr: Des étiquettes de documentation XML sont manquantes dans {0}.
it_it: In {0} mancano alcuni tag della documentazione XML.
ja_jp: {0} は、いくつかの XML ドキュメントのタグが抜けています。
ko_kr: {0}에 일부 XML 문서 태그가 누락되었습니다.
pl_pl: W {0} brakuje niektórych tagów dokumentacji XML.
pt_br: {0} tem alguns identificadores de documentação XML ausentes.
ru_ru: В {0} отсутствуют некоторые марки документации XML.
zh_cn: {0} 缺少某些 XML 文档标记。
zh_tw: {0} 缺少某些 XML 文件標籤。

# FailedToHandleReadyEvent
source: Failed to call Ready() in extension:
cs_cz: Nepodařilo se volat objekt Ready() v rozšíření:
de_de: Fehler beim Aufrufen von Ready() in Erweiterung:
es_es: No se ha podido llamar a Ready() en la extensión:
fr_fr: Échec de l'appel de Ready() dans l'extension:
it_it: Impossibile chiamare Ready() nell'estensione:
ja_jp: 拡張子で Ready() の呼び出しに失敗しました:
ko_kr: 확장에서 Ready()를 호출하지 못함:
pl_pl: Wywołanie Ready() zakończyło się niepowodzeniem w rozszerzeniu:
pt_br: Falha ao chamar Ready() na extensão:
ru_ru: Не удалось вызвать событие Ready() в расширении:
zh_cn: 无法在扩展中调用 Ready():
zh_tw: 無法呼叫延伸中的 Ready():

# DuplicatedModelGuidError
source: The map already contains a model with this id, the id must be unique for the workspace that is currently being deserialized: {0}
cs_cz: Mapa již obsahuje model s tímto ID. ID musí být jedinečný v rámci pracovního prostoru, který je aktuálně deserializován: {0}
de_de: Die Karte enthält bereits ein Modell mit dieser ID. Die ID muss für den Arbeitsbereich, der derzeit deserialisiert wird, eindeutig sein: {0}
es_es: El mapa ya contiene un modelo con este ID; el ID debe ser exclusivo para el espacio de trabajo que se está deserializando actualmente: {0}
fr_fr: La carte contient déjà un modèle portant cet ID. L'ID doit être unique pour l'espace de travail qui est en cours de désérialisation: {0}
it_it: La mappa contiene già un modello con questo ID. L'ID deve essere univoco per l'area di lavoro in corso di deserializzazione: {0}
ja_jp: マップにはこの ID を持つモデルが既に含まれています。ID は現在デシリアライズされているワークスペースに対して一意である必要があります: {0}
ko_kr: 맵에 이 ID를 가진 모델이 이미 포함되어 있습니다. ID({0})는 현재 역직렬화되고 있는 작업공간에 대해 고유해야 합니다.
pl_pl: Mapa zawiera już model o tym identyfikatorze. Identyfikator musi być unikatowy dla obszaru roboczego, który jest aktualnie deserializowany: {0}
pt_br: O mapa já contém um modelo com esta ID, a ID precisa ser exclusiva para o espaço de trabalho que está sendo desserializado atualmente: {0}
ru_ru: Карта уже содержит модель с таким идентификатором. Идентификатор должен быть уникальным для рабочего пространства, которое в настоящий момент десериализуется: {0}
zh_cn: 该地图已包含具有此 ID 的模型，该 ID 对于当前正在反序列化的工作空间而言必须是唯一的: {0}
zh_tw: 貼圖已包含有此 ID 的模型，目前正被重新序列化的工作區的 ID 必須是唯一的: {0}

# ArgumentNullException
source: Value cannot be null. Parameter name: {0}
cs_cz: Hodnota nesmí být hodnotou null. Název parametru: {0}
de_de: Wert darf nicht Null sein. Parametername: {0}
es_es: El valor no puede ser nulo. Nombre de parámetro: {0}
fr_fr: La valeur ne peut pas être nulle. Nom du paramètre: {0}
it_it: Il valore non può essere null. Nome parametro: {0}
ja_jp: 値を NULL にすることはできません。 パラメータ名: {0}
ko_kr: 값은 null일 수 없습니다. 매개변수 이름: {0}
pl_pl: Wartość nie może być nieznana (null). Nazwa parametru: {0}
pt_br: O valor não pode ser nulo. Nome do parâmetro: {0}
ru_ru: Значение не может быть пустым. Имя параметра: {0}
zh_cn: 值不能为空。 参数名称: {0}
zh_tw: 值不能為空值。 參數名稱: {0}

# ModelNotFoundError
source: UpdateModelValue: Model not found
cs_cz: UpdateModelValue: Model nebyl nalezen.
de_de: UpdateModelValue: Modell nicht gefunden
es_es: UpdateModelValue: no se ha encontrado el modelo.
fr_fr: UpdateModelValue: modèle introuvable
it_it: UpdateModelValue: modello non trovato
ja_jp: UpdateModelValue: モデルが見つかりません
ko_kr: UpdateModelValue: 모델을 찾을 수 없음
pl_pl: UpdateModelValue: nie znaleziono modelu
pt_br: UpdateModelValue: modelo não encontrado
ru_ru: UpdateModelValue: модель не найдена
zh_cn: UpdateModelValue: 未找到模型
zh_tw: UpdateModelValue: 找不到模型

# PackageManagerPackageAlreadyExists
source: A package with the given name already exists.
cs_cz: Balíček s daným názvem již existuje.
de_de: Ein Paket mit diesem Namen ist bereits vorhanden.
es_es: Ya existe un paquete con el nombre especificado.
fr_fr: Un package portant ce nom existe déjà.
it_it: Esiste già un pacchetto con il nome specificato.
ja_jp: 指定した名前のパッケージは既に存在します。
ko_kr: 지정된 이름의 패키지가 이미 존재합니다.
pl_pl: Pakiet o podanej nazwie już istnieje.
pt_br: Um pacote com o nome especificado já existe.
ru_ru: Пакет с таким именем уже существует.
zh_cn: 具有给定名称的软件包已存在。
zh_tw: 具有給定名稱的套件已存在。

# PackageManagerUserIsNotAMaintainer
source: The current user, '{0}', is not a maintainer of the package '{1}'.
cs_cz: Aktuální uživatel '{0}' není hlavním aktuálním uživatelem balíčku '{1}'.
de_de: Der aktuelle Benutzer '{0}' ist kein Maintainer von Paket '{1}'.
es_es: El usuario actual, '{0}', no es el responsable del mantenimiento del paquete '{1}'.
fr_fr: L'utilisateur actuel, '{0}', n'est pas un gestionnaire du package '{1}'.
it_it: L'utente corrente '{0}' non è un gestore del pacchetto '{1}'.
ja_jp: 現在のユーザ '{0}' は、パッケージ '{1}' を保持しているユーザではありません。
ko_kr: 현재 사용자인 '{0}'은(는) 패키지 '{1}'의 유지 담당자가 아닙니다.
pl_pl: Bieżący użytkownik, „{0}”, nie jest administratorem pakietu „{1}”.
pt_br: O usuário atual, '{0}', não é um mantenedor do pacote '{1}'.
ru_ru: Текущий пользователь «{0}» не является сопроводителем пакета «{1}».
zh_cn: 当前用户“{0}”不是该软件包“{1}”的维护人员。
zh_tw: 目前使用者「{0}」不是「{1}」套件的維護者。

# DuplicatedOlderPackage
source: An older version of the package called {0} version {2} was found at {1} with version {3}. The older version has been ignored.
cs_cz: Starší verze balíčku s názvem {0} verze {2} byla nalezena v {1} s verzí {3}. Starší verze byla ignorována.
de_de: Eine ältere Version des Pakets mit dem Namen {0} Version {2} wurde unter {1} mit Version {3} gefunden. Die ältere Version wurde ignoriert.
es_es: Se ha encontrado una versión anterior del paquete con el nombre {0}, versión {2}, en {1} con la versión {3}. Se ha omitido la versión anterior.
fr_fr: Une autre version antérieure du package intitulée {0} version {2} a été trouvée dans {1} avec la version {3}. Cette version antérieure a donc été ignorée.
it_it: È stata trovata una versione precedente del pacchetto denominata {0} versione {2} in {1} con versione {3}. La versione precedente è stata ignorata.
ja_jp: {0} バージョン {2} というパッケージの古いバージョンが {1} のバージョン {3} で見つかりました。古いバージョンは無視されました。
ko_kr: {3} 버전의 {1}에서 {0} 버전 {2}(이)라는 이전 버전의 패키지를 찾았습니다. 이전 버전은 무시되었습니다.
pl_pl: Starsza wersja pakietu o nazwie {0} wersja {2} została znaleziona w {1} w wersji {3}. Starsza wersja została zignorowana.
pt_br: Uma versão mais antiga do pacote chamado {0} versão {2} foi encontrada em {1} com a versão {3}. A versão mais antiga foi ignorada.
ru_ru: Более ранняя версия пакета с именем {0} ({2}) обнаружена в {1} с версией {3}. Более ранняя версия проигнорирована.
zh_cn: 名为 {0} (版本为 {2})的软件包的旧版本已在 {1} 处找到(版本为 {3})。已忽略该旧版本。
zh_tw: 在 {1} 找到名為 {0} (版本 {2}) 之套件的較舊版本 (版本 {3})。已忽略較舊版本。

# InvalidPackageVersion
source: The version of the package called {0} found at {1} is invalid (version: "{2}"). Ignoring it.
cs_cz: Verze balíčku s názvem {0} nalezená v {1} není platná (verze: "{2}"). Bude ignorována.
de_de: Die Version des Pakets mit dem Namen {0} unter {1} ist ungültig (Version: "{2}"). Diese wird ignoriert.
es_es: La versión del paquete con el nombre {0} encontrada en {1} no es válida (versión: "{2}"). Se omitirá.
fr_fr: La version du package intitulée {0} trouvée dans {1} n'est pas valide (version: "{2}"). Elle a donc été ignorée.
it_it: La versione del pacchetto {0} trovata in {1} non è valida (versione: "{2}"). Verrà ignorata.
ja_jp: {1} で見つかった {0} というパッケージのバージョンは無効です(バージョン: "{2}")。無視します。
ko_kr: {1}에 있는 {0}(이)라는 패키지 버전이 유효하지 않습니다(버전: "{2}"). 무시합니다.
pl_pl: Wersja pakietu o nazwie {0} znaleziona w {1} jest nieprawidłowa (wersja: „{2}”). Zostanie zignorowana.
pt_br: A versão do pacote chamado {0} encontrada em {1} é inválida (versão: “{2}”). Ignorando-a.
ru_ru: Версия пакета с именем {0}, обнаруженная в {1}, является недопустимой (версия: «{2}»). Она игнорируется.
zh_cn: 名为 {0} 的软件包的版本（在 {1} 处找到）无效(版本:“{2}”)。请忽略它。
zh_tw: 在 {1} 找到名為 {0} 之套件的版本無效 (版本:「{2}」)。將忽略它。

# DuplicatedNewerPackage
source: A newer version of the package called {0} version {2} was found at {1} with version {3}. The newer version has been ignored.
cs_cz: Byla nalezena novější verze balíčku s názvem {0} verze {2} v umístění {1} s verzí {3}. Novější verze byla ignorována.
de_de: Eine neuere Version des Pakets mit dem Namen {0} Version {2} wurde unter {1} mit Version {3} gefunden. Die neuere Version wurde ignoriert.
es_es: Se ha encontrado una versión más reciente del paquete con el nombre {0}, versión {2}, en {1} con la versión {3}. Se ha omitido la versión más reciente.
fr_fr: Une autre nouvelle version du package intitulée {0} version {2} a été trouvée dans {1} avec la version {3}. Cette nouvelle version a donc été ignorée.
it_it: È stata trovata una versione più recente del pacchetto denominata {0} versione {2} in {1} con versione {3}. La versione più recente è stata ignorata.
ja_jp: {0} バージョン {2} というパッケージの新しいバージョンが {1} のバージョン {3} で見つかりました。新しいバージョンは無視されました。
ko_kr: {3} 버전의 {1}에서 {0} 버전 {2}(이)라는 최신 버전의 패키지를 찾았습니다. 최신 버전은 무시되었습니다.
pl_pl: Nowsza wersja pakietu o nazwie {0} wersja {2} została znaleziona w {1} w wersji {3}. Nowsza wersja została zignorowana.
pt_br: Uma versão mais recente do pacote chamado {0} versão {2} foi encontrada em {1} com a versão {3}. A versão mais recente foi ignorada.
ru_ru: Более поздняя версия пакета с именем {0} ({2}) обнаружена в {1} с версией {3}. Более поздняя версия проигнорирована.
zh_cn: 名为 {0} (版本为 {2})的软件包的更高版本已在 {1} 处找到(版本为 {3})。已忽略该更高版本。
zh_tw: 在 {1} 找到名為 {0} (版本 {2}) 之套件的較新版本 (版本 {3})。已忽略較新版本。

# NoneLinterDescriptorName
source: None
cs_cz: Žádný
de_de: Keine
es_es: Ninguno
fr_fr: Aucun
it_it: Nessuno
ja_jp: なし
ko_kr: 없음
pl_pl: Brak
pt_br: Nenhum
ru_ru: Нет
zh_cn: 无
zh_tw: 無

# PackageStatePendingUnload
source: Scheduled to be unloaded
cs_cz: Naplánováno k nenačtení
de_de: Geplant: Laden aufheben
es_es: Anulación de carga programada
fr_fr: Planifié pour déchargement
it_it: Pianificato per essere scaricato
ja_jp: ロード解除をスケジュール済み
ko_kr: 언로드되도록 일람표에 작성됨
pl_pl: Zaplanowano usunięcie z pamięci
pt_br: Programado para ser descarregado
ru_ru: Запланировано к выгрузке
zh_cn: 已计划卸载
zh_tw: 已排定要卸載

# PackageStateError
source: Error
cs_cz: Chyba
de_de: Fehler
fr_fr: Erreur
it_it: Errore
ja_jp: エラー
ko_kr: 오류
pl_pl: Błąd
pt_br: Erro
ru_ru: Ошибка
zh_cn: 错误
zh_tw: 錯誤

# PackageStateLoaded
source: Loaded
cs_cz: Načteno
de_de: Geladen
es_es: Cargado
fr_fr: Chargé
it_it: Caricato
ja_jp: ロード済み
ko_kr: 로드됨
pl_pl: Wczytano
pt_br: Carregado
ru_ru: Загружено
zh_cn: 已加载
zh_tw: 已載入

# PackageStateUnloaded
source: Unloaded
cs_cz: Nenačteno
de_de: Nicht geladen
es_es: No cargado
fr_fr: Déchargé
it_it: Scaricato
ja_jp: ロード解除済み
ko_kr: 언로드됨
pl_pl: Usunięto z pamięci
pt_br: Descarregado
ru_ru: Выгружено
zh_cn: 已卸载
zh_tw: 已卸載

# PackageStatePendingUnloadTooltip
source: Scheduled to be unloaded. This package will be unloaded after the next Dynamo restart.
cs_cz: Naplánováno k nenačtení. Po dalším restartování aplikace Dynamo bude tento balíček ve stavu nenačteno.
de_de: Geplant: Laden aufheben. Dieses Paket wird nach dem nächsten Neustart von Dynamo nicht mehr geladen.
es_es: Anulación de carga programada. Este paquete no se cargará después de reiniciar Dynamo.
fr_fr: Planifié pour déchargement. Ce package sera déchargé après le prochain redémarrage de Dynamo.
it_it: Pianificato per essere scaricato. Questo pacchetto verrà scaricato dopo il successivo riavvio di Dynamo.
ja_jp: ロード解除をスケジュール済み。 このパッケージは、次回 Dynamo を再起動した後にロード解除されます。
ko_kr: 언로드되도록 일람표에 작성되어 있습니다. 이 패키지는 다음번에 Dynamo를 다시 시작하면 언로드됩니다.
pl_pl: Zaplanowano usunięcie z pamięci. Ten pakiet zostanie usunięty z pamięci przy kolejnym uruchomieniu dodatku Dynamo.
pt_br: Programado para ser descarregado. Esse pacote será descarregado após o próximo reinício do Dynamo.
ru_ru: Запланировано к выгрузке. Этот пакет будет выгружен после перезапуска Dynamo.
zh_cn: 已计划卸载。 此软件包将在下次 Dynamo 重新启动后卸载。
zh_tw: 已排定要卸載。 下次重新啟動 Dynamo 後，將卸載此套件。

# PackageStateErrorTooltip
source: Unloaded. This package has not been loaded due to an unexpected error.
cs_cz: Nenačteno. Tento balíček nebyl načten z důvodu neočekávané chyby.
de_de: Nicht geladen. Dieses Paket wurde aufgrund eines unerwarteten Fehlers nicht geladen.
es_es: No cargado. Este paquete no se ha cargado debido a un error inesperado.
fr_fr: Déchargé. Ce package n'a pas été chargé en raison d'une erreur inattendue.
it_it: Scaricato. Il pacchetto non è stato caricato a causa di un errore imprevisto.
ja_jp: エラー。 予期しないエラーにより、このパッケージはロードされませんでした。
ko_kr: 언로드되었습니다. 이 패키지는 예기치 않은 오류로 인해 로드되지 않았습니다.
pl_pl: Usunięto z pamięci. Ten pakiet nie został wczytany z powodu nieoczekiwanego błędu.
pt_br: Descarregado. Esse pacote não foi carregado devido a um erro inesperado.
ru_ru: Выгружено. Этот пакет не был загружен из-за непредвиденной ошибки.
zh_cn: 已卸载。 由于出现意外错误，尚未加载此软件包。
zh_tw: 已卸載。 由於發生未預期的錯誤，未載入此套件。

# PackageStateLoadedTooltip
source: Loaded. This package is loaded and ready to be used.
cs_cz: Načteno. Tento balíček je načten a připraven k použití.
de_de: Geladen. Dieses Paket ist geladen und kann verwendet werden.
es_es: Cargado. Este paquete se ha cargado y está listo para su uso.
fr_fr: Chargé. Ce package est chargé et prêt à être utilisé.
it_it: Caricato. Questo pacchetto viene caricato ed è pronto per essere utilizzato.
ja_jp: ロード済み。 このパッケージはロードされており、準備が完了しています。
ko_kr: 로드되었습니다. 이 패키지가 로드되어 사용할 준비가 되었습니다.
pl_pl: Wczytano. Ten pakiet jest wczytany i gotowy do użycia.
pt_br: Carregado. Esse pacote foi carregado e está pronto para ser usado.
ru_ru: Загружено. Этот пакет загружен и готов к использованию.
zh_cn: 已加载。 此软件包已加载，可供使用。
zh_tw: 已載入。 此套件已載入且可供使用。

# PackageStateUnloadedTooltip
source: Unloaded. This package has not been loaded because another conflicting package was loaded before it.
cs_cz: Nenačteno. Tento balíček nebyl načten, protože před ním byl načten jiný konfliktní balíček.
de_de: Nicht geladen. Dieses Paket wurde nicht geladen, da zuvor ein anderes Paket geladen wurde, das einen Konflikt verursacht.
es_es: No cargado. Este paquete no se ha cargado porque otro paquete en conflicto se había cargado antes.
fr_fr: Déchargé. Ce package n'a pas été chargé, car un autre package en conflit a été chargé avant lui.
it_it: Scaricato. Il pacchetto non è stato caricato perché prima era stato caricato un altro pacchetto in conflitto.
ja_jp: ロード解除済み。 競合する別のパッケージが先にロードされたため、このパッケージはロードされませんでした。
ko_kr: 언로드되었습니다. 이전에 충돌하는 다른 패키지가 로드되었기 때문에 이 패키지가 로드되지 않았습니다.
pl_pl: Usunięto z pamięci. Ten pakiet nie został wczytany, ponieważ wcześniej wczytano inny pakiet będący z nim w konflikcie.
pt_br: Descarregado. Esse pacote não foi carregado porque outro pacote conflitante foi carregado antes dele.
ru_ru: Выгружено. Этот пакет не загружен, поскольку перед ним был загружен другой конфликтующий пакет.
zh_cn: 已卸载。 此软件包还未加载，因为在此之前加载了其他冲突的软件包。
zh_tw: 已卸載。 未載入此套件，因為在載入此套件之前先載入了另一個相衝突的套件。
