Repository: DynamoDS/Dynamo
Catalog: src/DynamoCore/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# InvalidStartOrEndOfRange
source: The start or end of a range is greater than the number of available elements in the list.
cs_cz: Začátek nebo konec rozsahu je větší než počet dostupných prvků v seznamu.
de_de: Der Anfang oder das Ende eines Bereichs ist größer ist als die Anzahl der verfügbaren Elemente in der Liste.
es_es: El inicio o el final de un rango es mayor que el número de elementos disponibles en la lista
fr_fr: Le début ou la fin d'un intervalle est supérieur au nombre d'éléments disponibles dans la liste.
it_it: L'inizio o la fine di un intervallo è maggiore del numero di elementi disponibili nell'elenco.
ja_jp: 範囲の開始または終了がリストで利用できる要素数よりも大きくなっています。
ko_kr: 범위의 시작 또는 끝이 리스트의 사용 가능한 요소 수보다 큽니다.
pl_pl: Początek lub koniec zakresu jest większy niż liczba dostępnych elementów na liście.
pt_br: O ponto inicial ou final de uma faixa é maior do que o número de elementos disponíveis na lista.
ru_ru: Начальное или конечное значение диапазона превышает число доступных элементов в списке.
zh_cn: 范围的开始或结束大于列表中可用图元的数量。
zh_tw: 範圍的開始或結束大於清單中的可用元素數目。

# MalformedHeaderPackage
source: {0} contains a package with a malformed header. Ignoring it.
cs_cz: {0} obsahuje balíček se špatně vytvořeným záhlavím. Je ignorován.
de_de: {0} enthält ein Paket mit einem fehlerhaften Header. Es wird ignoriert.
es_es: {0} contiene un paquete con un encabezamiento incorrecto. Ignorando.
fr_fr: {0} contient un package avec un en-tête au format incorrect. Il va être ignoré.
it_it: {0} contiene un pacchetto con un'intestazione errata e verrà ignorato.
ja_jp: {0} に不正なヘッダのパッケージが含まれています。これは無視されます。
ko_kr: {0}에 헤더가 잘못된 패키지가 포함되어 있습니다. 무시하는 중.
pl_pl: {0} zawiera pakiet z nieprawidłowym nagłówkiem. Ignorowanie.
pt_br: O {0} contém um pacote com um cabeçalho malformado. Ignorando.
ru_ru: {0} содержит пакет с неправильно сформированным заголовком. Игнорируется.
zh_cn: {0} 包含有问题的标题的软件包，忽略它。
zh_tw: {0} 包含一個具有錯誤標頭的套件。將忽略它。

# NoHeaderPackage
source: {0} contains a package without a header. Ignoring it.
cs_cz: {0} obsahuje balíček bez záhlaví. Je ignorován.
de_de: {0} enthält ein Paket ohne Header. Es wird ignoriert.
es_es: {0} contiene un paquete sin encabezamiento. Ignorando.
fr_fr: {0} contient un package sans en-tête. Il va être ignoré.
it_it: {0} contiene un pacchetto senza intestazione e verrà ignorato.
ja_jp: {0} にヘッダがないパッケージが含まれています。これは無視されます。
ko_kr: {0}에 헤더가 없는 패키지가 포함되어 있습니다. 무시하는 중.
pl_pl: {0} zawiera pakiet bez nagłówka. Ignorowanie.
pt_br: O {0} contém um pacote sem um cabeçalho. Ignorando.
ru_ru: {0} содержит пакет без заголовка. Игнорируется.
zh_cn: {0} 包含不带标题的软件包，忽略它。
zh_tw: {0} 包含一個沒有標頭的套件。將忽略它。

# PackageEmpty
source: The package was found to be empty and was not installed.
cs_cz: Ukázalo se, že balíček je prázdný, a nebyl nainstalován.
de_de: Das Paket ist leer und wurde nicht installiert.
es_es: Se ha detectado que el paquete está vacío y no se ha instalado
fr_fr: Le package s'est révélé être vide et n'a pas été installé.
it_it: Il pacchetto era vuoto e non è stato installato.
ja_jp: パッケージが空であったため、インストールされませんでした。
ko_kr: 패키지가 비어 있는 것으로 확인되었으며 설치되지 않았습니다.
pl_pl: Pakiet był pusty i nie został zainstalowany.
pt_br: Foi verificado que o pacote está vazio e não foi instalado.
ru_ru: Пакет оказался пустым и не был установлен.
zh_cn: 发现软件包为空，未安装。
zh_tw: 發現套件是空的且未安裝。

# PackageTooLarge
source: The package is too large! The package must be less than 15 MB!
cs_cz: Balíček je příliš velký! Balíček musí být menší než 15 MB.
de_de: Das Paket ist zu groß. Es muss kleiner als 15 MB sein.
es_es: El paquete es demasiado grande. Debe ser menor de 15 MB
fr_fr: Le package est trop volumineux. Le package doit être inférieur à 15 Mo.
it_it: Il pacchetto è troppo grande: le dimensioni non possono superare i 15 MB.
ja_jp: パッケージが大きすぎます! パッケージは 15 MB 未満にする必要があります。
ko_kr: 패키지가 너무 큽니다! 15MB보다 작아야 합니다!
pl_pl: Pakiet jest zbyt duży! Pakiet powinien być mniejszy niż 15 MB!
pt_br: O pacote é muito grande! O pacote deve ter menos do que 15 MB!
ru_ru: Пакет слишком велик! Размер данного пакета не должен превышать 15 МБ.
zh_cn: 软件包过大！软件包必须小于 15 MB！
zh_tw: 套件太大！套件必須小於 15 MB！

# PathNotRegconizableAsStableOrDailyBuild
source: The specified file path is not recognizable as a stable or a daily build
cs_cz: Určená cesta k souboru není rozpoznatelná jako stabilní nebo denní sestavení
de_de: Der angegebene Dateipfad ist nicht als stabiler oder täglicher Build erkennbar.
es_es: La ruta de archivo indicada no se reconoce como compilación estable o diaria
fr_fr: Le chemin de fichier spécifié n'est pas reconnu comme une version stable ou quotidienne
it_it: Il percorso del file specificato non è riconoscibile come riferimento stabile o come build giornaliera
ja_jp: 指定したファイル パスは、安定または毎日のビルドとして認識できません
ko_kr: 지정된 파일 경로를 안정적 빌드 또는 일일 빌드로 인식할 수 없습니다
pl_pl: Określona ścieżka pliku nie jest rozpoznawalna jako stała lub codziennie zmieniana kompilacja
pt_br: O caminho do arquivo especificado não é reconhecível como uma compilação estável ou diária
ru_ru: Указанный путь к файлу не удается распознать как стабильный или повседневно создаваемый
zh_cn: 指定文件路径不可识别为稳定或每日构建
zh_tw: 指定的檔案路徑無法辨識為穩定或每日建置

source: Range end could not be parsed.
cs_cz: Konec rozsahu nelze analyzovat.
de_de: Bereichsende konnte nicht analysiert werden.
es_es: No se ha podido analizar fin de rango.
fr_fr: La fin de l'intervalle n'a pas pu être analysée.
it_it: Impossibile analizzare la fine dell'intervallo.
ja_jp: 範囲の終了を解析できませんでした。
ko_kr: 범위 끝을 해석할 수 없습니다.
pl_pl: Koniec zakresu nie może być przetworzony.
pt_br: O final da faixa não pode ser analisado.
ru_ru: Не удалось разобрать конец диапазона.
zh_cn: 范围终点无法解析。
zh_tw: 無法剖析範圍終點。

# RangeOrApprIdentifierAlrUsed
source: Cannot use range or approx. identifier on increment field when one has already been used to specify a count.
cs_cz: Nelze použít rozsah nebo přibližný identifikátor pro pole přírůstku, když již byl použit k určení počtu.
de_de: Bereich oder ungefähre ID kann nicht für Inkrementfeld verwendet werden, wenn dies bereits für die Angabe der Anzahl verwendet wurde.
es_es: No se puede utilizar el rango o el identificador de aproximación en el campo de incremento si ya se ha utilizado uno para especificar un total.
fr_fr: Impossible d'utiliser un intervalle ou un identificateur approximatif dans le champ d'incrément lorsqu'il a déjà été utilisé pour spécifier un nombre.
it_it: Impossibile utilizzare un intervallo o un identificatore approssimato nel campo dell'incremento se un identificatore di questo tipo già stato utilizzato per specificare un conteggio.
ja_jp: 範囲や近似識別子を既に使用して数を指定している場合は、増分フィールドに範囲や近似識別子を使用できません。
ko_kr: 이미 개수를 지정하기 위해 사용된 경우 증분 필드에 범위 또는 근사 식별자를 사용할 수 없습니다.
pl_pl: Nie można użyć zakresu lub identyfikatora przybliżenia w polu przyrost, jeśli jeden został już użyty do określenia liczby.
pt_br: Não é possível utilizar o identificador de faixa ou de aproximação no campo de incremento quando um identificador já tiver sido utilizado para especificar uma contagem.
ru_ru: Невозможно использовать диапазон или приблизительный идентификатор в поле «Приращение», если он уже используется для указания количества.
zh_cn: 在已使用一个范围或近似标识指定数目时，在增量字段不再可使用。
zh_tw: 當範圍或近似識別字已用來指定計數時，無法在增量欄位上使用該範圍或近似識別字。

source: Range step could not be parsed.
cs_cz: Krok rozsahu nelze analyzovat.
de_de: Schritt für Bereich konnte nicht analysiert werden.
es_es: No se ha podido analizar paso de rango
fr_fr: Le pas d'intervalle n'a pas pu être analysé.
it_it: Impossibile analizzare l'incremento di intervallo.
ja_jp: 範囲のステップを解析できませんでした。
ko_kr: 범위 단계를 해석할 수 없습니다.
pl_pl: Nie można przetworzyć etapu zakresu.
pt_br: A etapa da faixa não pode ser analisada.
ru_ru: Не удалось разобрать шаг диапазона.
zh_cn: 无法解析距离阶梯。
zh_tw: 無法剖析範圍步驟。

# RangeValuesGreaterThanZero
source: Range values must be greater than zero.
cs_cz: Rozsah hodnot musí být větší než nula.
de_de: Werte des Bereichs müssen größer als Null sein.
es_es: Los valores de rango deben ser mayor que cero
fr_fr: Les valeurs de l'intervalle doivent être supérieures à zéro.
it_it: I valori dell'intervallo devono essere maggiori di zero.
ja_jp: 範囲の値は 0 より大きくする必要があります。
ko_kr: 범위 값은 0보다 커야 합니다.
pl_pl: Wartości zakresu muszą być większe od zera.
pt_br: Os valores da faixa devem ser maiores do que zero.
ru_ru: Значения в диапазоне должны быть больше нуля.
zh_cn: 范围值必须大于零。
zh_tw: 範圍值必須大於零。

# RequestingVersionUpdate
source: Requesting version update info...
cs_cz: Požadavek na informace o aktualizaci verze...
de_de: Info zu Versionsaktualisierung wird angefordert...
es_es: Solicitando información de actualización de versión...
fr_fr: Demande d'informations de mise à jour de version...
it_it: Richiesta informazioni di aggiornamento versione in corso...
ja_jp: バージョン更新情報を要求中...
ko_kr: 버전 업데이트 정보 요청 중...
pl_pl: Żądanie informacji o aktualizacji wersji...
pt_br: Solicitando as informações da atualização da versão...
ru_ru: Запрос данных об обновлении версии...
zh_cn: 申请版本更新信息...
zh_tw: 正在請求版本更新資訊...

# UpdateAvailable
source: Update available: {0}
cs_cz: Je k dispozici aktualizace: {0}.
de_de: Aktualisierung verfügbar: {0}
es_es: Actualización disponible: {0}
fr_fr: Mise à jour disponible: {0}
it_it: Aggiornamento disponibile: {0}
ja_jp: 更新プログラムが利用可能です: {0}
ko_kr: 사용 가능한 업데이트: {0}
pl_pl: Dostępna aktualizacja: {0}
pt_br: Atualização disponível: {0}
ru_ru: Доступно обновление: {0}
zh_cn: 更新可用: {0}
zh_tw: 可用的更新：{0}

source: Update download complete.
cs_cz: Stahování aktualizace dokončeno.
de_de: Download des Update abgeschlossen.
es_es: Descarga de actualización finalizada
fr_fr: Téléchargement de la mise à jour terminée.
it_it: Download dell'aggiornamento completato.
ja_jp: 更新プログラムのダウンロードが完了しました。
ko_kr: 업데이트 다운로드 완료.
pl_pl: Pobieranie aktualizacji zakończone.
pt_br: Download da atualização concluído.
ru_ru: Загрузка обновлений завершена.
zh_cn: 更新下载完成。
zh_tw: 更新下載完成。

# UpdateDownloadProgress
source: Update download progress: {0}%
cs_cz: Aktualizovat průběh stahování: {0} %
de_de: Fortschritt von Download des Updates: {0}%
es_es: Actualizar progreso de descarga: {0}%
fr_fr: Progression du téléchargement de la mise à jour: {0}%
it_it: Stato del download dell'aggiornamento: {0}%
ja_jp: 更新プログラムをダウンロード中: {0}%
ko_kr: 업데이트 다운로드 진행률: {0}%
pl_pl: Postęp pobierania aktualizacji: {0}%
pt_br: Andamento do download da atualização: {0}%
ru_ru: Ход загрузки обновлений: {0} %
zh_cn: 更新下载进度: {0}%
zh_tw: 更新下載進度：{0}%

source: Update download started...
cs_cz: Stahování aktualizace bylo zahájeno...
de_de: Download des Update gestartet...
es_es: Iniciada descarga de actualización...
fr_fr: Téléchargement de la mise à jour commencé...
it_it: Download dell'aggiornamento avviato...
ja_jp: 更新プログラムのダウンロードを開始しました...
ko_kr: 업데이트 다운로드 시작됨...
pl_pl: Pobieranie aktualizacji rozpoczęte...
pt_br: Download da atualização iniciado...
ru_ru: Загрузка обновлений началась...
zh_cn: 更新下载开始...
zh_tw: 已啟動更新下載...

# WorkbenchNotOpen
source: Workbench could not be opened.
cs_cz: Systém workbench nelze otevřít.
de_de: Workbench konnte nicht geöffnet werden.
es_es: Workbench no se ha podido abrir
fr_fr: Workbench n'a pas pu être ouvert.
it_it: Impossibile aprire l'area di lavoro.
ja_jp: ワークベンチを開くことができませんでした。
ko_kr: 워크벤치를 열 수 없습니다.
pl_pl: Nie można otworzyć narzędzia Workbench.
pt_br: A bancada de trabalho não pôde ser aberta.
ru_ru: Не удалось открыть инструментарий.
zh_cn: 工作台无法打开。
zh_tw: Workbench 無法開啟。

# CouldNotRepairOneNodeHoles
source: Could not repair 1-node holes
cs_cz: Nelze opravit 1uzlové díry.
de_de: Öffnungen mit 1 Block konnten nicht repariert werden.
es_es: No se ha podido reparar agujeros de un nodo
fr_fr: Impossible de réparer des trous à un noeud
it_it: Impossibile riparare vuoti di 1 nodo
ja_jp: 1 ノードの穴を修復できませんでした
ko_kr: 1-노드 구멍을 복구할 수 없습니다
pl_pl: Nie można naprawić otworów 1-węzłowych
pt_br: Não foi possível corrigir os furos de 1 nó
ru_ru: Не удалось восстановить 1-узловые отверстия
zh_cn: 无法修复单节点孔
zh_tw: 無法修復 1 節點孔

# CustomNodeCouldNotBeInitialized
source: Custom node \"{0}\" could not be initialized.
cs_cz: Uživatelský uzel \„{0}\“ nelze inicializovat.
de_de: Benutzerdefinierter Block \"{0}\" konnte nicht initialisiert werden.
es_es: El nodo personalizado \"{0}\" no se ha podido inicializar
fr_fr: Le noeud personnalisé \"{0}\" n'a pas pu être initialisé.
it_it: Impossibile inizializzare il nodo personalizzato \"{0}\".
ja_jp: カスタム ノード \"{0}\" を初期化できませんでした。
ko_kr: 사용자 노드 \"{0}\"을(를) 초기화할 수 없습니다.
pl_pl: Nie można zainicjalizować węzła niestandardowego \"{0}\".
pt_br: O nó personalizado \"{0}\" não pôde ser inicializado.
ru_ru: Не удалось инициализировать пользовательский узел \"{0}\".
zh_cn: 自定义节点 \"{0}\" 无法初始化。
zh_tw: 無法初始化自訂節點 \"{0}\"。

# FailedToGetMirrorVariable
source: Failed to get mirror for variable: {0}; reason: {1}.
cs_cz: Nepodařilo se zrcadlit proměnou: {0}; příčina: {1}.
de_de: Fehler beim Abrufen der Spiegelung für die Variable: {0}; Grund: {1}.
es_es: Error al obtener simetría de variable: {0}; motivo: {1}
fr_fr: Echec de la mise en miroir de la variable: {0}; motif: {1}.
it_it: Impossibile ottenere una copia speculare per la variabile: {0}; motivo: {1}.
ja_jp: 変数: {0} の鏡像を取得できませんでした。理由: {1}。
ko_kr: {0} 변수의 대칭을 가져오지 못했습니다(이유: {1}).
pl_pl: Nie udało się uzyskać odbicia lustrzanego dla zmiennej: {0}; przyczyna: {1}.
pt_br: Falha ao obter a simetria para variável: {0}; motivo: {1}.
ru_ru: Не удалось получить зеркальное отражение для переменной: {0}; причина: {1}.
zh_cn: 无法获取变量 ({0}) 的镜像；原因: {1}。
zh_tw: 無法取得變數的鏡射：{0}；原因：{1}。

# FailedToLoadType
source: Failed to load type from {0}. The type was {1}.
cs_cz: Nepodařilo se načíst typ z {0}. Typ byl {1}.
de_de: Typ konnte nicht geladen werden aus {0}. Der Typ war {1}.
es_es: Error al cargar tipo de {0}. El tipo era {1}.
fr_fr: Impossible de charger le type de {0}. Le type était {1}.
it_it: Impossibile caricare il tipo da {0}. Il tipo era {1}.
ja_jp: {0} からタイプをロードできませんでした。タイプは {1} でした。
ko_kr: {0}에서 유형을 로드하지 못했습니다. 유형은 {1}이었습니다.
pl_pl: Nie udało się wczytać typu z {0}. Typ był {1}.
pt_br: Falha ao carregar o tipo a partir de {0}. O tipo era {1}.
ru_ru: Не удалось загрузить тип из {0}. Тип был {1}.
zh_cn: 无法从 {0} 加载类型。类型是 {1}。
zh_tw: 無法 {0} 載入類型從。類型為 {1}。

# OpenWorkspaceError
source: There was an error opening the workspace.
cs_cz: Nastala chyba při otevírání pracovního prostoru.
de_de: Beim Öffnen des Arbeitsbereichs ist ein Fehler aufgetreten.
es_es: Error al abrir el espacio de trabajo
fr_fr: Erreur d'ouverture de l'espace de travail.
it_it: Si è verificato un errore durante l'apertura dell'area di lavoro.
ja_jp: ワークスペースを開くときにエラーが発生しました。
ko_kr: 작업공간을 여는 중에 오류가 발생했습니다.
pl_pl: Wystąpił błąd podczas otwierania obszaru roboczego.
pt_br: Ocorreu um erro ao abrir o espaço de trabalho.
ru_ru: Ошибка при открытии рабочего пространства.
zh_cn: 打开工作空间时出错。
zh_tw: 開啟工作區時發生錯誤。

# UnableToCreateCustomNodeID
source: Unable to create instance of custom node with id: \"
cs_cz: Nelze vytvořit instanci vlastního uzlu s ID: \".
de_de: Instanz des benutzerdefinierten Blocks mit ID \" kann nicht erstellt werden.
es_es: No se puede crear ejemplar de nodo personalizado con ID: \"
fr_fr: Impossible de créer l'occurrence de noeud personnalisé avec l'ID: \"
it_it: Impossibile creare un'istanza del nodo personalizzato con ID: \"
ja_jp: 次の ID を持つカスタム ノードのインスタンスを作成できません。
ko_kr: 다음 ID로 사용자 노드의 인스턴스(instance)를 만들 수 없습니다. \"
pl_pl: Nie można utworzyć wystąpienia węzła niestandardowego z identyfikatorem: \"
pt_br: Não é possível criar a instância do nó personalizado com a ID: \"
ru_ru: Не удалось создать экземпляр пользовательского узла с идентификатором: \"
zh_cn: 无法创建自定义节点 (ID: \") 的实例
zh_tw: 無法建立自訂節點的例證，ID 為：\"

# BackUpOriginalFileMessage
source: Original file '{0}' gets backed up at '{1}'
cs_cz: Původní soubor „{0}“ se zálohuje v „{1}“.
de_de: Ursprüngliche Datei '{0}' wird gesichert unter '{1}'.
es_es: Copia de seguridad del archivo original '{0}' realizada en '{1}'
fr_fr: Le fichier d'origine, '{0}', est sauvegardé sous '{1}'.
it_it: Il backup del file originale '{0}' viene eseguito in '{1}'
ja_jp: 元のファイル '{0}' を '{1}' にバックアップします
ko_kr: '{1}'에 원본 파일 '{0}'이(가) 백업됩니다
pl_pl: Dla oryginalnego pliku '{0}' tworzona jest kopia zapasowa w '{1}'
pt_br: O arquivo original '{0}' tem seu backup feito em '{1}'
ru_ru: Для исходного файла '{0}' создается резервная копия в '{1}'
zh_cn: 原始文件 '{0}' 在 '{1}' 处进行备份
zh_tw: 原始檔案 '{0}' 已備份在 '{1}'

source: Clearing workspace...
cs_cz: Mazání pracovního prostoru...
de_de: Arbeitsbereich wird geleert...
es_es: Anulando selección de espacio de trabajo...
fr_fr: Effacement de l'espace de travail...
it_it: Cancellazione dell'area di lavoro in corso...
ja_jp: ワークスペースをクリア中...
ko_kr: 작업공간 지우는 중...
pl_pl: Czyszczenie obszaru roboczego...
pt_br: Limpando o espaço de trabalho...
ru_ru: Очистка рабочего пространства...
zh_cn: 正在清除工作空间...
zh_tw: 正在清除工作區...

# CodeBlockDescription
source: Allows for DesignScript code to be authored directly
cs_cz: Umožňuje přímé vytváření kódu DesignScript.
de_de: Ermöglicht die direkte Erstellung von DesignScript-Code.
es_es: Permite creación directa de código de DesignScript
fr_fr: Permet de créer le code DesignScript directement
it_it: Consente la creazione diretta di codice DesignScript
ja_jp: DesignScript のコードを直接作成することができます。
ko_kr: DesignScript 코드를 직접 작성할 수 있습니다
pl_pl: Umożliwia bezpośrednie utworzenie kodu DesignScript.
pt_br: Permite que o código DesignScript seja criado diretamente
ru_ru: Обеспечивает возможность непосредственного авторства кода DesignScript
zh_cn: 允许直接编写 DesignScript 代码
zh_tw: 允許直接編寫 DesignScript 程式碼

# DownloadLatestButton
source: Download latest version
cs_cz: Stáhněte si nejnovější verzi.
de_de: Aktuelle Version herunterladen
es_es: Descargar versión más reciente
fr_fr: Télécharger la dernière version
it_it: Scarica la versione più recente
ja_jp: 最新バージョンをダウンロード
ko_kr: 최신 버전 다운로드
pl_pl: Pobierz najnowszą wersję
pt_br: Download da versão mais recente
ru_ru: Загрузить последнюю версию
zh_cn: 下载最新版本
zh_tw: 下載最新版本

# DuplicateMigrationTypeRegistered
source: Duplicate migration type registered for {0}
cs_cz: Duplicitní typ migrace zjištěn pro {0}.
de_de: Doppelter Migrationstyp registriert für {0}
es_es: Tipo de migración duplicada registrada para {0}
fr_fr: Dupliquer le type de migration enregistré pour {0}
it_it: Tipo di migrazione duplicato registrato per {0}
ja_jp: {0} に登録されている移行タイプを複製
ko_kr: {0}에 중복된 마이그레이션 유형 등록됨
pl_pl: Powielony typ migracji zarejestrowany dla {0}
pt_br: Duplicar o tipo de migração registrado para {0}
ru_ru: Зарегистрирован повторяющийся тип переноса для {0}
zh_cn: 复制为 {0} 注册的移植类型
zh_tw: 已對 {0} 註冊重複移轉類型

# FileCannotBeOpened
source: Your file cannot be opened.
cs_cz: Soubor nelze otevřít.
de_de: Die Datei kann nicht geöffnet werden.
es_es: El archivo no se puede abrir
fr_fr: Le fichier ne peut pas être ouvert.
it_it: Impossibile aprire il file.
ja_jp: ファイルを開くことができません。
ko_kr: 파일을 열 수 없습니다.
pl_pl: Nie można otworzyć pliku.
pt_br: Seu arquivo não pode ser aberto.
ru_ru: Не удается открыть файл.
zh_cn: 文件无法打开。
zh_tw: 無法開啟您的檔案。

# FutureFileDescription
source: Your file '{0}' was created in future version '{1}' and may not open correctly in your installed version of Dynamo '{2}'
cs_cz: Váš soubor „{0}“ byl vytvořen v budoucí verzi „{1}“ a nemusí se správně spouštět v nainstalované verzi aplikace Dynamo „{2}“.
de_de: Die Datei '{0}' wurde in der späteren Version '{1}' erstellt und kann eventuell in der bei Ihnen installierten Version Dynamo '{2}' nicht ordnungsgemäß geöffnet werden.
es_es: El archivo '{0}' se ha creado en la versión posterior '{1}' y quizá no se pueda abrir en su versión instalada de Dynamo '{2}'
fr_fr: Le fichier "{0}" a été créé dans une version ultérieure ('{1}') et risque de ne pas s'ouvrir correctement dans la version installée de Dynamo ('{2}')
it_it: Il file '{0}' è stato creato nella versione successiva '{1}' e potrebbe non essere aperto correttamente nella versione di Dynamo installata ({2})
ja_jp: ファイル '{0}' は新しいバージョン '{1}' で作成されており、インストールされているバージョンの Dynamo '{2}' では正しく開くことができない場合があります
ko_kr: '{0}' 파일은 이후 버전 '{1}'에서 작성되어 현재 설치된 Dynamo '{2}' 버전에서는 올바로 열리지 않을 수도 있습니다
pl_pl: Plik '{0}' został utworzony w nowszej wersji '{1}' i może nie zostać otwarty poprawnie w zainstalowanej wersji dodatku Dynamo '{2}'
pt_br: O arquivo '{0}' foi criado em uma versão futura '{1}' e não pode ser aberto corretamente em sua versão instalada do Dynamo '{2}'
ru_ru: Файл '{0}' был создан в более поздней версии '{1}', и в установленной версии Dynamo '{2}' он может открываться с ошибками
zh_cn: 未来版本 '{1}' 中创建了文件 '{0}'，该文件在安装的 Dynamo 版本 '{2}' 中可能无法正确打开
zh_tw: 檔案 '{0}' 已建立在未來版本 '{1}' 中，而且可能無法在安裝的 Dynamo '{2}' 版本中正確開啟

# FutureFileSummary
source: Your file may not open correctly
cs_cz: Soubor se nemusí správně otevírat.
de_de: Die Datei wird möglicherweise nicht ordnungsgemäß geöffnet.
es_es: Es posible que el archivo no se abra correctamente
fr_fr: Votre fichier risque de ne pas s'ouvrir correctement
it_it: È possibile che il file non venga aperto correttamente
ja_jp: ファイルを正しく開くことができない場合があります
ko_kr: 파일이 올바로 열리지 않을 수도 있습니다
pl_pl: Plik może nie zostać otwarty poprawnie
pt_br: Seu arquivo pode não abrir corretamente
ru_ru: Возможно, файл откроется с ошибками
zh_cn: 您的文件可能无法正确打开
zh_tw: 您的檔案可能無法正確地開啟

# FutureFileTitle
source: Future File
cs_cz: Budoucí soubor
de_de: Zukünftige Datei
es_es: Archivo futuro
fr_fr: Futur fichier
it_it: File future
ja_jp: 今後のファイル
ko_kr: 이후의 파일
pl_pl: Przyszły plik
pt_br: Arquivo futuro
ru_ru: Будущий файл
zh_cn: 未来文件
zh_tw: 未來檔案

# GoodByeLog
source: Goodbye
cs_cz: Na shledanou
de_de: Auf Wiedersehen
es_es: Adiós
fr_fr: Au revoir
it_it: Fine
ja_jp: 終了
ko_kr: 종료
pl_pl: Do zobaczenia
pt_br: Adeus
ru_ru: Пока!
zh_cn: 再见
zh_tw: 再見

source: Invalid library format.
cs_cz: Neplatný formát knihovny.
de_de: Ungültiges Bibliotheksformat
es_es: Formato de biblioteca no válido
fr_fr: Format de bibliothèque incorrect.
it_it: Formato di libreria non valido.
ja_jp: ライブラリ形式が無効です。
ko_kr: 잘못된 라이브러리 형식.
pl_pl: Nieprawidłowy format biblioteki.
pt_br: Formato de biblioteca inválido.
ru_ru: Недопустимый формат библиотеки.
zh_cn: 库格式无效。
zh_tw: 無效的資源庫格式。

# LibraryBuildError
source: Build error for library: {0}
cs_cz: Chyba sestavení pro knihovnu: {0}
de_de: Build-Fehler für Bibliothek: {0}
es_es: Error de generación de biblioteca: {0}
fr_fr: Erreur de création pour la bibliothèque: {0}
it_it: Errore di compilazione della libreria: {0}
ja_jp: ライブラリの作成エラー: {0}
ko_kr: {0} 라이브러리 작성 오류
pl_pl: Błąd kompilacji dla biblioteki: {0}
pt_br: Erro de geração da biblioteca: {0}
ru_ru: Ошибка сборки в библиотеке: {0}
zh_cn: 库的生成错误: {0}
zh_tw: 資源庫的建置錯誤：{0}

# LibraryHasBeenLoaded
source: Library {0} has been loaded.
cs_cz: Knihovna {0} byla načtena.
de_de: Bibliothek {0} wurde geladen.
es_es: La biblioteca {0} se ha cargado
fr_fr: La bibliothèque {0} a été chargée.
it_it: La libreria {0} è stata caricata.
ja_jp: ライブラリ {0} をロードしました。
ko_kr: {0} 라이브러리가 로드되었습니다.
pl_pl: Biblioteka {0} została wczytana.
pt_br: A biblioteca {0} foi carregada.
ru_ru: Библиотека {0} загружена.
zh_cn: 库 {0} 已加载。
zh_tw: 已載入資源庫 {0}。

# LibraryIsDumped
source: Library is dumped to \"{0}\".
cs_cz: Knihovna je vypsána do \„{0}\“.
de_de: Bibliothek wird ausgegeben unter \"{0}\".
es_es: La biblioteca se ha descargado en \"{0}\"
fr_fr: La bibliothèque est envoyée vers \"{0}\".
it_it: La libreria viene scaricata in \"{0}\".
ja_jp: ライブラリは \"{0}\" にダンプされます。
ko_kr: 라이브러리가 \"{0}\"(으)로 덤프되었습니다.
pl_pl: Biblioteka została zrzucona do \"{0}\".
pt_br: A biblioteca é descarregado para \"{0}\".
ru_ru: Библиотека доступна в \"{0}\".
zh_cn: 将库转储到 \"{0}\"。
zh_tw: 資源庫已傾印到 \"{0}\"。
