Repository: DynamoDS/Dynamo
Catalog: src/DynamoCore/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

source: Unhandled exception in Dynamo engine
cs_cz: Neošetřená výjimka v systému aplikaci Dynamo
de_de: Nicht behandelter Ausnahmefehler in Dynamo-Engine
es_es: Excepción sin gestionar en motor de Dynamo
fr_fr: Exception non gérée dans le moteur Dynamo
it_it: Eccezione non gestita nel nucleo Dynamo
ja_jp: Dynamo エンジンで未処理の例外が発生しました
ko_kr: Dynamo 엔진에서 처리되지 않은 예외 발생
pl_pl: Nieobsługiwany wyjątek w dodatku Dynamo
pt_br: Ocorreu uma exceção não tratada no mecanismo do Dynamo
ru_ru: Необрабатываемое исключение в движке Dynamo
zh_cn: Dynamo 引擎中未处理的异常
zh_tw: Dynamo 引擎中未處理的異常狀況

# UsageReportingErrorMessage
source: Uh oh... We're sorry - we tried to save your decisions, but something went wrong. The decision probably hasn't been saved. This really shouldn't have happened. Please get in touch via GitHub and send us this information. You can also try deleting [FILEPATH] and trying again. Depending on your previous choice, analytics may still be running, if you're worried about this, please consider not using Dynamo until we've got back to you to solve the problem. Sorry about that.
cs_cz: Tady něco nehraje... Je nám líto. Snažili jsme se uložit vaše rozhodnutí, ale došlo k chybě. Rozhodnutí pravděpodobně nebylo uloženo. To se nemělo stát. Kontaktujte nás přes GitHub a zašlete nám tyto informace. Můžete také zkusit odstranit [FILEPATH] a opakovat akci. Podle vašeho předchozího výběru může být nástroj analýzy stále spuštěn. Pokud z toho máte obavy, nepoužívejte aplikaci Dynamo, dokud vám nedáme vědět ohledně řešení problému. Omlouváme se za komplikace.
de_de: Entschuldigung. Wir haben versucht, Ihre Entscheidungen zu speichern, dabei ist jedoch ein Fehler aufgetreten. Die Entscheidung wurde wahrscheinlich nicht gespeichert. Zu einem solchen Fehler sollte es nicht kommen. Bitte nehmen Sie über GitHub mit uns Kontakt auf, und senden Sie uns diese Informationen. Sie können auch [DATEIPFAD] löschen und den Vorgang wiederholen. Die Analyse könnte nach wie vor aktiv sein, falls Sie zuvor eine entsprechende Auswahl getroffen haben. Falls Sie diesbezüglich Bedenken haben, sollten Sie Dynamo eventuell zunächst nicht mehr verwenden, bis wir uns mit Ihnen in Verbindung setzen, um das Problem zu beheben. Wir bitten nochmals um Entschuldigung.
es_es: Vaya... Lo lamentamos. Hemos intentado guardar sus decisiones, pero se ha producido algún problema y es probable que la decisión no se haya guardado. Esto no debería haber sucedido. Póngase en contacto mediante GitHub y envíenos esta información. También puede intentar suprimir [FILEPATH] y probar de nuevo. En función de su elección anterior, es posible que los análisis sigan en funcionamiento. Si está preocupado en este sentido, quizá sería aconsejable no utilizar Dynamo hasta que se le comunique que su problema está solucionado. Disculpe las molestias.
fr_fr: Erreur. Nous sommes désolés, nous avons essayé d'enregistrer vos choix, mais une erreur est survenue. Le choix n'a probablement pas été enregistré. Merci de nous contacter via GitHub et de nous informer de ce problème. Vous pouvez également tenter de supprimer [FILEPATH] et réessayer. En fonction de votre choix précédent, les analyses sont peut-être encore en cours d'exécution. Si cela risque de poser un problème, évitez d'utiliser Dynamo tant que nous ne sommes pas revenus vers vous. Toutes nos excuses.
it_it: Attenzione. È stato eseguito un tentativo di salvataggio, tuttavia si è verificato un errore. Il salvataggio probabilmente non è stato eseguito. Questo è un comportamento imprevisto. Inviare le informazioni relative all'operazione tramite GitHub. In alternativa, provare ad eliminare [FILEPATH] e ritentare. A seconda della scelta precedente, è possibile che l'analisi resti in esecuzione. In caso di dubbi su come procedere, evitare di utilizzare Dynamo fino a quando il problema non è stato risolto. Ci scusiamo per l'inconveniente.
ja_jp: 問題が発生しました 操作を保存しようとしたところ問題が発生しました。操作は保存されなかった可能性が高いです。これは非常に深刻な問題であるため、GitHub にご連絡いただき情報をお寄せください。 また、[FILEPATH]を削除してから、操作をもう一度実行してみてください。 直前の操作によっては、解析が引き続き実行中となっている場合があります。ご心配な場合は、問題が解決するまで Dynamo の使用をお控えください。 ご迷惑をおかけしており、大変申し訳ありません。
ko_kr: 죄송합니다. 결정을 저장하는 데 문제가 발생했습니다. 결정은 저장되지 않은 것 같습니다. 이 문제는 발생하지 않았어야 합니다. GitHub를 통해 연락하고 이 정보를 보내주십시오. [FILEPATH]을(를) 삭제하고 다시 시도해 보셔도 됩니다. 이전 선택에 따라 해석이 여전히 실행 중일 수도 있습니다. 이 문제가 염려되면 문제를 해결하는 방법을 알려드릴 때까지 Dynamo를 사용하지 마십시오. 불편을 드려 죄송합니다.
pl_pl: Problem... Przepraszamy — próbowaliśmy zapisać Twoje decyzje, ale wystąpiły problemy. Decyzja prawdopodobnie nie została zapisana. Nie powinno to było się wydarzyć. Skontaktuj się z nami przez serwis GitHub i prześlij nam te informacje. Możesz też spróbować usunąć plik [FILEPATH] i spróbować ponownie. W zależności od poprzednio dokonanego wyboru analiza może być nadal w toku. Jeśli Cię to martwi, najlepiej wstrzymaj się od korzystania z dodatku Dynamo, dopóki nie skontaktujemy się z Tobą w celu rozwiązania problemu. Przepraszamy za utrudnienia.
pt_br: Opa... Tentamos salvar suas decisões, mas algo deu errado. A decisão provavelmente não foi salva. Isso realmente não deveria ter ocorrido. Contate-nos via GitHub e nos envie essa informação. Você também pode tentar excluir [FILEPATH] e tentar novamente. Dependendo de sua escolha anterior, a análise ainda pode estar em execução. Caso você esteja preocupado com isso, considere a possibilidade de não usar o Dynamo até que nós possamos solucionar o problema. Pedimos desculpa pelo inconveniente.
ru_ru: Ох... Вот незадача — мы пытались сохранить ваши решения, но что-то пошло не так. Решение, скорее всего, не сохранилось. Это не должно было случиться. Свяжитесь с нами через GitHub и пришлите информацию об этом. Вы также можете попробовать удалить [FILEPATH] и попытаться снова. В зависимости от предыдущего выбора, аналитика, возможно, все еще работает. Если вас это беспокоит, постарайтесь не использовать Dynamo, пока мы не свяжемся с вами и не предложим решение проблемы. Нам очень жаль, что вам пришлось столкнуться с данной проблемой.
zh_cn: 糟糕... 很抱歉，我们尝试保存您的决定，但出现错误。该决定可能未保存。这种情况确实不应该发生。请 GitHub 与我们联系并发送该信息。 您也可以尝试删除 [FILEPATH]，然后重试。 根据您先前的选择，分析可能仍在运行；如果您对此仍有顾虑，请考虑停止使用 Dynamo，直到我们与您联系来解决问题为止。 对于给您带来的不便，我们深感抱歉。
zh_tw: 呃... 很抱歉 - 我們嘗試儲存您的決策，但發生錯誤。決策可能尚未儲存。不應該發生這個狀況。請透過 GitHub 與我們聯繫，並將這項資訊傳送給我們。 您也可以嘗試刪除 [FILEPATH]，然後再試一次。 視您先前的選擇而定，分析可能仍在執行，如果您擔心，請考慮先不要使用 Dynamo，直到我們為您解決問題。 對於發生這個狀況，我們深感抱歉。

source: Could not load types.
cs_cz: Nelze načíst typy.
de_de: Typen konnten nicht geladen werden.
es_es: No se ha podido cargar tipos
fr_fr: Impossible de charger les types.
it_it: Impossibile caricare i tipi.
ja_jp: タイプをロードできませんでした。
ko_kr: 유형을 로드할 수 없습니다.
pl_pl: Nie można wczytać typów.
pt_br: Não foi possível carregar os tipos.
ru_ru: Не удалось загрузить типы.
zh_cn: 无法加载类型。
zh_tw: 無法載入類型。

# CreatingConnectorError
source: ERROR : Could not create connector between {0} and {1}.
cs_cz: CHYBA: Nelze vytvořit spojku mezi {0} a {1}.
de_de: Fehler: Es konnte kein Connector zwischen {0} und {1} erstellt werden.
es_es: ERROR: no se ha podido crear conector entre {0} y {1}
fr_fr: Erreur: Impossible de créer le connecteur entre {0} et {1}.
it_it: Errore: impossibile creare un connettore tra {0} e {1}.
ja_jp: エラー: {0} と {1} との間にコネクタを作成できませんでした。
ko_kr: 오류: {0} 및 {1} 사이에 커넥터를 만들 수 없습니다.
pl_pl: BŁĄD: Nie można utworzyć łącznika między {0} i {1}.
pt_br: Erro: não foi possível criar o conector entre {0} e {1}.
ru_ru: Ошибка: не удалось создать соединение между {0} и {1}.
zh_cn: 错误: 无法在 {0} 和 {1} 之间创建连接件。
zh_tw: 錯誤: 無法在 {0} 與 {1} 之間建立連接器。

source: Dll Load Exception:
cs_cz: Výjimka načítání DLL:
de_de: Ausnahme beim Laden von DLL:
es_es: Excepción de carga de DLL:
fr_fr: Exception de chargement de la DLL:
it_it: Eccezione caricamento DLL:
ja_jp: Dll ロードの例外:
ko_kr: DLL 로드 예외:
pl_pl: Wyjątek podczas wczytywania pliku DLL:
pt_br: Exceção de carga do DLL:
ru_ru: Исключение при загрузке dll:
zh_cn: DLL 加载异常:
zh_tw: DLL 載入例外：

# ElapsedWhenLoadingXml
source: {0} elapsed for loading xml.
cs_cz: {0} uplynulo pro načítání XML.
de_de: {0} verstrichen zum Laden von XML
es_es: {0} transcurrido para cargar xml
fr_fr: {0} écoulé pour le chargement du fichier XML.
it_it: {0} trascorsi per il caricamento del file XML.
ja_jp: xml のロードに {0} が経過しました。
ko_kr: xml을 로드하는 데 {0}이(가) 경과했습니다.
pl_pl: Dotychczasowy czas wczytywania pliku XML: {0}
pt_br: {0} decorridos para carregar o xml.
ru_ru: Затрачено {0} на загрузку xml.
zh_cn: 加载 XML 已用时间 {0}。
zh_tw: 載入 XML 時經歷的 {0}。

# EvaluationCompleted
source: Evaluation completed in {0}
cs_cz: Vyhodnocení bylo dokončeno v {0}.
de_de: Auswertung abgeschlossen in {0}
es_es: Evaluación completada en {0}
fr_fr: Evaluation terminée dans {0}
it_it: Valutazione completata in {0}
ja_jp: {0} で評価が完了しました。
ko_kr: {0}에서 평가 완료됨
pl_pl: Ocena zakończona w {0}
pt_br: Avaliação concluída em {0}
ru_ru: Оценка завершена в {0}
zh_cn: 在 {0} 中评估完成
zh_tw: 已在 {0} 完成演算

# FailedToLoadHeader
source: ERROR: The header for the custom node at {0} failed to load. It will be left out of search.
cs_cz: CHYBA: Záhlaví vlastního uzlu v {0} se nepodařilo načíst. Z vyhledávání bude vynecháno.
de_de: Fehler: Die Kopfzeile für den benutzerdefinierten Block an {0} konnte nicht geladen werden. Kann nicht für die Suche berücksichtigt werden.
es_es: ERROR: no se ha podido cargar el encabezamiento del nodo personalizado en {0}. Quedará fuera de la búsqueda.
fr_fr: Erreur: échec du chargement de l'en-tête pour le noeud personnalisé sur {0}. Il sera omis de la recherche.
it_it: Errore: l'intestazione del nodo personalizzato in {0} non è stata caricata. Non verrà inclusa nella ricerca.
ja_jp: エラー: {0} のカスタム ノードのヘッダのロードに失敗しました。検索外のままとなります。
ko_kr: 오류: {0}에서 사용자 노드의 헤더가 로드되지 않았습니다. 검색 범위를 벗어납니다.
pl_pl: BŁĄD: Wczytanie nagłówka dla węzła niestandardowego nie powiodło się w {0}. Zostanie wyłączone z wyszukiwania.
pt_br: Erro: o cabeçalho do nó personalizado em {0} falhou ao carregar. Ele ficará fora da pesquisa.
ru_ru: Ошибка: не удалось загрузить заголовок для пользовательского узла в {0}. Он не будет учитываться при поиске.
zh_cn: 错误: 在 {0} 处自定义节点的标题加载失败。它将被排除在搜索之外。
zh_tw: 錯誤：{0} 中自訂節點的標頭無法載入。無法進行搜尋。

# FileBackUpLocation
source: Original file '{0}' gets backed up at '{1}'
cs_cz: Původní soubor „{0}“ se zálohuje v „{1}“.
de_de: Ursprüngliche Datei '{0}' wird gesichert unter '{1}'.
es_es: Copia de seguridad del archivo original '{0}' realizada en '{1}'
fr_fr: Le fichier d'origine, '{0}', est sauvegardé sous '{1}'.
it_it: Il backup del file originale '{0}' viene eseguito in '{1}'
ja_jp: 元のファイル '{0}' を '{1}' にバックアップします
ko_kr: '{1}'에 원본 파일 '{0}'이(가) 백업됩니다
pl_pl: Dla oryginalnego pliku '{0}' tworzona jest kopia zapasowa w '{1}'
pt_br: O arquivo original '{0}' tem seu backup feito em '{1}'
ru_ru: Для исходного файла '{0}' создается резервная копия в '{1}'
zh_cn: 原始文件 '{0}' 在 '{1}' 处进行备份
zh_tw: 原始檔案 '{0}' 已備份在 '{1}'

# LoadingNodeDefinition
source: Loading node definition for "{0}" from: {1}
cs_cz: Načítání definice uzlu pro „{0}“ z: {1}
de_de: Blockdefinition wird geladen für "{0}" aus: {1}
es_es: Cargando definición de nodo para "{0}" desde: {1}
fr_fr: Chargement de la définition de noeud pour "{0}" de: {1}
it_it: Caricamento in corso della definizione di nodo per "{0}" da: {1}
ja_jp: "{0}" のノード設定を {1} からロードしています
ko_kr: {1}에서 "{0}"에 대한 노드 정의 로드 중
pl_pl: Wczytywanie definicji węzła dla „{0}” z: {1}
pt_br: Carregar a definição do nó para "{0}" de: {1}
ru_ru: Загрузка определения узла для «{0}» из: {1}
zh_cn: 从 {1} 为 "{0}" 加载节点定义
zh_tw: 正在從下列位置載入 "{0}" 的節點定義：{1}

# NodeProblemEncountered
source: Whilst preparing to run, this node encountered a problem. Please talk to the creators of the node, and give them this message:
cs_cz: Během přípravy ke spuštění došlo v tomto uzlu k problému. Obraťte se na tvůrce uzlu a sdělte jim tuto zprávu:
de_de: Während der Vorbereitung zur Ausführung ist an diesem Block ein Problem aufgetreten. Wenden Sie sich an die Ersteller des Blocks, und übermitteln Sie ihnen die folgende Nachricht:
es_es: Al prepararse para la ejecución, este nodo ha detectado un problema. Póngase en contacto con los creadores del nodo y proporcióneles este mensaje:
fr_fr: Lors de la préparation de l'exécution, ce noeud a rencontré un problème. Veuillez contacter les créateurs du noeud et leur transmettre ce message:
it_it: Durante la preparazione dell'esecuzione si è verificato un problema nel nodo. Rivolgersi all'autore del nodo indicando il messaggio seguente:
ja_jp: 実行の準備中に、このノードで問題が発生しました。 ノードの作成者に問い合わせ、次のメッセージを伝えてください。
ko_kr: 실행을 준비하는 중 이 노드에 문제가 발생했습니다. 노드 작성자에게 알린 다음 이 메시지를 보내십시오.
pl_pl: Podczas przygotowywania do uruchomienia wystąpił problem z tym węzłem. Należy skontaktować się z autorami węzła i przekazać im tę wiadomość:
pt_br: Ao preparar para executar, este nó encontrou um problema. Converse com os criadores do nó e lhes transmita esta mensagem:
ru_ru: Во время подготовки к выполнению, в этом узле произошла ошибка. Пожалуйста, обратитесь к разработчикам узла и передайте им следующее сообщение:
zh_cn: 在准备运行时，该节点发生问题。请联系节点创建者，并告知其该消息:
zh_tw: 在準備執行時此節點發生問題。請洽詢節點建立者，並將此訊息提供給他們：

# OpeningHomeWorkspace
source: Opening home workspace {0}...
cs_cz: Spouštění domovského pracovního prostoru {0}...
de_de: Start-Arbeitsbereich {0} wird geöffnet...
es_es: Abriendo espacio de trabajo de inicio {0}...
fr_fr: Ouverture de l'espace de travail d'accueil {0}...
it_it: Apertura area di lavoro iniziale {0} in corso...
ja_jp: ホーム ワークスペース {0} を開く...
ko_kr: 홈 작업공간 {0} 여는 중...
pl_pl: Otwieranie głównego obszaru roboczego {0}...
pt_br: Abrindo o espaço de trabalho inicial {0}...
ru_ru: Открытие исходного рабочего пространства {0}...
zh_cn: 正在打开主工作空间 {0}...
zh_tw: 開啟首頁工作區 {0}...

# OpenWorkbenchError
source: There was an error opening the workbench.
cs_cz: Nastala chyba při otevírání systému workbench.
de_de: Beim Öffnen der Workbench ist ein Fehler aufgetreten.
es_es: Error al abrir Workbench
fr_fr: Erreur lors de l'ouverture de Workbench.
it_it: Errore durante l'apertura del workbench.
ja_jp: ワークベンチを開くときにエラーが発生しました。
ko_kr: 워크벤치를 여는 중에 오류가 발생했습니다.
pl_pl: Wystąpił błąd podczas otwierania narzędzia workbench.
pt_br: Ocorreu um erro ao abrir a bancada de trabalho.
ru_ru: Ошибка при открытии Workbench.
zh_cn: 打开工作台时出错。
zh_tw: 開啟 Workbench 時發生錯誤。

# BadIdentifierSyntax
source: Bad identifier syntax: "{0}"
cs_cz: Chybná syntaxe identifikátoru: „{0}“
de_de: Ungültige ID-Syntax: "{0}"
es_es: Sintaxis de identificador errónea: "{0}"
fr_fr: Syntaxe incorrecte de l'identificateur: "{0}"
it_it: Sintassi identificatore errata: "{0}"
ja_jp: 識別子の構文が間違っています: "{0}"
ko_kr: 잘못된 식별자 구문: "{0}"
pl_pl: Nieprawidłowa składnia identyfikatora: „{0}”.
pt_br: Sintaxe incorreta do identificador: "{0}"
ru_ru: Недопустимый синтаксис идентификатора: «{0}»
zh_cn: 错误的标识符语法: "{0}"
zh_tw: 不正確的識別碼語法："{0}"

# BadRangeSyntax
source: Bad range syntax: not of format \"start..end[..(increment|#count)]\"
cs_cz: Chybná syntaxe rozsahu: není ve formátu \„start..end[..(přírůstek | #počet)]\“
de_de: Ungültige Bereichssyntax: nicht im Format \"start..end[..(increment|#count)]\"
es_es: Sintaxis de rango incorrecta: no de formato \"start..end[..(increment|#count)]\"
fr_fr: Syntaxe d'intervalle incorrecte: format différent de \"start..end[..(increment|#count)]\"
it_it: Sintassi ad intervalli non valida: il formato non è \"start..end[..(increment|#count)]\"
ja_jp: 範囲の構文が間違っています: \"start..end[..(increment|#count)]\" の形式になっていません
ko_kr: 잘못된 범위 구문: \"start..end[..(increment|#count)]\" 형식이 아님
pl_pl: Zła składnia zakresu: nie w formacie \"start..end[..(increment|#count)]\"
pt_br: Sintaxe incorreta da faixa: não do formato \"start..end[..(increment|#count)]\"
ru_ru: Неверный синтаксис диапазона: не соответствует формату \"start..end[..(increment|#count)]\"
zh_cn: 错误的距离语法: 不是格式 \"起点.. 终点[..(增量| #计数)] \"
zh_tw: 不正確的範圍語法：格式不是 \"start..end[..(increment|#count)]\"

# CannotHave0Step
source: Can't have 0 step.
cs_cz: Nelze mít 0 kroků.
de_de: Schritt kann nicht 0 sein.
es_es: No puede tener paso 0
fr_fr: Ne peut pas comporter 0 pas.
it_it: Non può includere una fase 0.
ja_jp: 0 ステップは設定できません。
ko_kr: 0단계는 사용할 수 없습니다.
pl_pl: Nie może być kroku 0.
pt_br: Não é possível ter 0 etapas.
ru_ru: Шаг не может быть с нулевым значением.
zh_cn: 不能有 0 步。
zh_tw: 無法有 0 個步驟。

source: Clearing workflow...
cs_cz: Mazání pracovního postupu...
de_de: Arbeitsablauf wird gelöscht...
es_es: Creando flujo de trabajo...
fr_fr: Effacement du workflow...
it_it: Annullamento del flusso di lavoro in corso...
ja_jp: ワークフローをクリア中...
ko_kr: 워크플로우 지우는 중...
pl_pl: Usuwanie procesu roboczego...
pt_br: Desmarcando o fluxo de trabalho...
ru_ru: Очистка рабочего процесса...
zh_cn: 正在清除工作流程...
zh_tw: 正在清除工作流程...

# CouldNotCompressFile
source: Could not compress file. Is the file in use?
cs_cz: Soubor nelze komprimovat. Používá se soubor?
de_de: Datei konnte nicht komprimiert werden. Wird die Datei verwendet?
es_es: No se ha podido comprimir archivo. ¿Está en uso?
fr_fr: Impossible de compresser le fichier. Le fichier est-il en cours d'utilisation?
it_it: Impossibile comprimere il file. Il file è in uso?
ja_jp: ファイルを圧縮できませんでした。ファイルが使用中であると考えられます
ko_kr: 파일을 압축할 수 없습니다. 파일이 사용 중입니까?
pl_pl: Kompresja pliku nie powiodła się. Czy plik jest używany?
pt_br: Não é possível compactar o arquivo. O arquivo está em uso?
ru_ru: Не удалось сжать файл. Файл используется?
zh_cn: 无法压缩文件。文件是否正在使用？
zh_tw: 無法壓縮檔案。該檔案是否使用中？

# CouldNotGetLatestBuild
source: Couldn't get the latest build from S3
cs_cz: Nelze získat nejnovější verzi z S3.
de_de: Der neueste Build konnte nicht von S3 abgerufen werden.
es_es: No se ha podido obtener la última compilación de S3
fr_fr: Impossible d'obtenir la dernière version à partir de S3
it_it: Impossibile ottenere la build più recente da S3
ja_jp: S3 から最新ビルドを取得できませんでした
ko_kr: S3에서 최신 빌드를 가져올 수 없습니다
pl_pl: Nie można pobrać najnowszej kompilacji z S3
pt_br: Não foi possível obter a compilação mais recente do S3
ru_ru: Не удалось получить последнюю сборку из S3
zh_cn: 无法从 S3 获取最新版本
zh_tw: 無法取得 S3 的最新建置

# CouldNotGetUpdateData
source: Couldn't get update data from {0}
cs_cz: Nelze získat data aktualizace z {0}.
de_de: Aktualisierungsdaten konnten nicht abgerufen werden aus {0}.
es_es: No se ha podido obtener la actualización de datos de {0}
fr_fr: Impossible d'obtenir les données de mise à jour de {0}
it_it: Impossibile ottenere i dati dell'aggiornamento da {0}
ja_jp: {0} から更新データを取得できませんでした
ko_kr: {0}에서 업데이트 데이터를 가져올 수 없습니다
pl_pl: Nie można pobrać aktualizacji danych z {0}
pt_br: Não foi possível obter os dados atualizados de {0}
ru_ru: Не удалось получить данные обновлений из {0}
zh_cn: 无法从 {0} 获取更新数据
zh_tw: 無法取得 {0} 的更新資料

# DulicatedPackage
source: A duplicate of the package called {0} was found at {1}. Ignoring it.
cs_cz: Duplicitní balíček s názvem {0} byl nalezen v {1}. Je ignorován.
de_de: Ein Duplikat des Pakets mit dem Namen {0} wurde gefunden unter {1}. Dies wird ignoriert.
es_es: Un duplicado del paquete denominado {0} se ha encontrado en {1}. Ignorando.
fr_fr: Une copie du package nommée {0} a été trouvée sur {1}. Copie ignorée.
it_it: Un duplicato del pacchetto {0} rilevato in {1} verrà ignorato.
ja_jp: {0} と言う名前のパッケージが {1} で重複しています。無視します。
ko_kr: {1}에서 {0} 패키지의 사본을 찾을 수 없습니다. 무시하는 중.
pl_pl: Powielony pakiet o nazwie {0} został znaleziony w {1}. Ignorowanie.
pt_br: Uma duplicata do pacote chamada {0} foi encontrada em {1}. Ignorando a mesma.
ru_ru: Копия пакета под названием {0} найдена в {1}. Игнорируется.
zh_cn: 在 {1} 处找到名为 {0} 的数据包。忽略它。
zh_tw: 在 {1} 找到重複的套件，稱為 {0}。將忽略它。

# DynamoUpToDate
source: Dynamo is up to date.
cs_cz: Aplikaci Dynamo je aktuální.
de_de: Dynamo ist auf dem neuesten Stand.
es_es: Dynamo está actualizado
fr_fr: Dynamo est à jour.
it_it: Dynamo è aggiornato.
ja_jp: Dynamo は最新です。
ko_kr: Dynamo가 최신 버전입니다.
pl_pl: Dodatek Dynamo jest aktualne.
pt_br: O Dynamo está atualizado.
ru_ru: Dynamo не нуждается в обновлении.
zh_cn: Dynamo 已是最新版本。
zh_tw: Dynamo 是最新的。

# ExceptionEncountered
source: Exception encountered scanning the package directory at {0}
cs_cz: Došlo k výjimce při skenování adresáře s balíčkem na {0}.
de_de: Ausnahme beim Scannen des Paketverzeichnisses unter {0}
es_es: Excepción detectada al analizar el directorio de paquetes en {0}
fr_fr: Une exception est survenue lors de l'analyse du répertoire du package à l'emplacement {0}
it_it: Eccezione durante la scansione della directory del pacchetto in {0}
ja_jp: {0} のパッケージ フォルダのスキャン中に例外が発生しました
ko_kr: {0}에서 패키지 디렉토리를 스캔하는 중에 예외가 발생했습니다
pl_pl: Wystąpił wyjątek podczas skanowania spakowanego katalogu w {0}
pt_br: Exceção encontrada ao verificar o diretório do pacote {0}
ru_ru: Обнаружено исключение при сканировании пакета папку в {0}
zh_cn: 扫描软件包目录时在 {0} 处遇到的异常
zh_tw: 掃描 {0} 中的套件目錄時發現異常狀況

# FailedToLoad
source: Failed to load {0}\n, Exception: {1}
cs_cz: Nepodařilo se načíst {0}\n, výjimka: {1}
de_de: Fehler beim Laden von {0}\n, Ausnahme: {1}
es_es: Error al cargar {0}\n, Excepción: {1}
fr_fr: Echec du chargement de {0}\n, Exception: {1}
it_it: Impossibile caricare {0}\n, eccezione: {1}
ja_jp: {0} をロードできませんでした。\n例外: {1}
ko_kr: {0}을(를) 로드하지 못했습니다.\n 예외: {1}
pl_pl: Wczytanie {0}\n nie powiodło się, wyjątek: {1}
pt_br: Falha ao carregar {0}\n, exceção: {1}
ru_ru: Не удалось загрузить {0}\n, исключение: {1}
zh_cn: 无法加载 {0}\n例外情况: {1}
zh_tw: 無法載入 {0}\n，異常狀況：{1}

# FailedToLoadCustomNode
source: Failed to load custom node: {0}. Replacing with proxy custom node.
cs_cz: Nepodařilo se načíst vlastní uzel: {0}. Je nahrazen vlastním uzlem serveru proxy.
de_de: Benutzerdefinierter Block konnte nicht geladen werden: {0}. Wird durch Proxy für benutzerdefinierten Block ersetzt.
es_es: No se ha podido cargar el nodo personalizado: {0}. Reemplazando por nodo proxy personalizado
fr_fr: Echec du chargement de noeud personnalisé: {0}. Remplacement par un noeud personnalisé proxy.
it_it: Impossibile caricare il nodo personalizzato {0}. Verrà sostituito da un nodo personalizzato proxy.
ja_jp: カスタム ノード: {0} をロードできませんでした。プロキシのカスタム ノードで置き換えています。
ko_kr: 사용자 노드 {0}을(를) 로드하지 못했습니다. 프록시 사용자 노드로 대체하는 중.
pl_pl: Nie udało się wczytać węzła niestandardowego: {0}. Zastępowanie zastępczym węzłem niestandardowym.
pt_br: Falha ao carregar o nó personalizado: {0}. Substituindo pelo nó personalizado do proxy.
ru_ru: Не удалось загрузить пользовательский узел: {0}. Замена пользовательским прокси-узлом.
zh_cn: 无法加载自定义节点: {0}。替换为代理自定义节点。
zh_tw: 無法載入自訂節點：{0}。將取代為代理自訂節點。

# FailedToSave
source: Failed to save {0}\n, Exception: {1}
cs_cz: Nepodařilo se uložit {0}\n, výjimka: {1}.
de_de: Fehler beim Speichern von {0}\n, Ausnahme: {1}
es_es: Error al guardar {0}\n, Excepción: {1}
fr_fr: Echec de l'enregistrement {0}\n, Exception: {1}
it_it: Impossibile salvare {0}\n, eccezione: {1}
ja_jp: {0} を保存できませんでした。\n例外: {1}
ko_kr: {0}을(를) 저장하지 못했습니다.\n 예외: {1}
pl_pl: Nie udało się zapisać {0}\n, Wyjątek: {1},
pt_br: Falha ao salvar {0}\n, exceção: {1}
ru_ru: Не удалось сохранить {0}\n, исключение: {1}
zh_cn: 无法保存 {0}\n，例外情况: {1}
zh_tw: 無法儲存 {0}\n，異常狀況：{1}

# IdentifiersNotFound
source: No identifiers found.
cs_cz: Nebyly nalezeny žádné identifikátory.
de_de: Keine Kennungen gefunden
es_es: No se han encontrado identificadores
fr_fr: Aucun identificateur détecté.
it_it: Nessun identificatore trovato.
ja_jp: 識別子が見つかりませんでした。
ko_kr: 식별자를 찾을 수 없습니다.
pl_pl: Nie znaleziono żadnych identyfikatorów.
pt_br: Nenhum identificador encontrado.
ru_ru: Не найдены идентификаторы.
zh_cn: 未找到标识符。
zh_tw: 找不到識別碼。
