Repository: DynamoDS/Dynamo
Catalog: src/DynamoCore/Properties/Resources.*.resx
Languages: cs_cz, de_de, es_es, fr_fr, it_it, ja_jp, ko_kr, pl_pl, pt_br, ru_ru, zh_cn, zh_tw

# LibraryPathCannotBeFound
source: Cannot find library path: {0}.
cs_cz: Nelze najít cestu knihovny: {0}.
de_de: Bibliothekspfad nicht gefunden: {0}.
es_es: No se puede encontrar la ruta de biblioteca: {0}
fr_fr: Impossible de trouver le chemin de la bibliothèque: {0}.
it_it: Impossibile trovare il percorso di libreria: {0}.
ja_jp: ライブラリ パス: {0} が見つかりません。
ko_kr: 라이브러리 경로: {0}을(를) 찾을 수 없습니다.
pl_pl: Nie można znaleźć ścieżki biblioteki: {0}.
pt_br: Não é possível localizar o caminho da biblioteca: {0}.
ru_ru: Не удалось найти путь к библиотеке: {0}.
zh_cn: 无法找到库路径: {0}。
zh_tw: 找不到資源庫路徑：{0}。

# NewNoteString
source: New Note
cs_cz: Nová poznámka
de_de: Neue Anmerkung
es_es: Nueva nota
fr_fr: Nouvelle remarque
it_it: Nuova nota
ja_jp: 新規注記
ko_kr: 새 참고
pl_pl: Nowa notatka
pt_br: Nova nota
ru_ru: Создать примечание
zh_cn: 新建注释
zh_tw: 新註記

# ObsoleteFileDescription
source: Your file '{0}' of version '{1}' cannot be opened by this version of Dynamo ({2})
cs_cz: Váš soubor „{0}“ ve verzi „{1}“ nelze otevřít v této verzi aplikace Dynamo ({2}).
de_de: Die Datei '{0}' aus Version '{1}' kann in dieser Version von Dynamo ({2}) nicht geöffnet werden.
es_es: Su archivo '{0}' de la versión '{1}' no se puede abrir con esta versión de Dynamo ({2})
fr_fr: Le fichier '{0}', version '{1}', ne peut pas être ouvert par cette version de Dynamo ({2})
it_it: Impossibile aprire il file '{0}' versione '{1}' con la versione corrente di Dynamo ({2})
ja_jp: このバージョンの Dynamo ({2})では、バージョン '{1}' の ファイル '{0}' を開くことができません
ko_kr: 이 Dynamo 버전({2})으로는 버전 '{1}'의 '{0}' 파일을 열 수 없습니다
pl_pl: Plik '{0}' w wersji '{1}' nie może zostać otwarty w tej wersji dodatku Dynamo ({2})
pt_br: O arquivo '{0}' da versão '{1}' não pode ser aberto por esta versão do Dynamo ({2})
ru_ru: Файл '{0}' версии '{1}' не может быть открыт в данной версии Dynamo ({2})
zh_cn: 该版本的 Dynamo ({2}) 无法打开您 '{1}' 版本的文件 '{0}'
zh_tw: 此版本的 Dynamo ({2}) 無法開啟您的檔案 '{0}' (版本為 '{1}')

# ObsoleteFileTitle
source: Obsolete File
cs_cz: Zastaralý soubor
de_de: Veraltete Datei
es_es: Archivo obsoleto
fr_fr: Fichier obsolète
it_it: File obsoleto
ja_jp: ファイルを廃止
ko_kr: 사용되지 않는 파일
pl_pl: Nieaktualny plik
pt_br: Arquivo obsoleto
ru_ru: Файл устарел
zh_cn: 过时文件
zh_tw: 舊檔案

# OKButton
source: OK
es_es: ACEPTAR
ko_kr: 확인
zh_cn: 确定
zh_tw: 確定

# ProceedButton
source: Proceed anyway
cs_cz: Přesto pokračovat
de_de: Trotzdem fortfahren
es_es: Continuar de todos modos
fr_fr: Continuer malgré tout
it_it: Continuare
ja_jp: 続行
ko_kr: 계속 진행
pl_pl: Kontynuuj operację
pt_br: Continuar assim mesmo
ru_ru: Все равно продолжить
zh_cn: 仍然继续
zh_tw: 無論如何都要繼續嗎？

# SavingInProgress
source: Saving {0} ...
cs_cz: Ukládání {0}...
de_de: {0} wird gespeichert...
es_es: Guardando {0}...
fr_fr: {0} en cours d'enregistrement...
it_it: Salvataggio di {0} in corso...
ja_jp: {0}を保存中...
ko_kr: {0} 저장 중 ...
pl_pl: Zapisywanie {0} ...
pt_br: Salvando {0}...
ru_ru: Сохранение {0} ...
zh_cn: 正在保存 {0} ...
zh_tw: 正在儲存 {0}...

# SubmitBugButton
source: Submit Bug To Github
cs_cz: Odeslat chybu na Github
de_de: Fehler an Github senden
es_es: Enviar error a Github
fr_fr: Envoyer le bogue à GitHub
it_it: Invia bug a GitHub
ja_jp: バグを Github に送信
ko_kr: Github에 버그 제출
pl_pl: Zgłoś błąd do Github
pt_br: Enviar o bug para Github
ru_ru: Отправить ошибку в Github
zh_cn: 将错误提交至 Github
zh_tw: 將錯誤提交至 Github

# ToolTipForTempVar
source: Statement Output
cs_cz: Výstup příkazu
de_de: Anweisungsausgabe
es_es: Salida de instrucción
fr_fr: Sortie d'instruction
it_it: Output dell'istruzione
ja_jp: ステートメントの出力
ko_kr: 문 출력
pl_pl: Wynik instrukcji
pt_br: Saída da declaração
ru_ru: Вывод выражения
zh_cn: 语句输出
zh_tw: 陳述式輸出

# ToolTipReturnValue
source: return value
cs_cz: návratová hodnota
de_de: Rückgabewert
es_es: valor de retorno
fr_fr: valeur de retour
it_it: Valore di restituzione
ja_jp: 戻り値
ko_kr: 반환 값
pl_pl: wartość zwracana
pt_br: valor de retorno
ru_ru: возвращаемое значение
zh_cn: 返回值
zh_tw: 傳回值

# UnhandledExceptionSummary
source: Unhandled exception in Dynamo engine
cs_cz: Neošetřená výjimka v systému aplikaci Dynamo
de_de: Nicht behandelter Ausnahmefehler in Dynamo-Engine
es_es: Excepción sin gestionar en motor de Dynamo
fr_fr: Exception non gérée dans le moteur Dynamo
it_it: Eccezione non gestita nel nucleo Dynamo
ja_jp: Dynamo エンジンで未処理の例外が発生しました
ko_kr: Dynamo 엔진에서 처리되지 않은 예외 발생
pl_pl: Nieobsługiwany wyjątek w dodatku Dynamo
pt_br: Ocorreu uma exceção não tratada no mecanismo do Dynamo
ru_ru: Необрабатываемое исключение в движке Dynamo
zh_cn: Dynamo 引擎中未处理的异常
zh_tw: Dynamo 引擎中未處理的異常狀況

# UnhandledExceptionTitle
source: Unhandled Exception
cs_cz: Neošetřená výjimka
de_de: Nicht behandelter Ausnahmefehler
es_es: Excepción sin gestionar
fr_fr: Exception non gérée
it_it: Eccezione non gestita
ja_jp: 未処理の例外
ko_kr: 처리되지 않은 예외
pl_pl: Nieobsługiwany wyjątek
pt_br: Ocorreu uma exceção não tratada
ru_ru: Необрабатываемое исключение
zh_cn: 未处理的异常
zh_tw: 未處理的異常狀況

# UnknownVersion
source: Unknown
cs_cz: Neznámý
de_de: Unbekannt
es_es: Desconocida
fr_fr: Inconnu
it_it: Sconosciuto
ja_jp: 不明
ko_kr: 알 수 없음
pl_pl: Nieznany
pt_br: Desconhecido
ru_ru: Неизвестно
zh_cn: 未知
zh_tw: 不明

# WelcomeMessage
source: Welcome to Dynamo!
cs_cz: Vítejte v aplikaci Dynamo!
de_de: Willkommen bei Dynamo!
es_es: Bienvenido a Dynamo
fr_fr: Bienvenue dans Dynamo!
it_it: Benvenuti a Dynamo.
ja_jp: Dynamo へようこそ!
ko_kr: Dynamo에 오신 것을 환영합니다!
pl_pl: Witamy w dodatku Dynamo!
pt_br: Bem-vindo ao Dynamo!
ru_ru: Добро пожаловать в Dynamo!
zh_cn: 欢迎使用 Dynamo！
zh_tw: 歡迎使用 Dynamo！

# ToolTipFunctionOutput
source: function output
cs_cz: výstup funkce
de_de: Funktionsausgabe
es_es: salida de función
fr_fr: sortie de fonction
it_it: Output della funzione
ja_jp: 関数の出力
ko_kr: 함수 출력
pl_pl: wynik funkcji
pt_br: saída da função
ru_ru: вывод функции
zh_cn: 函数输出
zh_tw: 函數輸出

# ToolTipInput
source: Input #
cs_cz: Vstup č.
de_de: Eingabe #
es_es: Núm. de entrada
fr_fr: N° entrée
it_it: Input n.
ja_jp: 入力番号
ko_kr: 입력 #
pl_pl: Dane wejściowe #
pt_br: Nº da entrada
ru_ru: Ввод #
zh_cn: 输入 #
zh_tw: 輸入 #

# ToolTipOutput
source: Output #
cs_cz: Výstup č.
de_de: Ausgabe #
es_es: Núm. de salida
fr_fr: N° de sortie
it_it: N. output
ja_jp: 出力番号
ko_kr: 출력 #
pl_pl: Dane wyjściowe #
pt_br: Nº da saída
ru_ru: Вывод #
zh_cn: 输出 #
zh_tw: 輸出 #

# ToolTipOutputData
source: Output Data
cs_cz: Výstupní data
de_de: Ausgabedaten
es_es: Datos de salida
fr_fr: Données de sortie
it_it: Dati di output
ja_jp: 出力データ
ko_kr: 출력 데이터
pl_pl: Dane wyjściowe
pt_br: Dados de saída
ru_ru: Выходные данные
zh_cn: 输出数据
zh_tw: 輸出資料

# WarningCannotFindType
source: Cannot find type '{0}'
cs_cz: Nelze nalézt typ „{0}“.
de_de: Typ '{0}' nicht gefunden
es_es: No se puede encontrar el tipo '{0}'
fr_fr: Impossible de trouver le type '{0}'
it_it: Impossibile trovare il tipo '{0}'
ja_jp: タイプ '{0}' が見つかりません
ko_kr: '{0}' 유형을 찾을 수 없습니다
pl_pl: Nie można znaleźć typu '{0}'
pt_br: Não é possível localizar o tipo '{0}'
ru_ru: Не удалось найти тип '{0}'
zh_cn: 找不到类型 '{0}'
zh_tw: 找不到類型 '{0}'

# WarningInvalidInput
source: Invalid input. The name of parameter should start with alphabetic character. You can specify its type and default value. E.g., input : var[]..[] value: bool = false
cs_cz: Neplatné zadání. Název parametru musí začínat abecedním znakem. Můžete určit jeho typ a výchozí hodnotu. Například zadejte: var []..[] value: bool = false
de_de: Ungültige Eingabe. Der Name des Parameters muss mit einem Buchstaben beginnen. Sie können seinen Typ und Vorgabewert angeben, z. B. input : var[]..[] value: bool = false
es_es: Entrada no válida. El nombre del parámetro debe empezar por un carácter alfabético. Puede especificar su tipo y su valor por defecto. Por ejemplo, input : var[]..[] value: bool = false
fr_fr: Entrée incorrecte. Le nom du paramètre doit commencer par un caractère alphabétique. Vous pouvez spécifier le type et la valeur par défaut. Par exemple, entrée: var[]..[] valeur: bool = false
it_it: Input non valido. Il nome del parametro deve iniziare con un carattere alfabetico. È possibile specificare il tipo e il valore di default del parametro, ad esempio: input : var[]..[] value: bool = false
ja_jp: 入力が無効です。 パラメータの名前は英文字で始まる必要があります。タイプと既定値は次のように指定できます。 input : var[]..[] value: bool = false
ko_kr: 잘못된 입력. 매개변수의 이름은 알파벳 문자로 시작해야 합니다. 매개변수의 유형 및 기본값을 지정할 수 있습니다. 예: input : var[]..[] value: bool = false
pl_pl: Nieprawidłowe dane wejściowe. Nazwa parametru powinna zaczynać się od znaku alfabetycznego. Można określić jego typ i wartość domyślną. Np. input : var[]..[] value: bool = false
pt_br: Entrada inválida. O nome do parâmetro deveria começar com um caractere alfabético. Você pode especificar seu tipo e valor padrão. Por exemplo, entrada: var []...[] valor: bool = false
ru_ru: Неверный ввод. Имя параметра должно начинаться с буквы. Можно указать его тип и значение по умолчанию. Например, ввод: var[]..[] значение: bool = false
zh_cn: 输入内容无效。 参数名称应以字母字符开头。可以指定其类型和默认值。例如 ， 输入: 变量[]... [] 值: bool = false
zh_tw: 無效的輸入。 參數名稱應以字母字元開頭。 您可以指定其類型與預設值。 例如 ， 輸入：var [].. [] 值：bool = false

# DSFunctionNodeDescription
source: DesignScript Builtin Functions
cs_cz: Integrované funkce aplikace DesignScript
de_de: DesignScript Builtin-Funktionen
es_es: Funciones integradas de DesignScript
fr_fr: Fonctions intégrées DesignScript
it_it: Funzioni incorporate DesignScript
ja_jp: DesignScript 組み込み関数
ko_kr: DesignScript 내장 함수
pl_pl: Wbudowane funkcje DesignScript
pt_br: Funções incorporadas no DesignScript
ru_ru: Встроенные функции DesignScript
zh_cn: DesignScript 内置函数
zh_tw: DesignScript 內建函數

# DummyNodeDescription
source: This is an obsolete node
cs_cz: Toto je zastaralý uzel.
de_de: Dies ist ein veralteter Block
es_es: Este es un nodo obsoleto
fr_fr: Ce noeud est obsolète
it_it: Nodo obsoleto
ja_jp: これは廃止されたノードです
ko_kr: 사용되지 않는 노드입니다
pl_pl: Ten węzeł jest nieaktualny
pt_br: Este é um nó obsoleto
ru_ru: Это устаревший узел
zh_cn: 这是过时的节点
zh_tw: 這是舊型節點

# FunctionDescription
source: Instance of a Custom Node
cs_cz: Instance uživatelského uzlu
de_de: Instanz eines benutzerdefinierten Blocks
es_es: Ejemplar de nodo personalizado
fr_fr: Occurrence d'un noeud personnalisé
it_it: Istanza di un nodo personalizzato
ja_jp: カスタム ノードのインスタンス
ko_kr: 사용자 노드의 인스턴스(instance)
pl_pl: Wystąpienie węzła niestandardowego
pt_br: Instância de um nó personalizado
ru_ru: Экземпляр пользовательского узла
zh_cn: 自定义节点的实例
zh_tw: 自訂節點的例證

# SymbolNodeDescription
source: A function parameter, use with custom nodes. You can specify the type and default value for parameter. E.g., input : var[]..[] value : bool = false
cs_cz: Parametr funkce. Použijte s vlastními uzly. Můžete zadat typ a výchozí hodnotu parametru. Například zadejte: var[]..[] hodnota: bool = False
de_de: Ein Funktionsparameter zur Verwendung mit benutzerdefinierten Blöcken. Sie können den Typ und den Vorgabewert für den Parameter angeben, z. B. input : var[]..[] value : bool = false
es_es: Un parámetro de función, utilícelo con nodos personalizados. Puede especificar el tipo y el valor por defecto del parámetro. Por ejemplo, input : var[]..[] value : bool = false
fr_fr: Un paramètre de fonction, utiliser avec des noeuds personnalisés. Vous pouvez spécifier le type et la valeur par défaut du paramètre. Par exemple, entrée: var[]..[] valeur: bool = false
it_it: Parametro funzione, da utilizzare con nodi personalizzati. È possibile specificare il tipo e il valore di default del parametro. Esempio: input : var[]..[] value : bool = false
ja_jp: 関数パラメータ: カスタムノードで使用。 パラメータのタイプと既定値を指定できます。例: input : var[]..[] value : bool = false
ko_kr: 기능 매개변수로, 사용자 노드와 함께 사용합니다. 유형 및 매개변수의 기본값을 지정할 수 있습니다. 예: 입력: var[]..[] 값: bool = false
pl_pl: Parametr funkcji, należy użyć z węzłami niestandardowymi. Można określić typ i domyślną wartość dla parametru. Np. input : var[]..[] value : bool = false
pt_br: Um parâmetro Função, utilizar com os nós personalizados. Você pode especificar o tipo e o valor padrão do parâmetro. Por exemplo, entrada: var []. [] valor: bool = false
ru_ru: Параметр функции, использовать с пользовательскими узлами. Можно указать тип и значение параметра по умолчанию. Например, ввод: var [], []. значение: bool = false
zh_cn: 函数参数，用于自定义节点。 可以指定参数的类型和默认值。例如: 输入: 变量 []... [] 值: bool = false
zh_tw: 函數參數，與自訂節點共同使用。 您可以指定類型和預設值參數。例如 ， input : var[]..[] value : bool = false

# CustomNodeNotLoaded
source: Custom node definition is not loaded! href=CustomNodeNotLoaded.html
cs_cz: Definice uživatelského uzlu není načtena! href=CustomNodeNotLoaded.html
de_de: Definition für benutzerdefinierten Block ist nicht geladen. href=CustomNodeNotLoaded.html
es_es: La definición de nodo personalizado no se ha cargado. href=CustomNodeNotLoaded.html
fr_fr: La définition de noeud personnalisé n'est pas chargée. href=CustomNodeNotLoaded.html
it_it: La definizione del nodo personalizzato non è caricata. href=CustomNodeNotLoaded.html
ja_jp: カスタム ノードの設定がロードされていません。href=CustomNodeNotLoaded.html
ko_kr: 사용자 노드 정의가 로드되지 않았습니다! href=CustomNodeNotLoaded.html
pl_pl: Definicja węzła niestandardowego nie jest wczytana! href=CustomNodeNotLoaded.html
pt_br: A definição do nó personalizado não está carregada. href=CustomNodeNotLoaded.html
ru_ru: Определение пользовательского узла не загружено! href=CustomNodeNotLoaded.html
zh_cn: 自定义节点定义未加载！href=CustomNodeNotLoaded.html
zh_tw: 未載入自訂節點定義！href=CustomNodeNotLoaded.html

# RunTypeToolTipAutomatically
source: Run whenever an input to the graph is updated.
cs_cz: Spustit vždy, když je aktualizován vstup do grafu.
de_de: Wird ausgeführt, wenn eine Eingabe im Diagramm aktualisiert wird.
es_es: Ejecutar siempre que se actualiza una entrada del gráfico
fr_fr: Exécuter à chaque fois qu'une entrée est mise à jour dans le graphique.
it_it: Viene eseguito ad ogni aggiornamento di un input del grafico.
ja_jp: グラフへの入力が更新されるたびに実行します。
ko_kr: 그래프의 입력이 업데이트될 때마다 실행됩니다.
pl_pl: Uruchom za każdym razem, gdy aktualizowane są dane wejściowe do wykresu.
pt_br: Executar sempre que uma entrada para o gráfico for atualizada.
ru_ru: Запуск при обновлении входного элемента графика.
zh_cn: 在图形的输入更新时运行。
zh_tw: 每當更新圖表的輸入時，即會執行

# RunTypeToolTipManually
source: Run when you click the Run button.
cs_cz: Ke spuštění dojde po kliknutí na tlačítko Spustit.
de_de: Ausführung nach Klicken auf die Schaltfläche Ausführen
es_es: Se ejecuta cuando al hacer clic en el botón Ejecutar
fr_fr: Exécuter lorsque vous cliquez sur le bouton Exécuter.
it_it: Viene eseguito quando si fa clic sul pulsante Esegui.
ja_jp: [実行]ボタンをクリックすると実行します。
ko_kr: 실행 버튼을 클릭하면 실행됩니다.
pl_pl: Uruchom, klikając przycisk Uruchom.
pt_br: Executar quando você clicar no botão Executar.
ru_ru: Запуск при нажатии на кнопку «Запуск».
zh_cn: 单击“运行”按钮时运行。
zh_tw: 按一下「執行」按鈕時執行。

# RunTypeToolTipPeriodicallyDisabled
source: Run Periodic is only available when there are nodes in the graph that support periodic update.
cs_cz: Možnost Spouštět pravidelně je dostupná pouze tehdy, když v grafu existují uzly, které podporují pravidelné aktualizace.
de_de: Die periodische Ausführung ist nur verfügbar, wenn das Diagramm Blöcke enthält, für die eine periodische Aktualisierung unterstützt wird.
es_es: La ejecución periódica solo está disponible si en el gráfico hay nodos que permiten la actualización periódica
fr_fr: L'exécution périodique est disponible uniquement lorsqu'il existe des noeuds dans le graphique qui prennent en charge la mise à jour périodique.
it_it: L'esecuzione periodica è disponibile solo quando il grafico contiene nodi che supportano l'aggiornamento periodico.
ja_jp: 定期的な実行は、定期的な更新をサポートするグラフにノードがある場合にのみ使用できます。
ko_kr: 주기적 실행은 그래프에 주기적 업데이트를 지원하는 노드가 있을 때만 사용할 수 있습니다.
pl_pl: Funkcja Uruchom okresowo jest dostępna tylko wtedy, gdy istnieją węzły na wykresie, które obsługują okresową aktualizację.
pt_br: Executar periódico somente está disponível quando houver nós no gráfico que suportam a atualização periódica.
ru_ru: Периодическое выполнение процесса доступно только при наличии на графике узлов, поддерживающих периодические обновления.
zh_cn: 仅当图形中有支持定期更新的节点时，运行周期才可用。
zh_tw: 只在圖表中有支援定期更新的節點時，才能使用定期執行。

# RunTypeToolTipPeriodicallyEnabled
source: Run at the specified interval.
cs_cz: Spustit v zadaném intervalu.
de_de: In angegebenen Abständen ausführen
es_es: Ejecutar en el intervalo especificado
fr_fr: Exécuter à l'intervalle spécifié.
it_it: Viene eseguito in base all'intervallo specificato.
ja_jp: 指定した間隔で実行します。
ko_kr: 지정된 간격으로 실행됩니다.
pl_pl: Uruchom w określonych odstępach.
pt_br: Executar no intervalo especificado.
ru_ru: Выполнение процесса с указанным интервалом.
zh_cn: 以指定时间间隔运行。
zh_tw: 以指定的間隔執行。

# HeaderAction
source: ACTIONS
cs_cz: AKCE
de_de: Aktionen
es_es: ACCIONES
it_it: AZIONI
ja_jp: アクション
ko_kr: 동작
pl_pl: DZIAŁANIA
pt_br: AÇÕES
ru_ru: ДЕЙСТВИЯ
zh_cn: 操作
zh_tw: 動作

# HeaderCreate
source: CREATE
cs_cz: VYTVOŘIT
de_de: Erstellen
es_es: CREAR
fr_fr: CREER
it_it: CREA
ja_jp: 作成
ko_kr: 만들기
pl_pl: UTWÓRZ
pt_br: CRIAR
ru_ru: СОЗДАТЬ
zh_cn: 创建
zh_tw: 建立

# HeaderQuery
source: QUERY
cs_cz: DOTAZ
de_de: Abfrage
es_es: CONSULTA
fr_fr: REQUETE
ja_jp: クエリー
ko_kr: 쿼리
pl_pl: ZAPYTANIE
pt_br: CONSULTA
ru_ru: ЗАПРОС
zh_cn: 查询
zh_tw: 查詢

# InputLabel
source: INPUT
cs_cz: VSTUP
de_de: Eingabe
es_es: ENTRADA
fr_fr: ENTREE
ja_jp: 入力
ko_kr: 입력
pl_pl: DANE WEJŚCIOWE
pt_br: ENTRADA
ru_ru: ВВОД
zh_cn: 输入
zh_tw: 輸入

# MoreButtonTextFormat
source: SHOW MORE ({0})
cs_cz: ZOBRAZIT VÍCE ({0})
de_de: Mehr anzeigen ({0})
es_es: MOSTRAR MÁS ({0})
fr_fr: AFFICHER PLUS ({0})
it_it: Mostra altro ({0})
ja_jp: 詳細を表示({0})
ko_kr: 자세히 표시({0})
pl_pl: POKAŻ WIĘCEJ ({0})
pt_br: MOSTRAR MAIS ({0})
ru_ru: ПОКАЗАТЬ БОЛЬШЕ ({0})
zh_cn: 显示更多 ({0})
zh_tw: 展示更多 ({0})

source: No description available
cs_cz: K dispozici není žádný popis.
de_de: Keine Beschreibung verfügbar
es_es: No hay ninguna descripción disponible
fr_fr: Aucune description disponible
it_it: Nessuna descrizione disponibile
ja_jp: 説明は使用できません
ko_kr: 사용 가능한 설명이 없습니다
pl_pl: Brak dostępnego opisu
pt_br: Nenhuma descrição disponível
ru_ru: Описание отсутствует
zh_cn: 无说明可用
zh_tw: 無可用的描述

# OutputLabel
source: OUTPUT
cs_cz: VÝSTUP
de_de: Ausgabe
es_es: SALIDA
fr_fr: SORTIE
ja_jp: 出力
ko_kr: 출력
pl_pl: WYNIK
pt_br: SAÍDA
ru_ru: ВЫВОД
zh_cn: 输出
zh_tw: 輸出

source: Top Result
cs_cz: Nejlepší výsledek
de_de: Oberes Ergebnis
es_es: Resultado destacado
fr_fr: Résultat principal
it_it: Risultato principale
ja_jp: 上位の結果
ko_kr: 상위 결과
pl_pl: Najlepszy wynik
pt_br: Resultado principal
ru_ru: Верхний результат
zh_cn: 热门搜索结果
zh_tw: 頂部結果

source: Locate in Disk..
cs_cz: Najít disk.
de_de: Suchen auf Datenträger...
es_es: Buscar en disco
fr_fr: Rechercher sur le disque.
it_it: Individua nel disco..
ja_jp: ディスク内を検索..
ko_kr: 디스크에서 찾기..
pl_pl: Zlokalizuj na dysku..
pt_br: Localizar no disco.
ru_ru: Найти на диске...
zh_cn: 在磁盘中查找..
zh_tw: 在磁碟中尋找。

# MoveLabel
source: Move
cs_cz: Přesunout
de_de: Verschieben
es_es: Desplazar
fr_fr: Déplacer
it_it: Sposta
ja_jp: 移動
ko_kr: 이동
pl_pl: Przenieś
pt_br: Mover
ru_ru: Переместить
zh_cn: 移动
zh_tw: 移動

source: No matches found
cs_cz: Nebyly nalezeny žádné shody.
de_de: Keine Übereinstimmungen gefunden
es_es: No se ha encontrado ninguna coincidencia
fr_fr: Aucun résultat trouvé
it_it: Nessuna corrispondenza trovata
ja_jp: 一致するものが見つかりませんでした
ko_kr: 일치 항목을 찾을 수 없습니다
pl_pl: Brak pasujących elementów
pt_br: Nenhuma coincidência encontrada
ru_ru: Совпадений не найдено
zh_cn: 找不到匹配项
zh_tw: 找不到相符項

# RemoveLabel
source: Remove
cs_cz: Odstranit
de_de: Entfernen
es_es: Eliminar
fr_fr: Supprimer
it_it: Rimuovi
ja_jp: 削除
ko_kr: 제거
pl_pl: Usuń
pt_br: Remover
ru_ru: Удалить
zh_cn: 删除
zh_tw: 移除

# IncorrectlyFormattedNodeLibraryDisplay
source: This is the incorrectly formatted library name:
cs_cz: Toto je nesprávně naformátovaný název knihovny:
de_de: Der falsch formatierte Bibliotheksname:
es_es: Este es el nombre de biblioteca con formato incorrecto:
fr_fr: Ce nom de bibliothèque n'est pas correctement formaté:
it_it: Nome della libreria con formattazione errata:
ja_jp: 次のライブラリ名の形式が正しくありません。
ko_kr: 라이브러리 이름의 형식이 잘못 지정되었습니다:
pl_pl: Niepoprawnie sformatowana nazwa biblioteki:
pt_br: Este é o nome de biblioteca incorretamente formatado:
ru_ru: Это некорректно отформатированное имя библиотеки:
zh_cn: 这是格式不正确的库名称:
zh_tw: 這是未正確格式化的資源庫名稱：

# IncorrectlyFormattedNodeLibraryWarning
source: Incorrectly formatted package node library encountered, this may result in a package assembly not being loaded!
cs_cz: Vyskytl se nesprávně naformátovaná knihovna uzlů balíčku, což může mít za následek nenačtení sestavení balíčku.
de_de: Falsch formatierte Paketblockbibliothek gefunden. Paket-Assembly kann eventuell nicht geladen werden.
es_es: Se ha detectado biblioteca de nodos de paquetes con formato incorrecto, lo cual puede hacer que no se cargue un conjunto de paquetes
fr_fr: Une bibliothèque de noeuds de package avec un format incorrect a été trouvé, ce qui peut entraîner l'échec du chargement d'un ensemble de package.
it_it: È stata rilevata una libreria di nodi pacchetto con formattazione errata. Ciò può determinare il mancato caricamento di un assembly del pacchetto.
ja_jp: 不正にフォーマットされたパッケージ ノード ライブラリが検出されました。これが原因でパッケージ アセンブリがロードされないことがあります!
ko_kr: 패키지 노드 라이브러리의 형식이 잘못되었습니다. 패키지 조합이 로드되지 않을 수도 있습니다!
pl_pl: Niepoprawnie sformatowana spakowana biblioteka węzłów. Może to spowodować problem z wczytaniem spakowanego zespołu!
pt_br: Foi encontrado um pacote de biblioteca de nós incorretamente formatado. Isso pode fazer com que a montagem do pacote não seja carregada!
ru_ru: Обнаружена некорректно отформатированная библиотека пакетных узлов, из-за которой сборка пакета может быть не загружена!
zh_cn: 遇到格式不正确的软件包节点库，这可能导致某个软件包组件无法加载！
zh_tw: 發現未正確格式化的套件節點資源庫，這可能會導致套件組合未被載入！

# NothingIsSelectedWarning
source: Nothing is selected. href=NothingIsSelectedWarning.html
cs_cz: Není nic vybráno. href=NothingIsSelectedWarning.html
de_de: Es ist nichts ausgewählt. href=NothingIsSelectedWarning.html
es_es: No hay nada seleccionado. href=NothingIsSelectedWarning.html
fr_fr: Rien n'est sélectionné. href=NothingIsSelectedWarning.html
it_it: Nessun elemento selezionato. href=NothingIsSelectedWarning.html
ja_jp: 何も選択されていません。href=NothingIsSelectedWarning.html
ko_kr: 선택된 항목이 없습니다. href=NothingIsSelectedWarning.html
pl_pl: Nie wybrano żadnych pozycji. href=NothingIsSelectedWarning.html
pt_br: Não há nada selecionado. href=NothingIsSelectedWarning.html
ru_ru: Ничего не выбрано. href=NothingIsSelectedWarning.html
zh_cn: 未选择任何内容。href=NothingIsSelectedWarning.html
zh_tw: 未選取任何項目。href=NothingIsSelectedWarning.html

# SearchTextBlockText
source: Search
cs_cz: Hledat
de_de: Suchen
es_es: Buscar
fr_fr: Rechercher
it_it: Cerca
ja_jp: 検索
ko_kr: 검색
pl_pl: Wyszukiwanie
pt_br: Pesquisar
ru_ru: Поиск
zh_cn: 搜索
zh_tw: 搜尋

# AutocompleteSearchTextBlockText
source: Search Autocomplete Results
cs_cz: Hledat výsledky automatického dokončování
de_de: Nach Ergebnissen der automatischen Vervollständigung suchen
es_es: Buscar en resultados de Autocompletar
fr_fr: Rechercher les résultats de la saisie automatique
it_it: Cerca nei risultati Completamento automatico
ja_jp: オートコンプリートの結果を検索
ko_kr: 자동 완성 결과 검색
pl_pl: Wyniki autouzupełniania wyszukiwania
pt_br: Pesquisar resultados de preenchimento automático
ru_ru: Поиск в результатах автозаполнения
zh_cn: 搜索自动完成结果
zh_tw: 搜尋自動完成結果

source: Autocomplete
cs_cz: Automatické dokončování
de_de: Automatische Vervollständigung
es_es: Autocompletar
fr_fr: Saisie automatique
it_it: Completamento automatico
ja_jp: オートコンプリート
ko_kr: 자동 완성
pl_pl: Autouzupełnianie
pt_br: Preenchimento automático
ru_ru: Автозавершение
zh_cn: 自动完成
zh_tw: 自動完成

# WatermarkLabelText
source: Enter code here
cs_cz: Zde zadejte kód
de_de: Code hier eingeben
es_es: Introduzca el código aquí
fr_fr: Entrer le code ici
it_it: Immettere qui il codice
ja_jp: ここにコードを入力
ko_kr: 여기에 코드 입력
pl_pl: Tutaj wpisz kod
pt_br: Inserir código aqui
ru_ru: Введите здесь код
zh_cn: 在此处输入代码
zh_tw: 在這裡輸入程式碼
