DSCore.Data.ToNative(Newtonsoft.Json.Linq.JToken)
Parse implementation for converting JToken types to native .NET objects.
token: JToken to parse to N

DSCore.Data.DynamoJObjectToNative(Newtonsoft.Json.Linq.JObject)
Parse implementation for converting JObject types to specific Dynamo objects (ie Geometry, Color, Images, etc)
Throws System.Exception:

DSCore.Data.CanObjectBeCached(System.Object)
Helper function to determine if object can be cached or if it is null, "null" string, or empty list.
inputObject: Object to check

DSCore.Data.Remember(System.Object,System.String)
Function to handle caching for the Data.Remember node
inputObject: Object to cache
cachedJson: Optional existing cache json

DSCore.Data.FindCommonAncestor(System.Collections.ArrayList)
A function to help find the type in case an ArrayList of objects was passed in AutoMode
list: The input value, expected to be of type ArrayList

DSCore.Data.LikelyAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
A helper function returning the lowest-level node from a list of DataNodeDynamoType nodes
nodes: The list of DataNodeDynamoType to evaluate

DSCore.Data.FindClosestCommonAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
A helper function to try to determine a common ancestor in a list of data types
nodes: The list of DataType nodes to evaluate

DSCore.Data.FindCommonAncestorBetweenTwoNodes(DSCore.Data.DataNodeDynamoType,DSCore.Data.DataNodeDynamoType)
Recursive function to try and find a common ancestor between two dynamo types
Climbs up the hierarchical tree of the likelyAncestor until it
node: Check if this node is derived from the likely ancestor
likelyAncestor: The likely ancestor that the node should be deriving from

DSCore.Data.GetListFromTypes(System.Collections.ArrayList)
Return a list of DataNodeDynamoTypes from an ArrayList of objects
list: The ArrayList of objects to reformat

DSCore.Data.IsSingleValueOrSingleLevelArrayList(System.Object)
Check if the input object is a single value or a single-level ArrayList.
obj: The input object to evaluate

DSCore.Data.IsSupportedDataNodeDynamoType(System.Object,System.Type,System.Boolean)
Function to validate input type against supported Dynamo input types
inputValue: The incoming data to validate
type: The input type provided by the user. It has to match the inputValue type
isList: The value of this boolean decides if the input is a single object or a list

DSCore.Data.IsDerivedFrom(System.Type,System.Type)
This method checks if a type is derived from a base type
derivedType: The type we want to assert
baseType: The base type we compare with