DSCore.ColorRange1D.GetColorAtParameter(DSCore.ColorRange1D,System.Double)
Returns the color in this color range at the specified parameter.
parameter: A value between 0.0 and 1.0.
Returns: A Color.

DSCore.ColorRange1D.Default
Create a ColorRange1D with the default color scheme.