DSCore.String.Split(System.String,System.String[])
Divides a single string into a list of strings, with divisions
determined by the given separator strings.
string: String to split up
separators: Strings that, if present, determine the end and start of a split.
List of strings made from the input string
divide,separator,delimiter,cut,csv,comma,

DSCore.String.ChangeCase(System.String,System.Boolean)
Converts the given string to all uppercase characters or all
lowercase characters based on a boolean parameter.
string: String to be made uppercase or lowercase.
upper: True to convert to uppercase, false to convert to lowercase.
String with converted case.
2lowercase,to lowercase,tolowercase,lowercase,
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.Substring(System.String,System.Int32,System.Int32)
Retrieves a substring from the given string. The substring starts at the given
character position and has the given length.
string: String to take substring of
startIndex: Starting character position of the substring in the original string
length: Number of characters in the substring
Substring made from the original string
subset,get string,part,smaller string

DSCore.String.Remove(System.String,System.Int32,System.Nullable{System.Int32})
Removes characters from a string.
string: String to remove characters from.
startIndex: Index at which to start removal.
count: Amount of characters to remove,
Note: if the Count is negative, the removal process goes from right to left.
String with characters removed.
delete,rem,shorten