DSCore.Color.Brightness(DSCore.Color)
Returns the brightness value for this color.
color: Color to query brightness from
Brightness value (between 0 and 1 inclusive)

DSCore.Color.Hue(DSCore.Color)
Returns the hue value for this color.
color: A color object
Hue value for color as a double between 0 and 1 inclusive.
hues

DSCore.Color.Components(DSCore.Color)
Lists the components for the color in the order: alpha, red, green, blue.
color: A color object
Alpha value, int between 0 and 255 inclusive.
Red value for RGB color model, int between 0 and 255 inclusive.
Green value for RGB color model, int between 0 and 255 inclusive.
Blue value for RGB color model, int between 0 and 255 inclusive.
alpha,red,green,blue

DSCore.Color.BuildColorFrom1DRange(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double},System.Double)
Returns a color from a color gradient between a start color and an end color.
parameters: The values between 0 and 1 along the range for which you would like to sample the color.
Colors in the given range.
color,range,gradient

DSCore.Color.Blerp(System.Collections.Generic.IList{DSCore.Color.IndexedColor2D},Autodesk.DesignScript.Geometry.UV)
Bilinearly interpolate between a set of colors.
Returns: The interpolated color or white.
This algorithm is not the same as the solution found from wikipedia
(reference: https://en.wikipedia.org/wiki/Bilinear_interpolation)