DSCore.List.Sublists(System.Collections.IList,System.Collections.IList,System.Int32)
Build sublists from a list using DesignScript range syntax.
list: The list from which to create sublists.
ranges: The index ranges of the sublist elements.
Ex. \"{0..3,5,2}\"
offset: The offset to apply to the sublist.
Ex. the range \"0..3\" with an offset of 2 will yield
{0,1,2,3}{2,3,4,5}{4,5,6,7}...
type: var[]..[]
sublists,build sublists,subset,

DSCore.List.TakeItems(System.Collections.IList,System.Int32)
Fetches an amount of items from the start of the list.
list: List to take from.
amount: Amount of items to take. If negative, items are taken from the end of the list.
List of extracted items.
get,sub,sublist,extract

DSCore.List.DropItems(System.Collections.IList,System.Int32)
Removes an amount of items from the start of the list. If the amount is a negative value,
items are removed from the end of the list.
list: List to remove items from.
amount: Amount of items to remove. If negative, items are removed from the end of the list.
List of remaining items.
drop,remove,shorten

DSCore.List.ShiftIndices(System.Collections.IList,System.Int32)
Shifts indices in the list to the right by the given amount.
list: List to be shifted.
amount: Amount to shift indices by. If negative, indices will be shifted to the left.
Shifted list.
shift,offset

DSCore.List.Slice(System.Collections.IList,System.Nullable{System.Int32},System.Nullable{System.Int32},System.Int32)
Returns a single sub-list from the given list, based on starting index, ending index,
and a step amount.
list: List to take a slice of.
start: Index to start the slice from.
end: Index to end the slice at.
step: Amount the indices of the items are separate by in the original list.
Items in the slice of the given list.
list,sub,sublist,subrange,get sublist

DSCore.List.DropEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
Removes items from the given list at indices that are multiples
of the given value, after the given offset.
list: List to remove items from/
n: Indices that are multiples of this argument will be removed.
offset: Amount of items to be ignored from the start of the list.
List with items removed.
nth,remove,cull,every

DSCore.List.TakeEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
Fetches items from the given list at indices that are multiples
of the given value, after the given offset.
list: List to take items from.
n: Indices that are multiples of this number (after the offset)
will be fetched.
offset: Amount of items to be ignored from the start of the list.
Items from the list.
fetch,take,every,nth

DSCore.List.Combinations(System.Collections.IList,System.Int32,System.Boolean)
Produces all combinations of the given length of a given list.
list: List to generate combinations of
length: Length of each combination
replace: Whether or not items are removed once selected for combination, defaults
to false.
Combinations of the list of the given length
combo

DSCore.List.FirstIndexOf(System.Collections.IList,System.Object)
Given an item, returns the zero-based index of its first occurrence
in the list. If the item cannot be found in the list, -1 is returned.
list: List to search in. If this argument is null, -1 is returned.
item: Item to look for.
Returns: Zero-based index of the item in the list, or -1 if it is not found.

DSCore.List.AllIndicesOf(System.Collections.IList,System.Object)
Given an item, returns the zero-based indices of all its occurrences
in the list. If the item cannot be found, an empty list is returned.
list: List to search in. If this argument is null, an empty list is returned.
item: Item to look for.
A list of zero-based indices of all occurrences of the item if
found, or an empty list if the item does not exist in the list.