DSCore.IO.FileSystem.FileFromPath(System.String)
Creates File object from given file path.

DSCore.IO.FileSystem.ReadText(System.IO.FileInfo)
Reads a text file and returns the contents as a string.
file: File object to read text from
Contents of the text file.
read file,text,file