DSCore.IO.Image.WriteToFile(System.String,System.Drawing.Bitmap)
Write the image to a path, given the specified file name.
image: The image to write
Created image object
write image,image,file,filepath