DSCore.TimeSpan.Scale(System.TimeSpan,System.Double)
Multiplies a TimeSpan by a scaling factor
timeSpan: TimeSpan to multiply
scaleFactor: Amount to scale the TimeSpan. For example, a scaling factor of 2 will yield
double the amount of time spanned.
TimeSpan product