Autodesk.DesignScript.Geometry.Point.PruneDuplicates(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double)
Prune points to exclude duplicates within tolerance of included points
points: List of points from which to prune duplicates
tolerance: Tolerance used for pruning
Returns: Unique points
unique,duplicates,remove duplicates,distinct,near