Autodesk.DesignScript.Geometry.Surface.GetIsoline(System.Int32,System.Double)
Create a parameter line curve on the given surface.
Create a Curve that represents a u or v parameter line on the Surface. A
parameter line runs in the direction of increasing u or v parameter at a
constant opposite u or v parameter. The resulting Curve will match the
Surface parameterisation and its range will be bounded by the Surface
parameter range. The type of Curve returned will depend on the Surface
type.
isoDirection: If direction == 0, creates a U parameter line, if direction == 1, creates a V parameter line.
lines
0.4

Autodesk.DesignScript.Geometry.Surface.Repair
Attempts to repair the Surface.

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Create a Surface by sweeping a profile Curve along a path.
profile: Curve to sweep
path: Path curve used to sweep along
Returns: Surface created by sweeping profile along path
sweep,rail,guide,sweep1