Autodesk.DesignScript.Geometry.BoundingBox.ToPolySurface
Get the BoundingBox as a collection of Surfaces.
Returns: Returns polysurface representation of the bounding box
converttosurfaces,convert2surfaces,bbtosrfs,bbtosrfs,bounding to surfaces,bound to poly,convert2poly

Autodesk.DesignScript.Geometry.BoundingBox.ByMinimumVolume(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Create a non-axis-aligned, minimum-volume, oriented bounding box around the input geometries.
Returns: Oriented bounding box arounding input geometries.