Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.MoveVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Vector,System.Boolean)
Move given vertices along given vector
vertices: Vertex list to be moved
vector: Vector to move along
onSurface: Flag, indicating whether to use surface or control points of vertices to move

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Repair
Attempts to repair the TsplineSurface.