Autodesk.DesignScript.Geometry.CoordinateSystem.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
Returns this geometry with its position expressed relative to the
targetCoordinateSystem, placed into the frame of the sourceCoordinateSystem.
The local position of the result within the sourceCoordinateSystem
matches the local position of the input within the targetCoordinateSystem.
To obtain the coordinates of a geometry in world-space within a given coordinate
system, pass CoordinateSystem.Identity as the sourceCoordinateSystem
and the given CS as the targetCoordinateSystem.
The resulting geometry coordinates will equal the coordinates of the input
relative to that target frame.
targetCoordinateSystem: The CoordinateSystem to express the geometry relative to.
sourceCoordinateSystem: The CoordinateSystem the geometry is currently expressed in.
Pass CoordinateSystem.Identity() to work in world space.
Returns: Transformed Geometry.
from,to, local coordinates