Autodesk.DesignScript.Geometry.Solid.Repair
Attempts to repair the solid.

Autodesk.DesignScript.Geometry.Solid.ByUnion(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Solid})
Union a collection of solids into one solid
solids: A collection of solids
Brep,brep,boolean,addition