Autodesk.DesignScript.Geometry.Mesh.TriangleNormals
Returns the normals for each triangle face in a given mesh.

Autodesk.DesignScript.Geometry.Mesh.BooleanUnion(Autodesk.DesignScript.Geometry.Mesh)
Returns a new mesh unifying the tool mesh and the original mesh.
mesh

Autodesk.DesignScript.Geometry.Mesh.BooleanDifference(Autodesk.DesignScript.Geometry.Mesh)
Returns a new mesh subtracting the tool mesh from the original mesh.
mesh

Autodesk.DesignScript.Geometry.Mesh.BooleanIntersection(Autodesk.DesignScript.Geometry.Mesh)
Returns a new mesh consisting of the intersection between the tool
mesh and the original mesh.
mesh

Autodesk.DesignScript.Geometry.Mesh.ByPointsIndexGroups(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.IndexGroup})
Create a mesh from a collection of Points and a collection of IndexGroups referencing the Point collection
points: List of points
indexGroups: Index groups for points
Returns: Mesh
mesh,meshes

Autodesk.DesignScript.Geometry.Mesh.ByPointsIndices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Collections.Generic.IEnumerable{System.Int32})
Create a new Mesh from supplied points and indices. Points should
not overlap. Indices should be sets of three integers
indicating the three locations in the points array
of the three points of a triangle
points: List of points
indices: Flat list of point indices
Returns: Mesh

Autodesk.DesignScript.Geometry.Mesh.Plane(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32)
Create a mesh plane based on the given inputs.
mesh

Autodesk.DesignScript.Geometry.Mesh.Cuboid(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32)
Create a mesh cuboid based on the current settings.
mesh

Autodesk.DesignScript.Geometry.Mesh.Sphere(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Boolean)
Create a mesh sphere based on the current settings.
mesh

Autodesk.DesignScript.Geometry.Mesh.Cone(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double,System.Int32,System.Boolean)
Create a mesh cone based on the current settings.
mesh