Autodesk.DesignScript.Geometry.PolyCurve.OffsetMany(System.Double,System.Boolean,Autodesk.DesignScript.Geometry.Vector)
Create one or more Polycurves by offsetting a planar polycurve by the given distance in a plane defined by the plane normal.
The "planeNormal" input argument defaults to the normal of the plane containing the curve but an explicit normal parallel to the original curve normal can be provided to better control the direction of the offset.
For example, if a consistent offset direction is required for multiple curves sharing the same plane, the "planeNormal" can be used to override individual curve normals and force all curves to be offset in the same direction.
Reversing the normal reverses the direction of the offset.
signedDistance: A positive offset distance applies in the direction of the cross product between the polycurve's tangent and the plane's normal vector, while a negative offset applies in the opposite direction.
extendCircular: If there are gaps between the offset component curves then, depending on the gap closure settings, they may be filled either by circular arcs (true value) to give smooth corners, or by extending (false value) the offset curves.
planeNormal: The curve's plane normal. Defaults to the input curve's plane normal
Returns: One or more offset polycurves

Autodesk.DesignScript.Geometry.PolyCurve.ExtendWithEllipse(System.Double,System.Double,System.Double,System.Double,System.Boolean)
Extends polycurve by tangent ellipse
length: Length of extension ellipse
radius1: Parameter of ellipse
radius2: Parameter of ellipse
endEllipseParameter: Parameter of ellipse
endOrStart: extending end or start of the polycurve

Autodesk.DesignScript.Geometry.PolyCurve.ExtendWithArc(System.Double,System.Double,System.Boolean)
Extends polycurve by tangent arc.
length: Length of extension arc
radius: Radius of arc
endOrStart: extending end or start of the polycurve

Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
Make one or more polycurves by grouping connected curves.
Choose a preferred join tolerance between 1e-6 and 1e-3 units.
Lower values may be too strict and prevent curves that should connect from joining; higher values may cause short curves to be unintentionally merged or to collapse to degenerate points.
curves: Curves to group together to create one or more PolyCurves
joinTolerance: Tolerance to determine size of gap allowed between curves to be joined

Autodesk.DesignScript.Geometry.PolyCurve.ByThickeningCurve(Autodesk.DesignScript.Geometry.Curve,System.Double,Autodesk.DesignScript.Geometry.Vector)
Make PolyCurve by thickening a curve.
curve: the curve to thicken
thickness: the thickness
nor: the normal perpendicular to the thickening direction
offset

Autodesk.DesignScript.Geometry.PolyCurve.ByThickeningCurveNormal(Autodesk.DesignScript.Geometry.Curve,System.Double,Autodesk.DesignScript.Geometry.Vector)
Make PolyCurve by thickening a curve along a plane specified by the input normal.
curve: the curve to thicken
thickness: the thickness
normal: the normal perpendicular to the thickening direction. If the normal is not supplied (is null), the curve normal is used by default.
offset,thicken