Autodesk.DesignScript.Geometry.Core.EntityTags.AddTag(System.String,System.Object)
Add or overwrite a Geometry tag

Autodesk.DesignScript.Geometry.Core.EntityTags.LookupTag(System.String)
Do recursive lookup of geometry tags