Autodesk.DesignScript.Geometry.Curve.OffsetMany(System.Double,Autodesk.DesignScript.Geometry.Vector)
Create one or more curves by offsetting a planar curve by the given distance in a plane defined by the plane normal. If there are gaps between the offset component curves then, they are filled by extending the offset curves.
The "planeNormal" input argument defaults to the normal of the plane containing the curve but an explicit normal parallel to the original curve normal can be provided to better control the direction of the offset.
For example, if a consistent offset direction is required for multiple curves sharing the same plane, the "planeNormal" can be used to override individual curve normals and force all curves to be offset in the same direction.
Reversing the normal reverses the direction of the offset.
signedDistance: A positive offset distance applies in the direction of the cross product between the curve's tangent and the plane's normal vector, while a negative offset applies in the opposite direction.
planeNormal: The curve's plane normal. Defaults to the input curve's plane normal
Returns: One or more offset curves
thicken,lines
0.5,0.4

Autodesk.DesignScript.Geometry.Curve.ByParameterLineOnSurface(Autodesk.DesignScript.Geometry.Surface,Autodesk.DesignScript.Geometry.UV,Autodesk.DesignScript.Geometry.UV)
Create a curve by line of surface in uv space
baseSurface: Surface to use
startParams: Starting uv at which curve will start
endParams: Ending uv at which curve will end
Returns: Curve at start and end parameters of surface
isocurve,curvebyuv,lines,uvs
0.5,0.5,0.4,0.4

Autodesk.DesignScript.Geometry.Curve.ByBlendBetweenCurves(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Boolean,System.Boolean)
Create a curve that blends between two curves
curve1: First curve to blend
curve2: Second curve to blend
endOrStart1: flag to indicate which end of curve 1 to blend
endOrStart2: flag to indicate which end of curve 2 to blend
isG2Continuous: flag to indicate if resultant curve is of G1 continuity or G2 continuity
Returns: Resulting curve from blending two curves
blend,make continuous,connect

Autodesk.DesignScript.Geometry.Curve.ByIsoCurveOnSurface(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Double)
Create a curve by isoline of surface
baseSurface: Base surface
direction: if 0 isoline is along u direction, if 1 along v direction
parameter: fixed for the curve value of other surface parameter
Returns: Isocurve on surface
isocurve,curvebydir,lines
0.5,0.5,0.4