Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
Form a Vector by 3 Euclidean coordinates
x: X coordinate
y: Y coordinate
z: Z coordinate
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
Form a Vector by 3 Euclidean coordinates and normalize the Vector
x: X coordinate
y: Y coordinate
z: Z coordinate
normalized: Whether to normalize the result Vector or not
normalize,vector3