Autodesk.DesignScript.Geometry.PolySurface.ByJoinedSurfaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Make Polysurface by joining surfaces.
surfaces: Surfaces to join into polysurface
joinsurfaces,joinsrf

Autodesk.DesignScript.Geometry.PolySurface.BySolid(Autodesk.DesignScript.Geometry.Solid)
Make Polysurface by surfaces of Solid.
solid: Solid which surfaces to use
solid2poly,solidtopoly,convertsolid

Autodesk.DesignScript.Geometry.PolySurface.BySweep(Autodesk.DesignScript.Geometry.Curve,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Make Polysurface by sweeping curves along rail.
rail: Curve to sweep along
crossSection: Sweep profile
sweep,rail,guide,sweep1