DSCore.DateTime
Objekt für eine bestimmte Datums- und Zeitangabe

DSCore.DateTime.MinValue
Die frühestmöglichen Datums- und Zeitangaben, die dargestellt werden können
Kleinstmögliche DateTime-Darstellung

DSCore.DateTime.MaxValue
Die spätestmöglichen Datums- und Zeitangaben, die dargestellt werden können
Größtmögliche DateTime-Darstellung

DSCore.DateTime.Now
Das aktuelle Datum und die Uhrzeit des Systems
DateTime-Darstellung der aktuellen Zeit

DSCore.DateTime.Today
Das aktuelle Systemdatum mit Mitternacht als Zeitangabe
DateTime-Darstellung für heute

DSCore.DateTime.Format(System.DateTime,System.String)
Gibt das angegebene Datum und die Uhrzeit als Zeichenfolge im angegebenen Format zurück.
dateTime: Zu formatierender DateTime-Wert
format: Zeichenfolgendarstellung des Datumsformats. Verwendet InvariantCulture, d. h. die Ausgabe ist unabhängig von der Sprache des Betriebssystems des Benutzers.
Vorgabeformat ist "F": "Dienstag 21. Februar 2017 23:02:43".
Suchen Sie nach "Benutzerdefinierte Zeichenfolgen für Datum und Uhrzeit bei MSDN", um eine vollständige Liste mit Formatangaben zu erhalten.
DateTime-Darstellung als Zeichenfolge

DSCore.DateTime.ByDate(System.Int32,System.Int32,System.Int32)
Erstellt ein neues DateTime für ein genaues Datum.
year: Genaues Jahr (1-9999)
month: Genauer Monat (1-12)
day: Genauer Tag (1 - [Tage im Monat] )
DateTime-Wert erstellt aus Datum

DSCore.DateTime.ByDateAndTime(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
Erstellt ein neues DateTime für ein genaues Datum und eine genaue Uhrzeit.
year: Genaues Jahr (1-9999)
month: Genauer Monat (1-12)
day: Genauer Tag (1 - [Tage im Monat] )
hour: Genaue Stunde (0-23)
minute: Genaue Minute (0-59)
second: Genaue Sekunde (0-59)
millisecond: Genaue Millisekunde (0-999)
DateTime-Wert erstellt aus Datum und Uhrzeit

DSCore.DateTime.SubtractTimeSpan(System.DateTime,System.TimeSpan)
Subtrahiert TimeSpan von DateTime, und gibt einen neuen DateTime-Wert zurück.
dateTime: DateTime-Wert für Start
timeSpan: Zu subtrahierende Zeitspanne
Aus Subtraktion resultierender DateTime-Wert

DSCore.DateTime.AddTimeSpan(System.DateTime,System.TimeSpan)
Addiert TimeSpan zu DateTime, und gibt einen neuen DateTime-Wert zurück.
dateTime: DateTime-Wert für Start
timeSpan: Zu DateTime-Wert zu addierende Zeitspanne
Aus Addition der Zeitspanne resultierender DateTime-Wert

DSCore.DateTime.DaysInMonth(System.Int32,System.Int32)
Berechnet die Anzahl der Tage im angegebenen Monat des angegebenen Jahres.
year: Genaues Jahr (1-9999)
month: Genauer Monat (1-12)
Anzahl der Tage im Monat

DSCore.DateTime.IsDaylightSavingsTime(System.DateTime)
Bestimmt, ob zum angegebenen DateTime-Zeitpunkt Sommerzeit verwendet wird.
dateTime: DateTime-Wert für die Bestimmung der Sommerzeit
True, wenn DateTime in der Sommerzeit liegt, sonst False

DSCore.DateTime.IsLeapYear(System.Int32)
Bestimmt, ob das angegebene Jahr ein Schaltjahr ist.
year: Genaues Jahr (1-9999)
True, wenn das Jahr ein Schaltjahr ist, sonst False

DSCore.DateTime.FromString(System.String)
Versucht, einen DateTime-Wert aus einer Zeichenfolge zu analysieren
string: Zeichenfolgendarstellung eines DateTime-Werts
DateTime-Wert einer analysierten Zeichenfolge

DSCore.DateTime.Date(System.DateTime)
Extrahiert nur das Datum aus einem DateTime-Wert. Für die  Zeitkomponenten wird 0 festgelegt.
dateTime: DateTime-Wert
Datum aus DateTime-Wert
Date

DSCore.DateTime.Components(System.DateTime)
Extrahiert die einzelnen Komponenten eines DateTime-Werts.
dateTime: DateTime-Wert, von dem Komponenten abgerufen werden sollen
Numerische Darstellung des Jahres (1–9999)
Numerische Darstellung des Monats (1–12)
Numerische Darstellung des Tages (1–[Tage im Monat])
Numerische Darstellung der Stunde (0–23)
Numerische Darstellung der Minuten (0–59)
Numerische Darstellung der Sekunden (0–59)
Numerische Darstellung der Millisekunden (0-999)

DSCore.DateTime.DayOfWeek(System.DateTime)
Gibt den Tag der Woche aus dem angegebenen DateTime-Wert zurück.
dateTime: DateTime-Objekt, von dem der Wochentag abgerufen wird
Wochentag

DSCore.DateTime.DayOfYear(System.DateTime)
Gibt den Tag des Jahres aus (0-366)
dateTime: DateTime-Wert, von dem der Tag des Jahres abgerufen wird
Anzahl der Tage ab Jahresbeginn

DSCore.DateTime.TimeOfDay(System.DateTime)
Gibt einen neuen TimeSpan-Wert aus, der die seit Mitternacht des angegebenen DateTime-Werts
verstrichene Zeit darstellt.
dateTime: DateTime-Wert
TimeSpan-Wert seit Mitternacht