DSCore.CurveMapper.LinearCurve
Stellt eine lineare Kurve im CurveMapper dar.
Eine lineare Kurve ist eine gerade Linie zwischen zwei Steuerpunkten.

DSCore.CurveMapper.LinearCurve.LineEquation(System.Double)
Berechnet die Y-Werte (Ansichtsbereich-Koordinaten) für min. und max. X-Werte

DSCore.CurveMapper.LinearCurve.SolveForXGivenY(System.Double)
Berechnet die X-Werte (Ansichtsbereich-Koordinaten) für min. und max. Y-Werte

DSCore.CurveMapper.LinearCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Gibt die X- und Y-Werte über die Kurve verteilt zurück.