DSCore.CurveMapper.PerlinNoiseCurve
Stellt eine Perlin-Noise-Kurve im CurveMapper dar.
Die Kurve erzeugt prozedurales Rauschen basierend auf Steuerpunkten und Perlin-Noise-Funktionen.

DSCore.CurveMapper.PerlinNoiseCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Gibt die X- und Y-Werte über die Kurve verteilt zurück.