DSCore.CurveMapper.BezierCurve
Stellt eine Bezier-Kurve im CurveMapper dar.
Eine Bezier-Kurve wird durch vier Steuerpunkte definiert und bietet eine glatte Interpolation.

DSCore.CurveMapper.BezierCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Ruft interpolierte Y-Werte basierend auf den zugewiesenen Parametern und Grenzwerten ab.