DSCore.Data.DataNodeDynamoType
Eine Klasse, die einen von Dynamo unterstützten DataType darstellt

DSCore.Data.DataNodeDynamoType.#ctor(System.Type,System.String,System.String)
Eine Klasse, die einen von Dynamo unterstützten DataType darstellt

DSCore.Data.DataNodeDynamoType.Type
Der zugrunde liegende Typ

DSCore.Data.DataNodeDynamoType.Name
Optionaler Name zum Überschreiben des Typnamens (`Number` anstelle von `long`)

DSCore.Data.DataNodeDynamoType.TypeId
Drahtformat $typeid (z. B. "autodesk.math:point3d-1.0.0").
Null für primitive Typen, die keine $typeid-Serialisierung verwenden.

DSCore.Data.DataNodeDynamoType.Level
Die in der Benutzeroberfläche anzuzeigende hierarchische Ebene

DSCore.Data.DataNodeDynamoType.IsLastChild
Wenn der Typ das letzte untergeordnete Element einer Hierarchie ist (in der Benutzeroberfläche)

DSCore.Data.DataNodeDynamoType.Parent
Das übergeordnete Element des Typs, falls vorhanden