DSCore.ColorRange.ByColorsAndParameters(System.Collections.Generic.IList{DSCore.Color},System.Collections.Generic.IList{Autodesk.DesignScript.Geometry.UV})
Erstellt einen ColorRange durch Angabe von Listen mit Farben und UVs.
colors: Eine Liste mit Farben.
parameters: Eine Liste mit Parametern zwischen (0.0,0.0) und (1.0,1.0).
Returns: Ein ColorRange-Objekt

DSCore.ColorRange.GetColorAtParameter(Autodesk.DesignScript.Geometry.UV)
Gibt die Farbe in diesem Farbbereich am angegebenen Parameter zurück.
parameter: UV zwischen (0.0,0.0) und (1.0,1.0).
Returns: Eine Farbe.