DSCore.Properties.Resources
Eine stark typisierte Ressourcenklasse zum Suchen von lokalisierten Zeichenfolgen usw.

DSCore.Properties.Resources.ResourceManager
Gibt die im Cache gespeicherte ResourceManager-Instanz zurück, die von dieser Klasse verwendet wird.

DSCore.Properties.Resources.Culture
Überschreibt die Eigenschaft CurrentUICulture des aktuellen Threads für alle
Ressourcenabrufe, die diese stark typisierte Ressourcenklasse verwenden.

DSCore.Properties.Resources.BitmapOverflowError
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Die bereitgestellten Farbdaten sind zu groß, um in die Bildumgrenzungen zu passen.'.

DSCore.Properties.Resources.CurveMapperEqualMinMaxWarning
Sucht eine lokalisierte Zeichenfolge ähnlich wie '• Mindest- und Maximalwerte müssen unterschiedlich sein.'.

DSCore.Properties.Resources.CurveMapperInvalidCountWarning
Sucht eine lokalisierte Zeichenfolge ähnlich wie '• Werte müssen eine Liste von Zahlen oder eine einzelne Zahl ≥ 2 sein.'.

DSCore.Properties.Resources.CurveMapperInvalidCurveWarning
Sucht eine lokalisierte Zeichenfolge ähnlich wie '• Steuerpunkte für die ausgewählte Kurve sind nicht gültig.'.

DSCore.Properties.Resources.CurveMapperInvalidXYFormatWarning
Sucht eine lokalisierte Zeichenfolge ähnlich wie '• X- und Y-Eingaben müssen einzelne Zahlen sein (keine Listen).'.

DSCore.Properties.Resources.DefineDataSupportedInputValueExceptionMessage
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Eingabe muss ein einzelner Wert oder eine nicht verschachtelte Liste sein'.

DSCore.Properties.Resources.DefineDataUnexpectedInputExceptionMessage
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Dieser Block erwartete eine {0}-Eingabe, erhielt jedoch eine {1}-Eingabe. Geben Sie die erwartete Eingabe ein, oder wählen Sie im Dropdown-Menü des Blocks einen neuen Typ aus.'

DSCore.Properties.Resources.DefineDataUnsupportedCombinationOfDataTypesExceptionMessage
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Dieser Block unterstützt die Kombination von Datentypen in der aktuellen Eingabeliste {0} nicht. Stellen Sie sicher, dass die Eingabeliste Elemente desselben Datentyps oder eine Kombination von Typen mit einem gemeinsamen übergeordneten Typ enthält.'

DSCore.Properties.Resources.DefineDataUnsupportedDataTypeExceptionMessage
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Dieser Block unterstützt den aktuellen Eingabedatentyp ({0}) nicht. Zeigen Sie die unterstützten Datentypen in der Dropdown-Liste an.'

DSCore.Properties.Resources.EnumDateOfWeekFriday
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Freitag'.

DSCore.Properties.Resources.EnumDateOfWeekMonday
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Montag'.

DSCore.Properties.Resources.EnumDateOfWeekSaturday
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Samstag'.

DSCore.Properties.Resources.EnumDateOfWeekSunday
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Sonntag'.

DSCore.Properties.Resources.EnumDateOfWeekThursday
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Donnerstag'.

DSCore.Properties.Resources.EnumDateOfWeekTuesday
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Dienstag'.

DSCore.Properties.Resources.EnumDateOfWeekWednesday
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Mittwoch'.

DSCore.Properties.Resources.Exception_Deserialize_Bad_Format
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'JSON-Datei für Typ {0} wurde nicht korrekt formatiert'.

DSCore.Properties.Resources.Exception_Deserialize_Unsupported_Cache
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Die gespeicherten Daten können nicht geladen werden.'.

DSCore.Properties.Resources.Exception_Serialize_Depth_Unsupported
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Tiefe {0} überschreitet MaxDepth {1} bei Pfad " {2}"'.

DSCore.Properties.Resources.Exception_Serialize_DesignScript_Unsupported
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Dieser Geometrietyp kann nicht serialisiert werden.'.

DSCore.Properties.Resources.Exception_Serialize_Unsupported_Type
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Daten des Typs {0} können nicht gespeichert werden.'.

DSCore.Properties.Resources.ExportToCSVObsolete
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Verwenden Sie stattdessen den Block Data.ExportCSV.'.

DSCore.Properties.Resources.FactorialNegativeInt
Sucht eine lokalisierte Zeichenfolge ähnlich wie Der Eingabewert von Math.Factorial darf nicht negativ sein.

DSCore.Properties.Resources.FactorialOverflow
Sucht eine lokalisierte Zeichenfolge ähnlich wie Der Rückgabewert von Math.Factorial liegt außerhalb des Bereichs.

DSCore.Properties.Resources.FindPointsWithinRadiusNullPointMessage
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Sie müssen einen Mittelpunkt angeben.'.

DSCore.Properties.Resources.FindPointsWithinRadiusSearchRadiusMessage
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Der Suchradius darf nicht null sein.'.

DSCore.Properties.Resources.FromObjectObsolete
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Dieser Block ist veraltet, bitte "String from Object" verwenden.'.

DSCore.Properties.Resources.IntegerOverflow
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Der Vorgang führte zu einem Ganzzahlüberlauf. Das Ergebnis ist möglicherweise unerwartet.'.

DSCore.Properties.Resources.InvalidDestinationPathErrorMessage
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Ungültiger Zieldateipfad als Kopierpfad verwendet.'.

DSCore.Properties.Resources.InvalidKeysErrorMessage
Sucht eine lokalisierte Zeichenfolge ähnlich wie Ein oder mehrere Eingabetypen stimmen nicht überein. Listen werden nicht als Schlüssel unterstützt.

DSCore.Properties.Resources.InvalidKeysLenghtErrorMessage
Sucht eine lokalisierte Zeichenfolge ähnlich wie Anzahl der Elemente stimmt nicht mit der Anzahl der Schlüssel überein. href=InvalidKeysLenghtErrorMessage.html.

DSCore.Properties.Resources.LoadImageFromPathObsolete
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Verwenden Sie stattdessen File.FromPath ->  Image.ReadFromFile-Blöcke.'.

DSCore.Properties.Resources.MissingPythonEngine
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Die ausgewählte Python-Engine wurde nicht gefunden'.

DSCore.Properties.Resources.ObjectArgumentExceptionMessage
Sucht eine lokalisierte Zeichenfolge ähnlich wie Objekt kann nicht Null sein, bitte geeigneten Wert eingeben.

DSCore.Properties.Resources.QuadtreeConstructionEmptyUVSetMessage
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Sie können kein Quadtree aus einer leeren Punktmenge erstellen.'.

DSCore.Properties.Resources.QuadtreeConstructionNullUVSetMessage
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Aus einer Nullmenge von UVs kann kein Quadtree erstellt werden.'.

DSCore.Properties.Resources.ReadImageObsolete
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Verwenden Sie stattdessen File.FromPath ->  Image.ReadFromFile ->  Image.Pixels-Blöcke.'.

DSCore.Properties.Resources.ReadTextObsolete
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Verwenden Sie stattdessen File.FromPath ->  File.ReadText-Blöcke.'.

DSCore.Properties.Resources.StringRemoveCountOutOfRangeMessage
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Anzahl liegt außerhalb des Bereichs'.

DSCore.Properties.Resources.StringRemoveStartIndexOutOfRangeMessage
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Startindex liegt außerhalb des Bereichs.

DSCore.Properties.Resources.StringToNumberInvalidNumberMessage
Sucht eine lokalisierte Zeichenfolge ähnlich wie "Keine gültige Nummer".

DSCore.Properties.Resources.WebRequestNullUrlMessage
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'URL darf nicht null sein'.

DSCore.Properties.Resources.WriteImageObsolete
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Verwenden Sie stattdessen den Block Image.WriteToFile.'.