DSCore.Data.ParseJSON(System.String)
Analyse konvertiert eine beliebige JSON-Zeichenfolge in einen Wert (Gegenteil von JSON.Stringify).
json: JSON-Zeichenfolge
Der Ergebnistyp hängt vom Inhalt der eingegebenen Zeichenfolge ab. Der Ergebnistyp kann ein primitiver Wert (z. B. string, boolean, double), eine Liste oder ein Wörterbuch sein.

DSCore.Data.ToNative(Newtonsoft.Json.Linq.JToken)
Analyse-Implementierung für die Konvertierung von JToken-Typen in native .NET-Objekte.
token: JToken zum Analysieren in N

DSCore.Data.DynamoJObjectToNative(Newtonsoft.Json.Linq.JObject)
Analyse-Implementierung für die Konvertierung von JObject-Typen in bestimmte Dynamo-Objekte (z. B. Geometrie, Farbe, Bilder usw.)
Throws System.Exception:

DSCore.Data.StringifyJSON(System.Object)
Stringify konvertiert einen beliebigen Wert oder eine Liste beliebiger Werte in JSON. Mit Replikation kann der Vorgang auf eine Liste angewendet werden und erzeugt eine Liste von JSON-Zeichenfolgen.
values: Liste von Werten
JSON-Zeichenfolge, mit der primitive Typen (z. B. double, int, boolean), Listen und Wörterbücher in den zugehörigen JSON-Typ umgewandelt werden.

DSCore.Data.CanObjectBeCached(System.Object)
Hilfsfunktion, um zu bestimmen, ob ein Objekt im Cache gespeichert werden kann oder ob es null, "null" Zeichenfolge oder eine leere Liste ist.
inputObject: Zu prüfendes Objekt

DSCore.Data.Remember(System.Object,System.String)
Funktion für die Cache-Speicherung für den Block Data.Remember
inputObject: Im Cache zu speicherndes Objekt
cachedJson: Optional im Cache vorhandene JSON-Datei

DSCore.Data.DataNodeDynamoTypeList
Statische Liste für alle von Dynamo unterstützten Datentypen
Returns: Die Liste mit den unterstützten Datentypen

DSCore.Data.#cctor
Statischer Konstruktor

DSCore.Data.SafeExtractDictionaryValue(System.Collections.Generic.Dictionary{System.String,System.Object},System.String)
Eine Hilfsfunktion zum sicheren Extrahieren eines Wörterbuchwerts
dict: Das Wörterbuch, aus dem der Wert extrahiert werden soll
key: Der Schlüssel des Schlüssel-/Wert-Paars

DSCore.Data.EvaluateDefineDataNode(System.Object,System.String,System.Boolean,System.Boolean,System.String)
Dies ist die Funktion, die von AST zum Auswerten des Blocks DefineData verwendet wird.
Sie verarbeitet einen Teil der Blocklogik während der Validierung
inputValue: Vorgelagerter Eingabewert
typeString: Der Typ als Zeichenfolge (Todo: Für den direkten Typenvergleich ist es empfehlenswert, ein Objekt des Typs 'Typ' zu übergeben)
isList: Wenn der Eingabetyp `ArrayList` ist
isAutoMode: Wenn sich der Block im automatischen Modus befindet
playerValue: Der Wert, der von Dynamo Player in den Block eingefügt wird, falls vorhanden.

DSCore.Data.FindCommonAncestor(System.Collections.ArrayList)
Eine Funktion zum Suchen des Typs, falls eine ArrayList von Objekten im AutoMode übergeben wurde
list: Der Eingabewert, wobei der Typ ArrayList erwartet wird

DSCore.Data.LikelyAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
Eine Hilfsfunktion, die den Block der untersten Ebene aus einer Liste von DataNodeDynamoType-Blöcken zurückgibt
nodes: Die Liste der auszuwertenden DataNodeDynamoType-Elemente

DSCore.Data.FindClosestCommonAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
Eine Hilfsfunktion zum Ermitteln eines gemeinsamen Vorgängers in einer Liste von Datentypen
nodes: Die Liste der auszuwertenden DataType-Blöcke

DSCore.Data.FindCommonAncestorBetweenTwoNodes(DSCore.Data.DataNodeDynamoType,DSCore.Data.DataNodeDynamoType)
Rekursive Funktion zum Suchen eines gemeinsamen Vorgängers zwischen zwei Dynamo-Typen
Läuft in der hierarchischen Struktur für likelyAncestor von unten nach oben bis
node: Überprüft, ob dieser Block vom wahrscheinlichen Vorgänger abgeleitet wurde
likelyAncestor: Der wahrscheinliche Vorgänger, von dem der Block abgeleitet werden soll

DSCore.Data.GetListFromTypes(System.Collections.ArrayList)
Gibt eine Liste von DataNodeDynamoTypes aus einer ArrayList von Objekten zurück
list: ArrayList der neu zu formatierenden Objekte

DSCore.Data.IsSingleValueOrSingleLevelArrayList(System.Object)
Überprüft, ob das Eingabeobjekt ein einzelner Wert oder eine ArrayList mit einer einzigen Ebene ist.
obj: Das auszuwertende Eingabeobjekt

DSCore.Data.IsSupportedDataNodeDynamoType(System.Object,System.Type,System.Boolean)
Funktion, die prüft, ob der Eingabetyp zu den in Dynamo unterstützten Eingabetypen gehört
inputValue: Die eingehenden, zu validierenden Daten
type: Der vom Benutzer angegebene Eingabetyp. Er muss mit dem Typ inputValue übereinstimmen.
isList: Dieser boolesche Wert entscheidet, ob die Eingabe ein einzelnes Objekt oder eine Liste ist

DSCore.Data.IsItemOfType(System.Object,System.Type)
Diese Methode prüft, ob ein Element einen erforderlichen Dynamo-DataType aufweist.
'IsInstanceOfType' führt eine rekursive Überprüfung auf aufsteigende Übernahmen durch
item: Element, auf das der Datentyp überprüft werden soll
dataType: DataType, auf den geprüft werden soll
Returns: Ergebnis mit true oder false, das auf der Überprüfungsvalidierung basiert

DSCore.Data.IsDerivedFrom(System.Type,System.Type)
Diese Methode überprüft, ob ein Typ von einem Basistyp abgeleitet wurde
derivedType: Der Typ, der bestätigt werden soll
baseType: Der Basistyp für den Vergleich