DSCore.IO.Image
Methoden für die Arbeit mit Bild-Bitmaps

DSCore.IO.Image.ReadFromFile(System.IO.FileInfo)
Lädt die Datei als Bitmap.
file: Dateiobjekt, aus dem das Bild geladen werden soll
Bildobjekt aus der Datei

DSCore.IO.Image.Pixels(System.Drawing.Bitmap,System.Nullable{System.Int32},System.Nullable{System.Int32})
Liest eine Bilddatei, und gibt die Farbwerte an den angegebenen Rasterpositionen zurück.
image: Bildobjekt, aus dem die Pixelfarben abgerufen werden sollen
xSamples: Anzahl der Sample-Rasterpunkte in X-Richtung
ySamples: Anzahl der Sample-Rasterpunkte in Y-Richtung
Farben an den angegebenen Rasterpunkten
read,image,bitmap,png,jpg,jpeg

DSCore.IO.Image.FromPixels(DSCore.Color[][])
Erstellt ein Bild aus einer 2D-Pixelliste.
colors: Rechteckige 2D-Liste der Farben für die Pixel
Bild der 2D-Liste von Pixeln

DSCore.IO.Image.FromPixels(DSCore.Color[],System.Int32,System.Int32)
Erstellt ein Bild aus einer flachen Pixelliste, einem Breiten- und einem Höhenwert.
colors: Liste der Farben für die Pixel
width: Breite des neuen Bilds in Pixeln
height: Höhe des neuen Bilds in Pixeln
Bild von der Liste der Pixel

DSCore.IO.Image.Dimensions(System.Drawing.Bitmap)
Gibt die Breite und Höhe eines Bilds zurück.
image: Bild, dessen Abmessungen abgerufen werden
Bildbreite in Pixeln
Bildhöhe in Pixeln

DSCore.IO.Image.WriteToFile(System.String,System.Drawing.Bitmap)
Schreibt das Bild unter Verwendung des angegebenen Dateinamens in einen Pfad.
image: Das zu schreibende Bild
Bildobjekt erstellt
write image,image,file,filepath