DSCore.Data.MaxDepthJsonTextWriter
Subklasse von JsonTextWriter, die eine maximale unterstützte Objekttiefe einschränkt, um Abstürze von zirkulären Referenzen beim Serialisieren beliebiger .NET-Objekttypen zu verhindern.