DSCore.Math
Methoden für mathematische Operationen

DSCore.Math.Random(System.Nullable{System.Int32})
Generiert einen zufälligen double-Wert im Bereich [0, 1].
seed: Ausgangszahl für den Zufallsgenerator
Zufallszahl zwischen 0 und 1
random,seed

DSCore.Math.Random(System.Double,System.Double)
Erstellt eine zufällige Zahl im Bereich [lower_number, higher_number].
value1: Unteres Ende des Bereichs für die Zufallszahl.
value2: Oberes Ende des Bereichs für die Zufallszahl.
Zufallszahl im Bereich [lower_number, higher_number].
random,numberrange

DSCore.Math.Random(System.Double,System.Double,System.Int32)
Erstellt eine Zufallszahl im Bereich [lower_number, higher_number] basierend auf einer ursprünglichen Ausgangszahl.
value1: Unteres Ende des Bereichs für die Zufallszahl.
value2: Oberes Ende des Bereichs für die Zufallszahl.
seed: Ausgangszahl für den Zufallsgenerator.
Zufallszahl im Bereich [lower_number, higher_number].
random,numberrange,seed

DSCore.Math.RandomList(System.Int32)
Gibt eine Liste mit der angegebenen Anzahl zufälliger double-Werte
im Bereich [0, 1] aus.
amount: Anzahl der Zufallszahlen in der Ergebnisliste
Liste der Zufallszahlen zwischen 0 und 1
random,listcontains

DSCore.Math.RandomList(System.Int32,System.Double,System.Double,System.Int32)
Erzeugt eine Liste mit der angegebenen Anzahl zufälliger double-Werte
basierend auf einer ursprünglichen Ausgangszahl im definierten Bereich von [lower_number, higher_number].
amount: Anzahl der Zufallszahlen in der Ergebnisliste.
value1: Unteres Ende des Bereichs für die Zufallszahl.
value2: Oberes Ende des Bereichs für die Zufallszahl.
seed: Ausgangszahl für den Zufallsgenerator.
Liste der Zufallszahlen im Bereich [lower_number, higher_number].
random,listcontains,seed

DSCore.Math.PiTimes2
Konstante Pi multipliziert mit 2
2 mal Pi
2pi,2*pi,twopi,two*pi

DSCore.Math.Average(System.Collections.Generic.IList{System.Double})
Berechnet den Durchschnitt einer Liste von Zahlen.
numbers: Liste der Zahlen, deren Durchschnitt berechnet werden soll
Durchschnitt der Liste von Zahlen
avg,mean

DSCore.Math.Map(System.Double,System.Double,System.Double)
Ordnet den Eingabewert anhand des Eingabebereichs einer Zahl zwischen 0 und 1 zu.
rangeMin: Der Mindestwert des Eingabebereichs
rangeMax: Der Maximalwert des Eingabebereichs
inputValue: Die zuzuordnende Zahl
Der zugeordnete Wert
map,range,minimum,maximum,normalize,scale,remap

DSCore.Math.MapTo(System.Double,System.Double,System.Double,System.Double,System.Double)
Ordnet den Eingabewert einer Zahl zwischen targetRangeMin und targetRangeMax zu.
rangeMin: Der Mindestwert des Eingabebereichs.
rangeMax: Der Maximalwert des Eingabebereichs.
inputValue: Die zuzuordnende Zahl.
targetRangeMin: Der Mindestwert für den neuen Bereich
targetRangeMax: Der Maximalwert für den neuen Bereich
Der zugeordnete Wert.
map,range,mapto,minimum,maximum,normalize,scale,remap

DSCore.Math.RemapRange(System.Collections.Generic.IList{System.Double},System.Double,System.Double)
Passt den Bereich einer Liste von Zahlen an, wobei deren
Verteilung erhalten bleibt.
numbers: Liste der Zahlen, deren Bereich angepasst werden soll
newMin: Neuer Mindestwert des Bereichs
newMax: Neuer Höchstwert des Bereichs
Dem neuen Bereich zugeordnete Liste
remap range

DSCore.Math.kRadiansToDegrees
verschiebt Funktionen/Methoden von Math.dll in diese DSCoreNode.dll

DSCore.Math.PI
Die mathematische Konstante Pi (3.14159...)
Die Konstante Pi
3.141592653589793

DSCore.Math.E
Die mathematische Konstante e (2,71828...)
Die Konstante e
exp,2.718281828459045

DSCore.Math.GoldenRatio
Der Goldene Schnitt (1 + Quadratwurzel(5))/2 = 1.61803...)
Der Goldene Schnitt
golden,ratio,divine,phi,tau,1.61803398875

DSCore.Math.RadiansToDegrees(System.Double)
Konvertiert einen Winkel in Bogenmaß in einen Winkel in Grad.
radians: Winkel in Bogenmaß
Winkel in Grad
radians,degrees,angle

DSCore.Math.DegreesToRadians(System.Double)
Konvertiert einen Winkel in Grad in einen Winkel in Bogenmaß.
degrees: Winkel in Grad
Winkel in Bogenmaß
degrees,radians,angle

DSCore.Math.Abs(System.Double)
Ermittelt den absoluten Wert einer Zahl.
number: Zahl, von der der absolute Wert abgerufen wird
Der absolute Wert der Zahl
absolute value,magnitude

DSCore.Math.Equals(System.Double,System.Double,System.Double)
Diese Methode wird NUR vom Block Gleich (mit Toleranz) NodeModel verwendet

DSCore.Math.Abs(System.Int64)
Ermittelt den absoluten Wert einer Zahl.
integer: Eine Zahl
Der Absolutwert der Zahl
absolute value,magnitude

DSCore.Math.Acos(System.Double)
Ermittelt den Arkuskosinus, d. h. den Winkel, dessen Kosinus das angegebene Verhältnis darstellt.
ratio: Der Kosinus des Winkels: eine Zahl im Bereich [-1, 1]
Der Winkel, dessen Kosinus das eingegebene Verhältnis ist
acosine,arccosine

DSCore.Math.Asin(System.Double)
Ermittelt den Arkussinus, d. h. den Winkel, dessen Sinus das angegebene Verhältnis darstellt.
ratio: Der Sinus des Winkels: eine Zahl im Bereich [-1, 1]
Der Winkel, dessen Sinus das angegebene Verhältnis darstellt
asine,arcsin

DSCore.Math.Atan(System.Double)
Ermittelt den Arkustangens, d. h. den Winkel, dessen Tangens das angegebene Verhältnis darstellt.
ratio: Der Tangens des Winkels
Der Winkel, dessen Tangens das angegebene Verhältnis darstellt
atangent,arctangent

DSCore.Math.Atan2(System.Double,System.Double)
Ermittelt den Arkustangens des Quotienten aus zwei Zahlen. Gibt den Winkel zurück,
dessen Tangens dem Verhältnis Zähler/Nenner entspricht.
numerator: Der Zähler für den Tangens des Winkels
denominator: Der Nenner für den Tangens des Winkels
Der Winkel, dessen Tangens gleich dem Quotienten Zähler/Nenner ist
atangent,arctangent

DSCore.Math.Ceiling(System.Double)
Gibt die erste Ganzzahl zurück, die größer als die angegebene Zahl ist.
number: Die zu rundende Zahl
Erste Ganzzahl größer als die Zahl
ceiling,round

DSCore.Math.Cos(System.Double)
Ermittelt den Kosinus eines Winkels.
angle: Winkel in Grad, dessen Kosinus ermittelt werden soll
Kosinus des Winkels
cosine

DSCore.Math.Cosh(System.Double)
Ermittelt den hyperbolischen Kosinus eines Winkels (Bogenmaß).
angle: Winkel in Bogenmaß
Hyperbolischer Kosinus des Winkels
hyperbolic cosine

DSCore.Math.DivRem(System.Int64,System.Int64)
Ermittelt den Rest von Dividend/Divisor.
dividend: Die zu teilende Zahl
divisor: Die Zahl, durch die geteilt werden soll
Der bei der Division verbleibende Rest
remainder

DSCore.Math.EvaluateFormula(System.String,System.String[],System.Object[])
Wertet eine NCalc-Formel mit angegebenen Parameterzuordnungen aus.
formulaString: NCalc-Formel
parameters: Variablennamen
arguments: Variablenbindungen
type: var[]..[] (Ergebnis der Formelberechnung)

DSCore.Math.Exp(System.Double)
Gibt den Exponentialwert der Zahl aus, d. h. die Konstante e potenziert mit dem Wert der Zahl.
number: Die Zahl
Der Exponentialwert der Zahl
exponential

DSCore.Math.Floor(System.Double)
Gibt die erste Ganzzahl zurück, die kleiner als die angegebene Zahl ist.
number: Die abzurundende Zahl
Erste Ganzzahl kleiner als die Zahl
round

DSCore.Math.Log(System.Double)
Ermittelt den natürlichen Logarithmus einer Zahl im Bereich (0, ∞).
number: Zahl größer als 0
Natürlicher Logarithmus der Zahl
natural,logarithm,ln

DSCore.Math.Log(System.Double,System.Double)
Ermittelt den Logarithmus einer Zahl für die angegebene Basis.
number: Zahl größer als 0
logBase: Basis des Logarithmus im Bereich [0,1),(1, ∞]
Logarithmus der Zahl
logarithm,ld,lg

DSCore.Math.Log10(System.Double)
Ermittelt den dekadischen Logarithmus einer Zahl.
number: Zahl größer als 0
Logarithmus der Zahl
logarithm

DSCore.Math.Max(System.Double,System.Double)
Gibt die größere von zwei Zahlen zurück.
value1: Zu vergleichende Zahl
value2: Zu vergleichende Zahl
Die größere der beiden Zahlen
maximum,greater,larger

DSCore.Math.Max(System.Int64,System.Int64)
Gibt die größere von zwei Zahlen zurück.
int1: Zu vergleichende Zahl
int2: Zu vergleichende Zahl
Die größere der beiden Zahlen
maximum,greater,larger

DSCore.Math.Min(System.Double,System.Double)
Gibt die kleinere von zwei Zahlen zurück.
value1: Zu vergleichende Zahl
value2: Zu vergleichende Zahl
Die kleinere der beiden Zahlen
minimum,lesser,smaller

DSCore.Math.Min(System.Int64,System.Int64)
Gibt die kleinere von zwei Zahlen zurück.
int1: Zu vergleichende Zahl
int2: Zu vergleichende Zahl
Die kleinere der beiden Zahlen
minimum,lesser,smaller

DSCore.Math.Pow(System.Double,System.Double)
Potenziert eine Zahl mit dem angegebenen Wert.
number: Die zu potenzierende Zahl
power: Der Exponent
Die potenzierte Zahl
^,power,raise,exponent

DSCore.Math.Rand
Erstellt eine Zufallszahl im Bereich [0, 1].
Die Zufallszahl im Bereich [0, 1]
random,numberrange

DSCore.Math.Round(System.Double)
Rundet eine Zahl auf die nächste Ganzzahl.
Beachten Sie, dass diese Methode keine Ganzzahl, sondern eine Gleitkommazahl mit doppelter Genauigkeit zurückgibt.
number: Die zu rundende Zahl
Ganzzahl, die der Zahl am nächsten kommt

DSCore.Math.Round(System.Double,System.Int32)
Rundet eine Zahl auf eine angegebene Anzahl Nachkommastellen.
number: Zu rundende Zahl
digits: Anzahl der Nachkommastellen im Rückgabewert
Die dem Wert am nächsten kommende Zahl mit der den angegebenen Stellen entsprechenden Anzahl Nachkommastellen

DSCore.Math.Sign(System.Double)
Gibt das Vorzeichen der Zahl zurück: -1, 0 oder 1.
number: Zahl, von der das Vorzeichen abgerufen wird
Das Vorzeichen der Zahl: -1, 0 oder 1

DSCore.Math.Sign(System.Int64)
Gibt das Vorzeichen der Zahl zurück: -1, 0 oder 1.
int: Ganzzahl, von der das Vorzeichen abgerufen wird
Das Vorzeichen der Zahl: -1, 0 oder 1

DSCore.Math.Sin(System.Double)
Ermittelt den Sinus eines Winkels.
angle: Winkel in Grad, dessen Sinus ermittelt werden soll
Sinus des Winkels
sine

DSCore.Math.Sinh(System.Double)
Ermittelt den hyperbolischen Sinus eines Winkels (Bogenmaß).
angle: Winkel in Bogenmaß
Hyperbolischer Sinus des Winkels
hyperbolic

DSCore.Math.Sqrt(System.Double)
Ermittelt die positive Quadratwurzel einer Zahl im Bereich [0, ∞].
number: Eine Zahl im Bereich [0, ∞]
Positive Quadratwurzel der Zahl
square,root,radical

DSCore.Math.Tan(System.Double)
Ermittelt den Tangens eines Winkels.
angle: Winkel in Bogenmaß
Tangens des Winkels
tangent

DSCore.Math.Tanh(System.Double)
Ermittelt den hyperbolischen Tangens eines Winkels (Bogenmaß).
angle: Winkel in Bogenmaß
Hyperbolischer Tangens des Winkels
hyperbolic,tanh

DSCore.Math.Sum(System.Collections.Generic.IEnumerable{System.Double})
Ermittelt die Summe einer Reihe von Zahlen.
values: Die zur Summe zu addierenden Zahlen
Die Summe der Werte
mass addition,massadd

DSCore.Math.Factorial(System.Int64)
Ermittelt die Fakultät einer positiven Ganzzahl.
number: Eine positive Ganzzahl
Die Fakultät der Ganzzahl
!

DSCore.Math.Xor(System.Boolean,System.Boolean)
Boolesche XOR-Operation: Gibt true zurück, wenn und nur wenn genau eine der Eingaben den Wert true hat.
bool: Ein boolescher Wert
otherBool: Weiterer boolescher Wert
Ergebnis der booleschen Operation
xor,exclusive,or

DSCore.Math.DoCheckedCast(System.Double)
Führt in einem geprüften Kontext eine zu lange Umwandlung aus. Wenn der Vorgang einen Überlauf erzeugt,
wird eine Warnung aus- und das übergelaufene Ergebnis zurückgegeben.
value: Auszuführender Vorgang
Returns: Ergebnis des Vorgangs