DSCore.Color.Red
Rote Komponente der Farbe ermitteln: 0 bis 255
Rot-Wert für RGB-Farbmodell, Ganzzahl zwischen 0 und 255 (inklusiv).

DSCore.Color.Green
Grüne Komponente der Farbe ermitteln: 0 bis 255
Grün-Wert für RGB-Farbmodell, Ganzzahl zwischen 0 und 255 (inklusiv).

DSCore.Color.Blue
Blaue Komponente der Farbe ermitteln: 0 bis 255
Blau-Wert für RGB-Farbmodell, Ganzzahl zwischen 0 und 255 (inklusiv).

DSCore.Color.Alpha
Alpha-Komponente der Farbe ermitteln: 0 bis 255
Alpha-Wert, Ganzzahl zwischen 0 und 255 (inklusiv).

DSCore.Color.ByARGB(System.Int32,System.Int32,System.Int32,System.Int32)
Farbe durch Alpha-, Rot-, Grün- und Blau-Komponenten erstellen
alpha: Alpha-Wert (zwischen 0 und 255 (inklusiv))
red: Rot-Wert für RGB-Farbmodell (zwischen 0 und 255 (inklusiv))
green: Grün-Wert für RGB-Farbmodell (zwischen 0 und 255 (inklusiv))
blue: Blau-Wert für RGB-Farbmodell (zwischen 0 und 255 (inklusiv))
Farbe erstellt über ARGB
color

DSCore.Color.Brightness(DSCore.Color)
Gibt den Helligkeitswert für die Farbe zurück.
color: Farbe, von der Helligkeit abgefragt werden soll
Helligkeitswert (zwischen 0 und 1 (inklusiv))

DSCore.Color.Saturation(DSCore.Color)
Gibt den Sättigungswert für die Farbe zurück.
Sättigungswert als double-Wert zwischen 0 und 1 (inklusiv).

DSCore.Color.Hue(DSCore.Color)
Gibt den Farbtonwert für die Farbe zurück.
color: Ein Farbobjekt
Farbtonwert für Farbe als double-Wert zwischen 0 und 1 (inklusiv).
hues

DSCore.Color.Components(DSCore.Color)
Listet die Komponenten für die Farbe in der Reihenfolge Alpha, Rot, Grün, Blau auf.
color: Ein Farbobjekt
Alpha-Wert, Ganzzahl zwischen 0 und 255 (inklusiv).
Rot-Wert für RGB-Farbmodell, Ganzzahl zwischen 0 und 255 (inklusiv).
Grün-Wert für RGB-Farbmodell, Ganzzahl zwischen 0 und 255 (inklusiv).
Blau-Wert für RGB-Farbmodell, Ganzzahl zwischen 0 und 255 (inklusiv).
alpha,red,green,blue

DSCore.Color.BuildColorFrom1DRange(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double},System.Double)
Gibt eine Farbe aus einem Farbverlauf zwischen einer Anfangs- und einer Endfarbe zurück.
parameters: Die Werte zwischen 0 und 1 im Bereich, für den die Farbe als Muster entnommen werden soll.
Farben im angegebenen Bereich.
color,range,gradient

DSCore.Color.Lerp(DSCore.Color,DSCore.Color,System.Double)
Lineare Interpolierung zwischen zwei Farben.
start: Die Startfarbe.
end: Die Endfarbe.
t: Ein Parameter zwischen 0.0 und 1.0.
Returns: Die interpolierte Farbe oder Weiß.

DSCore.Color.Blerp(System.Collections.Generic.IList{DSCore.Color.IndexedColor2D},Autodesk.DesignScript.Geometry.UV)
Bilineare Interpolierung zwischen einem Satz von Farben.
Returns: Die interpolierte Farbe oder Weiß.
This algorithm is not the same as the solution found from wikipedia
(reference: https://en.wikipedia.org/wiki/Bilinear_interpolation)

DSCore.Color.Add(DSCore.Color,DSCore.Color)
Konstruiert eine Farbe durch Kombination der ARGB-Werte zweier bestehender Farben.
color: Hinzuzufügende Farbe
otherColor: Weitere hinzuzufügende Farbe
Farbergebnis durch Addition zweier Farben

DSCore.Color.Multiply(DSCore.Color,System.Double)
Multipliziert eine eingegebene Farbe mit einem numerischen Multiplikator, um eine dunklere Farbe zu erhalten. Der Alpha-Wert der eingegebenen Farbe muss kleiner sein als 255.
color: Zu multiplizierende Farbe
multiplier: Multiplikatorwert
Farbergebnis durch Multiplikation

DSCore.Color.Divide(DSCore.Color,System.Double)
Teilt eine eingegebene Farbe durch einen numerischen Divisor, um eine hellere Farbe zu erhalten und die Farbtönung zu entfernen.
color: Zu teilende Farbe
dividend: Dividend-Wert
Farbergebnis durch Teilung