DSCore.Object
Allgemeine Funktionen für alle Daten

DSCore.Object.IsNull(System.Object)
Bestimmt, ob das angegebene Objekt Null ist.
object: Zu testendes Objekt.
Angabe, ob das Objekt Null ist
is null

DSCore.Object.Identity(System.Object)
Gibt an, was übergeben wird, ohne weitere Aktion.
object: Ein Objekt.
Gleiches Objekt

DSCore.Object.Type(System.Object)
Gibt den Typ des Objekts als Zeichenfolge zurück.
object: Objekt, von dem der Typ abgerufen wird
Returns: Typ des Objekts