DSCore.CurveMapper.PowerCurve
Stellt eine Potenzfunktionskurve im CurveMapper dar.
Die Kurve wird durch eine Potenzgleichung definiert, die von einem Steuerpunkt abgeleitet wird.

DSCore.CurveMapper.PowerCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Gibt die X- und Y-Werte über die Kurve verteilt zurück.