DSCore.CurveMapper.SquareRootCurve
Stellt eine Quadratwurzelkurve im CurveMapper dar.
Die Kurve folgt einer Quadratwurzelfunktion und wird von zwei Steuerpunkten beeinflusst.

DSCore.CurveMapper.SquareRootCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Gibt die X- und Y-Werte über die Kurve verteilt zurück.