DSCore.CurveMapper.CurveBase
Stellt eine Basisklasse für alle Kurventypen im CurveMapper dar.
Bietet allgemeine Funktionen zum Generieren und Abrufen von Kurvenwerten.

DSCore.CurveMapper.CurveBase.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Abstrakte Methode, die von abgeleiteten Klassen zum Generieren von Kurvenwerten implementiert werden soll.

DSCore.CurveMapper.CurveBase.GetCurveXValues(System.Collections.Generic.List{System.Double},System.Boolean)
Allgemeine Methode zum Abrufen von X-Werten.

DSCore.CurveMapper.CurveBase.GetCurveYValues(System.Collections.Generic.List{System.Double},System.Boolean)
Allgemeine Methode zum Abrufen von Y-Werten.

DSCore.CurveMapper.CurveBase.GenerateFromDomain(System.Collections.Generic.List{System.Double},System.Func{System.Double,System.Double})
Generiert X- und Y-Werte durch Zuordnen von Domäneneingaben zum Ansichtsbereich und Auswerten einer Kurvenfunktion.