DSCore.Thread
Funktionen für die Bearbeitung von Auswertungs-Threads

DSCore.Thread.Pause(System.Object,System.Int32)
Hält den aktuellen Auswertungs-Thread für den angegebenen Zeitraum an.
object: Zu übergebendes Objekt.
msTimeout: Zeitraum für die Unterbrechung des Threads in Millisekunden
Übergebenes Objekt