DSCore.CurveMapper.SineWave
Stellt eine Sinuswellenkurve im CurveMapper dar.
Die Sinuswelle wird durch zwei Steuerpunkte definiert und folgt einer trigonometrischen Funktion.

DSCore.CurveMapper.SineWave.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Gibt die X- und Y-Werte über die Kurve verteilt zurück.