DSCore.IO.FileSystem
Methoden für die Arbeit mit Dateien

DSCore.IO.FileSystem.AbsolutePath(System.String,System.String)
Gibt den absoluten Pfad aus dem angegebenen Pfad zurück. Wenn der angegebene Pfad
ein relativer Pfad ist, wird er in Bezug zum aktuellen Arbeitsbereich
aufgelöst. Wenn die Datei unter dem relativen Pfad nicht vorhanden ist, aber unter
dem angegebenen hintPath existiert, wird der hintPath zurückgegeben.
path: Relativer Pfad oder vollständiger Pfad
hintPath: Letzter aufgelöster Pfad
Returns: Absoluter Pfad

DSCore.IO.FileSystem.FileFromPath(System.String)
Erstellt Dateiobjekt aus dem angegebenen Dateipfad.

DSCore.IO.FileSystem.ReadText(System.IO.FileInfo)
Liest eine Textdatei und gibt die Inhalte als Zeichenfolge zurück.
file: Dateiobjekt, aus dem Text gelesen werden soll
Inhalte der Textdatei.
read file,text,file

DSCore.IO.FileSystem.MoveFile(System.String,System.String,System.Boolean)
Verschiebt eine angegebene Datei an einen neuen Speicherort.
path: Zeichenfolgendarstellung des vorhandenen Pfads
newPath: Zeichenfolgendarstellung des neuen Pfads
overwrite: Überschreiben vorhandener Dateien ein/aus
Block führt eine Aufgabe aus, erzeugt keine Ausgabe

DSCore.IO.FileSystem.DeleteFile(System.String)
Löscht die angegebene Datei.
path: Zu löschender Dateipfad
Block führt eine Aufgabe aus, erzeugt keine Ausgabe

DSCore.IO.FileSystem.CopyFile(System.IO.FileInfo,System.String,System.Boolean)
Kopiert eine Datei.
file: Zu kopierendes Dateiobjekt
destinationPath: Zeichenfolgendarstellung des Zieldateipfads
overwrite: Überschreiben vorhandener Dateien ein/aus
Block führt eine Aufgabe aus; bei erfolgreicher Kopieraktion wird true zurückgegeben.

DSCore.IO.FileSystem.FileExists(System.String)
Ermittelt, ob unter dem angegebenen Pfad eine Datei vorhanden ist.
path: Zeichenfolge, die einen Dateipfad darstellt
True, wenn Datei vorhanden ist, sonst False
filepath

DSCore.IO.FileSystem.WriteText(System.String,System.String)
Schreibt den Textinhalt in eine durch den Pfad angegebene Datei.
filePath: Pfad, unter dem geschrieben werden soll
text: Textinhalt
Keine Ausgabe
write file,text,file,filepath

DSCore.IO.FileSystem.AppendText(System.String,System.String)
Fügen Sie den Textinhalt einer durch den Pfad angegebenen Datei hinzu.
filePath: Pfad, unter dem geschrieben werden soll
text: Textinhalt
Block führt eine Aufgabe aus, erzeugt keine Ausgabe
append file,write file,text,file,filepath

DSCore.IO.FileSystem.CombinePath(System.String[])
Verbindet mehrere Zeichenfolgen zu einem einzelnen Dateipfad.
strings: Zu einem Pfad zu kombinierende Zeichenfolgen
Kombinierter Dateipfad

DSCore.IO.FileSystem.FileExtension(System.String)
Gibt die Erweiterung eines Dateipfads zurück.
path: Pfad, dessen Erweiterung abgerufen werden soll
Dateierweiterung

DSCore.IO.FileSystem.ChangePathExtension(System.String,System.String)
Ändert die Erweiterung eines Dateipfads.
path: Pfad, dessen Erweiterung geändert werden soll
newExtension: Zeichenfolgendarstellung der neuen Erweiterung
Dateipfad mit geänderter Erweiterung

DSCore.IO.FileSystem.DirectoryName(System.String)
Gibt den Verzeichnisnamen eines Dateipfads zurück.
path: Pfad, dessen Verzeichnisinformationen abgerufen werden sollen
Verzeichnisname des Dateipfads
directorypath

DSCore.IO.FileSystem.FileName(System.String,System.Boolean)
Gibt den Dateinamen eines Dateipfads zurück.
path: Pfad, dessen Dateiname abgerufen werden soll
withExtension: Erweiterung im Ergebnis berücksichtigen ein/aus
Dateiname aus Dateipfad

DSCore.IO.FileSystem.FileHasExtension(System.String)
Ermittelt, ob ein Dateipfad eine Erweiterung enthält.
path: Nach einer Erweiterung zu durchsuchender Pfad
True, wenn der Dateipfad eine Erweiterung enthält, sonst False

DSCore.IO.FileSystem.GetDirectoryContents(System.IO.DirectoryInfo,System.String,System.Boolean)
Gibt eine Liste mit Dateien und Verzeichnissen zurück, die sich in einem bestimmten Verzeichnis befinden. Mit einer optionalen searchString können Sie die Ergebnisse filtern.
directory: Verzeichnis zum Abrufen des Inhalts
searchString: Suchzeichenfolge zum Filtern von Ergebnissen
includeSubdirectories: Legen Sie diese Option auf True fest, um Dateien und Ordner in Unterverzeichnissen (rekursiv) einzubeziehen, oder legen Sie False fest, um Ergebnisse nur aus der obersten Ebene des angegebenen Verzeichnisses einzubeziehen.
Aus Abfrage resultierende Dateien
Aus Abfrage resultierende Verzeichnisse

DSCore.IO.FileSystem.CopyDirectory(System.IO.DirectoryInfo,System.String,System.Boolean)
Kopiert ein Verzeichnis an einen Zielspeicherort.
directory: Zu kopierendes Verzeichnis
destinationPath: Ziel des Kopiervorgangs auf dem Datenträger
overwriteFiles: Überschreiben des vorhandenen Verzeichnisses ein/aus
Block führt eine Aufgabe aus, erzeugt keine Ausgabe

DSCore.IO.FileSystem.DeleteDirectory(System.String,System.Boolean)
Löscht ein Verzeichnis.
path: Pfad zu einem Verzeichnis auf dem Datenträger
recursive: Gibt an, ob der gesamte Inhalt des Verzeichnisses gelöscht werden soll. Vorgabe: false.
Block führt eine Aufgabe aus, erzeugt keine Ausgabe

DSCore.IO.FileSystem.DirectoryExists(System.String)
Ermittelt, ob unter dem angegebenen Pfad ein Verzeichnis vorhanden ist.
path: Pfad zu einem Verzeichnis auf dem Datenträger
True, wenn das Verzeichnis vorhanden ist, sonst False
directorypath

DSCore.IO.FileSystem.MoveDirectory(System.String,System.String,System.Boolean)
Verschiebt ein Verzeichnis an einen neuen Speicherort.
path: Zeichenfolgendarstellung des vorhandenen Pfads
newPath: Zeichenfolgendarstellung des neuen Pfads
overwriteFiles: Überschreiben vorhandener Dateien ein/aus
Block führt eine Aufgabe aus, erzeugt keine Ausgabe