DSCore.ObjectComparer
Implementiert Vergleichsfunktion für zwei Objekte anhand der folgenden Regel.
1. Für Zahlen wird kleinste, dann boolesch, Zeichenfolge und Zeiger angenommen.
2. Wenn die zwei Objekte IComparable sind und zum selben Typ gehören,
wird der zugehörige native Vergleichsmechanismus verwendet.
3. Wenn beide Eingaben den Wertetyp aufweisen, aber keiner von ihnen boolesch ist,
ist der boolesche Wert größer.
4. Andernfalls erfolgt Konvertierung in double und das Vergleichen.
5. Wenn nur einer ein Wertetyp ist, dann ist Wertetypobjekt kleiner.
6. Wenn nur einer eine Zeichenfolge ist, ist die Zeichenfolge kleiner als andere Werte.
7. Wenn nicht sicher, wie verglichen werden soll, dann am besten nach Hashcode.