DSCore.Compare
Vergleichsmethoden

DSCore.Compare.GreaterThan(System.Object,System.Object)
Gibt true zurück, wenn a größer als b ist.
a: Ein vergleichbares Objekt.
b: Ein vergleichbares Objekt.
Ergebnis der booleschen Operation.
larger,bigger

DSCore.Compare.GreaterThanOrEqual(System.Object,System.Object)
Gibt true zurück, wenn a größer als oder gleich b ist.
a: Ein vergleichbares Objekt.
b: Ein vergleichbares Objekt.
Ergebnis der booleschen Operation.
larger,bigger,equal

DSCore.Compare.LessThan(System.Object,System.Object)
Gibt true zurück, wenn a kleiner als b ist.
a: Ein vergleichbares Objekt.
b: Ein vergleichbares Objekt.
Ergebnis der booleschen Operation.
less,smaller

DSCore.Compare.LessThanOrEqual(System.Object,System.Object)
Gibt true zurück, wenn a kleiner als oder gleich b ist.
a: Ein vergleichbares Objekt.
b: Ein vergleichbares Objekt.
Ergebnis der booleschen Operation.
smaller,equal