DSCore.ColorRange1D.ByColorsAndParameters(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double})
Erstellt eine ColorRange1D nach Angabe von Listen mit Farben und Parametern.
colors: Eine Liste mit Farben.
parameters: Eine Liste mit Parametern zwischen 0.0 und 1.0.
Returns: Ein ColorRange1D-Objekt.

DSCore.ColorRange1D.GetColorAtParameter(DSCore.ColorRange1D,System.Double)
Gibt die Farbe in diesem Farbbereich am angegebenen Parameter zurück.
parameter: Ein Wert zwischen 0.0 und 1.0.
Returns: Eine Farbe.

DSCore.ColorRange1D.Default
Erstellt eine ColorRange1D mit dem vorgegebenen Farbschema.