DSCore.Quadtree.ByUVs(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.UV})
Konstruiert einen Quadtree, der die Domäne (0,0)->(1,1) umfasst.
uvs: Eine Menge von UVs in der Domäne (0,0)->(1,1).
Returns: Ein Quadtree-Objekt.

DSCore.Quadtree.FindPointsWithinRadius(Autodesk.DesignScript.Geometry.UV,System.Double)
Sucht alle Quadtree-Punkte (UVs) im Quadtree im Radius der angegeben UV-Position.
center: Der UV in der Mitte des Suchbereichs.
radius: Der Radius des Suchbereichs.
Returns: Ein Liste von UVs.