DSCore.CurveMapper.GaussianCurve
Stellt eine Gaußsche Kurve im CurveMapper dar.
Die Gaußsche Kurve folgt einer glockenförmigen Verteilung, die durch vier Steuerpunkte definiert wird.

DSCore.CurveMapper.GaussianCurve.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Gibt an, ob die Größe des Blocks derzeit geändert wird, um unbeabsichtigte Aktualisierungen des Steuerpunkts zu verhindern.

DSCore.CurveMapper.GaussianCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Gibt die X- und Y-Werte über die Kurve verteilt zurück.