DSCore.Sorting
Dienstprogramm-Methoden zum Sortieren nach Schlüsseln. Diese sollten bei der Erstellung von Blöcken unterdrückt werden. Stattdessen
werden sie in DS-Implementierungen gekapselt, die Schlüsselzuordnungsfunktionen akzeptieren.