DSCore.String
Methoden für die Verwaltung von Zeichenfolgen

DSCore.String.ToNumber(System.String)
Konvertiert eine Zeichenfolge in einen integer- oder double-Wert.
string: Zu konvertierende Zeichenfolge
Ganzzahl oder Gleitkommazahl
2number,str2number,strtonumber,string2number,stringtonumber,int,double,cast

DSCore.String.GetNumber(System.String)
Ruft alle Nummernzeichenfolgen aus der Zielzeichenfolge als Zeichenfolge ab
string: Abzurufende Zielzeichenfolge
Nummer in Zeichenfolge
getnumber,tonumber,strtonumber,numberinstring,string2number,stringtonumber,int,double,cast

DSCore.String.Concat(System.String[])
Verkettet mehrere Zeichenfolgen zu einer einzigen Zeichenfolge.
strings: Liste der zu verkettenden Zeichenfolgen
Die aus der Liste von Zeichenfolgen erstellte Zeichenfolge
concatenate,join,combine strings

DSCore.String.Length(System.String)
Gibt die Anzahl der in der angegebenen Zeichenfolge enthaltenen Zeichen aus.
string: Zeichenfolge, deren Länge ermittelt werden soll
Anzahl der Zeichen in der Zeichenfolge
count,size,characters,chars,length,sizeof

DSCore.String.Split(System.String,System.String[])
Teilt eine einzelne Zeichenfolge in eine Liste von Zeichenfolgen auf, wobei die Unterteilungen
durch die angegebenen Trennzeichenfolgen bestimmt werden.
string: Aufzuteilende Zeichenfolge
separators: Zeichenfolgen, die (sofern vorhanden) Ende und Anfang der Teilung markieren.
Liste der aus der Eingabezeichenfolge erstellten Zeichenfolgen
divide,separator,delimiter,cut,csv,comma,

DSCore.String.Join(System.String,System.String[])
Verkettet mehrere Zeichenfolgen zu einer einzigen Zeichenfolge, und fügt dabei das angegebene
Trennzeichen zwischen den einzelnen verbundenen Zeichenfolgen ein.
separator: Die zwischen den verbundenen Zeichenfolgen einzufügende Zeichenfolge
strings: Die zu einer einzigen Zeichenfolge zu verbindenden Zeichenfolgen
Eine aus der Liste von Zeichenfolgen erstellte Zeichenfolge einschließlich Trennzeichen
join,separator,build csv,concat,construct

DSCore.String.ToUpper(System.String)
Konvertiert die gesamte angegebene Zeichenfolge in Großbuchstaben.
string: In Großbuchstaben zu konvertierende Zeichenfolge
Zeichenfolge in Großbuchstaben
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.ToLower(System.String)
Konvertiert die gesamte angegebene Zeichenfolge in Kleinbuchstaben.
string: In Kleinbuchstaben zu konvertierende Zeichenfolge
Zeichenfolge in Kleinbuchstaben
2lowercase,to lowercase,tolowercase,lowercase

DSCore.String.ToTitle(System.String)
Konvertiert die angegebene Zeichenfolge in eine Zeichenfolge mit großem Anfangsbuchstaben.
str: Zeichenfolge, die mit großem Anfangsbuchstaben verwendet werden soll
Zeichenfolge mit großem Anfangsbuchstaben
2titlecase,to titlecase,to title case,totitlecase,titlecase

DSCore.String.ChangeCase(System.String,System.Boolean)
Konvertiert die gesamte angegebene Zeichenfolge in Abhängigkeit von einem booleschen Parameter
in Großbuchstaben oder Kleinbuchstaben.
string: In Groß- oder Kleinbuchstaben zu konvertierende Zeichenfolge.
upper: true für Großbuchstaben, false für Kleinbuchstaben
In Groß- bzw. Kleinbuchstaben konvertierte Zeichenfolge
2lowercase,to lowercase,tolowercase,lowercase,
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.Substring(System.String,System.Int32,System.Int32)
Ruft eine Teilzeichenfolge aus der angegebenen Zeichenfolge ab. Die Teilzeichenfolge beginnt an der angegebenen
Zeichenposition und hat die angegebene Länge.
string: Zeichenfolge, aus der die Teilzeichenfolge abgerufen werden soll
startIndex: Zeichenposition für den Anfang der Teilzeichenfolge in der ursprünglichen Zeichenfolge
length: Anzahl der Zeichen in der Teilzeichenfolge
Aus der ursprünglichen Zeichenfolge erstellte Teilzeichenfolge
subset,get string,part,smaller string

DSCore.String.Contains(System.String,System.String,System.Boolean)
Bestimmt, ob die angegebene Zeichenfolge die angegebene Teilzeichenfolge enthält.
string: Zeichenfolge, in der gesucht werden soll
searchFor: Zu suchende Teilzeichenfolge
ignoreCase: Gibt an, ob die Groß- und Kleinschreibung beim Vergleich berücksichtigt werden soll
Gibt an, ob die Zeichenfolge die Teilzeichenfolge enthält
test,within,in,is in,part of

DSCore.String.CountOccurrences(System.String,System.String,System.Boolean)
Zählt die Anzahl der nicht überlappenden Vorkommen einer Teilzeichenfolge innerhalb der angegebenen Zeichenfolge.
string: Zeichenfolge, in der gesucht werden soll
searchFor: Zu suchende Teilzeichenfolge
ignoreCase: Gibt an, ob die Groß- und Kleinschreibung beim Vergleich berücksichtigt werden soll
Anzahl der nicht überlappenden Vorkommen der Teilzeichenfolge in der Zeichenfolge
count,substring,count occurrences,numberof,search,find,within

DSCore.String.Replace(System.String,System.String,System.String)
Ersetzt alle Vorkommen des angegebenen Texts in einer Zeichenfolge durch anderen Text.
string: Zeichenfolge, die die zu ersetzenden Teilzeichenfolgen enthält.
searchFor: Der zu ersetzende Text
replaceWith: Als Ersatz einzufügender Text
Zeichenfolge mit Ersetzungen
replace,overwrite,override,find and replace

DSCore.String.EndsWith(System.String,System.String,System.Boolean)
Bestimmt, ob die angegebene Zeichenfolge mit der angegebenen Teilzeichenfolge endet.
string: Zeichenfolge, deren Ende durchsucht werden soll
searchFor: Am Ende zu suchende Teilzeichenfolge
ignoreCase: True, um die Groß- und Kleinschreibung beim Vergleich zu ignorieren; False, um die Groß- und Kleinschreibung zu berücksichtigen
True, wenn die Zeichenfolge mit der Teilzeichenfolge beginnt, sonst False
test,does end,last,str end,terminated

DSCore.String.StartsWith(System.String,System.String,System.Boolean)
Bestimmt, ob die angegebene Zeichenfolge mit der angegebenen Teilzeichenfolge beginnt.
string: Zeichenfolge, deren Anfang durchsucht werden soll
searchFor: Am Anfang zu suchende Teilzeichenfolge
ignoreCase: True, um die Groß- und Kleinschreibung beim Vergleich zu ignorieren; False, um die Groß- und Kleinschreibung zu berücksichtigen
True, wenn die Zeichenfolge mit der Teilzeichenfolge beginnt, sonst False
test,beginswith,start,string start,front

DSCore.String.TrimWhitespace(System.String)
Entfernt alle Leerzeichen vom Anfang und Ende der angegebenen Zeichenfolge.
string: Zu verkürzende Zeichenfolge.
Die Zeichenfolge ohne Leerzeichen am Anfang und Ende
trimstring,cleanstring,whitespace,blanks,spaces,string trim

DSCore.String.TrimLeadingWhitespace(System.String)
Entfernt alle Leerzeichen vom Anfang der angegebenen Zeichenfolge.
string: Zu verkürzende Zeichenfolge.
Die Zeichenfolge ohne Leerzeichen am Anfang
trim string,clean string,trim leading whitespaces,string trim

DSCore.String.TrimTrailingWhitespace(System.String)
Entfernt alle Leerzeichen vom Ende der angegebenen Zeichenfolge.
string: Zu verkürzende Zeichenfolge.
Die Zeichenfolge ohne Leerzeichen am Ende
trim string,clean string,trim trailing whitespaces,string trim

DSCore.String.IndexOf(System.String,System.String,System.Boolean)
Ermittelt den nullbasierten Index des ersten Vorkommens einer Teilzeichenfolge innerhalb einer Zeichenfolge.
Gibt -1 zurück, wenn kein Index gefunden wird.
string: Zeichenfolge, in der gesucht werden soll
searchFor: Zu suchende Teilzeichenfolge
ignoreCase: Gibt an, ob die Groß- und Kleinschreibung beim Vergleich berücksichtigt werden soll
Index des ersten Vorkommens der Teilzeichenfolge oder -1, wenn nicht gefunden
index of,find substring,where,search

DSCore.String.AllIndicesOf(System.String,System.String,System.Boolean)
Sucht nach einer Liste von Indizes, deren Teilzeichenfolge in einer Zeichenfolge enthalten ist.
string: Zeichenfolge, in der gesucht werden soll.
searchFor: Zu suchende Teilzeichenfolge.
ignoreCase: Gibt an, ob die Groß- und Kleinschreibung beim Vergleich berücksichtigt werden soll.
Liste von Indizes, in der die Teilzeichenfolge gefunden wird (type: int[])
all indices of,find substring,where,search

DSCore.String.LastIndexOf(System.String,System.String,System.Boolean)
Ermittelt den nullbasierten Index des letzten Vorkommens einer Teilzeichenfolge innerhalb einer Zeichenfolge.
Gibt -1 zurück, wenn kein Index gefunden wird.
string: Zeichenfolge, in der gesucht werden soll.
searchFor: Zu suchende Teilzeichenfolge
ignoreCase: Gibt an, ob die Groß- und Kleinschreibung beim Vergleich berücksichtigt werden soll.
Index des letzten Vorkommens der Teilzeichenfolge oder -1, wenn nicht gefunden
last index of,find substring,where,search

DSCore.String.PadLeft(System.String,System.Int32,System.String)
Richtet die Zeichen in der angegebenen Zeichenfolge durch Auffüllen des linken Endes bis zur angegebenen
Gesamtlänge rechtsbündig aus.
string: Aufzufüllende Zeichenfolge
newLength: Gesamtlänge der Zeichenfolge nach Auffüllen
padChars: Zum Auffüllen zu verwendendes Zeichen, Vorgabe: Leerzeichen
Durch Auffüllen mit Leerzeichen am Anfang bis zur Gesamtlänge rechtsbündig ausgerichtete Zeichenfolgen
pad left,right align,right-align,pad,string space,whitespace

DSCore.String.PadRight(System.String,System.Int32,System.String)
Richtet die Zeichen in der angegebenen Zeichenfolge durch Auffüllen des rechten Endes bis zur angegebenen
Gesamtlänge linksbündig aus.
string: Aufzufüllende Zeichenfolge
newLength: Gesamtlänge der Zeichenfolge nach Auffüllen
padChars: Zum Auffüllen zu verwendendes Zeichen, Vorgabe: Leerzeichen
Durch Auffüllen mit Leerzeichen am Ende bis zur Gesamtlänge linksbündig ausgerichtete Zeichenfolgen
pad right,left align,left-align,pad string space,whitespace

DSCore.String.Center(System.String,System.Int32,System.String)
Vergrößert die Länge einer Zeichenfolge durch Einschließen der ursprünglichen Zeichen in Leerzeichen auf beiden Seiten.
string: Zu zentrierende Zeichenfolge
newLength: Gesamtlänge der Zeichenfolge nach dem Zentrieren
padChars: Zum Zentrieren zu verwendendes Zeichen, Vorgabe: Leerzeichen
Durch Auffüllen mit Leerzeichen am Anfang und Ende bis zur Gesamtlänge
zentrierte Zeichenfolgen
center align,center-align,centered,whitespace,expand string,surround

DSCore.String.Insert(System.String,System.Int32,System.String)
Fügt eine Zeichenfolge am angegebenen Index in eine andere Zeichenfolge ein.
string: Zeichenfolge, in die eingefügt wird.
index: Index, an dem eingefügt werden soll
toInsert: Einzufügende Zeichenfolge
Zeichenfolge mit eingefügter Teilzeichenfolge
insertstring,insert string

DSCore.String.Remove(System.String,System.Int32,System.Nullable{System.Int32})
Entfernt Zeichen aus einer Zeichenfolge.
string: Zeichenfolge, aus der Zeichen entfernt werden.
startIndex: Index für den Anfang der zu entfernenden Zeichenfolge
count: Anzahl der zu entfernenden Zeichen,
Anmerkung: Bei einem negativen Wert für Anzahl werden Zeichen von rechts nach links entfernt.
Zeichenfolge ohne die entfernten Zeichen
delete,rem,shorten