DSCore.List
Methoden zum Erstellen und Bearbeiten von Listen

DSCore.List.Empty
Gibt eine leere Liste zurück.
Leere Liste
empty list, emptylist,[]

DSCore.List.UniqueItems(System.Collections.IList)
Erstellt eine neue Liste mit allen eindeutigen Elementen in der angegebenen Liste.
list: Liste, aus der Duplikate ausgefiltert werden sollen
Gefilterte Liste
removes,duplicates,remove duplicates,cull duplicates,distinct,listcontains

DSCore.List.Contains(System.Collections.IList,System.Object)
Ermittelt, ob die angegebene Liste das angegebene Element enthält. Diese Funktion durchsucht die darin enthaltenen Unterlisten.
list: Die zu durchsuchende Liste
item: Das zu suchende Element
True, wenn die Liste das Element enthält, sonst False
item,search,in,listcontains

DSCore.List.IsHomogeneous(System.Collections.IList)
Überprüft, ob die Elemente in der Liste vom selben Typ sind.
list: Liste, deren Homogenität geprüft werden soll
Gibt an, ob die Liste homogen ist.
homogeneous,allequal,same,type

DSCore.List.IsRectangular(System.Collections.IList)
Überprüft, ob alle Zeilen der Liste gleich viele Elemente enthalten.
list: Liste, deren Zeilen daraufhin geprüft werden sollen, ob sie gleich viele Elemente enthalten.
Gibt an, ob alle Zeilen der Liste dieselbe Anzahl Elemente enthalten.
rectangular,isrectangular,same,sublist,row

DSCore.List.IsUniformDepth(System.Collections.IList)
Überprüft, ob die Elemente in der Liste dieselbe Tiefe aufweisen.
list: Liste, deren Elemente auf übereinstimmende Tiefe überprüft werden sollen.
Gibt an, ob die Tiefe der Liste einheitlich ist.
depth,uniform,isuniformdepth,sublist,jagged

DSCore.List.SetDifference(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Gibt eine neue Liste zurück, die Objekte aus List1 enthält, aber Objekte aus List2 ausschließt.
list1: Liste der in die neue Liste aufzunehmenden Objekte
list2: Liste der aus der neuen Liste auszuschließenden Objekte
Neue Liste mit den Objekten aus List1, aber ohne die Objekte aus List2
difference,setdifference,set

DSCore.List.SetIntersection(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Gibt eine neue Liste mit Objekten zurück, die sowohl in List1 als auch in List2 enthalten sind.
list1: Liste der Objekte für den Vergleich mit List2
list2: Liste der Objekte für den Vergleich mit List1
Neue Liste mit Objekten, die sowohl in List1 als auch in List2 enthalten sind
intersection,setintersection,set,overlap

DSCore.List.SetUnion(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Gibt eine neue Liste mit Objekten zurück, die entweder in List1 oder in List2 enthalten sind.
list1: Liste der aufzunehmenden Objekte
list2: Liste der in List1 aufzunehmenden Objekte
Neue Liste mit den Objekten, die entweder in List1 oder in List2 enthalten sind
union,setunion,set

DSCore.List.IndexOf(System.Collections.IList,System.Object)
Gibt den Index des Elements in der angegebenen Liste zurück. Eine Übereinstimmung zwischen der angegebenen Liste und dem Zielelement muss eine genaue Übereinstimmung sein (d. h. int und int, double und double, string und string, object und object usw.).
list: Liste, in der nach dem Element gesucht werden soll
element: Element, dessen Index zurückgegeben werden soll
Der Index des Elements in der Liste. Der ungültige Index -1 wird zurückgegeben, wenn keine genaue Übereinstimmung gefunden wurde.
index,indexof

DSCore.List.CountFalse(System.Collections.IList)
Gibt die Anzahl der Booleschen False-Werte in der angegebenen Liste zurück.
list: Liste, in der nach Booleschen False-Werten gesucht werden soll
Anzahl der Booleschen False-Werte in der Liste
false,count

DSCore.List.CountTrue(System.Collections.IList)
Gibt die Anzahl der Booleschen True-Werte in der angegebenen Liste zurück.
list: Liste, in der nach Booleschen True-Werten gesucht werden soll
Anzahl der Booleschen True-Werte in der Liste
true,count

DSCore.List.Insert(System.Collections.IList,System.Object,System.Int32)
Fügt ein Element am angegebenen Index in eine Liste ein.
list: Liste, in die das Element eingefügt wird
element: Das einzufügende Element
index: Gibt die Position in der Liste an, an der das Element eingefügt werden soll
Liste mit dem eingefügten Element
insert,add

DSCore.List.Reorder(System.Collections.IList,System.Collections.IList)
Ordnet die eingegebene Liste entsprechend der angegebenen Liste von Indizes neu.
list: Die neu zu ordnende Liste
indices: Die zum Neuordnen der Elemente in der Liste zu verwendenden Indizes
Die neu geordnete Liste
reorder,index,indices

DSCore.List.SortIndexByValue(System.Collections.Generic.List{System.Double})
Sortiert die Liste nach Elementen und gibt deren Indizes zurück.
list: Liste der zu sortierenden Elemente
Indizes der Elemente in der sortierten Liste
sort,index,value

DSCore.List.NormalizeDepth(System.Collections.IList,System.Int32)
Gibt eine multidimensionale Liste entsprechend dem angegebenen Rang zurück.
list: Liste, deren Tiefe entsprechend dem Rang normalisiert werden soll
rank: Rang, auf den die Liste normalisiert werden soll, Vorgabe: 1
Liste mit normalisiertem Rang
depth,normalize

DSCore.List.Reverse(System.Collections.IList)
Erstellt eine neue Liste mit den Elementen der angegebenen Liste, jedoch in umgekehrter Reihenfolge.
list: Umzukehrende Liste
Umgekehrte Liste
flip,listcontains

DSCore.List.__Create(System.Collections.IList)
Erstellt eine neue Liste mit den angegebenen Elementen.
items: Elemente, die in der neuen Liste gespeichert werden.

DSCore.List.Sublists(System.Collections.IList,System.Collections.IList,System.Int32)
Erstellt unter Verwendung von DesignScript-Bereichssyntax Unterlisten aus einer Liste.
list: Die Liste, aus der die Unterlisten erstellt werden sollen
ranges: Die Indexbereiche der Unterlistenelemente.
Bsp. \"{0..3,5,2}\"
offset: Der Versatz für die Unterliste.
Bsp. Bereich\"0..3\" mit Versatz 2 ergibt
{0,1,2,3}{2,3,4,5}{4,5,6,7}...
type: var[]..[]
sublists,build sublists,subset,

DSCore.List.Sort(System.Collections.Generic.IEnumerable{System.Object})
Sortiert die Liste in der integrierten natürlichen Reihenfolge.
list: Zu sortierende Liste
Sortierte Liste
sort,order,sorted

DSCore.List.MinimumItem(System.Collections.Generic.IEnumerable{System.Object})
Gibt den kleinsten Wert aus einer Liste aus.
list: Liste vergleichbarer Elemente, deren kleinster Wert ausgegeben werden soll
Kleinstes Element aus der Liste.
least,smallest,find min

DSCore.List.MaximumItem(System.Collections.Generic.IEnumerable{System.Object})
Gibt den größten Wert aus einer Liste aus.
list: Liste vergleichbarer Elemente, deren größter Wert ausgegeben werden soll
Größtes Element aus der Liste.
greatest,largest,biggest,find max

DSCore.List.FilterByBoolMask(System.Collections.IList,System.Collections.IList)
Filtert eine Sequenz durch Abrufen entsprechender Indizes in einer separaten Liste
boolescher Werte.
list: Zu filternde Liste
mask: Liste der booleschen Ausdrücke, die eine Maske darstellen
Elemente mit Maskenindex true
Elemente mit Maskenindex false
filter,in,out,mask,dispatch,bool filter,boolfilter,bool filter

DSCore.List.Deconstruct(System.Collections.IList)
Gibt bei Angabe einer Liste das erste Element aus der Liste sowie eine neue Liste mit allen Elementen,
ausgenommen das erste, zurück.
list: Zu teilende Liste
Erstes Element in der Liste (type: var[]..[])
Rest der Liste (type: var[]..[])
first,rest,list split,listcontains

DSCore.List.SortByKey(System.Collections.IList,System.Collections.IList)
Liste anhand ihrer Schlüssel sortieren
list: Zu sortierende Liste
keys: Liste der Schlüssel, Schlüssel müssen sortiert werden können (z. B. Nummern, Zeichenfolgen)
type: var[]..[]
type: var[]..[]
sort;key

DSCore.List.GroupByKey(System.Collections.IList,System.Collections.IList)
Gruppiert Elemente anhand übereinstimmender Schlüsselwerte in Unterlisten
list: Liste der in Unterlisten zu gruppierenden Elemente
keys: Schlüsselwerte zur Gruppierung der Einträge, je ein Wert pro Eintrag in der eingegebenen Liste
Liste der Unterlisten, Einträge nach übereinstimmenden Schlüsselwerten gruppiert
der jeweiligen Gruppe entsprechender Schlüsselwert
list;group;groupbykey;

DSCore.List.GroupBySimilarity(System.Collections.IList,System.Double,System.Boolean)
Gruppiert Listenelemente auf Grundlage der Nachbarschaft ihrer Indizes und der Ähnlichkeit ihrer Werte
list: Liste mit Elementen, die basierend auf Nachbarschaft und Ähnlichkeit als Unterlisten gruppiert werden sollen
tolerance: Grenzwert für die Gruppierung ähnlicher Elemente
considerAdjacency: Boolescher Wert, der steuert, ob der Block die Nachbarschaft berücksichtigen soll oder nicht.
Liste mit Unterlisten, die nach ähnlichen Werten gruppierte Elemente enthält
Liste mit Unterlisten, die die ursprünglichen Indizes der gruppierten Werte enthält
list;group;similar;adjacent;adjacency;groupbyadjacency;groupadjacentitems;groupsimilaritems;cluster;tolerance

DSCore.List.LevenshteinDistance(System.String,System.String)
Die Levenshtein-Distanz ist der Algorithmus, der verwendet wird, um die Distanz zwischen zwei Zeichenfolgen zu ermitteln
| Quelle

DSCore.List.AddItemToFront(System.Object,System.Collections.IList)
Fügt ein Element am Anfang einer Liste hinzu.
item: Das hinzuzufügende Element. Dies kann ein Objekt oder eine Liste sein.
list: Liste, der das Element hinzugefügt werden soll
Liste mit hinzugefügten Elementen
insert,add,item,front,start,begin

DSCore.List.AddItemToEnd(System.Object,System.Collections.IList)
Fügt ein Element am Ende der Liste hinzu.
item: Das hinzuzufügende Element. Dies kann ein Objekt oder eine Liste sein.
list: Liste, der das Element hinzugefügt werden soll
Liste mit hinzugefügten Elementen
insert,add,item,end

DSCore.List.TakeItems(System.Collections.IList,System.Int32)
Ruft eine Anzahl von Elementen vom Anfang der Liste ab.
list: Liste, aus der die Elemente abgerufen werden sollen
amount: Anzahl der abzurufenden Elemente. Wenn negativ, werden Elemente vom Ende der Liste abgerufen.
Liste der extrahierten Elemente
get,sub,sublist,extract

DSCore.List.DropItems(System.Collections.IList,System.Int32)
Entfernt eine Anzahl von Elementen vom Anfang der Liste. Wenn der Betrag ein negativer Wert ist,
werden Elemente vom Ende der Liste entfernt.
list: Liste, aus der die Elemente entfernt werden sollen
amount: Anzahl der zu entfernenden Elemente. Wenn negativ, werden Elemente vom Ende der Liste entfernt.
Liste der verbleibenden Elemente
drop,remove,shorten

DSCore.List.ShiftIndices(System.Collections.IList,System.Int32)
Verschiebt die Indizes in der Liste um den angegebenen Betrag nach rechts.
list: Liste, die verschoben werden soll
amount: Betrag zum Verschieben der Indizes. Wenn negativ, werden die Indizes nach links verschoben.
Verschobene Liste
shift,offset

DSCore.List.GetItemAtIndex(System.Collections.IList,System.Int32)
Gibt ein Element aus der angegebenen Liste an der Position des angegebenen Index zurück.
list: Liste, aus der ein Element abgerufen werden soll
index: Index des abzurufenden Elements
Element am angegebenen Index in der Liste
get,item,index,fetch,at,getfrom,get from,extract

DSCore.List.ReplaceItemAtIndex(System.Collections.IList,System.Int32,System.Object)
Ersetzt ein Element am angegebenen Index in der angegebenen Liste.
list: Liste, in der ein Element ersetzt werden soll
index: Index des zu ersetzenden Elements
item: Einzufügendes Element
Neue Liste, in der das Element ersetzt wurde
replace,switch

DSCore.List.ReplaceItemAtIndices(System.Collections.IList,System.Collections.Generic.IList{System.Int32},System.Object)
Ersetzt Elemente aus der angegebenen Liste, die sich an den angegebenen Indizes befinden.
list: Liste, in der ein Element ersetzt werden soll.
indices: Indizes der zu ersetzenden Elemente.
item: Einzufügendes Element.
Neue Liste mit den ersetzten Elementen.
replace,switch

DSCore.List.Slice(System.Collections.IList,System.Nullable{System.Int32},System.Nullable{System.Int32},System.Int32)
Gibt eine einzelne Unterliste aus der angegebenen Liste anhand von Startindex, Endindex,
und Schrittgröße zurück.
list: Liste, der der Teilbereich entnommen werden soll
start: Startindex für den Teilbereich
end: Endindex für den Teilbereich
step: Intervall zwischen den Indizes der Elemente in der ursprünglichen Liste
Elemente im Teilbereich aus der angegebenen Liste
list,sub,sublist,subrange,get sublist

DSCore.List.RemoveItemAtIndex(System.Collections.IList,System.Int32[])
Entfernt ein Element am angegebenen Index aus der Liste.
list: Liste, aus der ein oder mehrere Element(e) entfernt werden sollen
indices: Index oder Indizes des/der zu entfernenden Element(e)
Liste nach Entfernen der Elemente
index,indices,cull,remove,item

DSCore.List.DropEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
Entfernt unter Einhaltung des angegebenen Versatzes Elemente aus der angegebenen Liste,
deren Indizes Vielfache des angegebenen Werts sind.
list: Liste, aus der Elemente entfernt werden sollen/
n: Indizes, die Vielfache dieses Arguments sind, werden entfernt.
offset: Anzahl der am Anfang der Liste zu ignorierenden Elemente
Liste nach Entfernen der Elemente
nth,remove,cull,every

DSCore.List.TakeEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
Ruft unter Einhaltung des angegebenen Versatzes Elemente aus der angegebenen Liste ab,
deren Indizes Vielfache des angegebenen Werts sind.
list: Liste, aus der Elemente abgerufen werden sollen
n: Indizes, die Vielfache dieses Zahlenwerts sind (nach dem Versatz)
werden abgerufen.
offset: Anzahl der am Anfang der Liste zu ignorierenden Elemente
Elemente aus der Liste
fetch,take,every,nth

DSCore.List.IsEmpty(System.Collections.IList)
Bestimmt, ob die angegebene Liste leer ist.
list: Liste, die darauf überprüft werden soll, ob sie leer ist
True, wenn die Liste leer ist, sonst False
test,is,empty,null,count

DSCore.List.AllTrue(System.Collections.IList)
Ermittelt, ob alle Elemente in der angegebenen Liste boolesche Angaben mit dem Wert True sind.
list: Liste, in der geprüft werden soll, ob alle Elemente den Wert True haben
True, wenn alle Elemente aus der Liste True sind; False, wenn mindestens ein Element nicht True ist
test,all,true,istrue

DSCore.List.AllFalse(System.Collections.IList)
Ermittelt, ob alle Elemente in der angegebenen Liste boolesche Angaben mit dem Wert False sind.
list: Liste, in der geprüft werden soll, ob alle Elemente den Wert False haben
True, wenn alle Elemente aus der Liste False sind; False, wenn mindestens ein Element nicht False ist
test,all,false,isfalse

DSCore.List.AnyTrue(System.Collections.IList)
Ermittelt, ob ein Element in der angegebenen Liste eine boolesche Angabe mit dem Wert True ist.
list: Liste, in der geprüft werden soll, ob ein Element den Wert True aufweist.
Gibt an, ob ein Element den Wert True hat.
test,any,true,istrue

DSCore.List.AnyFalse(System.Collections.IList)
Ermittelt, ob ein Element in der angegebenen Liste eine boolesche Angabe mit dem Wert False ist.
list: Liste, in der geprüft werden soll, ob ein Element den Wert False aufweist.
Gibt an, ob ein Element den Wert False hat.
test,any,false,isfalse

DSCore.List.Count(System.Collections.IList)
Gibt die Anzahl der Elemente in der angegebenen Liste zurück.
list: Liste, deren Elementanzahl abgerufen werden soll
Länge der Liste
listlength,list length,count,size,sizeof

DSCore.List.Join(System.Collections.IList[])
Verkettet alle angegebenen Listen zu einer einzelnen Liste.
lists: Die zu einer Liste zu verkettenden Listen
Verbundene Liste
join lists,merge,concatenate

DSCore.List.FirstItem(System.Collections.IList)
Gibt das erste Element in einer Liste zurück.
list: Liste, deren erstes Element abgerufen werden soll
Das erste Element in der Liste
get,fetch,first,item,start

DSCore.List.RestOfItems(System.Collections.IList)
Entfernt das erste Element aus der angegeben Liste.
list: Liste, deren verbleibende Elemente abgerufen werden sollen
Der Rest der Liste
get,fetch,rest,end,rest of list

DSCore.List.Chop(System.Collections.IList,System.Collections.Generic.List{System.Int32})
Zerlegt eine Liste in eine Gruppe aufeinander folgender Unterlisten mit den angegebenen Längen. Die Unterteilung der Liste beginnt an deren Anfang.
list: Die in Unterlisten zu zerlegende Liste
lengths: Die Längen der aus der eingegebenen Liste zu erstellenden aufeinander folgenden Unterlisten
Die aus der Liste erstellten Unterlisten
sublists,build sublists,slices,partitions,cut,listcontains,chop

DSCore.List.DiagonalRight(System.Collections.IList,System.Int32)
Listet die Elemente entlang den Diagonalen in der Matrix von links unten nach rechts oben auf.
list: Einfache Liste
subLength: Länge jeder neuen Unterliste
Liste der Elemente entlang den Diagonalen in der Matrix
diagonal,right,matrix,get diagonals,diagonal sublists

DSCore.List.DiagonalLeft(System.Collections.IList,System.Int32)
Listet die Elemente entlang den Diagonalen in der Matrix von links oben nach rechts unten auf.
list: Einfache Liste
rowLength: Länge jeder neuen Unterliste
Liste der Elemente entlang den Diagonalen in der Matrix
diagonal,left,matrix,get diagonals,diagonal sublists

DSCore.List.Transpose(System.Collections.IList)
Vertauscht Zeilen und Spalten in einer Liste von Listen.
Wenn einige Zeilen kürzer als die übrigen sind,
werden Nullwerte als Platzhalter in das resultierende
Array eingefügt, sodass dieses immer rechteckig ist.
lists: Liste der umzustellenden Listen
Liste der umgestellten Listen
transpose,flip matrix,matrix,swap,rows,columns

DSCore.List.Clean(System.Collections.IList,System.Boolean)
Bereinigt Daten durch Entfernen von Nullen und leeren Listen aus einer gegebenen Liste mit beliebigen Maßen.
list: Liste mit Nullen und leeren Unterlisten zum Bereinigen
preserveIndices: Bietet die Option, die Indizes der Daten beizubehalten,
Liste der umgestellten Listen
sodass Nullen, die nicht am Ende stehen, beim Filtern erhalten bleiben
Returns: Eine bereinigte Liste ohne Nullen und leere Listen

DSCore.List.OfRepeatedItem(System.Object,System.Int32)
Erstellt eine Liste, die die angegebene Anzahl von Instanzen des angegebenen Elements enthält.
item: Das zu wiederholende Element
amount: Die Anzahl der Wiederholungen
Liste der wiederholten Elemente
repeat,repeated,duplicate,list of item,fill list,copies,listcontains

DSCore.List.Cycle(System.Collections.IList,System.Int32)
Erstellt eine neue Liste durch Verketten mehrerer Kopien einer angegebenen Liste.
list: Zu wiederholende Liste
amount: Anzahl der Wiederholungen
Liste der wiederholten Listen (type: var[]..[])
repeat,repeated,duplicate,repeated list,concat list

DSCore.List.LastItem(System.Collections.IList)
Ruft das letzte Element in einer Liste ab.
list: Liste, deren letztes Element abgerufen werden soll
Das letzte Element in der Liste
get,fetch,last,item,end of list

DSCore.List.Shuffle(System.Collections.IList)
Ordnet die Elemente einer Liste in zufälliger Reihenfolge neu an.
list: Die Liste, deren Reihenfolge geändert werden soll
Die Liste mit zufälliger Reihenfolge
random,randomize,shuffle,jitter,randomness

DSCore.List.Shuffle(System.Collections.IList,System.Int32)
Ordnet die Elemente einer Liste in zufälliger Reihenfolge basierend auf einer ursprünglichen Ausgangszahl neu an.
list: Die Liste, deren Reihenfolge geändert werden soll.
seed: Ausgangszahl für den Zufallsgenerator.
Liste mit zufälliger Reihenfolge.
random,randomize,shuffle,jitter,randomness,seed

DSCore.List.Permutations(System.Collections.IList,System.Nullable{System.Int32})
Gibt alle in einer angegebenen Liste möglichen Permutationen der angegebenen Länge aus.
list: Zu permutierende Liste
length: Länge der einzelnen Permutationen
Permutationen der Liste mit der angegebenen Länge (type: var[]..[])
permutation,permutations

DSCore.List.Combinations(System.Collections.IList,System.Int32,System.Boolean)
Gibt alle Kombinationen der angegebenen Länge aus einer bestimmten Liste aus.
list: Liste, aus der Kombinationen generiert werden sollen
length: Länge jeder Kombination
replace: Gibt an, ob Elemente nach der Auswahl für die Kombination entfernt werden sollen. Vorgabe:
false.
Kombinationen der angegebenen Länge aus der Liste
combo

DSCore.List.FirstIndexOf(System.Collections.IList,System.Object)
Gibt nach Eingabe eines Elements den nullbasierten Index von dessen erstem Vorkommen
in der Liste zurück. Wird das Element nicht in der Liste gefunden, wird -1 zurückgegeben.
list: Die zu durchsuchende Liste. Ist dieses Argument Null, wird -1 zurückgegeben.
item: Das zu suchende Element
Returns: Der nullbasierte Index des Elements in der Liste. Wird dieses nicht gefunden, wird -1 zurückgegeben.

DSCore.List.AllIndicesOf(System.Collections.IList,System.Object)
Gibt nach Eingabe eines Elements die nullbasierten Indizes aller seiner Vorkommen
in der Liste zurück. Wird das Element nicht gefunden, wird eine leere Liste zurückgegeben.
list: Die zu durchsuchende Liste. Ist dieses Argument Null, wird eine leere Liste zurückgegeben.
item: Das zu suchende Element
Eine Liste der nullbasierten Indizes aller Vorkommen des Elements, wenn dieses
in der Liste gefunden wird, oder andernfalls eine leere Liste.

DSCore.List.Flatten(System.Collections.IList,System.Int32)
Vereinfacht eine verschachtelte Liste von Listen um eine bestimmte Anzahl von Ebenen.
list: Zu vereinfachende Liste
amount: Layer der zu entfernenden Listenverschachtelung (-1 entfernt alle Listenverschachtelungen)
Vereinfachte Liste nach Betrag
flatten,completely

DSCore.List.IndexInList(System.Collections.IList,System.Object)
Eine Alternative zur Verwendung von IList.Contains, die mithilfe von Enumerable.SequenceEqual überprüft, ob
das Element in der Liste enthalten ist, wenn das Element ein Array ist. Gibt den Index zurück, wenn das Element
gefunden wird, andernfalls -1.
list: Liste, in der nach dem Element gesucht werden soll
item: Zu suchendes Element
Index des Elements in der Liste

DSCore.List.GetDepth(System.Object)
Ruft die maximale Tiefe einer angegebenen Liste ab.
list: Eingegebene Liste, deren Tiefe abgerufen werden soll
Tiefe des angegebenen Liste

DSCore.List.CountBool(System.Collections.IList,System.Boolean)
Gibt die Anzahl der festgelegten Booleschen Werte in der angegebenen Liste zurück.
list: Liste, in der nach den Booleschen Werten gesucht werden soll
value: Zu suchender Boolescher Wert
Anzahl der angegebenen Booleschen Werte in der Liste

DSCore.List.IncreaseDepth(System.Collections.IList,System.Int32)
Vergrößert die Tiefe einer angegebenen Liste um einen festgelegten Betrag. Die Tiefe wird
durch Erstellen einer neuen Liste vergrößert, die die angegebene Liste enthält.
list: Liste, deren Tiefe vergrößert werden soll
amt: Betrag, um den die Tiefe vergrößert werden soll
Neue Liste mit um den Betrag vergrößerter Tiefe

DSCore.List.DoubleConverter(System.Object)
Konvertiert ganzzahligen in double-Wert, ansonsten gibt Eingabeobjekt zurück.