DSCore.CurveMapper.ParabolicCurve
Stellt eine parabolische Kurve im CurveMapper dar.
Die Kurve folgt einer quadratischen Gleichung, die auf zwei Steuerpunkten basiert.

DSCore.CurveMapper.ParabolicCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Gibt die X- und Y-Werte über die Kurve verteilt zurück.