DSCore.TimeSpan
Objekt für einen verstrichenen Zeitraum ohne bestimmtes Start- oder Enddatum

DSCore.TimeSpan.ByDateDifference(System.DateTime,System.DateTime)
Gibt einen neuen TimeSpan-Wert durch Berechnung der Zeitdifferenz zwischen zwei DateTime-Werten aus
dateTime: DateTime-Wert, von dem subtrahiert werden soll
otherDateTime: DateTime-Wert für Subtraktion
TimeSpan-Unterschiede zwischen zwei Daten

DSCore.TimeSpan.Zero
Ein TimeSpan-Wert für die verstrichene Zeit von Null an
TimeSpan-Wert für die verstrichene Zeit von Null an

DSCore.TimeSpan.MaxValue
Der längste darstellbare TimeSpan-Wert
Größtmögliche TimeSpan-Darstellung

DSCore.TimeSpan.MinValue
Der kürzeste darstellbare TimeSpan-Wert
Kleinstmögliche TimeSpan-Darstellung

DSCore.TimeSpan.Create(System.Double,System.Double,System.Double,System.Double,System.Double)
Erstellt einen neuen TimeSpan-Wert aus einer Zeitspanne.
days: Enthaltene Tage
hours: Enthaltene Stunden
minutes: Enthaltene Minuten
seconds: Enthaltene Sekunden
milliseconds: Enthaltene Millisekunden
TimeSpan-Wert wurde erstellt

DSCore.TimeSpan.Scale(System.TimeSpan,System.Double)
Multipliziert einen TimeSpan-Wert mit einem Skalierungsfaktor
timeSpan: TimeSpan-Wert für Multiplikation
scaleFactor: Skalierungsfaktor für TimeSpan. Beispiel: Mit dem Skalierungsfaktor 2 erhalten Sie
eine doppelt so lange Zeitspanne.
TimeSpan-Produkt

DSCore.TimeSpan.Negate(System.TimeSpan)
Kehrt einen TimeSpan-Wert um
timeSpan: Umzukehrender TimeSpan-Wert
Negativer TimeSpan-Wert

DSCore.TimeSpan.Add(System.TimeSpan,System.TimeSpan)
Addiert zwei TimeSpan-Werte
timeSpan1: Zu addierender TimeSpan-Wert
timeSpan2: Weiterer zu addierender TimeSpan-Wert
TimeSpan-Ergebnis der Addition

DSCore.TimeSpan.Subtract(System.TimeSpan,System.TimeSpan)
Subtrahiert zwei TimeSpan-Werte
timeSpan1: TimeSpan-Wert für die Subtraktion
timeSpan2: Zu subtrahierender TimeSpan-Wert
Aus Subtraktion resultierender TimeSpan-Wert

DSCore.TimeSpan.FromString(System.String)
Versucht, einen TimeSpan-Wert aus einer Zeichenfolge zu analysieren
string: Zeichenfolgendarstellung eines TimeSpan-Werts.
TimeSpan-Wert aus analysierter Zeichenfolge

DSCore.TimeSpan.Components(System.TimeSpan)
Extrahiert die einzelnen Komponenten eines TimeSpan-Werts.
timeSpan: TimeSpan-Wert für das Abrufen von Komponenten
Anzahl der Tage (type: int)
Anzahl der Stunden (type: int)
Anzahl der Minuten (type: int)
Anzahl der Sekunden (type: int)
Anzahl der Millisekunden (type: int)

DSCore.TimeSpan.TotalDays(System.TimeSpan)
Wandelt den gesamten durch einen TimeSpan-Wert dargestellten Zeitraum in eine
ungenaue Anzahl von Tagen um.
timeSpan: TimeSpan-Wert für das Abrufen der Tagesgesamtanzahl
Gesamtanzahl der Tage

DSCore.TimeSpan.TotalHours(System.TimeSpan)
Wandelt den gesamten durch einen TimeSpan-Wert dargestellten Zeitraum in eine
ungenaue Anzahl von Stunden um.
timeSpan: TimeSpan-Wert für das Abrufen der Stundengesamtanzahl
Gesamtanzahl der Stunden

DSCore.TimeSpan.TotalMinutes(System.TimeSpan)
Wandelt den gesamten durch einen TimeSpan-Wert dargestellten Zeitraum in eine
ungenaue Anzahl von Minuten um.
timeSpan: TimeSpan-Wert für das Abrufen der Minutengesamtanzahl
Gesamtanzahl der Minuten

DSCore.TimeSpan.TotalSeconds(System.TimeSpan)
Wandelt den gesamten durch einen TimeSpan-Wert dargestellten Zeitraum in eine
ungenaue Anzahl von Sekunden um.
timeSpan: TimeSpan-Wert für das Abrufen der Sekundengesamtanzahl
Gesamtanzahl der Sekunden

DSCore.TimeSpan.TotalMilliseconds(System.TimeSpan)
Wandelt den gesamten durch einen TimeSpan-Wert dargestellten Zeitraum in eine
ungenaue Anzahl von Millisekunden um.
timeSpan: TimeSpan-Wert für das Abrufen der Millisekunden
Gesamtanzahl der Millisekunden