Repository: DynamoDS/Dynamo
Catalog: src/DocumentationBrowserViewExtension/Properties/Resources.*.resx
Languages: fr_fr, pt_br

# BrowserViewCannotBeAddedToSidebar
source: Browser view has not been initialised and cannot be added to the sidebar.
fr_fr: La vue du navigateur n'a pas été initialisée et ne peut pas être ajoutée au panneau latéral.
pt_br: A vista do navegador não foi inicializada e não pode ser adicionada à barra lateral.

# ExtensionName
source: Documentation Browser
fr_fr: Navigateur de documentation
pt_br: Navegador da documentação

# FileNotFoundFailureMessage
source: File not found
fr_fr: Fichier introuvable
pt_br: Arquivo não encontrado

# ImageFitToolTip
source: Zoom to fit
fr_fr: Zoom tout
pt_br: Aplicar zoom para ajustar

# ImageInsertToolTip
source: Add to workspace\n\nAdds the example file to the workspace as a group. To avoid potential issues, run mode will be changed to Manual.
fr_fr: Ajoutez à workspace\n\nAjoute le fichier d'exemple à l'espace de travail en tant que groupe. Pour éviter les problèmes potentiels, le mode d'exécution sera défini sur Manuel.
pt_br: Adicionar ao espaço de trabalho\n\nAdiciona o arquivo de exemplo ao espaço de trabalho como um grupo. Para evitar problemas potenciais, o modo de execução será alterado para Manual.

# ImageZoomInToolTip
source: Zoom in
fr_fr: Zoom avant
pt_br: Aproximar zoom

# ImageZoomOutToolTip
source: Zoom out
fr_fr: Zoom arrière
pt_br: Afastar zoom

# InsertedGroupSubTitle
source: Inserted Dynamo graph
fr_fr: Graphique Dynamo inséré
pt_br: Gráfico do Dynamo inserido

# InsertGraphContainsNodesAlertMessage
source: The graph already contains the nodes to be inserted.
fr_fr: Le graphique contient déjà les noeuds à insérer.
pt_br: O gráfico já contém os nós a serem inseridos.

# InternalErrorNoDetailsAvailable
source: No further details available for this error.
fr_fr: Aucun autre détail disponible pour cette erreur.
pt_br: Não há mais detalhes disponíveis para esse erro.

# InvalidDocumentationLink
source: Documentation link is not a valid URI.
fr_fr: Le lien de documentation n'est pas un URI valide.
pt_br: O link da documentação não é um URI válido.

# MenuItemText
source: Show _Documentation Browser
fr_fr: Afficher le navigateur de _documentation
pt_br: Mostrar navegador de _documentação

# NodeDocumentationCategory
source: Category
fr_fr: Catégorie
pt_br: Categoria

# NodeDocumentationDescription
source: Description
pt_br: Descrição

# NodeDocumentationInputs
source: Inputs
fr_fr: Entrées
pt_br: Entradas

# NodeDocumentationInputsAndOutputs
source: Inputs and Outputs
fr_fr: Entrées et sorties
pt_br: Entradas e saídas

# NodeDocumentationIssueHelp
source: Node Issue Help
fr_fr: Aide sur les problèmes de noeud
pt_br: Ajuda para problemas de nós

# NodeDocumentationNodeInfo
source: Node Information
fr_fr: Informations sur le noeud
pt_br: Informações dos nós

# NodeDocumentationOutputs
source: Outputs
fr_fr: Sorties
pt_br: Saídas

# NodeInputsDataType
source: Data type
fr_fr: Type de données
pt_br: Tipo de dados

# NodeInputsDescription
source: Description
pt_br: Descrição

# NodeInputsName
source: Name
fr_fr: Nom
pt_br: Nome

# NodeInputsType
source: Type
pt_br: Tipo

# NodeInputsValue
source: Default value
fr_fr: Valeur par défaut
pt_br: Valor padrão

# ScriptTagsRemovalWarning
source: Script tags detected in the help document have been removed.
fr_fr: Les étiquettes de script détectées dans le document d'aide ont été supprimées.
pt_br: Os identificadores de scripts detectados no documento de ajuda foram removidos.

# ToastFileNotFoundLocationNotificationText
source: Example file from {0} could not be found
fr_fr: Fichier d'exemple de {0} introuvable
pt_br: Não foi possível encontrar o arquivo de exemplo de {0}

# ToastInsertGraphNotificationText
source: Example file added to workspace. Run mode changed to Manual.
fr_fr: Fichier d'exemple ajouté à l'espace de travail. Le mode d'exécution est passé à Manuel.
pt_br: Arquivo de exemplo adicionado ao espaço de trabalho. Modo de execução alterado para Manual.
