DSCore.Compare
Métodos de comparação.

DSCore.Compare.GreaterThan(System.Object,System.Object)
Retorna verdadeiro se a for maior do que b.
a: Um objeto comparável.
b: Um objeto comparável.
Resultado booleano.
larger,bigger

DSCore.Compare.GreaterThanOrEqual(System.Object,System.Object)
Retorna verdadeiro se a for maior do que ou igual a b.
a: Um objeto comparável.
b: Um objeto comparável.
Resultado booleano.
larger,bigger,equal

DSCore.Compare.LessThan(System.Object,System.Object)
Retorna verdadeiro se a for menor do que b.
a: Um objeto comparável.
b: Um objeto comparável.
Resultado booleano.
less,smaller

DSCore.Compare.LessThanOrEqual(System.Object,System.Object)
Retorna verdadeiro se a for menor do que ou igual a b.
a: Um objeto comparável.
b: Um objeto comparável.
Resultado booleano.
smaller,equal