DSCore.IO.Image
Métodos para operar em bitmaps de imagem.

DSCore.IO.Image.ReadFromFile(System.IO.FileInfo)
Carrega o arquivo como um bitmap.
file: Objeto de arquivo do qual a imagem é carregada
Objeto de imagem do arquivo

DSCore.IO.Image.Pixels(System.Drawing.Bitmap,System.Nullable{System.Int32},System.Nullable{System.Int32})
Lê um arquivo de imagem e retorna os valores de cores nas localizações da malha especificada.
image: Objeto de imagem do qual são obtidas as cores dos pixels
xSamples: Número de pontos da malha de amostra na direção X.
ySamples: Número de pontos da malha de amostra na direção Y.
Cores nos pontos da grade especificados
read,image,bitmap,png,jpg,jpeg

DSCore.IO.Image.FromPixels(DSCore.Color[][])
Cria uma imagem a partir de uma lista 2D de pixels.
colors: Lista de cores retangulares 2D representando os pixels
Imagem da lista de pixels 2D

DSCore.IO.Image.FromPixels(DSCore.Color[],System.Int32,System.Int32)
Cria uma imagem a partir de uma lista 2D de pixels, uma largura e uma altura.
colors: Lista de cores representando os pixels
width: Largura da nova imagem, em pixels
height: Altura da nova imagem, em pixels
Imagem da lista de pixels

DSCore.IO.Image.Dimensions(System.Drawing.Bitmap)
Retorna a largura e a altura de uma imagem.
image: Imagem da qual obter as cotas.
largura da imagem em pixels
altura da imagem em pixels

DSCore.IO.Image.WriteToFile(System.String,System.Drawing.Bitmap)
Grave a imagem para um caminho, com o nome de arquivo especificado.
image: A imagem para gravação
Objeto da imagem criado
write image,image,file,filepath