DSCore.Math
Métodos para executar operações matemáticas.

DSCore.Math.Random(System.Nullable{System.Int32})
Gera um aleatório duplo na faixa de [0, 1).
seed: Valor semente para o Gerador de número aleatório.
Número aleatório entre 0 e 1.
random,seed

DSCore.Math.Random(System.Double,System.Double)
Produza um número aleatório na faixa [lower_number, higher_number).
value1: Extremidade inferior do intervalo do número aleatório.
value2: Extremidade superior do intervalo do número aleatório.
Número aleatório no intervalo de [lower_number, higher_number).
random,numberrange

DSCore.Math.Random(System.Double,System.Double,System.Int32)
Produza um número aleatório no intervalo de [lower_number, higher_number) com base em um valor semente inicial.
value1: Extremidade inferior do intervalo do número aleatório.
value2: Extremidade superior do intervalo do número aleatório.
seed: Valor semente do gerador de números aleatórios.
Número aleatório no intervalo de [lower_number, higher_number).
random,numberrange,seed

DSCore.Math.RandomList(System.Int32)
Produz uma lista contendo a determinada quantidade de duplos aleatórios na faixa de [0, 1).
amount: Quantidade de números aleatórios que a lista de resultados irá conter.
Lista de números aleatórios entre 0 e 1.
random,listcontains

DSCore.Math.RandomList(System.Int32,System.Double,System.Double,System.Int32)
Produz uma lista contendo a quantidade determinada de duplos aleatórios
no intervalo definido de [lower_number, higher_number) com base em um valor semente inicial.
amount: Quantidade de números aleatórios que a lista de resultados conterá.
value1: Extremidade inferior do intervalo do número aleatório.
value2: Extremidade superior do intervalo do número aleatório.
seed: Valor semente do gerador de números aleatórios.
Lista de números aleatórios no intervalo de [lower_number, higher_number).
random,listcontains,seed

DSCore.Math.PiTimes2
PI constante multiplicado por 2
2 vezes PI.
2pi,2*pi,twopi,two*pi

DSCore.Math.Average(System.Collections.Generic.IList{System.Double})
Calcula a média de uma lista de números.
numbers: Lista de números para serrem ponderados.
Média da lista de números.
avg,mean

DSCore.Math.Map(System.Double,System.Double,System.Double)
Mapeia o valor de entrada para um número entre 0 e 1, com base no intervalo de entrada.
rangeMin: O valor mínimo do intervalo de entrada.
rangeMax: O valor máximo do intervalo de entrada.
inputValue: O número deve ser mapeado.
O valor mapeado.
map,range,minimum,maximum,normalize,scale,remap

DSCore.Math.MapTo(System.Double,System.Double,System.Double,System.Double,System.Double)
Mapeia o valor de entrada para um número entre targetRangeMin e targetRangeMax.
rangeMin: O valor mínimo do intervalo de entrada.
rangeMax: O valor máximo do intervalo de entrada.
inputValue: O número deve ser mapeado.
targetRangeMin: O valor mínimo do novo intervalo.
targetRangeMax: O valor máximo do novo intervalo.
O valor mapeado.
map,range,mapto,minimum,maximum,normalize,scale,remap

DSCore.Math.RemapRange(System.Collections.Generic.IList{System.Double},System.Double,System.Double)
Ajusta a faixa de uma lista de números, preservando o
coeficiente de distribuição.
numbers: Lista de números para a qual ajustar a faixa.
newMin: O novo valor mínimo da faixa.
newMax: Novo máximo da faixa
Lista remapeada para a nova faixa.
remap range

DSCore.Math.kRadiansToDegrees
mover as funções/métodos de Math.dll para este DSCoreNode.dll

DSCore.Math.PI
A constante matemática Pi, 3.14159...
A constante Pi
3.141592653589793

DSCore.Math.E
A constante matemática e, 2.71828...
A constante e
exp,2.718281828459045

DSCore.Math.GoldenRatio
A relação de ouro, (1 + sqrt(5))/2 = 1.61803...
A relação de ouro
golden,ratio,divine,phi,tau,1.61803398875

DSCore.Math.RadiansToDegrees(System.Double)
Converte um ângulo em radianos para um ângulo em graus.
radians: Ângulo em radianos.
Ângulo em graus.
radians,degrees,angle

DSCore.Math.DegreesToRadians(System.Double)
Converte um ângulo em graus para um ângulo em radianos.
degrees: Ângulo em graus.
Ângulo em radianos.
degrees,radians,angle

DSCore.Math.Abs(System.Double)
Localiza o valor absoluto de um número.
number: Número do qual é obtido o valor absoluto
Valor absoluto do número
absolute value,magnitude

DSCore.Math.Equals(System.Double,System.Double,System.Double)
Este método é SOMENTE usado pelo nó NodeModel Igual (a tolerância)

DSCore.Math.Abs(System.Int64)
Localiza o valor absoluto de um número.
integer: Um número.
Valor absoluto do número.
absolute value,magnitude

DSCore.Math.Acos(System.Double)
Localiza o cosseno inverso, o ângulo cujo cosseno é o coeficiente especificado.
ratio: Cosseno do ângulo, um número na faixa de [-1, 1].
O ângulo cujo cosseno é o coeficiente de entrada.
acosine,arccosine

DSCore.Math.Asin(System.Double)
Localiza o seno inverso, o ângulo cujo seno é o coeficiente especificado.
ratio: O seno do ângulo, um número na faixa de [-1, 1].
O ângulo cujo seno é o coeficiente de entrada
asine,arcsin

DSCore.Math.Atan(System.Double)
Localiza a tangente inversa, o ângulo cuja tangente é o coeficiente especificado.
ratio: A tangente do ângulo.
O ângulo cuja tangente é o coeficiente de entrada
atangent,arctangent

DSCore.Math.Atan2(System.Double,System.Double)
Localiza a tangente inversa do quociente de dois números. Retorna o ângulo
cuja tangente é a relação: numerador/denominador.
numerator: O numerador da tangente do ângulo.
denominator: O denominador da tangente do ângulo.
O ângulo cuja tangente é um numerador/denominador
atangent,arctangent

DSCore.Math.Ceiling(System.Double)
Retorna o primeiro número inteiro maior do que o número
number: Número para arredondar.
Primeiro número inteiro maior do que o número
ceiling,round

DSCore.Math.Cos(System.Double)
Localiza o cosseno de um ângulo.
angle: Ângulo em graus do qual obter o cosseno.
Cosseno do ângulo
cosine

DSCore.Math.Cosh(System.Double)
Localiza o cosseno hiperbólico de um ângulo (radianos).
angle: Um ângulo em radianos.
Cosseno hiperbólico do ângulo
hyperbolic cosine

DSCore.Math.DivRem(System.Int64,System.Int64)
Localiza o resto do dividendo/divisor.
dividend: O número a ser dividido.
divisor: O número pela qual ser dividido.
O resto da divisão
remainder

DSCore.Math.EvaluateFormula(System.String,System.String[],System.Object[])
Avalia uma fórmula NCalc com mapeamentos de parâmetro fornecidos.
formulaString: Fórmula NCalc
parameters: Nomes de variáveis
arguments: Vinculações variáveis
tipo: var[]..[] (resultado do cálculo da fórmula)

DSCore.Math.Exp(System.Double)
Retorna o valor exponencial do número, a constante e elevado para o número do valor.
number: Número.
O exponencial do número.
exponential

DSCore.Math.Floor(System.Double)
Retorna o primeiro número inteiro menor que o número.
number: Número a ser arredondado para baixo
Primeiro número inteiro menor do que o número
round

DSCore.Math.Log(System.Double)
Localiza o logaritmo natural de um número na faixa (0, ∞).
number: Número maior do que 0.
Log natural do número.
natural,logarithm,ln

DSCore.Math.Log(System.Double,System.Double)
Localiza o logaritmo de um número com a base especificada.
number: Número maior do que 0.
logBase: Base do logaritmo na faixa [0,1),(1, ∞).
Logaritmo do número.
logarithm,ld,lg

DSCore.Math.Log10(System.Double)
Localiza o logaritmo de base 10 de um número.
number: Número maior do que 0.
Logaritmo do número.
logarithm

DSCore.Math.Max(System.Double,System.Double)
Retorna o maior de dois números.
value1: Número para comparar.
value2: Número para comparar.
Maior dos dois números.
maximum,greater,larger

DSCore.Math.Max(System.Int64,System.Int64)
Retorna o maior de dois números.
int1: Número para comparar.
int2: Número para comparar.
Maior dos dois números.
maximum,greater,larger

DSCore.Math.Min(System.Double,System.Double)
Retorna o menor de dois números.
value1: Número para comparar.
value2: Número para comparar.
O menor de dois números.
minimum,lesser,smaller

DSCore.Math.Min(System.Int64,System.Int64)
Retorna o menor de dois números.
int1: Número para comparar.
int2: Número para comparar.
O menor de dois números.
minimum,lesser,smaller

DSCore.Math.Pow(System.Double,System.Double)
Eleva um número à potência especificada.
number: Número a ser elevado a uma potência.
power: Potência na qual elevar o número.
Número elevado à potência.
^,power,raise,exponent

DSCore.Math.Rand
Produza um número aleatório na faixa de [0, 1).
Número aleatório no intervalo de [0, 1).
random,numberrange

DSCore.Math.Round(System.Double)
Arredonda um número para o valor inteiro mais próximo.
Observe que este método retorna um número de ponto flutuante de precisão dupla em vez de um tipo inteiro.
number: Número para arredondar.
Valor inteiro mais próximo ao número.

DSCore.Math.Round(System.Double,System.Int32)
Arredonda um número para um número especificado de dígitos fracionários.
number: Número a ser arredondado
digits: Número de dígitos fracionários no valor de retorno
O número mais próximo do valor que contém um número de dígitos fracionários igual aos dígitos

DSCore.Math.Sign(System.Double)
Retorna o sinal do número: -1, 0 ou 1.
number: Número cujo sinal deve ser obtido
O sinal do número: -1, 0 ou 1

DSCore.Math.Sign(System.Int64)
Retorna o sinal do número: -1, 0 ou 1.
int: Número inteiro cujo sinal deve ser obtido
O sinal do número: -1, 0 ou 1

DSCore.Math.Sin(System.Double)
Localiza o seno de um ângulo.
angle: Ângulo em graus a partir do qual obter o seno.
Seno do ângulo.
sine

DSCore.Math.Sinh(System.Double)
Localiza o seno hiperbólico de ângulo (radianos).
angle: Um ângulo em radianos.
Seno hiperbólico do ângulo.
hyperbolic

DSCore.Math.Sqrt(System.Double)
Encontra a raiz quadrada positiva de um número na faixa [0, ∞).
number: Um número na faixa de [0, ∞).
Raiz quadrada positiva do número.
square,root,radical

DSCore.Math.Tan(System.Double)
Localiza a tangente de um ângulo.
angle: Ângulo em radianos
Tangente do ângulo
tangent

DSCore.Math.Tanh(System.Double)
Localiza a tangente hiperbólica de um ângulo (radianos).
angle: Ângulo em radianos
Tangente hiperbólica do ângulo
hyperbolic,tanh

DSCore.Math.Sum(System.Collections.Generic.IEnumerable{System.Double})
Localizar a soma de uma série de números
values: Números para acrescentar à soma
A soma dos valores
mass addition,massadd

DSCore.Math.Factorial(System.Int64)
Localiza o resultado fatorial de um número inteiro positivo.
number: Um número inteiro positivo
O resultado fatorial do número inteiro.
!

DSCore.Math.Xor(System.Boolean,System.Boolean)
Booleano XOR: Retorna verdadeiro se e somente se uma das entradas for verdadeira.
bool: Um booleano
otherBool: Outro booleano
Resultado booleano
xor,exclusive,or

DSCore.Math.DoCheckedCast(System.Double)
Executa um molde para ser usado em um contexto verificado. Se a operação gerar um estouro de capacidade,
um aviso é produzido e o resultado do estouro de capacidade é retornado.
value: Operação a ser executada
Returns: O resultado da operação