DSCore.Object
Funções genéricas que operam em todos os dados.

DSCore.Object.IsNull(System.Object)
Determina se o objeto especificado é nulo.
object: O objeto para testar.
Se o objeto for nulo.
is null

DSCore.Object.Identity(System.Object)
Retorna o que é passado, fazendo nada.
object: Um objeto.
Mesmo objeto

DSCore.Object.Type(System.Object)
Retorna o tipo de objeto representado como sequência de caracteres.
object: Objeto para o tipo de consulta
Returns: Tipo de objeto.