DSCore.String
Métodos para gerenciar as sequências de caracteres.

DSCore.String.ToNumber(System.String)
Converte uma sequência de caracteres em um inteiro ou um duplo.
string: Sequência de caracteres a ser convertida
Número inteiro ou número de tipo duplo
2number,str2number,strtonumber,string2number,stringtonumber,int,double,cast

DSCore.String.GetNumber(System.String)
Obter todas as sequências de caracteres de número da sequência de caracteres de destino como uma sequência de caracteres
string: Sequência de caracteres de destino a ser obtida
Número na sequência de caracteres
getnumber,tonumber,strtonumber,numberinstring,string2number,stringtonumber,int,double,cast

DSCore.String.Concat(System.String[])
Concatena múltiplas sequências de caracteres em uma única sequência de caracteres.
strings: Lista de sequência de caracteres para concatenar.
A sequência de caracteres é criada a partir da lista de sequências de caracteres.
concatenate,join,combine strings

DSCore.String.Length(System.String)
Retorna o número de caracteres contidos na determinada sequência de caracteres.
string: Sequência de caracteres cujo comprimento deve ser encontrado
Número de caracteres na sequência de caracteres
count,size,characters,chars,length,sizeof

DSCore.String.Split(System.String,System.String[])
Divide uma única sequência de caracteres em uma lista de sequência de caracteres, com as
divisões determinadas pelo separador de sequências de caracteres fornecido.
string: Sequência de caracteres para dividir
separators: Sequências de caracteres que, se presentes, determinam o início e o final da divisão.
Lista de sequências de caracteres criadas com base na sequência de caracteres de entrada
divide,separator,delimiter,cut,csv,comma,

DSCore.String.Join(System.String,System.String[])
Concatena múltiplas sequências de caracteres em uma única sequência de caracteres, inserindo o determinado separador entre cada sequência de caracteres unida.
separator: Sequência de caracteres a ser inserida entre sequências de caracteres unidas.
strings: As sequências de caracteres que serão unidas em uma única sequência de caracteres.
Uma sequência de caracteres criada a partir da lista de sequência de caracteres, incluindo o caractere separador.
join,separator,build csv,concat,construct

DSCore.String.ToUpper(System.String)
Converte a determinada sequência de caracteres para todos os caracteres maiúsculos.
string: Sequência de caracteres a ser criada em letras maiúsculas
Sequência de caracteres em letras maiúsculas
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.ToLower(System.String)
Converte a determinada sequência de caracteres para todos os caracteres minúsculos.
string: Sequência de caracteres a ser criada em letras minúsculas
Sequência de caracteres em letras minúsculas
2lowercase,to lowercase,tolowercase,lowercase

DSCore.String.ToTitle(System.String)
Converte a determinada sequência de caracteres no tamanho da fonte do título.
str: Sequência de caracteres a ser criada com capitalização do título
Sequência de caracteres com capitalização do título
2titlecase,to titlecase,to title case,totitlecase,titlecase

DSCore.String.ChangeCase(System.String,System.Boolean)
Converte a determinada sequência de caracteres para todos os caracteres maiúsculos ou todos os caracteres minúsculos com base em um parâmetro booleano.
string: Sequência de caracteres a ser criada em letras maiúsculas ou minúsculas.
upper: Verdadeiro para converter em maiúsculas, falso para converter para minúsculas.
Sequência de caracteres com a capitalização convertida.
2lowercase,to lowercase,tolowercase,lowercase,
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.Substring(System.String,System.Int32,System.Int32)
Recupera uma subsequência de caracteres na determinada sequência de caracteres. a subsequência de caracteres começa na determinada posição do caractere e tem o determinado comprimento.
string: Sequência de caracteres da qual obter a subsequência de caracteres
startIndex: A posição do caractere inicial da subsequência de caracteres na sequência de caracteres original
length: Número de caracteres na subsequência de caracteres
Subsequência de caracteres criada com base na sequência de caracteres original
subset,get string,part,smaller string

DSCore.String.Contains(System.String,System.String,System.Boolean)
Determina se a determinada sequência de caracteres contém a determinada subsequência de caracteres.
string: Sequência de caracteres na qual pesquisar
searchFor: Subsequência de caracteres que desejar pesquisar
ignoreCase: Se a comparação leva em conta as maiúsculas e minúsculas
Se a sequência de caracteres contém a subsequência de caracteres
test,within,in,is in,part of

DSCore.String.CountOccurrences(System.String,System.String,System.Boolean)
Conta o número de ocorrências não sobrepostas de uma subsequência de caracteres dentro de uma determinada sequência de caracteres.
string: Sequência de caracteres na qual pesquisar
searchFor: Subsequência de caracteres que desejar pesquisar
ignoreCase: Se a comparação leva em conta as maiúsculas e minúsculas
Número de ocorrências não sobrepostas da subsequência de caracteres na sequência de caracteres
count,substring,count occurrences,numberof,search,find,within

DSCore.String.Replace(System.String,System.String,System.String)
Substitui todas as ocorrências de texto em uma sequência de caracteres por outro texto.
string: A sequência de caracteres na qual substituir as subsequências de caracteres.
searchFor: Texto a ser substituído.
replaceWith: Texto pelo qual substituir.
Sequência de caracteres com substituições feitas.
replace,overwrite,override,find and replace

DSCore.String.EndsWith(System.String,System.String,System.Boolean)
Determina se a determinada sequência de caracteres começa com a determinada subsequência de caracteres.
string: Sequência de caracteres cujo final deve ser pesquisado
searchFor: Subsequência de caracteres cujo final deve ser pesquisado
ignoreCase: Verdadeiro se forem ignoradas as maiúsculas e minúsculas na comparação; falso se forem consideradas
Verdadeiro se a sequência de caracteres começar com a subsequência de caracteres; falso se não começar
test,does end,last,str end,terminated

DSCore.String.StartsWith(System.String,System.String,System.Boolean)
Determina se a determinada sequência de caracteres começa com uma determinada subsequência de caracteres.
string: Sequência de caracteres cujo início deve ser pesquisado
searchFor: Subsequência de caracteres na qual pesquisar o início.
ignoreCase: Verdadeiro se forem ignoradas as maiúsculas e minúsculas na comparação; falso se forem consideradas
Verdadeiro se a sequência de caracteres começar com a subsequência de caracteres; falso se não começar
test,beginswith,start,string start,front

DSCore.String.TrimWhitespace(System.String)
Remove os espaços em branco entre o início e o fim da determinada sequência de caracteres.
string: A sequência de caracteres a ser aparada.
Sequência de caracteres com espaços em branco inicial e final removidos.
trimstring,cleanstring,whitespace,blanks,spaces,string trim

DSCore.String.TrimLeadingWhitespace(System.String)
Remove os espaços em branco do início da determinada sequência de caracteres.
string: A sequência de caracteres a ser aparada.
Sequência de caracteres com os espaços em branco na esquerda removidos.
trim string,clean string,trim leading whitespaces,string trim

DSCore.String.TrimTrailingWhitespace(System.String)
Remove os espaços em branco a partir do fim da determinada sequência de caracteres.
string: A sequência de caracteres a ser aparada.
Sequência de caracteres com os espaços em branco na extremidade removidos.
trim string,clean string,trim trailing whitespaces,string trim

DSCore.String.IndexOf(System.String,System.String,System.Boolean)
Localiza o índice com base zero da primeira ocorrência de um subsequência de caracteres dentro de uma sequência de caracteres.
Retorna -1 se nenhum índice pôde ser encontrado.
string: Sequência de caracteres na qual pesquisar
searchFor: Subsequência de caracteres que desejar pesquisar
ignoreCase: Se a comparação leva em conta as maiúsculas e minúsculas
Índice da primeira ocorrência de uma subsequência de caracteres ou -1, caso não seja encontrado
index of,find substring,where,search

DSCore.String.AllIndicesOf(System.String,System.String,System.Boolean)
Localiza a lista de índices em que a subsequência de caracteres aparece dentro de uma sequência de caracteres.
string: Uma sequência de caracteres na qual pesquisar.
searchFor: Subsequência de caracteres que desejar pesquisar.
ignoreCase: Se deseja ou não levar em conta a comparação entre maiúsculas e minúsculas.
Lista de índices onde a subsequência de caracteres é encontrada (tipo: int[])
all indices of,find substring,where,search

DSCore.String.LastIndexOf(System.String,System.String,System.Boolean)
Localiza o índice com base zero da primeira ocorrência de um subsequência de caracteres dentro de uma sequência de caracteres.
Retorna -1 se nenhum índice pôde ser encontrado.
string: Sequência de caracteres na qual pesquisar.
searchFor: Subsequência de caracteres que desejar pesquisar.
ignoreCase: Se a comparação deve levar em conta maiúsculas e minúsculas.
Índice da última ocorrência do subsequência de caracteres ou -1 se não encontrado.
last index of,find substring,where,search

DSCore.String.PadLeft(System.String,System.Int32,System.String)
Alinha à direita os caracteres na sequência de caracteres fornecida ao preenchê-los com espaços na esquerda,
para um determinado comprimento total.
string: Sequência de caracteres a preencher
newLength: Comprimento total da sequência de caracteres após o preenchimento
padChars: Caractere com o qual preencher, padroniza para espaço
Sequências de caracteres alinhadas à direita com preenchimento de espaços em branco para um comprimento total especificado.
pad left,right align,right-align,pad,string space,whitespace

DSCore.String.PadRight(System.String,System.Int32,System.String)
Alinha à esquerda os caracteres na sequência de caracteres fornecida ao preenchê-los com espaços na direita,
para um determinado comprimento total.
string: Sequência de caracteres a preencher
newLength: Comprimento total da sequência de caracteres após o preenchimento
padChars: Caractere com o qual preencher, padroniza para espaço
Sequências de caracteres alinhadas à esquerda através do preenchimento com espaços em branco à direita para obter um comprimento total especificado
pad right,left align,left-align,pad string space,whitespace

DSCore.String.Center(System.String,System.Int32,System.String)
Aumenta o comprimento de uma sequência de caracteres ao acrescentar espaços aos caracteres originais nos dois lados.
string: Sequência de caracteres para centralizar
newLength: Comprimento total da sequência de caracteres após a centralização
padChars: Caractere com o qual centralizar, padroniza para espaço
Sequências de caracteres alinhadas no centro com preenchimento de espaços em branco na direita e na esquerda para um comprimento total especificado.
center align,center-align,centered,whitespace,expand string,surround

DSCore.String.Insert(System.String,System.Int32,System.String)
Insere uma sequência de caracteres em outra sequência de caracteres em um determinado índice.
string: Sequência de caracteres para inserir.
index: Índice no qual inserir.
toInsert: Sequência de caracteres a ser inserida.
Sequência de caracteres com subsequência de caracteres inserida.
insertstring,insert string

DSCore.String.Remove(System.String,System.Int32,System.Nullable{System.Int32})
Remove os caracteres de uma sequência de caracteres.
string: Sequência de caracteres da qual remover caracteres.
startIndex: Índice no qual iniciar a remoção.
count: Quantidade de caracteres para remover,
Observação: Se o número for negativo, o processo de remoção irá da direita para a esquerda.
Sequência de caracteres com os caracteres removidos.
delete,rem,shorten