DSCore.CurveMapper.SquareRootCurve
Representa uma curva raiz quadrada no CurveMapper.
A curva segue uma função de raiz quadrada e é influenciada por dois pontos de controle.

DSCore.CurveMapper.SquareRootCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Retorna os valores de X e Y distribuídos ao longo da curva.