DSCore.CurveMapper.LinearCurve
Representa uma curva linear no CurveMapper.
Uma curva linear é uma linha reta entre dois pontos de controle.

DSCore.CurveMapper.LinearCurve.LineEquation(System.Double)
Calcula os valores de Y (coordenadas na tela) para valores de X mín. e máx.

DSCore.CurveMapper.LinearCurve.SolveForXGivenY(System.Double)
Calcula os valores de X (coordenadas da tela) para valores de Y mín. e máx.

DSCore.CurveMapper.LinearCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Retorna os valores de X e Y distribuídos ao longo da curva.