DSCore.Data.MaxDepthJsonTextWriter
Subclasse de JsonTextWriter que limita a profundidade máxima suportada dos objetos para evitar as falhas de referência circular durante a serialização dos tipos de objetos .NET arbitrários.