DSCore.CurveMapper.BezierCurve
Representa uma curva de Bézier no CurveMapper.
Uma curva de Bézier é definida por quatro pontos de controle e fornece interpolação suave.

DSCore.CurveMapper.BezierCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Obtém valores de Y interpolados com base nos parâmetros e limites atribuídos.