DSCore.Data.ParseJSON(System.String)
O método Parse converte uma sequência de caracteres JSON arbitrária em um valor. É o oposto de JSON.Stringify.
json: Uma sequência de caracteres JSON
O tipo de resultado depende do conteúdo da sequência de caracteres de entrada. O tipo de resultado pode ser um valor primitivo (por exemplo, sequência de caracteres, booleano, duplo), uma lista ou um dicionário.

DSCore.Data.ToNative(Newtonsoft.Json.Linq.JToken)
Analise a implementação para converter tipos JToken em objetos .NET nativos.
token: JToken para analisar para N

DSCore.Data.DynamoJObjectToNative(Newtonsoft.Json.Linq.JObject)
Analise a implementação para converter tipos JObject em objetos específicos do Dynamo (por exemplo, geometria, cor, imagens etc.)
Throws System.Exception:

DSCore.Data.StringifyJSON(System.Object)
O método Stringify converte um valor arbitrário ou uma lista de valores arbitrários em JSON. É possível usar a replicação para aplicar a operação em uma lista, produzindo uma lista de sequências de caracteres JSON.
values: Uma lista de valores
Uma sequência de caracteres JSON em que os tipos primitivos (por exemplo, duplo, int, booleano), as listas e os dicionários serão transformados no tipo JSON associado.

DSCore.Data.CanObjectBeCached(System.Object)
Função auxiliar para determinar se o objeto pode ser armazenado em cache ou se é nulo, sequência de caracteres “null” ou lista vazia.
inputObject: Objeto a ser verificado

DSCore.Data.Remember(System.Object,System.String)
Função para lidar com o armazenamento em cache do nó Data.Remember
inputObject: Objeto a ser armazenado em cache
cachedJson: Json de cache existente opcional

DSCore.Data.DataNodeDynamoTypeList
Uma lista estática para todos os tipos de dados suportados pelo Dynamo
Returns: A lista contendo os tipos de dados suportados

DSCore.Data.#cctor
Construtor estático

DSCore.Data.SafeExtractDictionaryValue(System.Collections.Generic.Dictionary{System.String,System.Object},System.String)
Uma função de ajuda para extrair com segurança um valor de dicionário
dict: O dicionário do qual extrair o valor
key: A chave do par chave/valor

DSCore.Data.EvaluateDefineDataNode(System.Object,System.String,System.Boolean,System.Boolean,System.String)
Essa é a função usada pelo AST para avaliar o nó Definir dados.
Trata de parte da lógica do nó enquanto executa a validação
inputValue: Valor de entrada a montante
typeString: Tipo como sequência de caracteres (Para fazer: seria melhor passar um objeto do tipo 'Type' para comparação direta do tipo)
isList: Se a entrada é do tipo `ArrayList`
isAutoMode: Se o nó está no modo automático
playerValue: O valor injetado no nó pelo Reprodutor do Dynamo, se houver.

DSCore.Data.FindCommonAncestor(System.Collections.ArrayList)
Uma função para ajudar a localizar o tipo no caso de uma ArrayList de objetos ter sido passada no modo automático
list: O valor de entrada, que se espera que seja do tipo ArrayList

DSCore.Data.LikelyAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
Uma função de ajuda retornando o nó de nível mais baixo de uma lista de nós DataNodeDynamoType
nodes: A lista de DataNodeDynamoType para avaliar

DSCore.Data.FindClosestCommonAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
Uma função de ajuda para tentar determinar um ancestral comum em uma lista de tipos de dados
nodes: A lista de nós DataType para avaliar

DSCore.Data.FindCommonAncestorBetweenTwoNodes(DSCore.Data.DataNodeDynamoType,DSCore.Data.DataNodeDynamoType)
Função recursiva para tentar encontrar um ancestral comum entre dois tipos do Dynamo
Sobe na árvore hierárquica do likelyAncestor até
node: Verificar se esse nó é derivado do provável ancestral
likelyAncestor: O provável ancestral do qual o nó deve ser derivando

DSCore.Data.GetListFromTypes(System.Collections.ArrayList)
Retornar uma lista de DataNodeDynamoTypes de uma ArrayList de objetos
list: A ArrayList de objetos a serem reformatados

DSCore.Data.IsSingleValueOrSingleLevelArrayList(System.Object)
Verificar se o objeto de entrada é um valor único ou uma ArrayList de nível único.
obj: O objeto de entrada para avaliar

DSCore.Data.IsSupportedDataNodeDynamoType(System.Object,System.Type,System.Boolean)
Função para validar o tipo de entrada em relação aos tipos de entrada suportados do Dynamo
inputValue: Os dados de entrada para validar
type: O tipo de entrada fornecido pelo usuário. Ele deve corresponder ao tipo inputValue
isList: O valor desse booleano decide se a entrada é um objeto único ou uma lista

DSCore.Data.IsItemOfType(System.Object,System.Type)
Esse método verifica se um item é de um DataType do Dynamo necessário
'IsInstanceOfType' verifica recursivamente a herança ascendente
item: O item para o qual verificar o tipo de dados
dataType: O DataType com o qual verificar
Returns: Um resultado true ou false com base na validação da verificação

DSCore.Data.IsDerivedFrom(System.Type,System.Type)
Esse método verifica se um tipo é derivado de um tipo base
derivedType: O tipo que queremos confirmar
baseType: O tipo base com o qual comparamos