DSCore.TimeSpan
Um objeto que representa o período de tempo decorrido, com nenhuma data inicial ou final específica.

DSCore.TimeSpan.ByDateDifference(System.DateTime,System.DateTime)
Produz um novo intervalo de tempo calculado com base na diferença entre duas datas/horas.
dateTime: Data/hora da qual é feita a subtração
otherDateTime: Data/hora para subtrair
Intervalo de tempo entre duas datas

DSCore.TimeSpan.Zero
Um intervalo de tempo que representa um tempo decorrido de zero.
Intervalo de tempo representando um tempo decorrido de zero

DSCore.TimeSpan.MaxValue
O maior intervalo de tempo que pode ser representado.
Representação máxima possível do intervalo de tempo

DSCore.TimeSpan.MinValue
O menor intervalo de tempo que pode ser representado.
Representação mínima possível do intervalo de tempo

DSCore.TimeSpan.Create(System.Double,System.Double,System.Double,System.Double,System.Double)
Cria um novo período de tempo a partir de um período de tempo.
days: Dias expandidos.
hours: Horas estendidas.
minutes: Minutos estendidos.
seconds: Segundos estendidos.
milliseconds: Milésimo de segundo estendido.
Intervalo de tempo criado

DSCore.TimeSpan.Scale(System.TimeSpan,System.Double)
Multiplica um intervalo de tempo por um fator de escala
timeSpan: Intervalo de tempo para multiplicar
scaleFactor: Quantidade para redimensionar o intervalo de tempo. Por exemplo, um fator de escala de 2 irá produzir o dobro da quantidade de tempo estendido.
Produto do intervalo de tempo

DSCore.TimeSpan.Negate(System.TimeSpan)
Nega um intervalo de tempo
timeSpan: Intervalo de tempo a ser negado
Intervalo de tempo negativo

DSCore.TimeSpan.Add(System.TimeSpan,System.TimeSpan)
Adiciona dois intervalos de tempo
timeSpan1: Intervalo de tempo para adicionar
timeSpan2: Outro intervalo de tempo para adicionar
Intervalo de tempo resultante da adição

DSCore.TimeSpan.Subtract(System.TimeSpan,System.TimeSpan)
Subtrai dois intervalos de tempo
timeSpan1: Intervalo de tempo do qual é feito a subtração
timeSpan2: Um intervalo de tempo para subtrair
Intervalo de tempo resultante da subtração

DSCore.TimeSpan.FromString(System.String)
Tentativas para analisar um intervalo de tempo numa sequência de caracteres
string: Representação da sequência de caracteres de um intervalo de tempo.
Intervalo de tempo da sequência de caracteres analisada

DSCore.TimeSpan.Components(System.TimeSpan)
Extrai os componentes individuais de um intervalo de tempo.
timeSpan: Intervalo de tempo do qual são obtidos os componentes
Quantidade de dias (tipo int)
Quantidade de horas (tipo int)
Quantidade de minutos (tipo int)
Quantidade de segundos (tipo int)
Quantidade de milissegundos (tipo int)

DSCore.TimeSpan.TotalDays(System.TimeSpan)
Converte a quantidade total de tempo representado por um período de tempo para um
número inexato de dias.
timeSpan: Intervalo de tempo para consultar o total de dias
Quantidade total de dias

DSCore.TimeSpan.TotalHours(System.TimeSpan)
Converte a quantidade total de tempo representado por um período de tempo para um
número inexato de horas.
timeSpan: Intervalo de tempo para consultar o total de horas
Quantidade total de horas

DSCore.TimeSpan.TotalMinutes(System.TimeSpan)
Converte a quantidade total de tempo representado por um período de tempo para um
número inexato de minutos.
timeSpan: Intervalo de tempo para consultar o total de minutos
Quantidade total de minutos

DSCore.TimeSpan.TotalSeconds(System.TimeSpan)
Converte a quantidade total de tempo representado por um período de tempo para um
número inexato de segundos.
timeSpan: Intervalo de tempo para consultar o total de segundos
Quantidade total de segundos

DSCore.TimeSpan.TotalMilliseconds(System.TimeSpan)
Converte a quantidade total de tempo representado por um período de tempo para um
número inexato de milissegundos.
timeSpan: Intervalo de tempo para consultar o total de milissegundos
Quantidade total de milissegundos