DSCore.CurveMapper.SineWave
Representa uma curva de onda senoidal no CurveMapper.
A onda senoidal é definida por dois pontos de controle e segue uma função trigonométrica.

DSCore.CurveMapper.SineWave.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Retorna os valores de X e Y distribuídos ao longo da curva.