DSCore.ColorRange.ByColorsAndParameters(System.Collections.Generic.IList{DSCore.Color},System.Collections.Generic.IList{Autodesk.DesignScript.Geometry.UV})
Criar um ColorRange fornecendo listas de cores e UVs.
colors: Uma lista de cores.
parameters: Uma lista de parâmetros entre (0.0,0.0) e (1.0,1.0).
Returns: Um objeto ColorRange.

DSCore.ColorRange.GetColorAtParameter(Autodesk.DesignScript.Geometry.UV)
Retorna a cor nesta faixa de cores no parâmetro especificado.
parameter: Uma UV entre (0.0,0.0) e (1.0,1.0).
Returns: Uma cor.