DSCore.CurveMapper.CurveBase
Representa uma classe base para todos os tipos de curva no CurveMapper.
Fornece funcionalidade comum para gerar e recuperar valores de curva.

DSCore.CurveMapper.CurveBase.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Método abstrato a ser implementado por classes derivadas para gerar valores de curva.

DSCore.CurveMapper.CurveBase.GetCurveXValues(System.Collections.Generic.List{System.Double},System.Boolean)
Método comum para recuperar os valores de X.

DSCore.CurveMapper.CurveBase.GetCurveYValues(System.Collections.Generic.List{System.Double},System.Boolean)
Método comum para recuperar os valores de Y.

DSCore.CurveMapper.CurveBase.GenerateFromDomain(System.Collections.Generic.List{System.Double},System.Func{System.Double,System.Double})
Gera os valores de X e Y mapeando as entradas de domínio para o espaço de tela e avaliando uma função de curva.