DSCore.Color.Red
Localizar o componente vermelho de uma cor, 0 a 255.
Valor do vermelho para o modelo de cores RGB, nº inteiro entre 0 e 255, inclusive.

DSCore.Color.Green
Localizar o componente verde de uma cor, 0 a 255.
Valor do verde para o modelo de cores RGB, nº inteiro entre 0 e 255, inclusive.

DSCore.Color.Blue
Localizar o componente azul de uma cor, 0 a 255.
Valor do azul para o modelo de cores RGB, nº inteiro entre 0 e 255, inclusive.

DSCore.Color.Alpha
Localizar o componente alfa de uma cor, 0 a 255.
Valor alfa, nº inteiro entre 0 e 255, inclusive.

DSCore.Color.ByARGB(System.Int32,System.Int32,System.Int32,System.Int32)
Crie uma cor usando os componentes alfa, vermelho, verde e azul.
alpha: Valor alfa (entre 0 e 255, inclusive)
red: Valor vermelho para o modelo de cores RGB (entre 0 e 255, inclusive)
green: Valor verde para o modelo de cores RGB (entre 0 e 255, inclusive)
blue: Valor azul para o modelo de cores RGB (entre 0 e 255, inclusive)
Cor criada com base no ARGB
color

DSCore.Color.Brightness(DSCore.Color)
Retorna o valor de brilho para esta cor.
color: Cor na qual consultar o brilho
Valor do brilho (entre 0 e 1, inclusive)

DSCore.Color.Saturation(DSCore.Color)
Retorna o valor de saturação para esta cor.
O valor de saturação como o dobro entre 0 e 1, inclusive.

DSCore.Color.Hue(DSCore.Color)
Retorna o valor de matiz para esta cor.
color: Um objeto de cor
Valor da matiz da cor como um duplo entre 0 e 1, inclusive.
hues

DSCore.Color.Components(DSCore.Color)
Lista os componentes para a cor na ordem: alfa, vermelho, verde, azul.
color: Um objeto de cor
Valor alfa, nº inteiro entre 0 e 255, inclusive.
Valor do vermelho para o modelo de cores RGB, nº inteiro entre 0 e 255, inclusive.
Valor do verde para o modelo de cores RGB, nº inteiro entre 0 e 255, inclusive.
Valor do azul para o modelo de cores RGB, nº inteiro entre 0 e 255, inclusive.
alpha,red,green,blue

DSCore.Color.BuildColorFrom1DRange(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double},System.Double)
Retorna uma cor a partir de um gradiente de cores entre uma cor inicial e uma cor final.
parameters: Os valores entre 0 e 1 ao longo da faixa para a qual você deseja amostrar a cor.
Cores da faixa fornecida.
color,range,gradient

DSCore.Color.Lerp(DSCore.Color,DSCore.Color,System.Double)
Interpolar de forma linear entre duas cores.
start: A cor inicial.
end: A cor final.
t: Um parâmetro entre 0.0 e 1.0.
Returns: A cor ou branco interpolada.

DSCore.Color.Blerp(System.Collections.Generic.IList{DSCore.Color.IndexedColor2D},Autodesk.DesignScript.Geometry.UV)
Interpolar de forma bilinear entre um conjunto de cores.
Returns: A cor ou branco interpolada.
This algorithm is not the same as the solution found from wikipedia
(reference: https://en.wikipedia.org/wiki/Bilinear_interpolation)

DSCore.Color.Add(DSCore.Color,DSCore.Color)
Crie uma cor combinando os valores ARGB de duas cores existentes.
color: Uma cor para adicionar
otherColor: Outra cor para adicionar
Resultado da cor decorrente da adição de duas cores

DSCore.Color.Multiply(DSCore.Color,System.Double)
Multiplique uma cor de entrada por um multiplicador numérico para produzir uma cor mais escura. A cor de entrada deve ter um alfa menor que 255.
color: Cor para multiplicar
multiplier: Valor do multiplicador
Resultado da cor decorrente da multiplicação

DSCore.Color.Divide(DSCore.Color,System.Double)
Divida uma cor de entrada por um divisor numérico para produzir uma cor mais clara e remover a matiz da cor
color: Cor para dividir
dividend: Valor do dividendo
Resultado da cor decorrente da divisão