DSCore.CurveMapper.ParabolicCurve
Representa uma curva parabólica no CurveMapper.
A curva segue uma equação quadrática baseada em dois pontos de controle.

DSCore.CurveMapper.ParabolicCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Retorna os valores de X e Y distribuídos ao longo da curva.