DSCore.Quadtree.ByUVs(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.UV})
Construir uma árvore quádrupla abrangente (0,0) ->(1,1) domínio.
uvs: Um conjunto de UVs no domínio (0,0)->(1,1).
Returns: Um objeto de árvore quádrupla.

DSCore.Quadtree.FindPointsWithinRadius(Autodesk.DesignScript.Geometry.UV,System.Double)
Localize todos os pontos de árvore quádrupla (UVs) na árvore quádrupla dentro de um raio da localização de UV especificada.
center: O UV no centro da área de pesquisa.
radius: O raio da área da pesquisa.
Returns: Uma lista de UVs.