DSCore.CurveMapper.PerlinNoiseCurve
Representa uma curva de ruído Perlin no CurveMapper.
A curva gera ruído procedural com base nos pontos de controle e nas funções de ruído Perlin.

DSCore.CurveMapper.PerlinNoiseCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Retorna os valores de X e Y distribuídos ao longo da curva.