DSCore.Properties.Resources
Uma classe de recurso digitada com ênfase, para pesquisar sequências de caracteres etc.

DSCore.Properties.Resources.ResourceManager
Retorna a instância do cache ResourceManager usada por esta classe.

DSCore.Properties.Resources.Culture
Substitui a propriedade CurrentUICulture dos threads atuais para todas
as pesquisas de recurso que usam esta classe de recurso digitada com ênfase.

DSCore.Properties.Resources.BitmapOverflowError
Procura uma sequência de caracteres localizada, que seja semelhante a “Os dados de cor fornecidos são muito grandes para caber nos limites da imagem”.

DSCore.Properties.Resources.CurveMapperEqualMinMaxWarning
Procura uma sequência de caracteres localizada semelhante a • “Os valores mínimo e máximo devem ser diferentes”.

DSCore.Properties.Resources.CurveMapperInvalidCountWarning
Procura uma sequência de caracteres localizada semelhante a •“ Os valores devem ser uma lista de números ou um número único ≥ 2”.

DSCore.Properties.Resources.CurveMapperInvalidCurveWarning
Procura uma sequência de caracteres localizada semelhante a • “Os pontos de controle da curva selecionada não são válidos”.

DSCore.Properties.Resources.CurveMapperInvalidXYFormatWarning
Procura uma sequência de caracteres localizada semelhante a • “As entradas X e Y devem ser números únicos (não listas)”.

DSCore.Properties.Resources.DefineDataSupportedInputValueExceptionMessage
Procura uma sequência de caracteres localizada similar a “A entrada deve ser um valor único ou uma lista não aninhada”.

DSCore.Properties.Resources.DefineDataUnexpectedInputExceptionMessage
Procura uma sequência de caracteres localizada similar a “Esse nó esperava uma entrada {0}, mas recebeu uma entrada {1}. Forneça a entrada esperada ou selecione um novo tipo no menu suspenso do nó”.

DSCore.Properties.Resources.DefineDataUnsupportedCombinationOfDataTypesExceptionMessage
Procura uma sequência de caracteres localizada similar a “Esse nó não oferece suporte à combinação de tipos de dados na lista de entrada atual {0}. Verifique se a lista de entrada contém itens do mesmo tipo de dados ou uma combinação de tipos com um tipo principal comum”.

DSCore.Properties.Resources.DefineDataUnsupportedDataTypeExceptionMessage
Procura uma sequência de caracteres localizada similar a “Esse nó não oferece suporte ao tipo de dados de entrada atual ({0}). Visualize os tipos de dados com suporte no menu suspenso”.

DSCore.Properties.Resources.EnumDateOfWeekFriday
Pesquise por uma de sequência de caracteres localizada similar a Sexta-feira.

DSCore.Properties.Resources.EnumDateOfWeekMonday
Pesquise por uma de sequência de caracteres localizada similar a Segunda-feira.

DSCore.Properties.Resources.EnumDateOfWeekSaturday
Pesquise por uma sequência de caracteres localizada similar a Sábado.

DSCore.Properties.Resources.EnumDateOfWeekSunday
Pesquise por uma sequência de caracteres localizada similar a Domingo.

DSCore.Properties.Resources.EnumDateOfWeekThursday
Pesquise por uma sequência de caracteres localizada similar a Quinta-feira.

DSCore.Properties.Resources.EnumDateOfWeekTuesday
Pesquise por uma sequência de caracteres localizada similar a Terça-feira.

DSCore.Properties.Resources.EnumDateOfWeekWednesday
Pesquise por uma sequência de caracteres localizada similar a Quarta-feira.

DSCore.Properties.Resources.Exception_Deserialize_Bad_Format
Procura uma sequência de caracteres localizada, que seja similar a “O json para o tipo {0} não foi formatado corretamente”.

DSCore.Properties.Resources.Exception_Deserialize_Unsupported_Cache
Procura uma sequência de caracteres localizada, que seja similar a “Não é possível carregar os dados armazenados”.

DSCore.Properties.Resources.Exception_Serialize_Depth_Unsupported
Procura uma sequência de caracteres localizada similar a “A profundidade de {0} excede a profundidade máxima de {1} no caminho '{2}'”.

DSCore.Properties.Resources.Exception_Serialize_DesignScript_Unsupported
Procura uma sequência de caracteres localizada, que seja similar a “Esse tipo de geometria não pode ser serializado”.

DSCore.Properties.Resources.Exception_Serialize_Unsupported_Type
Procura uma sequência de caracteres localizada, que seja similar a “Não é possível armazenar dados do tipo {0}”.

DSCore.Properties.Resources.ExportToCSVObsolete
Pesquisa por uma sequência de caracteres localizada similar para Usar o nó Data.ExportCSV.

DSCore.Properties.Resources.FactorialNegativeInt
Procura uma sequência de caracteres localizada similar a O valor de entrada Math.Factorial não pode ser negativo.

DSCore.Properties.Resources.FactorialOverflow
Procura uma sequência de caracteres localizada similar a O Valor de retorno de Math.Factorial está fora do intervalo.

DSCore.Properties.Resources.FindPointsWithinRadiusNullPointMessage
A pesquisa de sequência de caracteres localizada similar a Você deve fornecer um ponto central.

DSCore.Properties.Resources.FindPointsWithinRadiusSearchRadiusMessage
A pesquisa de sequência de caracteres localizada similar a O raio de pesquisa não pode ser zero.

DSCore.Properties.Resources.FromObjectObsolete
A pesquisa de sequência de caracteres localizada similar a Este nó é obsoleto, utilize "Sequência de caracteres do objeto".

DSCore.Properties.Resources.IntegerOverflow
Procura uma sequência de caracteres localizada similar à opção: A operação resultou em um estouro de número inteiro. O resultado pode ser inesperado.

DSCore.Properties.Resources.InvalidDestinationPathErrorMessage
Procura uma sequência de caracteres localizada similar a Caminho de arquivo de destino inválido usado como caminho de cópia...

DSCore.Properties.Resources.InvalidKeysErrorMessage
Pesquisa por uma sequência localizada similar a um ou mais tipos de entrada que não são coincidentes. Listas como chaves não são suportadas.

DSCore.Properties.Resources.InvalidKeysLenghtErrorMessage
Procura uma sequência de caracteres localizada similar a O número de itens não coincide com o número de chaves. href=InvalidKeysLenghtErrorMessage.html.

DSCore.Properties.Resources.LoadImageFromPathObsolete
A pesquisa de sequência de caracteres localizada similar a Usar o nó File.FromPath -> Image.ReadFromFile.

DSCore.Properties.Resources.MissingPythonEngine
Procura uma sequência de caracteres localizada semelhante a Não foi possível localizar o mecanismo Python selecionado.

DSCore.Properties.Resources.ObjectArgumentExceptionMessage
Procura uma versão de sequência de caracteres similar para o Objeto que não pode ser nulo, forneça valor apropriado...

DSCore.Properties.Resources.QuadtreeConstructionEmptyUVSetMessage
A pesquisa de sequência de caracteres localizada similar a Não é possível construir uma árvore quádrupla a partir de um conjunto vazio de pontos.

DSCore.Properties.Resources.QuadtreeConstructionNullUVSetMessage
A pesquisa de sequência de caracteres localizada similar a A árvore quádrupla não pode ser construída a partir de um conjunto nulo de UVs.

DSCore.Properties.Resources.ReadImageObsolete
A pesquisa de sequência de caracteres localizada similar a Usar os nós File.FromPath-> Image.ReadFromFile -> Image.Pixels.

DSCore.Properties.Resources.ReadTextObsolete
A pesquisa de sequência de caracteres localizada similar a Usar o nó File.FromPath -> Excel.ReadFromFile.

DSCore.Properties.Resources.StringRemoveCountOutOfRangeMessage
Procura uma sequência de caracteres localizada similar a contagem que está fora da faixa!.

DSCore.Properties.Resources.StringRemoveStartIndexOutOfRangeMessage
Procura uma sequência de caracteres  localizada similar a StartIndex que está fora da faixa!.

DSCore.Properties.Resources.StringToNumberInvalidNumberMessage
Pesquisa uma  sequência de caracteres localizada similar a Não é um número válido.

DSCore.Properties.Resources.WebRequestNullUrlMessage
Pesquisa uma sequência de caracteres localizada similar a O URL não pode ser nulo.

DSCore.Properties.Resources.WriteImageObsolete
A pesquisa de sequência de caracteres localizada similar a Usar o nó Image.WriteToFile.