DSCore.Thread
Funções para manipular os threads de avaliação.

DSCore.Thread.Pause(System.Object,System.Int32)
Pausa o thread da avaliação atual por um determinado período de tempo.
object: O objeto a ser aprovado.
msTimeout: Duração de tempo para pausar o thread, em milésimos de segundo.
Objeto foi aprovado.