DSCore.CurveMapper.PowerCurve
Representa uma curva de função de potência no CurveMapper.
A curva é definida por uma equação de potência derivada de um ponto de controle.

DSCore.CurveMapper.PowerCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Retorna os valores de X e Y distribuídos ao longo da curva.