DSCore.CurveMapper.GaussianCurve
Representa uma curva gaussiana no CurveMapper.
A curva gaussiana segue uma distribuição em forma de sino definida por quatro pontos de controle.

DSCore.CurveMapper.GaussianCurve.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Indica se o nó está sendo redimensionado no momento, impedindo atualizações não intencionais de ponto de controle.

DSCore.CurveMapper.GaussianCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Retorna os valores de X e Y distribuídos ao longo da curva.