DSCore.DateTime
O objeto representando uma data e hora específica.

DSCore.DateTime.MinValue
A data e a hora mais antiga que pode ser representada.
Representação mínima possível de Data/hora

DSCore.DateTime.MaxValue
A data e hora mais recente que pode ser representada.
Representação máxima possível de Data/hora

DSCore.DateTime.Now
O sistema atual de data e hora.
Data/hora representando o momento atual

DSCore.DateTime.Today
A data atual do sistema, com a hora definida para meia-noite.
Data/hora representando o dia de hoje

DSCore.DateTime.Format(System.DateTime,System.String)
Retornar uma data e hora especificadas como uma sequência de caracteres, no formato especificado.
dateTime: Date/hora para formatar
format: Representação da sequência de caracteres do formato de data. Usa InvariantCulture, cujo resultado não depende do idioma do sistema operacional do usuário.
Define o padrão com o formato padrão "F" : "Terça-feira, 21 de fevereiro de 2017 23:02:43"
Pesquise "Cadeias de caracteres de formato de data e hora personalizado" no MSDN para obter uma lista abrangente dos especificadores de formato.
Data/hora representada como uma sequência de caracteres

DSCore.DateTime.ByDate(System.Int32,System.Int32,System.Int32)
Cria uma nova data e hora em uma data exata.
year: Ano exato (1-9999)
month: Mês exato (1-12)
day: Dia exato (1 - [dias no mês])
Data/hora criada com base na data

DSCore.DateTime.ByDateAndTime(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
Cria uma nova data e hora em uma data e hora exata.
year: Ano exato (1-9999)
month: Mês exato (1-12)
day: Dia exato (1 - [dias no mês])
hour: Hora exata (0-23)
minute: Minuto exato (0-59)
second: Segundo exato (0-59)
millisecond: Milésimo de segundo exato (0-999)
Data/hora criada com base na data e hora

DSCore.DateTime.SubtractTimeSpan(System.DateTime,System.TimeSpan)
Subtrai um intervalo de tempo de uma data e hora, produzindo uma nova data e hora.
dateTime: Data/hora inicial
timeSpan: Quantidade de tempo para subtrair
Data/hora resultante da subtração

DSCore.DateTime.AddTimeSpan(System.DateTime,System.TimeSpan)
Adiciona um intervalo de tempo para uma data/hora, produzindo uma nova data e hora.
dateTime: Data/hora inicial
timeSpan: Quantidade de tempo para adicionar à Data/hora
Data/hora resultante da adição do intervalo de tempo

DSCore.DateTime.DaysInMonth(System.Int32,System.Int32)
Calcula quantos dias estão em um determinado mês de um determinado ano.
year: Ano exato (1-9999)
month: Mês exato (1-12)
Número de dias no mês

DSCore.DateTime.IsDaylightSavingsTime(System.DateTime)
Determina se é uma economia de luz natural do horário de verão a uma determinada data/hora.
dateTime: Data/hora usada para determinar se existem horários de verão
Verdadeiro se a Data/hora estiver no horário de verão; falso se não estiver

DSCore.DateTime.IsLeapYear(System.Int32)
Determina se um determinado ano é um ano bissexto.
year: Ano exato (1-9999)
Verdadeiro se o ano for bissexto; falso se não for

DSCore.DateTime.FromString(System.String)
Tentativas para analisar uma Data/hora de uma sequência de caracteres
string: Representação da sequência de caracteres de uma Data/hora
Data/hora resultante da sequência de caracteres analisada

DSCore.DateTime.Date(System.DateTime)
Extrai somente a data da data/hora. Os componentes de tempo são definidos como 0.
dateTime: Uma Data/Hora.
data do campo Data/Hora
Date

DSCore.DateTime.Components(System.DateTime)
Extrai os componentes individuais de uma data/hora.
dateTime: Data/hora da qual são obtidos os componentes
Representação numérica do ano (1-9999)
Representação numérica do mês (1-12)
Representação numérica do dia (1 a [dias no mês])
Representação numérica da hora (0-23)
Representação numérica dos minutos (0-59)
Representação numérica dos segundos (0-59)
Representação numérica de milissegundos (0-999)

DSCore.DateTime.DayOfWeek(System.DateTime)
Retorna o dia da semana de uma determinada data e hora.
dateTime: Objeto de data/hora do qual será obtido o dia da semana
Dia da semana

DSCore.DateTime.DayOfYear(System.DateTime)
Retorna o dia do ano (0-366)
dateTime: Data/hora da qual será obtida o dia do ano
Número de dias desde o início do ano

DSCore.DateTime.TimeOfDay(System.DateTime)
Produz um novo intervalo de tempo que representa a quantidade de tempo que passou desde a meia-noite d a data e hora especificada.
dateTime: Uma Data/Hora.
Intervalo de tempo desde a meia-noite