DSCore.ObjectComparer
Implementa a função Comparar para dois objetos usando a seguinte regra.
1. Os números são considerados como os menores, booleanos, sequência de caracteres e ponteiros.
2. Se dois objetos forem IComparable e do mesmo tipo, então utilize seu mecanismo de comparação nativo.
3. Se as entradas são do  tipo de valor, mas um deles for booleano, booleano é maior
4. Caso contrário, converta todos eles para duplo e compare.
5. Else IF é somente um é um tipo de valor, então o objeto de tipo de valor é menor
6. Else IF somente uma sequência de caracteres, então a sequência de caracteres é menor do que outra
7. Else não sabe como para comparar, portanto melhor comparar com base no HashCode.