DSCore.IO.FileSystem
Métodos para trabalhar com os arquivos.

DSCore.IO.FileSystem.AbsolutePath(System.String,System.String)
Retorna o caminho absoluto do determinado caminho. Se o caminho for
o caminho relativo, então ele é solucionado com relação ao
espaço de trabalho atual. Se o arquivo não existir no caminho relativo, mas existe
no determinado hintPath, então o hintPath é retornado.
path: Caminho relativo ou caminho completo
hintPath: Último caminho resolvido
Returns: Caminho absoluto

DSCore.IO.FileSystem.FileFromPath(System.String)
Cria um objeto de arquivo a partir do caminho de arquivo dado.

DSCore.IO.FileSystem.ReadText(System.IO.FileInfo)
Lê um arquivo de texto e retorna o conteúdo como uma sequência de caracteres.
file: Objeto de arquivo para ler o texto
Conteúdo do arquivo de texto.
read file,text,file

DSCore.IO.FileSystem.MoveFile(System.String,System.String,System.Boolean)
Move um arquivo especificado para uma nova localização
path: Representação da sequência de caracteres do caminho existente
newPath: Representação da sequência de caracteres do novo caminho
overwrite: Alternar para substituir arquivos existentes
O nó executa uma tarefa, não produz uma saída

DSCore.IO.FileSystem.DeleteFile(System.String)
Exclui o arquivo especificado.
path: Caminho do arquivo a ser excluído
O nó executa uma tarefa, não produz uma saída

DSCore.IO.FileSystem.CopyFile(System.IO.FileInfo,System.String,System.Boolean)
Copia um arquivo.
file: Objeto de arquivo a ser copiado
destinationPath: Representação da sequência de caracteres do caminho do arquivo de destino
overwrite: Alternar para substituir arquivos existentes
O nó executa uma tarefa e retornará verdadeiro se a ação de cópia tiver êxito.

DSCore.IO.FileSystem.FileExists(System.String)
Determina se um arquivo existe no determinado caminho.
path: Sequência de caracteres representando um caminho de arquivo
Verdadeiro se o arquivo existir; falso se não existir
filepath

DSCore.IO.FileSystem.WriteText(System.String,System.String)
Gravar o conteúdo do texto em um arquivo especificado pelo caminho
filePath: Caminho da gravação
text: Conteúdo do texto
Nenhuma saída
write file,text,file,filepath

DSCore.IO.FileSystem.AppendText(System.String,System.String)
Anexar o conteúdo do texto a um arquivo especificado pelo caminho
filePath: Caminho da gravação
text: Conteúdo do texto
O nó executa uma tarefa, não produz uma saída
append file,write file,text,file,filepath

DSCore.IO.FileSystem.CombinePath(System.String[])
Une múltiplas sequências de caracteres em um caminho de arquivo único.
strings: Sequências de caracteres para combinar em um caminho
Caminho do arquivo combinado

DSCore.IO.FileSystem.FileExtension(System.String)
Retorna a extensão de um caminho de arquivo.
path: Caminho do qual a extensão é obtida
Extensão do arquivo

DSCore.IO.FileSystem.ChangePathExtension(System.String,System.String)
Altera a extensão de um caminho de arquivo.
path: Caminho do qual a extensão é alterada
newExtension: Representação da sequência de caracteres da nova extensão
Caminho do arquivo com extensão alterada

DSCore.IO.FileSystem.DirectoryName(System.String)
Retorna o nome do diretório de um caminho de arquivo.
path: Caminho do qual é obtida a informação do diretório
Nome do diretório do caminho do arquivo
directorypath

DSCore.IO.FileSystem.FileName(System.String,System.Boolean)
Retorna o nome do arquivo de um caminho de arquivo.
path: Caminho do qual é obtido o nome do arquivo
withExtension: Alternar para incluir a extensão no resultado
Nome do arquivo do caminho do arquivo

DSCore.IO.FileSystem.FileHasExtension(System.String)
Determina se um caminho de arquivo contém ou não uma extensão.
path: Caminho no qual a extensão deve ser verificada
Verdadeiro se o caminho do arquivo contiver extensão; falso se não contiver

DSCore.IO.FileSystem.GetDirectoryContents(System.IO.DirectoryInfo,System.String,System.Boolean)
Retornará uma lista de arquivos e diretórios contidos em um determinado diretório. É possível usar uma searchString opcional para filtrar os resultados.
directory: Diretório do qual são obtidos os conteúdos
searchString: Sequência de caracteres de pesquisa usada para filtrar os resultados
includeSubdirectories: Defina como verdadeiro para incluir arquivos e pastas em subdiretórios (recorrente) ou defina como falso para incluir os resultados de nível superior somente do diretório fornecido.
Arquivos resultantes da consulta
Diretórios resultantes da consulta

DSCore.IO.FileSystem.CopyDirectory(System.IO.DirectoryInfo,System.String,System.Boolean)
Copia um diretório para uma localização de destino.
directory: Diretório a ser copiado
destinationPath: Destino da operação de cópia no disco
overwriteFiles: Alternar para substituir diretório existente
O nó executa uma tarefa, não produz uma saída

DSCore.IO.FileSystem.DeleteDirectory(System.String,System.Boolean)
Exclui um diretório.
path: Caminho para um diretório no disco
recursive: Se você deseja ou não excluir todo o conteúdo do diretório, padroniza para falso.
O nó executa uma tarefa, não produz uma saída

DSCore.IO.FileSystem.DirectoryExists(System.String)
Determina se um diretório existe no determinado caminho.
path: Caminho para um diretório no disco
Verdadeiro se o diretório existir; falso se não existir
directorypath

DSCore.IO.FileSystem.MoveDirectory(System.String,System.String,System.Boolean)
Move um diretório para uma nova localização.
path: Representação da sequência de caracteres do caminho existente
newPath: Representação da sequência de caracteres do novo caminho
overwriteFiles: Alternar para substituir arquivos existentes
O nó executa uma tarefa, não produz uma saída