DSCore.List
Métodos para criar e manipular listas.

DSCore.List.Empty
Retorna uma lista vazia.
Lista vazia.
empty list, emptylist,[]

DSCore.List.UniqueItems(System.Collections.IList)
Cria uma nova lista que contém todos os itens exclusivos da determinada lista.
list: Lista da qual filtrar os duplicados.
Lista filtrada.
removes,duplicates,remove duplicates,cull duplicates,distinct,listcontains

DSCore.List.Contains(System.Collections.IList,System.Object)
Determina se a lista dada contém o item dado. Esta função pesquisa as sublistas contidos nela.
list: Lista na qual pesquisar
item: Item a ser procurado
Verdadeiro se a lista contiver o item; falso se não contiver
item,search,in,listcontains

DSCore.List.IsHomogeneous(System.Collections.IList)
Verifique se os itens da lista são do mesmo tipo.
list: Lista a ser verificada em relação se é homogênea.
Se a lista é homogênea.
homogeneous,allequal,same,type

DSCore.List.IsRectangular(System.Collections.IList)
Verifique se o número de itens em todas as linhas da lista é o mesmo.
list: Lista a ser verificada em relação a se as linhas têm o mesmo número de itens.
Se a lista tem o mesmo número de itens em todas as linhas.
rectangular,isrectangular,same,sublist,row

DSCore.List.IsUniformDepth(System.Collections.IList)
Verifique se os itens da lista têm a mesma profundidade.
list: Lista a ser verificada em relação a se os itens têm a mesma profundidade.
Se a profundidade da lista é uniforme.
depth,uniform,isuniformdepth,sublist,jagged

DSCore.List.SetDifference(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Retorna uma nova lista que inclui os objetos na Lista1, mas exclui os objetos da Lista2.
list1: Lista dos objetos a serem incluídos na nova lista
list2: Lista dos objetos a serem excluídos da nova lista
A nova lista que contém os objetos na Lista1, mas não na Lista2
difference,setdifference,set

DSCore.List.SetIntersection(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Retorna uma nova lista que inclui objetos que estão presentes na Lista1 e Lista2.
list1: Lista dos objetos a serem comparados com a lista2
list2: Lista dos objetos a serem comparados com a lista1
A nova lista que contém os objetos que estão na Lista1 e na Lista2
intersection,setintersection,set,overlap

DSCore.List.SetUnion(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Retorna uma nova lista que inclui os objetos que estão presentes na Lista1 ou na Lista2.
list1: Lista dos objetos a serem incluídos
list2: Lista dos objetos a serem incluídos na Lista1
A nova lista que contém os objetos que estão na Lista1 ou na Lista2
union,setunion,set

DSCore.List.IndexOf(System.Collections.IList,System.Object)
Retorna o índice do elemento na lista fornecida. A correspondência entre a lista fornecida e o elemento de destino deve ser exata (ou seja, int com int, double com double, string com string, object com object etc.).
list: A lista na qual localizar o elemento.
element: O elemento cujo índice deve ser retornado.
O índice do elemento na lista. Índice inválido – retornará 1 se não for encontrada uma correspondência exata.
index,indexof

DSCore.List.CountFalse(System.Collections.IList)
Retorna o número de valores booleanos falsos na lista fornecida.
list: A lista na qual localizar os valores booleanos falsos.
O número de valores booleanos falsos na lista.
false,count

DSCore.List.CountTrue(System.Collections.IList)
Retorna o número de valores booleanos verdadeiros na lista fornecida.
list: A lista na qual localizar os valores booleanos verdadeiros.
O número de valores booleanos verdadeiros na lista.
true,count

DSCore.List.Insert(System.Collections.IList,System.Object,System.Int32)
Insere um elemento em uma lista no índice especificado.
list: A lista na qual o elemento será inserido
element: O elemento a ser inserido
index: Especifica a localização na lista do elemento a ser inserido
Lista com o elemento inserido
insert,add

DSCore.List.Reorder(System.Collections.IList,System.Collections.IList)
Reordena a lista de entradas com base na lista de índices fornecida.
list: A lista a ser reordenada
indices: Os índices usados para reordenar os itens na lista
Lista reordenada
reorder,index,indices

DSCore.List.SortIndexByValue(System.Collections.Generic.List{System.Double})
Classifica a lista por itens e retorna seus índices.
list: Lista de itens a ser classificada
Os índices dos itens na lista classificada
sort,index,value

DSCore.List.NormalizeDepth(System.Collections.IList,System.Int32)
Retorna a lista multidimensional de acordo com a classificação dada.
list: A lista cuja profundidade será normalizada de acordo com a classificação.
rank: A classificação com a qual a lista será padronizada. O valor padrão é 1.
A lista com a classificação padronizada.
depth,normalize

DSCore.List.Reverse(System.Collections.IList)
Cria uma nova lista contendo os itens da lista determinada, mas na ordem inversa.
list: Lista a ser revertida.
Lista invertida
flip,listcontains

DSCore.List.__Create(System.Collections.IList)
Cria uma nova lista que contém os determinados itens.
items: Itens a serem armazenados na nova lista.

DSCore.List.Sublists(System.Collections.IList,System.Collections.IList,System.Int32)
Crie sublistas a partir de uma lista usando a sintaxe de faixa DesignScript.
list: A lista a partir da qual deseja criar sublistas.
ranges: As faixas de índice para elementos da sublista.
Ex. \"{0..3,5,2}\"
offset: O deslocamento para aplicar à sublista. Ex. A faixa "0.. 2" com um deslocamento de 1 irá produzir as sublistas {0,1,2}{1,2,3}{2,3,4}...
tipo: var[]..[]
sublists,build sublists,subset,

DSCore.List.Sort(System.Collections.Generic.IEnumerable{System.Object})
Classifica a lista usando a ordem natural incorporada.
list: Lista a ser classificada
Lista classificada
sort,order,sorted

DSCore.List.MinimumItem(System.Collections.Generic.IEnumerable{System.Object})
Retorna o valor mínimo de uma lista.
list: Lista de itens comparáveis para obter o valor mínimo
Mínimo de itens na lista.
least,smallest,find min

DSCore.List.MaximumItem(System.Collections.Generic.IEnumerable{System.Object})
Retorna o valor máximo de uma lista.
list: Lista de itens comparáveis para obter o valor máximo
Máximo de itens na lista.
greatest,largest,biggest,find max

DSCore.List.FilterByBoolMask(System.Collections.IList,System.Collections.IList)
Filtra uma sequência examinando os índices correspondentes em lista separada de booleanos.
list: Lista a filtrar.
mask: Lista de booleanos representando uma máscara.
Os itens cujo índice de máscara é verdadeiro.
Os itens cujo índice de máscara é falso.
filter,in,out,mask,dispatch,bool filter,boolfilter,bool filter

DSCore.List.Deconstruct(System.Collections.IList)
O fornecimento de uma lista produz o primeiro item na lista e uma nova lista que contém todos os itens exceto o primeiro.
list: Lista a ser dividida.
O primeiro item na lista (tipo: var[]..[])
Restante da lista (tipo: var[]..[])
first,rest,list split,listcontains

DSCore.List.SortByKey(System.Collections.IList,System.Collections.IList)
Classificar a lista com base em suas chaves
list: lista a ser classificada
keys: lista de chaves, as chaves devem ser classificáveis (por exemplo, números, strings)
tipo: var[]..[]
tipo: var[]..[]
sort;key

DSCore.List.GroupByKey(System.Collections.IList,System.Collections.IList)
Agrupar os itens em sublistas com base em seus valores chave
list: Lista de itens para agrupar como sublistas
keys: Valores chave, um por item na lista de entrada, utilizados para agrupar os itens
lista de sublistas, com itens agrupados pelos valores chave parecidos
valor chave correspondente a cada grupo
list;group;groupbykey;

DSCore.List.GroupBySimilarity(System.Collections.IList,System.Double,System.Boolean)
Os clusters listam elementos com base na adjacência de seus índices e na semelhança de seus valores
list: Lista de itens a serem agrupados como sublistas com base em adjacência e similaridade
tolerance: Valor limite para agrupamento de itens similares
considerAdjacency: Valor booleano para controlar se o nó deve considerar ou não a adjacência.
Lista de sublistas com itens agrupados por valores similares
Lista de sublistas contendo os índices originais de valores agrupados
list;group;similar;adjacent;adjacency;groupbyadjacency;groupadjacentitems;groupsimilaritems;cluster;tolerance

DSCore.List.LevenshteinDistance(System.String,System.String)
Distância de Levenshtein é o algoritmo usado para obter a distância entre 2 sequências de caracteres
| Origem

DSCore.List.AddItemToFront(System.Object,System.Collections.IList)
Adiciona um item no início de uma lista.
item: Item a ser adicionado. O item pode ser um objeto ou uma lista.
list: Lista na qual adicionar.
Lista com itens adicionados
insert,add,item,front,start,begin

DSCore.List.AddItemToEnd(System.Object,System.Collections.IList)
Adiciona um item no final de uma lista.
item: Item a ser adicionado. O item pode ser um objeto ou uma lista.
list: Lista na qual adicionar.
Lista com itens adicionados
insert,add,item,end

DSCore.List.TakeItems(System.Collections.IList,System.Int32)
Obtém uma quantidade de itens no início da lista.
list: Lista da qual obter.
amount: Quantidade de itens para obter. Se negativo, os itens são obtidos a partir do fim da lista.
Lista de itens extraídos.
get,sub,sublist,extract

DSCore.List.DropItems(System.Collections.IList,System.Int32)
Remove uma quantidade de itens do início da lista. Se o valor for negativo,
os itens são removidos do final da lista.
list: Lista da qual remover itens.
amount: Quantidade de itens para remover. Se negativo, os itens são removidos da parte final da lista.
Lista de itens remanescentes.
drop,remove,shorten

DSCore.List.ShiftIndices(System.Collections.IList,System.Int32)
Troca os índices na lista à direita pelo valor fornecido.
list: Lista a ser deslocada.
amount: Quantidade pela qual deslocar os índices. Se negativo, os índices serão deslocados para a esquerda.
Lista deslocada.
shift,offset

DSCore.List.GetItemAtIndex(System.Collections.IList,System.Int32)
Retorna um item de uma determinada lista que está localizada no índice especificado.
list: Lista da qual obter um item.
index: Índice do item a ser extraído.
Item na lista no determinado índice.
get,item,index,fetch,at,getfrom,get from,extract

DSCore.List.ReplaceItemAtIndex(System.Collections.IList,System.Int32,System.Object)
Substitua um item da determinada lista que está localizada no índice especificado.
list: Lista na qual substituir um item.
index: Índice do item a ser substituído.
item: O item a inserir.
Uma nova lista com o item substituído.
replace,switch

DSCore.List.ReplaceItemAtIndices(System.Collections.IList,System.Collections.Generic.IList{System.Int32},System.Object)
Substitui itens de uma lista determinada que estão localizados nos índices especificados.
list: Lista na qual substituir um item.
indices: Índices dos itens a serem substituídos.
item: O item a ser inserido.
Uma nova lista com os itens substituídos.
replace,switch

DSCore.List.Slice(System.Collections.IList,System.Nullable{System.Int32},System.Nullable{System.Int32},System.Int32)
Retorna uma sublista única da determinada lista, com base no índice inicial, índice final,
e uma quantidade de etapas.
list: Lista da qual obter uma fatia.
start: Índice do qual iniciar a fatia.
end: Índice no qual finalizar a fatia.
step: A quantidade de índices de itens pela qual eles são separados na lista original.
Itens na fatia da determinada lista.
list,sub,sublist,subrange,get sublist

DSCore.List.RemoveItemAtIndex(System.Collections.IList,System.Int32[])
Remove um item da determinada lista definida no índice especificado.
list: Lista da qual remover item ou itens.
indices: Índice ou índices dos itens a serem removidos.
Lista com itens removidos.
index,indices,cull,remove,item

DSCore.List.DropEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
Remove os itens da lista definida em índices que são múltiplos do determinado valo, após o determinado deslocamento.
list: Lista da qual remover itens/
n: Os índices que são múltiplos deste argumento serão removidos.
offset: Quantidade de itens a serem ignorados desde o início da lista.
Lista com itens removidos.
nth,remove,cull,every

DSCore.List.TakeEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
Obtém os itens na determinada lista em índices que são múltiplos do determinado valor, após o determinado deslocamento.
list: Lista da qual obter os itens.
n: Os índices que são múltiplos deste número (após o deslocamento)
serão obtidos..
offset: Quantidade de itens a serem ignorados desde o início da lista.
Os itens da lista.
fetch,take,every,nth

DSCore.List.IsEmpty(System.Collections.IList)
Determina se a determinada lista está vazia.
list: Lista a ser verificada para confirmar se está vazia
Verdadeiro se a lista estiver vazia; falso se não estiver
test,is,empty,null,count

DSCore.List.AllTrue(System.Collections.IList)
Determina se todos itens da lista dada são um valor booleano e têm um valor verdadeiro.
list: Lista a ser verificada em relação a se todos os itens são verdadeiros.
Verdadeiro se todos os itens na lista forem verdadeiros; falso se um ou mais itens não forem verdadeiros
test,all,true,istrue

DSCore.List.AllFalse(System.Collections.IList)
Determina se os itens da lista dada são um valor booleano e têm um valor falso.
list: Lista a ser verificada em relação a se todos os itens são falsos.
Verdadeiro se todos os itens na lista forem falsos; falso se um ou mais itens não forem falsos
test,all,false,isfalse

DSCore.List.AnyTrue(System.Collections.IList)
Determina se qualquer item na lista determinada é um valor booleano e tem um valor verdadeiro.
list: Lista a ser verificada em relação a se qualquer item é verdadeiro.
Se qualquer item é verdadeiro.
test,any,true,istrue

DSCore.List.AnyFalse(System.Collections.IList)
Determina se qualquer item na lista determinada é um valor booleano e tem um valor falso.
list: Lista a ser verificada em relação a se qualquer item é falso.
Se qualquer item é falso.
test,any,false,isfalse

DSCore.List.Count(System.Collections.IList)
Retorna o número de itens armazenados na determinada lista.
list: Lista da qual para obter a contagem de itens.
Comprimento da lista.
listlength,list length,count,size,sizeof

DSCore.List.Join(System.Collections.IList[])
Concatena todas as listas fornecidas em uma única lista.
lists: Lista para unir em uma.
Listas unidas.
join lists,merge,concatenate

DSCore.List.FirstItem(System.Collections.IList)
Retorna o primeiro item em uma lista.
list: Lista da qual obter o primeiro item.
O primeiro item na lista.
get,fetch,first,item,start

DSCore.List.RestOfItems(System.Collections.IList)
Remove o primeiro item da determinada lista.
list: Lista da qual para obter o resto.
Restante da lista.
get,fetch,rest,end,rest of list

DSCore.List.Chop(System.Collections.IList,System.Collections.Generic.List{System.Int32})
Divida uma lista em um conjunto de sublistas consecutivas com os comprimentos especificados. A divisão da lista começa no topo da lista.
list: Lista para dividir em sublistas.
lengths: Os comprimentos das sublistas consecutivas a serem criadas a partir da lista de entrada
Sublistas criadas a partir da lista
sublists,build sublists,slices,partitions,cut,listcontains,chop

DSCore.List.DiagonalRight(System.Collections.IList,System.Int32)
Lista de elementos ao longo de cada diagonal da matriz do canto superior esquerdo ao inferior direito.
list: Uma lista plana
subLength: Comprimento de cada nova sublista.
Lista de elementos ao longo das diagonais da matriz.
diagonal,right,matrix,get diagonals,diagonal sublists

DSCore.List.DiagonalLeft(System.Collections.IList,System.Int32)
Lista de elementos ao longo de cada diagonal da matriz do canto superior esquerdo ao inferior direito.
list: Uma lista plana.
rowLength: Comprimento de cada nova sublista.
Lista de elementos ao longo das diagonais da matriz.
diagonal,left,matrix,get diagonals,diagonal sublists

DSCore.List.Transpose(System.Collections.IList)
Troca as linhas e as colunas de uma lista de listas.
Se houver algumas linhas que sejam menores do que outras,
valores nulos serão inseridos como marcadores de posição na
matriz resultante para que seja sempre retangular.
lists: Lista de listas a serem transpostas
Lista de listas transpostas
transpose,flip matrix,matrix,swap,rows,columns

DSCore.List.Clean(System.Collections.IList,System.Boolean)
Limpa os dados de listas nulas e vazias de uma determinada de cotas arbitrárias
list: Lista contendo sublistas nulas e vazias para limpar
preserveIndices: Forneça uma opção para preservar os índices dos dados
Lista de listas transpostas
para que os nulos que não estejam à direita não possam ser filtrados
Returns: Uma lista limpa de listas nulas e listas vazias

DSCore.List.OfRepeatedItem(System.Object,System.Int32)
Cria uma lista que contém o determinado item no número determinado de vezes.
item: O item para repetir.
amount: O número de vezes para repetir.
Lista de itens repetidos.
repeat,repeated,duplicate,list of item,fill list,copies,listcontains

DSCore.List.Cycle(System.Collections.IList,System.Int32)
Cria uma nova lista concatenando as cópias de uma determinada lista.
list: Lista para repetir.
amount: Número de vezes para repetir.
Lista de listas repetidas do tipo: var[]..[]
repeat,repeated,duplicate,repeated list,concat list

DSCore.List.LastItem(System.Collections.IList)
Recupera o último item em uma lista.
list: Lista da qual obter o último item
Último item na lista
get,fetch,last,item,end of list

DSCore.List.Shuffle(System.Collections.IList)
Mistura uma lista, tornando aleatória a ordem de seus itens.
list: Lista para mexer.
Lista com ordem aleatória.
random,randomize,shuffle,jitter,randomness

DSCore.List.Shuffle(System.Collections.IList,System.Int32)
Mistura uma lista, tornando aleatória a ordem de seus itens com base em um valor semente inicial.
list: Lista para misturar.
seed: Valor semente do gerador de números aleatórios.
Lista com ordem aleatória.
random,randomize,shuffle,jitter,randomness,seed

DSCore.List.Permutations(System.Collections.IList,System.Nullable{System.Int32})
Produz todas as permutações do determinado comprimento de uma determinada lista.
list: Lista para permutar.
length: Comprimento de cada permutação.
Permutações da lista do comprimento especificado (tipo: var[]..[])
permutation,permutations

DSCore.List.Combinations(System.Collections.IList,System.Int32,System.Boolean)
Produz todas as combinações de determinado comprimento de uma determinada lista.
list: Lista da qual gerar combinações
length: Comprimento de cada combinação
replace: Se os itens serão ou não removidos quando selecionados para a combinação, padroniza para falso.
Combinações da lista do comprimento fornecido
combo

DSCore.List.FirstIndexOf(System.Collections.IList,System.Object)
Dado um item, retorna o índice com base zero de sua primeira ocorrência
na lista. Se o item não puder ser encontrado na lista, -1 é retornado.
list: Lista na qual pesquisar. Se este argumento for nulo, -1 é retornado.
item: Item a ser procurado.
Returns: O índice com base zero do item na lista ou -1 se não ele não for encontrado.

DSCore.List.AllIndicesOf(System.Collections.IList,System.Object)
Dado um item, retorna os índice com base zero de todas as suas ocorrências
na lista. Se o item não puder ser encontrado, uma lista vazia será retornada.
list: Lista na qual pesquisar. Se este argumento for nulo, uma lista vazia é retornada.
item: Item a ser procurado.
Uma lista de índices de base zero de todas as ocorrências do item se
encontrado, ou uma lista vazia se o item não existir na lista.

DSCore.List.Flatten(System.Collections.IList,System.Int32)
Aplaina uma lista aninhada de listas por um determinado montante.
list: Lista para aplainar.
amount: Camadas de aninhamento de listas a serem removidas (-1 removerá todos os aninhamentos de listas)
Lista nivelada por quantidade
flatten,completely

DSCore.List.IndexInList(System.Collections.IList,System.Object)
Uma alternativa para a utilização de IList.Contains que usa Enumerable.SequenceEqual para verificar se
o item está contido na lista caso o item seja uma matriz. Retorna o índice se o item for encontrado,
-1 se não for encontrado.
list: A lista a ser verificada em relação a se ela contém o item.
item: O item que precisa ser encontrado.
Índice do item da lista.

DSCore.List.GetDepth(System.Object)
Obter a profundidade máxima de uma lista dada.
list: A lista de entradas a partir da qual obter a profundidade.
Profundidade da lista dada.

DSCore.List.CountBool(System.Collections.IList,System.Boolean)
Retorna o número dos valores booleanos especificados na lista fornecida.
list: A lista na qual localizar os valores booleanos.
value: O valor booleano a ser encontrado.
O número do valor booleano especificado na lista.

DSCore.List.IncreaseDepth(System.Collections.IList,System.Int32)
Aumentar a profundidade de uma determinada lista por um valor especificado. A profundidade é aumentada
através da criação de uma nova lista que irá conter a lista dada.
list: A lista cuja profundidade será aumentada.
amt: A quantidade de profundidade que será aumentada.
A nova lista cuja profundidade é aumentada por QTD.

DSCore.List.DoubleConverter(System.Object)
Converte o inteiro em duplo, caso contrário retorna o objeto de entrada.