DSCore.Data.DataNodeDynamoType
Uma classe representando um DataType suportado pelo Dynamo

DSCore.Data.DataNodeDynamoType.#ctor(System.Type,System.String,System.String)
Uma classe representando um DataType suportado pelo Dynamo

DSCore.Data.DataNodeDynamoType.Type
O tipo subjacente

DSCore.Data.DataNodeDynamoType.Name
Um nome opcional para substituir o nome do tipo (`Number` em vez de `long`)

DSCore.Data.DataNodeDynamoType.TypeId
Formato de fio $typeid (por exemplo, “autodesk.math:point3d-1.0.0”).
Nulo para tipos de primitivos que não usam serialização $typeid.

DSCore.Data.DataNodeDynamoType.Level
O nível hierárquico a ser exibido na interface do usuário

DSCore.Data.DataNodeDynamoType.IsLastChild
Se o tipo é o último elemento secundário de uma hierarquia (para fins de IU)

DSCore.Data.DataNodeDynamoType.Parent
O elemento principal do tipo, se houver algum