DSCore.ColorRange1D.ByColorsAndParameters(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double})
Crie um ColorRange1D ao fornecer listas de cores e parâmetros.
colors: Uma lista de cores.
parameters: Uma lista de parâmetros entre 0.0 e 1.0.
Returns: Um objeto ColorRange1D.

DSCore.ColorRange1D.GetColorAtParameter(DSCore.ColorRange1D,System.Double)
Retorna a cor nesta faixa de cores no parâmetro especificado.
parameter: Um valor entre 0.0 e 1.0.
Returns: Uma cor.

DSCore.ColorRange1D.Default
Criar uma ColorRange1D com o esquema de cor padrão.