DSCore.CurveMapper.SquareRootCurve
Represents a square root curve in the CurveMapper.
The curve follows a square root function and is influenced by two control points.

DSCore.CurveMapper.SquareRootCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Returns X and Y values distributed across the curve.