DSCore.CurveMapper.BezierCurve
Represents a Bezier curve in the CurveMapper.
A Bezier curve is defined by four control points and provides smooth interpolation.

DSCore.CurveMapper.BezierCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Gets interpolated Y values based on the assigned parameters and limits.