DSCore.Math
Methods for performing Mathematical operations.

DSCore.Math.Random(System.Nullable{System.Int32})
Generates a random double in the range of [0, 1).
seed: Seed value for the random number generator.
Random number between 0 and 1.
random,seed

DSCore.Math.Random(System.Double,System.Double)
Produce a random number in the range [lower_number, higher_number).
value1: Lower end of the range for the random number.
value2: Higher end of the range for the random number.
Random number in the range [lower_number, higher_number).
random,numberrange

DSCore.Math.Random(System.Double,System.Double,System.Int32)
Produce a random number in the range [lower_number, higher_number) based on an initial seed value.
value1: Lower end of the range for the random number.
value2: Higher end of the range for the random number.
seed: Seed value for the random number generator.
Random number in the range [lower_number, higher_number).
random,numberrange,seed

DSCore.Math.RandomList(System.Int32)
Produces a list containing the given amount of random doubles
in the range of [0, 1).
amount: Amount of random numbers the result list will contain.
List of random numbers between 0 and 1.
random,listcontains

DSCore.Math.RandomList(System.Int32,System.Double,System.Double,System.Int32)
Produces a list containing the given amount of random doubles
in the defined range of [lower_number, higher_number) based on an initial seed value.
amount: Amount of random numbers the result list will contain.
value1: Lower end of the range for the random number.
value2: Higher end of the range for the random number.
seed: Seed value for the random number generator.
List of random numbers in the range [lower_number, higher_number).
random,listcontains,seed

DSCore.Math.PiTimes2
Pi Constant Multiplied by 2
2 times PI.
2pi,2*pi,twopi,two*pi

DSCore.Math.Average(System.Collections.Generic.IList{System.Double})
Averages a list of numbers.
numbers: List of numbers to be averaged.
Average of the list of numbers.
avg,mean

DSCore.Math.Map(System.Double,System.Double,System.Double)
Maps the input value to a number between 0 and 1 based on the input range.
rangeMin: The minimum value of the input range.
rangeMax: The maximum value of the input range.
inputValue: The number to be mapped.
The mapped value.
map,range,minimum,maximum,normalize,scale,remap

DSCore.Math.MapTo(System.Double,System.Double,System.Double,System.Double,System.Double)
Maps the input value to a number between targetRangeMin and targetRangeMax.
rangeMin: The minimum value of the input range.
rangeMax: The maximum value of the input range.
inputValue: The number to be mapped.
targetRangeMin: The minimum value of the new range.
targetRangeMax: The maximum value of the new range.
The mapped value.
map,range,mapto,minimum,maximum,normalize,scale,remap

DSCore.Math.RemapRange(System.Collections.Generic.IList{System.Double},System.Double,System.Double)
Adjusts the range of a list of numbers while preserving the
distribution ratio.
numbers: List of numbers to adjust range of.
newMin: New minimum of the range.
newMax: New maximum of the range
List remapped to new range.
remap range

DSCore.Math.kRadiansToDegrees
move the functions/methods from Math.dll to this DSCoreNode.dll

DSCore.Math.PI
The mathematical constant Pi, 3.14159...
The constant Pi
3.141592653589793

DSCore.Math.E
The mathematical constant e, 2.71828...
The constant e
exp,2.718281828459045

DSCore.Math.GoldenRatio
The golden ratio, (1 + sqrt(5))/2 = 1.61803...
The golden ratio
golden,ratio,divine,phi,tau,1.61803398875

DSCore.Math.RadiansToDegrees(System.Double)
Converts an angle in radians to an angle in degrees.
radians: Angle in radians.
Angle in degrees.
radians,degrees,angle

DSCore.Math.DegreesToRadians(System.Double)
Converts an angle in degrees to an angle in radians.
degrees: Angle in degrees.
Angle in radians.
degrees,radians,angle

DSCore.Math.Abs(System.Double)
Finds the absolute value of a number.
number: Number to get absolute value from
Absolute value of the number
absolute value,magnitude

DSCore.Math.Equals(System.Double,System.Double,System.Double)
This method is ONLY used by the Equals (with tolerance) NodeModel node
lhs:
rhs:
tol:
Returns:

DSCore.Math.Abs(System.Int64)
Finds the absolute value of a number.
integer: A number.
Absolute value of the number.
absolute value,magnitude

DSCore.Math.Acos(System.Double)
Finds the inverse cosine, the angle whose cosine is the given ratio.
ratio: The cosine of the angle, a number in the range [-1, 1].
The angle whose cosine is the input ratio.
acosine,arccosine

DSCore.Math.Asin(System.Double)
Finds the inverse sine, the angle whose sine is the given ratio.
ratio: The sine of the angle, a number in the range [-1, 1].
The angle whose sine is the input ratio
asine,arcsin

DSCore.Math.Atan(System.Double)
Finds the inverse tangent, the angle whose tangent is the given ratio.
ratio: The tangent of the angle.
The angle whose tangent is the input ratio
atangent,arctangent

DSCore.Math.Atan2(System.Double,System.Double)
Finds the inverse tangent of quotient of two numbers. Returns the angle
whose tangent is the ratio: numerator/denominator.
numerator: The numerator of the tangent of the angle.
denominator: The denominator of the tangent of the angle.
The angle whose tangent is numerator/denominator
atangent,arctangent

DSCore.Math.Ceiling(System.Double)
Returns the first integer greater than the number
number: Number to round up.
First integer greater than the number
ceiling,round

DSCore.Math.Cos(System.Double)
Finds the cosine of an angle.
angle: Angle in degrees to take the cosine of.
Cosine of the angle
cosine

DSCore.Math.Cosh(System.Double)
Finds the hyperbolic cosine of an angle (radians).
angle: An angle in radians.
Hyperbolic cosine of the angle
hyperbolic cosine

DSCore.Math.DivRem(System.Int64,System.Int64)
Finds the remainder of dividend/divisor.
dividend: The number to be divided.
divisor: The number to be divided by.
The remainder of the division
remainder

DSCore.Math.EvaluateFormula(System.String,System.String[],System.Object[])
Evaluates an NCalc formula with given parameter mappings.
formulaString: NCalc formula
parameters: Variable names
arguments: Variable bindings
type: var[]..[] (result of the formula calculation)

DSCore.Math.Exp(System.Double)
Returns the exponential of the number, the constant e raised to the value number.
number: Number.
The exponential of the number.
exponential

DSCore.Math.Floor(System.Double)
Returns the first integer smaller than the number.
number: Number to round down
First integer smaller than the number
round

DSCore.Math.Log(System.Double)
Finds the natural logarithm of a number in the range (0, ∞).
number: Number greater than 0.
Natural log of the number.
natural,logarithm,ln

DSCore.Math.Log(System.Double,System.Double)
Finds the logarithm of a number with the specified base.
number: Number greater than 0.
logBase: Base of the logarithm in the range [0,1),(1, ∞).
Logarithm of the number.
logarithm,ld,lg

DSCore.Math.Log10(System.Double)
Finds the base-10 logarithm of a number.
number: Number greater than 0.
Logarithm of the number.
logarithm

DSCore.Math.Max(System.Double,System.Double)
Returns the greater of two numbers.
value1: Number to compare.
value2: Number to compare.
Greater of the two numbers.
maximum,greater,larger

DSCore.Math.Max(System.Int64,System.Int64)
Returns the greater of two numbers.
int1: Number to compare.
int2: Number to compare.
Greater of the two numbers.
maximum,greater,larger

DSCore.Math.Min(System.Double,System.Double)
Returns the lesser of two numbers.
value1: Number to compare.
value2: Number to compare.
Smaler of the two numbers.
minimum,lesser,smaller

DSCore.Math.Min(System.Int64,System.Int64)
Returns the lesser of two numbers.
int1: Number to compare.
int2: Number to compare.
Smaler of the two numbers.
minimum,lesser,smaller

DSCore.Math.Pow(System.Double,System.Double)
Raises a number to the specified power.
number: Number to be raised to a power.
power: Power to raise the number to.
Number raised to the power.
^,power,raise,exponent

DSCore.Math.Rand
Produce a random number in the range [0, 1).
Random number in the range [0, 1).
random,numberrange

DSCore.Math.Round(System.Double)
Rounds a number to the closest integral value.
Note that this method returns a double-precision floating-point number instead of an integral type.
number: Number to round.
Integral value closes to the number.

DSCore.Math.Round(System.Double,System.Int32)
Rounds a number to a specified number of fractional digits.
number: Number to round
digits: Number of fractional digits in the return value
The number nearest to value that contains a number of fractional digits equal to digits

DSCore.Math.Sign(System.Double)
Returns the sign of the number: -1, 0, or 1.
number: Number to get sign from
The sign of the number: -1, 0, or 1

DSCore.Math.Sign(System.Int64)
Returns the sign of the number: -1, 0, or 1.
int: Integer to get sign from
The sign of the number: -1, 0, or 1

DSCore.Math.Sin(System.Double)
Finds the sine of an angle.
angle: Angle in degrees to take the sine of.
Sine of the angle.
sine

DSCore.Math.Sinh(System.Double)
Finds the hyperbolic sine of an angle (radians).
angle: An angle in radians.
Hyperbolic sine of the angle.
hyperbolic

DSCore.Math.Sqrt(System.Double)
Finds the positive square root of a number in the range [0, ∞).
number: A number in the range [0, ∞).
Positive square root of the number.
square,root,radical

DSCore.Math.Tan(System.Double)
Finds the tangent of an angle.
angle: Angle in radians
Tangent of the angle
tangent

DSCore.Math.Tanh(System.Double)
Finds the hyperbolic tangent of an angle (radians).
angle: Angle in radians
Hyperbolic tangent of the angle
hyperbolic,tanh

DSCore.Math.Sum(System.Collections.Generic.IEnumerable{System.Double})
Find the sum of a series of numbers
values: Numbers to add to sum
The sum of the values
mass addition,massadd

DSCore.Math.Factorial(System.Int64)
Finds the factorial result of a positive integer.
number: A positive integer
The factorial result of the integer.
!

DSCore.Math.Xor(System.Boolean,System.Boolean)
Boolean XOR: Returns true if and only if exactly one of the inputs is true.
bool: A boolean
otherBool: Other boolean
Boolean result
xor,exclusive,or

DSCore.Math.DoCheckedCast(System.Double)
Performs a cast to long in a checked context. If the operation produces an overflow,
then a warning is produced and the overflowed result is returned.
value: Operation to be performed
Returns: The result of the operation