DSCore.Compare
Comparison methods.

DSCore.Compare.GreaterThan(System.Object,System.Object)
Returns true if a is greater than b.
a: A comparable object.
b: A comparable object.
Boolean result.
larger,bigger

DSCore.Compare.GreaterThanOrEqual(System.Object,System.Object)
Returns true if a is greater than or equal to b.
a: A comparable object.
b: A comparable object.
Boolean result.
larger,bigger,equal

DSCore.Compare.LessThan(System.Object,System.Object)
Returns true if a is less than b.
a: A comparable object.
b: A comparable object.
Boolean result.
less,smaller

DSCore.Compare.LessThanOrEqual(System.Object,System.Object)
Returns true if a is less than or equal to b.
a: A comparable object.
b: A comparable object.
Boolean result.
smaller,equal