DSCore.CurveMapper.LinearCurve
Represents a linear curve in the CurveMapper.
A linear curve is a straight line between two control points.

DSCore.CurveMapper.LinearCurve.LineEquation(System.Double)
Calculates the Y values (canvas coordinates) for min and max X values

DSCore.CurveMapper.LinearCurve.SolveForXGivenY(System.Double)
Calculates the X values (canvas coordinates) for min and max Y values

DSCore.CurveMapper.LinearCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Returns X and Y values distributed across the curve.