DSCore.Quadtree.ByUVs(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.UV})
Construct a Quadtree encompassing the (0,0)->(1,1) domain.
uvs: A set of UVs in the (0,0)->(1,1) domain.
Returns: A Quadtree object.

DSCore.Quadtree.FindPointsWithinRadius(Autodesk.DesignScript.Geometry.UV,System.Double)
Find all quadtree points (UVs) in the quadtree within a radius of the given UV location.
center: The UV at the center of the search area.
radius: The radius of the search area.
Returns: A list of UVs.