DSCore.TimeSpan
Object representing an elapsed period of time, with no specific start or end date.

DSCore.TimeSpan.ByDateDifference(System.DateTime,System.DateTime)
Yields a new TimeSpan calculated from the time difference between two DateTimes
dateTime: DateTime to subtract from
otherDateTime: DateTime to subtract
TimeSpan difference between two dates

DSCore.TimeSpan.Zero
A TimeSpan representing an elapsed time of Zero.
TimeSpan representing an elapsed time of zero

DSCore.TimeSpan.MaxValue
The largest TimeSpan that can be represented.
Maximum possible TimeSpan representation

DSCore.TimeSpan.MinValue
The smallest TimeSpan that can be represented.
Minimum possible TimeSpan representation

DSCore.TimeSpan.Create(System.Double,System.Double,System.Double,System.Double,System.Double)
Creates a new TimeSpan from a span of time.
days: Days spanned.
hours: Hours spanned.
minutes: Minutes spanned.
seconds: Seconds spanned.
milliseconds: Milliseconds spanned.
TimeSpan created

DSCore.TimeSpan.Scale(System.TimeSpan,System.Double)
Multiplies a TimeSpan by a scaling factor
timeSpan: TimeSpan to multiply
scaleFactor:
Amount to scale the TimeSpan. For example, a scaling factor of 2 will yield
double the amount of time spanned.
TimeSpan product

DSCore.TimeSpan.Negate(System.TimeSpan)
Negates a TimeSpan
timeSpan: TimeSpan to negate
Negative TimeSpan

DSCore.TimeSpan.Add(System.TimeSpan,System.TimeSpan)
Adds two TimeSpans
timeSpan1: TimeSpan to add
timeSpan2: Other TimeSpan to add
Resulting TimeSpan from addition

DSCore.TimeSpan.Subtract(System.TimeSpan,System.TimeSpan)
Subtracts two TimeSpans
timeSpan1: TimeSpan to substract from
timeSpan2: TimeSpan to substract
Resulting TimeSpan from subtraction

DSCore.TimeSpan.FromString(System.String)
Attempts to parse a TimeSpan from a string
string: String representation of a TimeSpan.
TimeSpan from parsed string

DSCore.TimeSpan.Components(System.TimeSpan)
Extracts the individual components of a TimeSpan.
timeSpan: TimeSpan to get components from
Amount of days (type int)
Amount of hours (type int)
Amount of minutes (type int)
Amount of seconds (type int)
Amount of milliseconds (type int)

DSCore.TimeSpan.TotalDays(System.TimeSpan)
Converts the total amount of time represented by a TimeSpan to an
inexact number of days.
timeSpan: TimeSpan to query total days from
Total amount of days

DSCore.TimeSpan.TotalHours(System.TimeSpan)
Converts the total amount of time represented by a TimeSpan to an
inexact number of hours.
timeSpan: TimeSpan to query total hours from
Total amount of hours

DSCore.TimeSpan.TotalMinutes(System.TimeSpan)
Converts the total amount of time represented by a TimeSpan to an
inexact number of minutes.
timeSpan: TimeSpan to query total minutes from
Total amount of minutes

DSCore.TimeSpan.TotalSeconds(System.TimeSpan)
Converts the total amount of time represented by a TimeSpan to an
inexact number of seconds.
timeSpan: TimeSpan to query total seconds from
Total amount of seconds

DSCore.TimeSpan.TotalMilliseconds(System.TimeSpan)
Converts the total amount of time represented by a TimeSpan to an
inexact number of milliseconds.
timeSpan: TimeSpan to query milliseconds seconds from
Total amount of milliseconds