DSCore.Object
Generic functions that operate on all data.

DSCore.Object.IsNull(System.Object)
Determines if the given object is null.
object: Object to test.
Whether object is null.
is null

DSCore.Object.Identity(System.Object)
Returns what is passed in, doing nothing.
object: An object.
Same object

DSCore.Object.Type(System.Object)
Returns the type of object represented as string.
object: Object to query type
Returns: Type of object.