DSCore.CurveMapper.PowerCurve
Represents a power function curve in the CurveMapper.
The curve is defined by a power equation derived from a control point.

DSCore.CurveMapper.PowerCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Returns X and Y values distributed across the curve.