DSCore.CurveMapper.CurveBase
Represents a base class for all curve types in the CurveMapper.
Provides common functionality for generating and retrieving curve values.

DSCore.CurveMapper.CurveBase.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Abstract method to be implemented by derived classes for generating curve values.

DSCore.CurveMapper.CurveBase.GetCurveXValues(System.Collections.Generic.List{System.Double},System.Boolean)
Common method for retrieving X values.

DSCore.CurveMapper.CurveBase.GetCurveYValues(System.Collections.Generic.List{System.Double},System.Boolean)
Common method for retrieving Y values.

DSCore.CurveMapper.CurveBase.GenerateFromDomain(System.Collections.Generic.List{System.Double},System.Func{System.Double,System.Double})
Generates X and Y values by mapping domain inputs to canvas space and evaluating a curve function.