DSCore.String
Methods for managing strings.

DSCore.String.ToNumber(System.String)
Converts a string to an integer or a double.
string: String to be converted
Integer or double-type number
2number,str2number,strtonumber,string2number,stringtonumber,int,double,cast

DSCore.String.GetNumber(System.String)
Get all of the number strings from the target string as a string
string: Target string to be get
Number In string
getnumber,tonumber,strtonumber,numberinstring,string2number,stringtonumber,int,double,cast

DSCore.String.Concat(System.String[])
Concatenates multiple strings into a single string.
strings: List of strings to concatenate.
String made from list of strings.
concatenate,join,combine strings

DSCore.String.Length(System.String)
Returns the number of characters contained in the given string.
string: String to find the length of
Number of characters in the string
count,size,characters,chars,length,sizeof

DSCore.String.Split(System.String,System.String[])
Divides a single string into a list of strings, with divisions
determined by the given separator strings.
string: String to split up
separators:
Strings that, if present, determine the end and start of a split.
List of strings made from the input string
divide,separator,delimiter,cut,csv,comma,

DSCore.String.Join(System.String,System.String[])
Concatenates multiple strings into a single string, inserting the given
separator between each joined string.
separator: String to be inserted between joined strings.
strings: Strings to be joined into a single string.
A string made from the list of strings including the separator character.
join,separator,build csv,concat,construct

DSCore.String.ToUpper(System.String)
Converts the given string to all uppercase characters.
string: String to be made uppercase
Uppercase string
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.ToLower(System.String)
Converts the given string to all lowercase characters.
string: String to be made lowercase
Lowercase string
2lowercase,to lowercase,tolowercase,lowercase

DSCore.String.ToTitle(System.String)
Converts the given string to title case.
str: String to be made title case
Title case string
2titlecase,to titlecase,to title case,totitlecase,titlecase

DSCore.String.ChangeCase(System.String,System.Boolean)
Converts the given string to all uppercase characters or all
lowercase characters based on a boolean parameter.
string: String to be made uppercase or lowercase.
upper:
True to convert to uppercase, false to convert to lowercase.
String with converted case.
2lowercase,to lowercase,tolowercase,lowercase,
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.Substring(System.String,System.Int32,System.Int32)
Retrieves a substring from the given string. The substring starts at the given
character position and has the given length.
string: String to take substring of
startIndex:
Starting character position of the substring in the original string
length: Number of characters in the substring
Substring made from the original string
subset,get string,part,smaller string

DSCore.String.Contains(System.String,System.String,System.Boolean)
Determines if the given string contains the given substring.
string: String to search in
searchFor: Substring to search for
ignoreCase: Whether or not comparison takes case into account
Whether the string contains the substring
test,within,in,is in,part of

DSCore.String.CountOccurrences(System.String,System.String,System.Boolean)
Counts the number of non-overlapping occurrences of a substring inside a given string.
string: String to search in
searchFor: Substring to search for
ignoreCase: Whether or not comparison takes case into account
Number of non-overlapping occurrences of the substring in the string
count,substring,count occurrences,numberof,search,find,within

DSCore.String.Replace(System.String,System.String,System.String)
Replaces all occurrences of text in a string with other text.
string: String to replace substrings in.
searchFor: Text to be replaced.
replaceWith: Text to replace with.
String with replacements made.
replace,overwrite,override,find and replace

DSCore.String.EndsWith(System.String,System.String,System.Boolean)
Determines if the given string ends with the given substring.
string: String to search the end of
searchFor: Substring to search the end for
ignoreCase: True to ignore case in comparison, false to take case into account
True if string starts with substring, false if it doesn’t
test,does end,last,str end,terminated

DSCore.String.StartsWith(System.String,System.String,System.Boolean)
Determines if the given string starts with the given substring.
string: String to search the start of
searchFor: Substring to search the start for.
ignoreCase: True to ignore case in comparison, false to take case into account
True if string starts with substring, false if it doesn’t
test,beginswith,start,string start,front

DSCore.String.TrimWhitespace(System.String)
Removes all whitespace from the start and end of the given string.
string: String to trim.
String with beginning and ending whitespaces removed.
trimstring,cleanstring,whitespace,blanks,spaces,string trim

DSCore.String.TrimLeadingWhitespace(System.String)
Removes all whitespace from the start of the given string.
string: String to trim.
String with leading white spaces removed.
trim string,clean string,trim leading whitespaces,string trim

DSCore.String.TrimTrailingWhitespace(System.String)
Removes all whitespace from the end of the given string.
string: String to trim.
String with white spaces at end removed.
trim string,clean string,trim trailing whitespaces,string trim

DSCore.String.IndexOf(System.String,System.String,System.Boolean)
Finds the zero-based index of the first occurrence of a sub-string inside a string.
Returns -1 if no index could be found.
string: String to search in
searchFor: Substring to search for
ignoreCase: Whether or not comparison takes case into account
Index of the first occurrence of the substring or -1 if not found
index of,find substring,where,search

DSCore.String.AllIndicesOf(System.String,System.String,System.Boolean)
Finds list of indices where sub-string appears inside a string.
string: A string to search in.
searchFor: Substring to search for.
ignoreCase: Whether or not comparison takes case into account.
List of indices where substring is found (type: int[])
all indices of,find substring,where,search

DSCore.String.LastIndexOf(System.String,System.String,System.Boolean)
Finds the zero-based index of the last occurrence of a sub-string inside a string.
Returns -1 if no index could be found.
string: String to search in.
searchFor: Substring to search for.
ignoreCase: Whether comparison takes case into account.
Index of the last occurrence of the substring or -1 if not found.
last index of,find substring,where,search

DSCore.String.PadLeft(System.String,System.Int32,System.String)
Right-aligns the characters in the given string by padding them with spaces on the left,
for a specified total length.
string: String to pad
newLength: Total length of the string after padding
padChars: Character to pad with, defaults to space
Strings right-aligned by padding with leading whitespaces for a specified total length.
pad left,right align,right-align,pad,string space,whitespace

DSCore.String.PadRight(System.String,System.Int32,System.String)
Left-aligns the characters in the given string by padding them with spaces on the right,
for a specified total length.
string: String to pad
newLength: Total length of the string after padding
padChars: Character to pad with, defaults to space
Strings left-aligned by padding with trailing whitespaces for a specified total length
pad right,left align,left-align,pad string space,whitespace

DSCore.String.Center(System.String,System.Int32,System.String)
Increases the length of a string by encasing the original characters with spaces on either side.
string: String to center
newLength: Total length of the string after centering
padChars: Character to center with, defaults to space
Strings center-aligned by padding them with leading and trailing
whitespaces for a specified total length.
center align,center-align,centered,whitespace,expand string,surround

DSCore.String.Insert(System.String,System.Int32,System.String)
Inserts a string into another string at a given index.
string: String to insert into.
index: Index to insert at.
toInsert: String to be inserted.
String with inserted substring.
insertstring,insert string

DSCore.String.Remove(System.String,System.Int32,System.Nullable{System.Int32})
Removes characters from a string.
string: String to remove characters from.
startIndex: Index at which to start removal.
count:
Amount of characters to remove,
Note: if the Count is negative, the removal process goes from right to left.
String with characters removed.
delete,rem,shorten