DSCore.Color.Red
Find the red component of a color, 0 to 255.
Red value for RGB color model, int between 0 and 255 inclusive.

DSCore.Color.Green
Find the green component of a color, 0 to 255.
Green value for RGB color model, int between 0 and 255 inclusive.

DSCore.Color.Blue
Find the blue component of a color, 0 to 255.
Blue value for RGB color model, int between 0 and 255 inclusive.

DSCore.Color.Alpha
Find the alpha component of a color, 0 to 255.
Alpha value, int between 0 and 255 inclusive.

DSCore.Color.ByARGB(System.Int32,System.Int32,System.Int32,System.Int32)
Construct a color by alpha, red, green, and blue components.
alpha: Alpha value (between 0 and 255 inclusive)
red: Red value for RGB color model (between 0 and 255 inclusive)
green: Green value for RGB color model (between 0 and 255 inclusive)
blue: Blue value for RGB color model (between 0 and 255 inclusive)
Color created from ARGB
color

DSCore.Color.Brightness(DSCore.Color)
Returns the brightness value for this color.
color:  Color to query brightness from
Brightness value (between 0 and 1 inclusive)

DSCore.Color.Saturation(DSCore.Color)
Returns the saturation value for this color.
Saturation value as double between 0 and 1 inclusive.

DSCore.Color.Hue(DSCore.Color)
Returns the hue value for this color.
color:  A color object
Hue value for color as a double between 0 and 1 inclusive.
hues

DSCore.Color.Components(DSCore.Color)
Lists the components for the color in the order: alpha, red, green, blue.
color:  A color object
Alpha value, int between 0 and 255 inclusive.
Red value for RGB color model, int between 0 and 255 inclusive.
Green value for RGB color model, int between 0 and 255 inclusive.
Blue value for RGB color model, int between 0 and 255 inclusive.
alpha,red,green,blue

DSCore.Color.BuildColorFrom1DRange(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double},System.Double)
Returns a color from a color gradient between a start color and an end color.
colors:
parameters: The values between 0 and 1 along the range for which you would like to sample the color.
parameter:
Colors in the given range.
color,range,gradient

DSCore.Color.Lerp(DSCore.Color,DSCore.Color,System.Double)
Linearly interpolate between two colors.
start: The start color.
end: The end color.
t: A parameter between 0.0 and 1.0.
Returns: The interpolated color or white.

DSCore.Color.Blerp(System.Collections.Generic.IList{DSCore.Color.IndexedColor2D},Autodesk.DesignScript.Geometry.UV)
Bilinearly interpolate between a set of colors.
colors:
parameter:
Returns: The interpolated color or white.
This algorithm is not the same as the solution found from wikipedia
(reference: https://en.wikipedia.org/wiki/Bilinear_interpolation)

DSCore.Color.Add(DSCore.Color,DSCore.Color)
Construct a color by combining the ARGB values of two existing colors.
color: A color to add
otherColor: Other color to add
Color result from addition of two colors

DSCore.Color.Multiply(DSCore.Color,System.Double)
Multiply an input color with a number multiplier to produce a darker color. Input color must have an alpha less than 255.
color: Color to multiply
multiplier: Multiplier value
Color result from multiplication

DSCore.Color.Divide(DSCore.Color,System.Double)
Divide an input color with a number divider to produce a brighter color and remove color tint
color: Color to divide
dividend: Dividend value
Color result from division