DSCore.DateTime
Object representing a specific Date and Time.

DSCore.DateTime.MinValue
The earliest date and time that can be represented.
Minimum possible DateTime representation

DSCore.DateTime.MaxValue
The latest date and time that can be represented.
Maximum possible DateTime representation

DSCore.DateTime.Now
The current system date and time.
DateTime representing the present time

DSCore.DateTime.Today
The current system date, with time set at midnight.
DateTime representing today

DSCore.DateTime.Format(System.DateTime,System.String)
Return a specified date and time as a string, in the specified format.
dateTime: DateTime to format
format: String representation of the date format.  Uses InvariantCulture, which outputs independent of the user's operating system language.
Defaults to standard format "F" : "Tuesday, 21 February 2017 23:02:43"
Search "MSDN Custom Date and Time Format Strings" for a comprehensive list of format specifiers.
DateTime represented as a string

DSCore.DateTime.ByDate(System.Int32,System.Int32,System.Int32)
Creates a new DateTime at an exact date.
year: Exact year (1-9999)
month: Exact month (1-12)
day: Exact day (1-[days in month])
DateTime created from date

DSCore.DateTime.ByDateAndTime(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
Creates a new DateTime at an exact date and time.
year: Exact year (1-9999)
month: Exact month (1-12)
day: Exact day (1-[days in month])
hour: Exact hour (0-23)
minute: Exact minute (0-59)
second: Exact second (0-59)
millisecond: Exact millisecond (0-999)
DateTime created from date and time

DSCore.DateTime.SubtractTimeSpan(System.DateTime,System.TimeSpan)
Subtracts a TimeSpan from a DateTime, yielding a new DateTime.
dateTime: Starting DateTime
timeSpan: Amount of time to subtract
Resulting DateTime from substraction

DSCore.DateTime.AddTimeSpan(System.DateTime,System.TimeSpan)
Adds a TimeSpan to a DateTime, yielding a new DateTime.
dateTime: Starting DateTime
timeSpan: Amount of time to add to DateTime
Resulting DateTime from addition of timespan

DSCore.DateTime.DaysInMonth(System.Int32,System.Int32)
Calculates how many days are in the given month of the given year.
year: Exact year (1-9999)
month: Exact month (1-12)
Number of days in month

DSCore.DateTime.IsDaylightSavingsTime(System.DateTime)
Determines if it is Daylight Savings Time at the given DateTime.
dateTime: DateTime used to determine if there is daylight savings
True if DateTime is in daylight saving time, false if it isn't

DSCore.DateTime.IsLeapYear(System.Int32)
Determines if the given year is a leap year.
year: Exact year (1-9999)
True if year is leap year, false if not

DSCore.DateTime.FromString(System.String)
Attempts to parse a DateTime from a string
string: String representation of a DateTime
DateTime from parsed string

DSCore.DateTime.Date(System.DateTime)
Extracts only the date from a DateTime. Time components are set to 0.
dateTime: A DateTime.
date from DateTime
Date

DSCore.DateTime.Components(System.DateTime)
Extracts the individual components of a DateTime.
dateTime: DateTime to get components from
Numeric representation of the year (1-9999)
Numeric representation of the month (1-12)
Numeric representation of the day (1-[days in month])
Numeric representation of the hour (0-23)
Numeric representation of minutes (0-59)
Numeric representation of seconds(0-59)
Numeric representation of milliseconds(0-999)

DSCore.DateTime.DayOfWeek(System.DateTime)
Returns the Day of the Week from a given DateTime.
dateTime: DateTime object to get week day from
Day of the week

DSCore.DateTime.DayOfYear(System.DateTime)
Returns the day of the year (0-366)
dateTime: DateTime to get day of the year
Number of days from beginning of the year

DSCore.DateTime.TimeOfDay(System.DateTime)
Yields a new TimeSpan representing the amount of time passed since midnight of the
given DateTime.
dateTime: A DateTime.
TimeSpan since midnight