DSCore.CurveMapper.GaussianCurve
Represents a Gaussian curve in the CurveMapper.
The Gaussian curve follows a bell-shaped distribution defined by four control points.

DSCore.CurveMapper.GaussianCurve.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Indicates whether the node is currently being resized, preventing unintended control point updates.

DSCore.CurveMapper.GaussianCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Returns X and Y values distributed across the curve.