DSCore.IO.FileSystem
Methods for working with Files.

DSCore.IO.FileSystem.AbsolutePath(System.String,System.String)
Returns absolute path from the given path. If the given path is
relative path then it is resolved with respect to the current
workspace. If file doesn't exist at the relative path but exists
at the given hintPath then hintPath is returned.
path: Relative path or full path
hintPath: Last resolved path
Returns: Absolute path

DSCore.IO.FileSystem.FileFromPath(System.String)
Creates File object from given file path.
path:
Returns:

DSCore.IO.FileSystem.ReadText(System.IO.FileInfo)
Reads a text file and returns the contents as a string.
file:  File object to read text from
Contents of the text file.
read file,text,file

DSCore.IO.FileSystem.MoveFile(System.String,System.String,System.Boolean)
Moves a specified file to a new location
path: String representation of existing path
newPath: String representation of new path
overwrite: Toggle to overwrite existing files
Node performs a task, doesn’t produce an output

DSCore.IO.FileSystem.DeleteFile(System.String)
Deletes the specified file.
path: File path to delete
Node performs a task, doesn’t produce an output

DSCore.IO.FileSystem.CopyFile(System.IO.FileInfo,System.String,System.Boolean)
Copies a file.
file: File object to copy
destinationPath: String representation of destination file path
overwrite: Toggle to overwrite existing files
Node performs a task, return true of copy action succeed.

DSCore.IO.FileSystem.FileExists(System.String)
Determines if a file exists at the given path.
path: String representing a file path
True if file exists, false if it doesn't
filepath

DSCore.IO.FileSystem.WriteText(System.String,System.String)
Write the text content to a file specified by the path
filePath: Path to write to
text: Text content
No output
write file,text,file,filepath

DSCore.IO.FileSystem.AppendText(System.String,System.String)
Append the text content to a file specified by the path
filePath: Path to write to
text: Text content
Node performs a task, doesn’t produce an output
append file,write file,text,file,filepath

DSCore.IO.FileSystem.CombinePath(System.String[])
Combines multiple strings into a single file path.
strings: Strings to combine into a path
Combined file path

DSCore.IO.FileSystem.FileExtension(System.String)
Returns the extension from a file path.
path: Path to get extension of
Extension of file

DSCore.IO.FileSystem.ChangePathExtension(System.String,System.String)
Changes the extension of a file path.
path: Path to change extension of
newExtension: String representation of new extension
File path with changed extension

DSCore.IO.FileSystem.DirectoryName(System.String)
Returns the directory name of a file path.
path: Path to get directory information of
Directory name of file path
directorypath

DSCore.IO.FileSystem.FileName(System.String,System.Boolean)
Returns the file name of a file path.
path: Path to get the file name of
withExtension: Toggle to include extension in result
File name from file path

DSCore.IO.FileSystem.FileHasExtension(System.String)
Determines whether or not a file path contains an extension.
path: Path to check for an extension
True if file path contains extension, false if it doesn't

DSCore.IO.FileSystem.GetDirectoryContents(System.IO.DirectoryInfo,System.String,System.Boolean)
Will return a list of files and directories that are contained within a given directory. An optional searchString can be used to filter the results.
directory: Directory to get contents of
searchString: Search string used to filter results
includeSubdirectories: Set to true to include files and folders in subdirectories (recursive) or set to false to include results from top-level of given directory only.
Resulting files from query
Resulting directories from query

DSCore.IO.FileSystem.CopyDirectory(System.IO.DirectoryInfo,System.String,System.Boolean)
Copies a directory to a destination location.
directory: Directory to copy
destinationPath: Destination of the copy operation on disk
overwriteFiles: Toggle to overwrite existing directory
Node performs a task, doesn’t produce an output

DSCore.IO.FileSystem.DeleteDirectory(System.String,System.Boolean)
Deletes a directory.
path: Path to a directory on disk
recursive: Whether or not to delete all contents of the directory, defaults to false.
Node performs a task, doesn’t produce an output

DSCore.IO.FileSystem.DirectoryExists(System.String)
Determines if a directory exists at the given path.
path: Path to a directory on disk
True if directory exists, false if it doesn’t
directorypath

DSCore.IO.FileSystem.MoveDirectory(System.String,System.String,System.Boolean)
Moves a directory to a new location.
path: String representation of existing path
newPath: String representation of new path
overwriteFiles: Toggle to overwrite existing files
Node performs a task, doesn’t produce an output