DSCore.Properties.Resources
A strongly-typed resource class, for looking up localized strings, etc.

DSCore.Properties.Resources.ResourceManager
Returns the cached ResourceManager instance used by this class.

DSCore.Properties.Resources.Culture
Overrides the current thread's CurrentUICulture property for all
resource lookups using this strongly typed resource class.

DSCore.Properties.Resources.BitmapOverflowError
Looks up a localized string similar to The supplied color data is too large to fit in the image bounds..

DSCore.Properties.Resources.CurveMapperEqualMinMaxWarning
Looks up a localized string similar to • Min and Max values must be different..

DSCore.Properties.Resources.CurveMapperInvalidCountWarning
Looks up a localized string similar to • Values must be a list of numbers or a single number ≥ 2..

DSCore.Properties.Resources.CurveMapperInvalidCurveWarning
Looks up a localized string similar to • Control points for the selected curve are not valid..

DSCore.Properties.Resources.CurveMapperInvalidXYFormatWarning
Looks up a localized string similar to • X and Y inputs must be single numbers (not lists)..

DSCore.Properties.Resources.DefineDataSupportedInputValueExceptionMessage
Looks up a localized string similar to Input must be a single value or a non-nested list..

DSCore.Properties.Resources.DefineDataUnexpectedInputExceptionMessage
Looks up a localized string similar to This node expected a {0} input but received a {1} input. Please provide the expected input, or pick a new type in the node’s drop-down menu..

DSCore.Properties.Resources.DefineDataUnsupportedCombinationOfDataTypesExceptionMessage
Looks up a localized string similar to This node does not support the combination of data types in the current input list {0}. Ensure the input list contains items of the same data type, or a mix of types with a common parent type.

DSCore.Properties.Resources.DefineDataUnsupportedDataTypeExceptionMessage
Looks up a localized string similar to This node does not support the current input data type ({0}). View the supported data types in the drop-down menu..

DSCore.Properties.Resources.EnumDateOfWeekFriday
Looks up a localized string similar to Friday.

DSCore.Properties.Resources.EnumDateOfWeekMonday
Looks up a localized string similar to Monday.

DSCore.Properties.Resources.EnumDateOfWeekSaturday
Looks up a localized string similar to Saturday.

DSCore.Properties.Resources.EnumDateOfWeekSunday
Looks up a localized string similar to Sunday.

DSCore.Properties.Resources.EnumDateOfWeekThursday
Looks up a localized string similar to Thursday.

DSCore.Properties.Resources.EnumDateOfWeekTuesday
Looks up a localized string similar to Tuesday.

DSCore.Properties.Resources.EnumDateOfWeekWednesday
Looks up a localized string similar to Wednesday.

DSCore.Properties.Resources.Exception_Deserialize_Bad_Format
Looks up a localized string similar to The json for the type {0} was not formatted correctly.

DSCore.Properties.Resources.Exception_Deserialize_Unsupported_Cache
Looks up a localized string similar to The stored data can not be loaded..

DSCore.Properties.Resources.Exception_Serialize_Depth_Unsupported
Looks up a localized string similar to Depth {0} Exceeds MaxDepth {1} at path "{2}".

DSCore.Properties.Resources.Exception_Serialize_DesignScript_Unsupported
Looks up a localized string similar to This type of Geometry is not able to be serialized..

DSCore.Properties.Resources.Exception_Serialize_Unsupported_Type
Looks up a localized string similar to Cannot store data of type {0}..

DSCore.Properties.Resources.ExportToCSVObsolete
Looks up a localized string similar to Use Data.ExportCSV node instead.

DSCore.Properties.Resources.FactorialNegativeInt
Looks up a localized string similar to The input value of Math.Factorial cannot be negative..

DSCore.Properties.Resources.FactorialOverflow
Looks up a localized string similar to The return value of Math.Factorial is out of range..

DSCore.Properties.Resources.FindPointsWithinRadiusNullPointMessage
Looks up a localized string similar to You must provide a center point..

DSCore.Properties.Resources.FindPointsWithinRadiusSearchRadiusMessage
Looks up a localized string similar to The search radius cannot be zero..

DSCore.Properties.Resources.FromObjectObsolete
Looks up a localized string similar to This node is obsolete, please use "String from Object".

DSCore.Properties.Resources.IntegerOverflow
Looks up a localized string similar to The operation resulted in an integer overflow. Its result may be unexpected..

DSCore.Properties.Resources.InvalidDestinationPathErrorMessage
Looks up a localized string similar to Invalid destination file path used as copy path..

DSCore.Properties.Resources.InvalidKeysErrorMessage
Looks up a localized string similar to One or more input types are not matching. Lists as keys are not supported..

DSCore.Properties.Resources.InvalidKeysLenghtErrorMessage
Looks up a localized string similar to Number of items does not match the number of keys. href=InvalidKeysLenghtErrorMessage.html.

DSCore.Properties.Resources.LoadImageFromPathObsolete
Looks up a localized string similar to Use File.FromPath ->  Image.ReadFromFile nodes instead.

DSCore.Properties.Resources.MissingPythonEngine
Looks up a localized string similar to The selected Python engine could not be found.

DSCore.Properties.Resources.ObjectArgumentExceptionMessage
Looks up a localized string similar to Object cannot be null, please provide appropriate value..

DSCore.Properties.Resources.QuadtreeConstructionEmptyUVSetMessage
Looks up a localized string similar to You cannot construct a quadtree from an empty set of points..

DSCore.Properties.Resources.QuadtreeConstructionNullUVSetMessage
Looks up a localized string similar to A Quadtree cannot be constructed from a null set of UVs..

DSCore.Properties.Resources.ReadImageObsolete
Looks up a localized string similar to Use File.FromPath ->  Image.ReadFromFile ->  Image.Pixels nodes instead.

DSCore.Properties.Resources.ReadTextObsolete
Looks up a localized string similar to Use File.FromPath ->  File.ReadText nodes instead..

DSCore.Properties.Resources.StringRemoveCountOutOfRangeMessage
Looks up a localized string similar to Count is out of range!.

DSCore.Properties.Resources.StringRemoveStartIndexOutOfRangeMessage
Looks up a localized string similar to StartIndex is out of range!.

DSCore.Properties.Resources.StringToNumberInvalidNumberMessage
Looks up a localized string similar to Not a valid number..

DSCore.Properties.Resources.WebRequestNullUrlMessage
Looks up a localized string similar to The url cannot be null..

DSCore.Properties.Resources.WriteImageObsolete
Looks up a localized string similar to Use Image.WriteToFile node instead.