DSCore.ColorRange.ByColorsAndParameters(System.Collections.Generic.IList{DSCore.Color},System.Collections.Generic.IList{Autodesk.DesignScript.Geometry.UV})
Create a ColorRange by supplying lists of colors and UVs.
colors: A list of colors.
parameters: A list of parameters between (0.0,0.0) and (1.0,1.0).
Returns: A ColorRange object.

DSCore.ColorRange.GetColorAtParameter(Autodesk.DesignScript.Geometry.UV)
Returns the color in this color range at the specified parameter.
parameter: A UV between (0.0,0.0) and (1.0,1.0).
Returns: A Color.