DSCore.List
Methods for creating and manipulating Lists.

DSCore.List.Empty
Returns an Empty List.
Empty list.
empty list, emptylist,[]

DSCore.List.UniqueItems(System.Collections.IList)
Creates a new list containing all unique items in the given list.
list: List to filter duplicates out of.
Filtered list.
removes,duplicates,remove duplicates,cull duplicates,distinct,listcontains

DSCore.List.Contains(System.Collections.IList,System.Object)
Determines if the given list contains the given item. This function searches through the sublists contained in it.
list: List to search in
item: Item to look for
True if list contains item, false if it doesn’t
item,search,in,listcontains

DSCore.List.IsHomogeneous(System.Collections.IList)
Check if the items in the list are of the same type.
list: List to be checked if it's homogeneous.
Whether the list is homogeneous.
homogeneous,allequal,same,type

DSCore.List.IsRectangular(System.Collections.IList)
Check if the number of items in all rows of the list are the same.
list: List to be checked if the rows have the same number of items.
Whether the list has the same number of items in all rows.
rectangular,isrectangular,same,sublist,row

DSCore.List.IsUniformDepth(System.Collections.IList)
Check if the items in the list have the same depth.
list: List to be checked if the items have the same depth.
Whether the depth of the list is uniform.
depth,uniform,isuniformdepth,sublist,jagged

DSCore.List.SetDifference(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Returns a new list that includes objects in List1 but excludes objects in List2.
list1: List of objects to be included in the new list
list2: List of objects to be excluded in the new list
The new list that contains objects in List1 but not in List2
difference,setdifference,set

DSCore.List.SetIntersection(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Returns a new list that includes objects that are present in both List1 and List2.
list1: List of objects to be compared with list2
list2: List of objects to be compared with list1
The new list that contains objects that are in both List1 and List2
intersection,setintersection,set,overlap

DSCore.List.SetUnion(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Returns a new list that includes objects that are present in either List1 or List2.
list1: List of objects to be included
list2: List of objects to be included to List1
The new list that contains objects that are either in List1 or List2
union,setunion,set

DSCore.List.IndexOf(System.Collections.IList,System.Object)
Returns the index of the element in the given list. Match between given list and target element must be a strict match (i.e. int to int, double to double, string to string, object to object etc.).
list: The list to find the element in.
element: The element whose index is to be returned.
The index of the element in the list. Invalid index -1 will be returned if strict match not found.
index,indexof

DSCore.List.CountFalse(System.Collections.IList)
Returns the number of false boolean values in the given list.
list: The list find the false boolean values.
The number of false boolean values in the list.
false,count

DSCore.List.CountTrue(System.Collections.IList)
Returns the number of true boolean values in the given list.
list: The list find the true boolean values.
The number of true boolean values in the list.
true,count

DSCore.List.Insert(System.Collections.IList,System.Object,System.Int32)
Inserts an element into a list at specified index.
list: The list the element will be inserted to
element: The element to be inserted
index: Specifies the location in the list of the element to be inserted
List with the element inserted
insert,add

DSCore.List.Reorder(System.Collections.IList,System.Collections.IList)
Reorders the input list based on the given list of indices.
list: The list to be reordered
indices: The indices used to reorder the items in the list
Reordered list
reorder,index,indices

DSCore.List.SortIndexByValue(System.Collections.Generic.List{System.Double})
Sorts a list by the items and return their indices.
list: List of items to be sorted
The indices of the items in the sorted list
sort,index,value

DSCore.List.NormalizeDepth(System.Collections.IList,System.Int32)
Returns multidimensional list according the rank given.
list: The list whose depth is to be normalized according to the rank.
rank: The rank the list is to be normalized to. Default value is 1.
The list with the normalized rank.
depth,normalize

DSCore.List.Reverse(System.Collections.IList)
Creates a new list containing the items of the given list but in reverse order.
list: List to be reversed.
Reversed list
flip,listcontains

DSCore.List.__Create(System.Collections.IList)
Creates a new list containing the given items.
items: Items to be stored in the new list.

DSCore.List.Sublists(System.Collections.IList,System.Collections.IList,System.Int32)
Build sublists from a list using DesignScript range syntax.
list: The list from which to create sublists.
ranges:
The index ranges of the sublist elements.
Ex. \"{0..3,5,2}\"
offset:
The offset to apply to the sublist.
Ex. the range \"0..3\" with an offset of 2 will yield
{0,1,2,3}{2,3,4,5}{4,5,6,7}...
type: var[]..[]
sublists,build sublists,subset,

DSCore.List.Sort(System.Collections.Generic.IEnumerable{System.Object})
Sorts a list using the built-in natural ordering.
list: List to be sorted
Sorted list
sort,order,sorted

DSCore.List.MinimumItem(System.Collections.Generic.IEnumerable{System.Object})
Returns the minimum value from a list.
list: List of comparable items to take the minimum value from
Minimum item from the list.
least,smallest,find min

DSCore.List.MaximumItem(System.Collections.Generic.IEnumerable{System.Object})
Returns the maximum value from a list.
list: List of comparable items to take the maximum value from
Maximum item from the list.
greatest,largest,biggest,find max

DSCore.List.FilterByBoolMask(System.Collections.IList,System.Collections.IList)
Filters a sequence by looking up corresponding indices in a separate list of
booleans.
list: List to filter.
mask: List of booleans representing a mask.
Items whose mask index is true.
Items whose mask index is false.
filter,in,out,mask,dispatch,bool filter,boolfilter,bool filter

DSCore.List.Deconstruct(System.Collections.IList)
Given a list, produces the first item in the list, and a new list containing all items
except the first.
list: List to be split.
First item in the list (type: var[]..[])
Rest of the list (type: var[]..[])
first,rest,list split,listcontains

DSCore.List.SortByKey(System.Collections.IList,System.Collections.IList)
Sort list based on its keys
list: list to be sorted
keys: list of keys, keys have to be sortable (e.g. numbers,strings)
type: var[]..[]
type: var[]..[]
sort;key

DSCore.List.GroupByKey(System.Collections.IList,System.Collections.IList)
Group items into sub-lists based on their like key values
list: List of items to group as sublists
keys: Key values, one per item in the input list, used for grouping the items
list of sublists, with items grouped by like key values
key value corresponding to each group
list;group;groupbykey;

DSCore.List.GroupBySimilarity(System.Collections.IList,System.Double,System.Boolean)
Clusters list elements based on the adjacency of their indices and the similarity of their values
list: List of items to group as sublists based on adjacency and similarity
tolerance: Threshold value for grouping similar items
considerAdjacency: Boolean value to control if the node should consider adjacency or not.
list of sublists with items grouped by similar values
list of sublists containing the original indices of grouped values
list;group;similar;adjacent;adjacency;groupbyadjacency;groupadjacentitems;groupsimilaritems;cluster;tolerance

DSCore.List.LevenshteinDistance(System.String,System.String)
Levenshtein Distance is the algorithm used to get the distance between 2 strings
| Source

DSCore.List.AddItemToFront(System.Object,System.Collections.IList)
Adds an item to the beginning of a list.
item: Item to be added. Item could be an object or a list.
list: List to add on to.
List with added items
insert,add,item,front,start,begin

DSCore.List.AddItemToEnd(System.Object,System.Collections.IList)
Adds an item to the end of a list.
item: Item to be added.Item could be an object or a list.
list: List to add on to.
List with added items
insert,add,item,end

DSCore.List.TakeItems(System.Collections.IList,System.Int32)
Fetches an amount of items from the start of the list.
list: List to take from.
amount:
Amount of items to take. If negative, items are taken from the end of the list.
List of extracted items.
get,sub,sublist,extract

DSCore.List.DropItems(System.Collections.IList,System.Int32)
Removes an amount of items from the start of the list. If the amount is a negative value,
items are removed from the end of the list.
list: List to remove items from.
amount:
Amount of items to remove. If negative, items are removed from the end of the list.
List of remaining items.
drop,remove,shorten

DSCore.List.ShiftIndices(System.Collections.IList,System.Int32)
Shifts indices in the list to the right by the given amount.
list: List to be shifted.
amount:
Amount to shift indices by. If negative, indices will be shifted to the left.
Shifted list.
shift,offset

DSCore.List.GetItemAtIndex(System.Collections.IList,System.Int32)
Returns an item from the given list that's located at the specified index.
list: List to fetch an item from.
index: Index of the item to be fetched.
Item in the list at the given index.
get,item,index,fetch,at,getfrom,get from,extract

DSCore.List.ReplaceItemAtIndex(System.Collections.IList,System.Int32,System.Object)
Replace an item from the given list that's located at the specified index.
list: List to replace an item in.
index: Index of the item to be replaced.
item: The item to insert.
A new list with the item replaced.
replace,switch

DSCore.List.ReplaceItemAtIndices(System.Collections.IList,System.Collections.Generic.IList{System.Int32},System.Object)
Replaces items from the given list that are located at the specified indices.
list: List to replace an item in.
indices: Indices of the item(s) to be replaced.
item: The item to insert.
A new list with the item(s) replaced.
replace,switch

DSCore.List.Slice(System.Collections.IList,System.Nullable{System.Int32},System.Nullable{System.Int32},System.Int32)
Returns a single sub-list from the given list, based on starting index, ending index,
and a step amount.
list: List to take a slice of.
start: Index to start the slice from.
end: Index to end the slice at.
step:
Amount the indices of the items are separate by in the original list.
Items in the slice of the given list.
list,sub,sublist,subrange,get sublist

DSCore.List.RemoveItemAtIndex(System.Collections.IList,System.Int32[])
Removes an item from the given list at the specified index.
list: List to remove an item or items from.
indices: Index or indices of the item(s) to be removed.
List with items removed.
index,indices,cull,remove,item

DSCore.List.DropEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
Removes items from the given list at indices that are multiples
of the given value, after the given offset.
list: List to remove items from/
n: Indices that are multiples of this argument will be removed.
offset:
Amount of items to be ignored from the start of the list.
List with items removed.
nth,remove,cull,every

DSCore.List.TakeEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
Fetches items from the given list at indices that are multiples
of the given value, after the given offset.
list: List to take items from.
n:
Indices that are multiples of this number (after the offset)
will be fetched.
offset:
Amount of items to be ignored from the start of the list.
Items from the list.
fetch,take,every,nth

DSCore.List.IsEmpty(System.Collections.IList)
Determines if the given list is empty.
list: List to be checked if it is empty
True if list is empty, false if it isnt
test,is,empty,null,count

DSCore.List.AllTrue(System.Collections.IList)
Determines if all items in the given list is a boolean and has a true value.
list: List to be checked on whether all items are true.
True if all items from list are true, false if one or more items is not true
test,all,true,istrue

DSCore.List.AllFalse(System.Collections.IList)
Determines if all items in the given list is a boolean and has a false value.
list: List to be checked on whether all items are false.
True if all items from list are false, false if one or more items is not false
test,all,false,isfalse

DSCore.List.AnyTrue(System.Collections.IList)
Determines if any item in the given list is a boolean and has a true value.
list: List to be checked on whether any item is true.
Whether any item is true.
test,any,true,istrue

DSCore.List.AnyFalse(System.Collections.IList)
Determines if any item in the given list is a boolean and has a false value.
list: List to be checked on whether any item is false.
Whether any item is false.
test,any,false,isfalse

DSCore.List.Count(System.Collections.IList)
Returns the number of items stored in the given list.
list: List to get the item count of.
List length.
listlength,list length,count,size,sizeof

DSCore.List.Join(System.Collections.IList[])
Concatenates all given lists into a single list.
lists: Lists to join into one.
Joined list.
join lists,merge,concatenate

DSCore.List.FirstItem(System.Collections.IList)
Returns the first item in a list.
list: List to get the first item from.
First item in the list.
get,fetch,first,item,start

DSCore.List.RestOfItems(System.Collections.IList)
Removes the first item from the given list.
list: List to get the rest of.
Rest of the list.
get,fetch,rest,end,rest of list

DSCore.List.Chop(System.Collections.IList,System.Collections.Generic.List{System.Int32})
Chop a list into a set of consecutive sublists with the specified lengths. List division begins at the top of the list.
list: List to chop into sublists
lengths: Lengths of consecutive sublists to be created from the input list
Sublists created from the list
sublists,build sublists,slices,partitions,cut,listcontains,chop

DSCore.List.DiagonalRight(System.Collections.IList,System.Int32)
List elements along each diagonal in the matrix from the lower left to the top right.
list: A flat list
subLength: Length of each new sub-list.
Lists of elements along matrix diagonals.
diagonal,right,matrix,get diagonals,diagonal sublists

DSCore.List.DiagonalLeft(System.Collections.IList,System.Int32)
List elements along each diagonal in the matrix from the top left to the lower right.
list: A flat list.
rowLength: Length of each new sib-list.
Lists of elements along matrix diagonals.
diagonal,left,matrix,get diagonals,diagonal sublists

DSCore.List.Transpose(System.Collections.IList)
Swaps rows and columns in a list of lists.
If there are some rows that are shorter than others,
null values are inserted as place holders in the resultant
array such that it is always rectangular.
lists: List of lists to be transposed
List of transposed lists
transpose,flip matrix,matrix,swap,rows,columns

DSCore.List.Clean(System.Collections.IList,System.Boolean)
Cleans data of nulls and empty lists from a given list of arbitrary dimension
list: List containing nulls and empty sublists to clean
preserveIndices: Provide an option to preserve the indices of the data
List of transposed lists
such that non-trailing nulls may not be filtered out
Returns: A list cleaned of nulls and empty lists

DSCore.List.OfRepeatedItem(System.Object,System.Int32)
Creates a list containing the given item the given number of times.
item: The item to repeat.
amount: The number of times to repeat.
List of repeated items.
repeat,repeated,duplicate,list of item,fill list,copies,listcontains

DSCore.List.Cycle(System.Collections.IList,System.Int32)
Creates a new list by concatenating copies of a given list.
list: List to repeat.
amount: Number of times to repeat.
List of repeated lists of type: var[]..[]
repeat,repeated,duplicate,repeated list,concat list

DSCore.List.LastItem(System.Collections.IList)
Retrieves the last item in a list.
list: List to get the last item of
Last item in the list
get,fetch,last,item,end of list

DSCore.List.Shuffle(System.Collections.IList)
Shuffles a list, randomizing the order of its items.
list: List to shuffle.
Randomized list.
random,randomize,shuffle,jitter,randomness

DSCore.List.Shuffle(System.Collections.IList,System.Int32)
Shuffles a list, randomizing the order of its items based on an intial seed value.
list: List to shuffle.
seed: Seed value for the random number generator.
Randomized list.
random,randomize,shuffle,jitter,randomness,seed

DSCore.List.Permutations(System.Collections.IList,System.Nullable{System.Int32})
Produces all permutations of the given length of a given list.
list: List to permute.
length: Length of each permutation.
Permutations of the list of the given length (type: var[]..[])
permutation,permutations

DSCore.List.Combinations(System.Collections.IList,System.Int32,System.Boolean)
Produces all combinations of the given length of a given list.
list: List to generate combinations of
length: Length of each combination
replace:
Whether or not items are removed once selected for combination, defaults
to false.
Combinations of the list of the given length
combo

DSCore.List.FirstIndexOf(System.Collections.IList,System.Object)
Given an item, returns the zero-based index of its first occurrence
in the list. If the item cannot be found in the list, -1 is returned.
list:
List to search in. If this argument is null, -1 is returned.
item: Item to look for.
Returns: Zero-based index of the item in the list, or -1 if it is not found.

DSCore.List.AllIndicesOf(System.Collections.IList,System.Object)
Given an item, returns the zero-based indices of all its occurrences
in the list. If the item cannot be found, an empty list is returned.
list:
List to search in. If this argument is null, an empty list is returned.
item: Item to look for.
A list of zero-based indices of all occurrences of the item if
found, or an empty list if the item does not exist in the list.

DSCore.List.Flatten(System.Collections.IList,System.Int32)
Flattens a nested list of lists by a certain amount.
list: List to flatten.
amount: Layers of list nesting to remove (-1 will remove all list nestings)
Flattened list by amount
flatten,completely

DSCore.List.IndexInList(System.Collections.IList,System.Object)
An alternative to using IList.Contains which uses Enumerable.SequenceEqual to check if
the item is contained in the list if the item is an array. Returns the index if found,
-1 if not found.
list: The list to check if it contains the item.
item: The item that needs to be found.
Index of the item in the list.

DSCore.List.GetDepth(System.Object)
Obtain the maximum depth of a given list.
list: The input list to obtain the depth from.
Depth of the given list.

DSCore.List.CountBool(System.Collections.IList,System.Boolean)
Returns the number of the specified boolean values in the given list.
list: The list find the boolean values.
value: The boolean value to be found
The number of the specified boolean value in the list.

DSCore.List.IncreaseDepth(System.Collections.IList,System.Int32)
Increase the depth of a given list by a specified amount. Depth is increased
by creating a new list to contain the given list.
list: The list whose depth is to be increased.
amt: The amount the depth is to be increased by.
The new list whose depth is increased by amt.

DSCore.List.DoubleConverter(System.Object)
Converts integer to double, else returns the input object.