DSCore.Data.ParseJSON(System.String)
Parse converts an arbitrary JSON string to a value. It is the opposite of JSON.Stringify.
json: A JSON string
The result type depends on the content of the input string. The result type can be a primitive value (e.g. string, boolean, double), a List, or a Dictionary.

DSCore.Data.ToNative(Newtonsoft.Json.Linq.JToken)
Parse implementation for converting JToken types to native .NET objects.
token: JToken to parse to N
Returns:

DSCore.Data.DynamoJObjectToNative(Newtonsoft.Json.Linq.JObject)
Parse implementation for converting JObject types to specific Dynamo objects (ie Geometry, Color, Images, etc)
jObject:
Returns:
Throws System.Exception:

DSCore.Data.StringifyJSON(System.Object)
Stringify converts an arbitrary value or a list of arbitrary values to JSON. Replication can be used to apply the operation over a list, producing a list of JSON strings.
values: A List of values
A JSON string where primitive types (e.g. double, int, boolean), Lists, and Dictionary's will be turned into the associated JSON type.

DSCore.Data.CanObjectBeCached(System.Object)
Helper function to determine if object can be cached or if it is null, "null" string, or empty list.
inputObject: Object to check
Returns:

DSCore.Data.Remember(System.Object,System.String)
Function to handle caching for the Data.Remember node
inputObject: Object to cache
Optional existing cache json
Returns:

DSCore.Data.DataNodeDynamoTypeList
A static list for all Dynamo supported data types
Returns: The list containing the supported data types

DSCore.Data.#cctor
Static constructor

DSCore.Data.SafeExtractDictionaryValue(System.Collections.Generic.Dictionary{System.String,System.Object},System.String)
A helper function to safely extract a dictionary value
dict: The dictionary to extract the value from
key: The key of the key/value pair

DSCore.Data.EvaluateDefineDataNode(System.Object,System.String,System.Boolean,System.Boolean,System.String)
This is the function used by AST to evaluate the Define Data node.
Handles some of the the node logic while performing the validation
inputValue: Upstream input value
typeString: The Type as string (Todo: it would be better to pass an object of type 'Type' for direct type comparison)
isList: If the input is of type `ArrayList`
isAutoMode: If the node is in Auto mode
playerValue: The value injected into the node by Dynamo Player, if any.

DSCore.Data.FindCommonAncestor(System.Collections.ArrayList)
A function to help find the type in case an ArrayList of objects was passed in AutoMode
list: The input value, expected to be of type ArrayList
Returns:

DSCore.Data.LikelyAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
A helper function returning the lowest-level node from a list of DataNodeDynamoType nodes
nodes: The list of DataNodeDynamoType to evaluate
Returns:

DSCore.Data.FindClosestCommonAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
A helper function to try to determine a common ancestor in a list of data types
nodes: The list of DataType nodes to evaluate
Returns:

DSCore.Data.FindCommonAncestorBetweenTwoNodes(DSCore.Data.DataNodeDynamoType,DSCore.Data.DataNodeDynamoType)
Recursive function to try and find a common ancestor between two dynamo types
Climbs up the hierarchical tree of the likelyAncestor until it
node: Check if this node is derived from the likely ancestor
likelyAncestor: The likely ancestor that the node should be deriving from
Returns:

DSCore.Data.GetListFromTypes(System.Collections.ArrayList)
Return a list of DataNodeDynamoTypes from an ArrayList of objects
list: The ArrayList of objects to reformat
Returns:

DSCore.Data.IsUnusedDefineDataInput(System.Object)
Checks whether the Define Data input is unused (null or an empty list).
inputValue: The input value from the graph.
Returns: True when the input should be treated as unconnected or unused.

DSCore.Data.IsSingleValueOrSingleLevelArrayList(System.Object)
Check if the input object is a single value or a single-level ArrayList.
obj: The input object to evaluate
Returns:

DSCore.Data.IsSupportedDataNodeDynamoType(System.Object,System.Type,System.Boolean)
Function to validate input type against supported Dynamo input types
inputValue: The incoming data to validate
type: The input type provided by the user. It has to match the inputValue type
isList: The value of this boolean decides if the input is a single object or a list
Returns:

DSCore.Data.IsItemOfType(System.Object,System.Type)
This method checks if an item is of a required Dynamo DataType
'IsInstanceOfType' recursively checks for upward inheritance
item: The item to check the data type for
dataType: The DataType to check against
Returns: A true or false result based on the check validation

DSCore.Data.IsDerivedFrom(System.Type,System.Type)
This method checks if a type is derived from a base type
derivedType: The type we want to assert
baseType: The base type we compare with
Returns: