DSCore.CurveMapper.PerlinNoiseCurve
Represents a Perlin noise curve in the CurveMapper.
The curve generates procedural noise based on control points and Perlin noise functions.

DSCore.CurveMapper.PerlinNoiseCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Returns X and Y values distributed across the curve.