DSCore.CurveMapper.ParabolicCurve
Represents a parabolic curve in the CurveMapper.
The curve follows a quadratic equation based on two control points.

DSCore.CurveMapper.ParabolicCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Returns X and Y values distributed across the curve.