DSCore.ColorRange1D.ByColorsAndParameters(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double})
Create a ColorRange1D by supplying lists of colors and parameters.
colors: A list of colors.
parameters: A list of parameters between 0.0 and 1.0.
Returns: A ColorRange1D object.

DSCore.ColorRange1D.GetColorAtParameter(DSCore.ColorRange1D,System.Double)
Returns the color in this color range at the specified parameter.
colorRange:
parameter: A value between 0.0 and 1.0.
Returns: A Color.

DSCore.ColorRange1D.Default
Create a ColorRange1D with the default color scheme.
Returns: