DSCore.CurveMapper.SineWave
Represents a sine wave curve in the CurveMapper.
The sine wave is defined by two control points and follows a trigonometric function.

DSCore.CurveMapper.SineWave.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Returns X and Y values distributed across the curve.