DSCore.Data.DataNodeDynamoType
A class representing a DataType supported by Dynamo

DSCore.Data.DataNodeDynamoType.#ctor(System.Type,System.String,System.String)
A class representing a DataType supported by Dynamo

DSCore.Data.DataNodeDynamoType.Type
The underlying Type

DSCore.Data.DataNodeDynamoType.Name
An optional Name to override the Type name (`Number` instead of `long`)

DSCore.Data.DataNodeDynamoType.TypeId
Wire-format $typeid (e.g. "autodesk.math:point3d-1.0.0").
Null for primitive types that don't use $typeid serialization.

DSCore.Data.DataNodeDynamoType.Level
The hierarchical level to be displayed in the UI

DSCore.Data.DataNodeDynamoType.IsLastChild
If the type is a last child of a hierarchy (for UI purposes)

DSCore.Data.DataNodeDynamoType.Parent
The parent of the Type, if any