Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.WeldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Boolean)
Weld vertices of first and second groups pairwise.
First group is considered as vertices of this t-spline.
Second group vertices can be either from this surface or from any other.
In case of different t-splines combine is performed before the weld operation
firstGroup: First group of vertices to weld
secondGroup: Second group of vertices to weld
keepSubdCreases: Preserve the subd-creases of the input topology
Returns: TSpline surface with welded vertices
tspline,weld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.EnableSmoothMode(System.Boolean)
Change visualization style of t-spline.
Smooth visualization if true passed, box otherwise.
enable: Enable or disable smooth visualization
Returns: t-spline with chosen visualization style
tspline,visualization,mode,smooth,box

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Spline Sphere centered at the input Point, with given radius.
centerPoint: Center of a sphere
radius: Radius of a sphere
radiusSpans: Number of radial spans
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Spherical T-Spline Surface
tspline,sphere,radius