Autodesk.DesignScript.Geometry.Solid.ThinShell(System.Double,System.Double)
Obtain a solid Shell from the Faces of this Solid
internalFaceThickness: Distance to extend the shell inwards
externalFaceThickness: Distance to extend the shell outwards
extract shell, offset and extract