Autodesk.DesignScript.Geometry.DebugTools.EnableAsmJournaling(System.Collections.IList,System.String)
Enables ASM journaling
input: Any input value
journalPath: optional path to specify location of ASM journals.
Returns the input value

Autodesk.DesignScript.Geometry.DebugTools.DisableAsmJournaling(System.Collections.IList)
Disables ASM journaling
input: Any input value
Returns the input value