Repository: DynamoDS/Dynamo
Catalog: src/Libraries/PythonNodeModels/Properties/Resources.*.resx
Languages: es_es, fr_fr, it_it, ko_kr, pl_pl, pt_br, zh_cn, zh_tw

# DeletingPythonNodeWithOpenEditorMessage
source: The Python node "{0}" still has a script editor window open. Are you sure you want to close the editor and delete the node?
es_es: El nodo de Python "{0}" aún tiene una ventana de editor de secuencias de comandos abierta. ¿Confirma que desea cerrar el editor y suprimir el nodo?
fr_fr: Une fenêtre de l'éditeur de script du noeud Python "{0}" est encore ouverte. Etes-vous sûr de vouloir fermer l'éditeur et supprimer le noeud?
it_it: La finestra dell'editor di script del nodo Python "{0}" è ancora aperta. Chiudere l'editor ed eliminare il nodo?
ko_kr: Python 노드 "{0}"에 아직 열린 스크립트 편집기 창이 있습니다. 편집기를 닫고 노드를 삭제하시겠습니까?
pl_pl: Węzeł w języku Python „{0}” nadal ma otwarte okno edytora skryptów. Czy na pewno chcesz zamknąć edytor i usunąć węzeł?
pt_br: O nó Python "{0}" ainda tem uma janela do editor de script aberta. Tem certeza de que deseja fechar o editor e excluir o nó?
zh_cn: Python 节点“{0}”仍然有一个打开的脚本编辑器窗口。是否确定要关闭编辑器并删除节点？
zh_tw: Python 節點 "{0}" 仍有指令碼編輯器視窗開啟。您確定要關閉編輯器並刪除節點？

# DeletingPythonNodeWithOpenEditorTitle
source: Script Editor Open
es_es: Editor de secuencias de comando abierto
fr_fr: Editeur de script ouvert
it_it: Editor di script aperto
ko_kr: 스크립트 편집기 열기
pl_pl: Edytor skryptów otwarty
pt_br: Editor de script aberto
zh_cn: 脚本编辑器处于打开状态
zh_tw: 指令碼編輯器開啟

# EditHeader
source: Edit...
es_es: Editar...
fr_fr: Modifier...
it_it: Modifica...
ko_kr: 편집...
pl_pl: Edycja...
pt_br: Editar...
zh_cn: 编辑...
zh_tw: 編輯...

# PythonNodeContextMenuEngineSwitcher
source: Python Engine Version
es_es: Versión del motor de Python
fr_fr: Version du moteur Python
it_it: Versione motore Python
ko_kr: Python 엔진 버전
pl_pl: Wersja silnika Python
pt_br: Versão do mecanismo Python
zh_cn: Python 引擎版本
zh_tw: Python 引擎版本

# PythonNodeContextMenuLearnMoreButton
source: Learn more about Python
es_es: Más información sobre Python
fr_fr: En savoir plus sur Python
it_it: Ulteriori informazioni su Python
ko_kr: Python에 대해 자세히 알아보기
pl_pl: Dowiedz się więcej o języku Python
pt_br: Saiba mais sobre o Python
zh_cn: 了解有关 Python 的更多信息
zh_tw: 進一步瞭解 Python

# PythonNodePortDataOutputToolTip
source: Result of the python script
es_es: Resultado de la secuencia de comandos de Python
fr_fr: Résultat du script Python
it_it: Risultato dello script Python
ko_kr: Python 스크립트의 결과
pl_pl: Wynik skryptu w języku Python
pt_br: Resultado do script Python
zh_cn: Python 脚本结果
zh_tw: Python 指令碼的結果

# PythonScriptDescription
source: Runs an embedded Python script.
es_es: Ejecuta una secuencia de comandos de Python incrustada.
fr_fr: Exécute un script Python intégré.
it_it: Esegue uno script Python incorporato.
ko_kr: 포함된 Python 스크립트를 실행합니다.
pl_pl: Uruchamia osadzony skrypt języka Python.
pt_br: Executa um script Python incorporado.
zh_cn: 运行嵌入 Python 脚本。
zh_tw: 執行嵌入的 Python 指令碼。

# PythonScriptEditorCaption
source: Edit Python Script...
es_es: Editar secuencia de comandos de Python...
fr_fr: Modifier un script Python...
it_it: Modifica script Python...
ko_kr: Python 스크립트 편집...
pl_pl: Edytuj skrypt w języku Python...
pt_br: Editar o script Python...
zh_cn: 编辑 Python 脚本...
zh_tw: 編輯 Python 指令碼...

# PythonScriptEditorCodeComment
source: Place your code below this line
es_es: Incluya el código debajo de esta línea
fr_fr: Placer votre code au-dessous de cette ligne
it_it: Posizionare il codice sotto questa riga
ko_kr: 코드를 이 선 아래에 배치
pl_pl: Wstaw kod poniżej tej linii
pt_br: Insira o código abaixo desta linha
zh_cn: 将代码放在该行下面
zh_tw: 在此行下方放入您的程式碼

# PythonScriptEditorImports
source: Load the Python Standard and DesignScript Libraries
es_es: Carga las bibliotecas de DesignScript y normas de Python.
fr_fr: Charger les bibliothèques DesignScript et Standard Python
it_it: Carica librerie DesignScript e standard Python
ko_kr: Python 표준 및 DesignScript 라이브러리 로드
pl_pl: Wczytaj biblioteki Python Standard i DesignScript
pt_br: Carregar as bibliotecas DesignScript e padrão do Python
zh_cn: 加载 Python Standard 和 DesignScript 库
zh_tw: 載入 Python 標準資源庫和 DesignScript 資源庫

# PythonScriptEditorInputComment
source: The inputs to this node will be stored as a list in the IN variables.
es_es: Las entradas de este nodo se almacenan como lista en las variables IN.
fr_fr: Les entrées effectuées dans ce noeud sont stockées sous forme de liste dans les variables IN.
it_it: I valori di immissione per questo nodo verranno memorizzati come elenco nelle variabili IN.
ko_kr: 이 노드에 대한 입력값은 IN 변수에 리스트로 저장됩니다.
pl_pl: Wartości wejściowe do tego węzła będą przechowywane w postaci listy w zmiennych IN.
pt_br: As entradas para este nó serão armazenadas como uma lista nas variáveis IN.
zh_cn: 该节点的输入内容将存储为 IN 变量中的一个列表。
zh_tw: 此節點的輸入將在 IN 變數中儲存為一個清單。

# PythonScriptEditorMoreInfoButtonTooltip
source: Learn about the Python 2 to Python 3 conversion
es_es: Obtenga más información sobre la conversión de Python 2 a Python 3.
fr_fr: En savoir plus sur la conversion de Python 2 vers Python 3
it_it: Fornisce informazioni sulla conversione a Python 2 a Python 3.
ko_kr: Python2에서 Python3로 변환하는 방법에 대해 알아보기
pl_pl: Dowiedz się więcej na temat konwersji z języka Python 2 na język Python 3
pt_br: Saiba mais sobre a conversão do Python 2 em Python 3
zh_cn: 了解 Python 2 到 Python 3 转换
zh_tw: 瞭解將 Python 2 轉換為 Python 3

# PythonScriptEditorOutputComment
source: Assign your output to the OUT variable.
es_es: Asigne la salida a la variable OUT.
fr_fr: Affectez la sortie à la variable OUT.
it_it: Assegnare l'output dell'utente alla variabile OUT.
ko_kr: 출력을 OUT 변수에 지정합니다.
pl_pl: Przypisz dane wyjściowe do zmiennej OUT.
pt_br: Atribua a sua saída para a variável OUT.
zh_cn: 将输出内容指定给 OUT 变量。
zh_tw: 指定輸出至 OUT 變數。

# PythonScriptEditorRevertButtonTooltip
source: Revert the changes made to current Python node editor and close it.
es_es: Revierta los cambios realizados en el editor de nodos de Python actual.
fr_fr: Annulez les modifications apportées à l'éditeur de noeuds Python actuel.
it_it: Annulla le modifiche apportate all'editor di nodi Python corrente.
ko_kr: 현재 Python 노드 편집기에 대한 변경 사항을 되돌립니다.
pl_pl: Cofnij zmiany wprowadzone w bieżącym edytorze węzłów języka Python.
pt_br: Reverta as alterações feitas no editor de nós Python atual.
zh_cn: 还原对当前 Python 节点编辑器所做的更改。
zh_tw: 回復對目前 Python 節點編輯器所做的變更。

# PythonScriptEditorUndoButtonTooltip
source: Undo
es_es: Deshacer
fr_fr: Annuler
it_it: Annulla
ko_kr: 실행취소
pl_pl: Cofnij
pt_br: Desfazer
zh_cn: 撤消
zh_tw: 退回

# PythonScriptEditorRedoButtonTooltip
source: Redo
es_es: Rehacer
fr_fr: Répéter
it_it: Ripeti
ko_kr: 재실행
pl_pl: Powtórz
pt_br: Refazer
zh_cn: 重做
zh_tw: 重做

# PythonScriptEditorZoomInButtonTooltip
source: Zoom in
es_es: Ampliar
fr_fr: Zoom avant
it_it: Zoom avanti
ko_kr: 줌 확대
pl_pl: Powiększ
pt_br: Aproximar zoom
zh_cn: 放大
zh_tw: 拉近

# PythonScriptEditorZoomOutButtonTooltip
source: Zoom out
es_es: Reducir
fr_fr: Zoom arrière
it_it: Zoom indietro
ko_kr: 줌 축소
pl_pl: Pomniejsz
pt_br: Afastar zoom
zh_cn: 缩小
zh_tw: 拉遠

# PythonScriptEditorRunButton
source: Save and run
es_es: Guardar y ejecutar
fr_fr: Enreg. et exécuter
it_it: Salva ed esegui
ko_kr: 저장 및 실행
pl_pl: Zapisz i uruchom
pt_br: Salvar e executar
zh_cn: 保存并运行
zh_tw: 儲存並執行

# PythonScriptEditorRunButtonTooltip
source: Save Python script and run it with the graph
es_es: Guarde la secuencia de comandos de Python y ejecútela con el gráfico.
fr_fr: Enregistrez le script Python actuel et exécutez-le avec le graphique
it_it: Salva lo script Python e lo esegue con il grafico.
ko_kr: Python 스크립트를 저장하고 그래프로 실행
pl_pl: Zapisz skrypt w języku Python i uruchom go z wykresem
pt_br: Salve o script Python e execute-o com o gráfico
zh_cn: 保存 Python 脚本并与图形一起运行
zh_tw: 儲存 Python 指令碼並對圖表執行

# PythonScriptEditorSaveChangesButtonTooltip
source: Save changes made in Python Script editor
es_es: Guarde los cambios realizados en el editor de secuencias de comandos de Python.
fr_fr: Enregistrez les modifications apportées dans l'éditeur de scripts Python
it_it: Salva le modifiche apportate nell'editor dello script Python.
ko_kr: Python 스크립트 편집기에서 변경한 내용 저장
pl_pl: Zapisz zmiany wprowadzone w edytorze skryptu w języku Python
pt_br: Salve as alterações feitas no editor de scripts Python
zh_cn: 保存在 Python 脚本编辑器中所做的更改
zh_tw: 儲存 Python 指令碼編輯器中所做的變更

# PythonScriptFromStringDescription
source: Runs a Python script from a string.
es_es: Ejecuta una secuencia de comandos de Python a partir de una cadena.
fr_fr: Exécute un script Python à partir d'une chaîne.
it_it: Esegue uno script Python da una stringa.
ko_kr: 문자열에서 Python 스크립트를 실행합니다.
pl_pl: Uruchamia skrypt języka Python z ciągu.
pt_br: Executa um script Python com base em uma sequência de caracteres.
zh_cn: 运行字符串中的 Python 脚本。
zh_tw: 從字串執行 Python 指令碼。

# PythonStringPortDataScriptToolTip
source: Python script to run.
es_es: Secuencia de comandos de Python que ejecutar
fr_fr: Script Python à exécuter.
it_it: Script Python da eseguire.
ko_kr: 실행할 Python 스크립트.
pl_pl: Skrypt w języku Python do uruchomienia.
pt_br: Script Python a ser executado.
zh_cn: 要运行的 Python 脚本。
zh_tw: 要執行的 Python 指令碼。

# PythonScriptEditorEngineDropdownTooltip
source: Select the Python version/engine to execute the script
es_es: Seleccione la versión o el motor de Python que ejecutará el guión.
fr_fr: Sélectionnez la version/le moteur Python pour exécuter le script
it_it: Consente di selezionare la versione/il motore di Python per eseguire lo script.
ko_kr: 스크립트를 실행할 Python 버전/엔진 선택
pl_pl: Wybierz wersję/mechanizm języka Python do uruchamiania skryptu
pt_br: Selecione versão ou o mecanismo do Python para executar o script
zh_cn: 选择执行脚本的 Python 版本/引擎
zh_tw: 選取要執行指令碼的 Python 版本/引擎

# PythonScriptEditorMigrationAssistantButtonTooltip
source: Convert script to Python 3...
es_es: Convertir la secuencia de comandos a Python 3...
fr_fr: Convertissez le script vers Python 3…
it_it: Converte lo script in Python 3.
ko_kr: 스크립트를 Python 3로 변환...
pl_pl: Przekonwertuj skrypt na język Python 3...
pt_br: Converter o script em Python 3...
zh_cn: 转换脚本为 Python 3...
zh_tw: 將指令碼轉換為 Python 3...

# PythonScriptUnsavedChangesPromptText
source: It looks like you are still working on this. You may lose any unsaved changes if you leave now
es_es: Parece que aún está trabajando en esto. Si sale ahora, puede perder los cambios no guardados.
fr_fr: Il semble que vous travaillez toujours sur ce projet. Si vous fermez la fenêtre, vous risquez de perdre toutes les modifications non enregistrées.
it_it: Elaborazione ancora in corso. Se si esce ora, è possibile che le modifiche non salvate vadano perse
ko_kr: 아직 이 작업을 수행하고 있는 것 같습니다. 지금 종료하면 저장되지 않은 변경 사항이 손실될 수 있습니다.
pl_pl: Wygląda na to, że nadal nad tym pracujesz. Możesz utracić wszystkie niezapisane zmiany, jeśli opuścisz ten obszar teraz
pt_br: Parece que você ainda está trabalhando nisso. Você poderá perder todas as alterações não salvas se sair agora
zh_cn: 您似乎仍在处理此脚本。如果现在退出，可能会丢失任何未保存的更改。
zh_tw: 您似乎仍在處理此項目。如果您現在離開，可能會遺失任何未儲存的變更

# PythonScriptUnsavedChangesPromptTitle
source: Are you sure you want to leave?
es_es: ¿Confirma que desea salir?
fr_fr: Voulez-vous vraiment fermer la fenêtre ?
it_it: Uscire?
ko_kr: 나가시겠습니까?
pl_pl: Czy na pewno chcesz wyjść?
pt_br: Tem certeza de que deseja sair?
zh_cn: 是否确定要离开？
zh_tw: 您確定要離開嗎？
