DSCore.Data.ParseJSON(System.String)
解析将任意 JSON 字符串转换为一个值。它与 JSON.Stringify 正好相反。
json: JSON 字符串
结果类型取决于输入字符串的内容。该结果类型可以是基本值(例如，字符串、布尔型、双精度)、列表或词典。

DSCore.Data.ToNative(Newtonsoft.Json.Linq.JToken)
解析将 JToken 类型转换为本地 .NET 对象的实现。
token: 要解析为 N 的 JToken

DSCore.Data.DynamoJObjectToNative(Newtonsoft.Json.Linq.JObject)
解析将 JObject 类型转换为特定 Dynamo 对象(即几何图形、颜色、图像等)的实现
Throws System.Exception:

DSCore.Data.StringifyJSON(System.Object)
Stringify 将任意值或任意值列表转换为 JSON。数据同步可以用来针对列表应用该操作，生成 JSON 字符串列表。
values: 值列表
JSON 字符串，其中的基本类型(例如，双精度、整型、布尔值)、列表和词典的字符串将转换为关联的 JSON 类型。

DSCore.Data.CanObjectBeCached(System.Object)
确定对象是否可以缓存或者是否为空、“null”字符串或空列表的辅助函数。
inputObject: 要检查的对象

DSCore.Data.Remember(System.Object,System.String)
处理 Data.Remember 节点缓存的函数
inputObject: 要缓存的对象
cachedJson: 可选的现有缓存 json

DSCore.Data.DataNodeDynamoTypeList
所有 Dynamo 支持数据类型的静态列表
Returns: 包含支持数据类型的列表

DSCore.Data.#cctor
静态构造函数

DSCore.Data.SafeExtractDictionaryValue(System.Collections.Generic.Dictionary{System.String,System.Object},System.String)
安全提取词典值的辅助函数
dict: 从中提取值的词典
key: 键/值对的关键字

DSCore.Data.EvaluateDefineDataNode(System.Object,System.String,System.Boolean,System.Boolean,System.String)
这是 AST 用于计算“Define Data”节点的函数。
在执行验证时处理一些节点逻辑
inputValue: 上游输入值
typeString: Type 为字符串(待办事项: 最好传递类型为“Type”的对象以直接比较类型)
isList: 如果输入内容的类型为 `ArrayList`
isAutoMode: 如果节点处于“自动”模式下
playerValue: 由 Dynamo 播放器注入到节点中的值(如果有)。

DSCore.Data.FindCommonAncestor(System.Collections.ArrayList)
一个函数，有助于在 AutoMode 下传递对象的数组列表时查找类型
list: 输入值，预计为类型 ArrayList

DSCore.Data.LikelyAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
一个辅助函数，用于从 DataNodeDynamoType 节点列表中返回最低级别节点
nodes: 要计算的 DataNodeDynamoType 列表

DSCore.Data.FindClosestCommonAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
一个辅助函数，用于尝试确定数据类型列表中的共同祖先
nodes: 要计算的 DataType 节点列表

DSCore.Data.FindCommonAncestorBetweenTwoNodes(DSCore.Data.DataNodeDynamoType,DSCore.Data.DataNodeDynamoType)
递归函数，用于尝试查找两个 Dynamo 类型之间的共同祖先
向上攀爬 likelyAncestor 的层次树，直到它
node: 检查此节点是否派生自可能的祖先
likelyAncestor: 节点应该派生自的可能祖先

DSCore.Data.GetListFromTypes(System.Collections.ArrayList)
从对象的数组列表中返回 DataNodeDynamoTypes 列表
list: 要重新格式化的对象的数组列表

DSCore.Data.IsUnusedDefineDataInput(System.Object)
检查是否未使用“定义数据”输入(Null 或空列表)。
inputValue: 图表中的输入值。
Returns: 当输入应视为未连接或未使用时为 True。

DSCore.Data.IsSingleValueOrSingleLevelArrayList(System.Object)
检查输入对象是单个值还是单层 ArrayList。
obj: 要计算的输入对象

DSCore.Data.IsSupportedDataNodeDynamoType(System.Object,System.Type,System.Boolean)
根据支持的 Dynamo 输入类型验证输入类型的函数
inputValue: 要验证的传入数据
type: 用户提供的输入类型。它必须与 inputValue 类型匹配
isList: 此布尔值确定输入是单个对象还是列表

DSCore.Data.IsItemOfType(System.Object,System.Type)
此方法检查某个项目是否是所需的 Dynamo DataType
'IsInstanceOfType' 递归检查向上继承
item: 要检查数据类型的项目
dataType: 要检查的 DataType
Returns: 基于检查验证的 true 或 false 结果

DSCore.Data.IsDerivedFrom(System.Type,System.Type)
此方法检查类型是否派生自基础类型
derivedType: 我们要声明的类型
baseType: 我们比较的基础类型