DSCore.Quadtree.ByUVs(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.UV})
构建包含 (0,0)->(1,1) 域的四元树。
uvs: (0,0)->(1,1) 域中的一组 UV。
Returns: 四元树对象。

DSCore.Quadtree.FindPointsWithinRadius(Autodesk.DesignScript.Geometry.UV,System.Double)
查找给定 UV 位置半径范围内四元树中的所有四元树点（UV）。
center: 搜索区域中心 UV。
radius: 搜索区域的半径。
Returns: UV 列表。