DSCore.CurveMapper.PerlinNoiseCurve
表示“曲线映射器”中的 Perlin 噪波曲线。
曲线基于控制点和 Perlin 噪波函数生成程序噪波。

DSCore.CurveMapper.PerlinNoiseCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
返回分布在曲线中的 X 和 Y 值。