DSCore.CurveMapper.LinearCurve
表示“曲线映射器”中的线性曲线。
线性曲线是两个控制点之间的直线。

DSCore.CurveMapper.LinearCurve.LineEquation(System.Double)
计算最小和最大 X 值的 Y 值(画布坐标)

DSCore.CurveMapper.LinearCurve.SolveForXGivenY(System.Double)
计算最小和最大 Y 值的 X 值(画布坐标)

DSCore.CurveMapper.LinearCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
返回分布在曲线中的 X 和 Y 值。