DSCore.Object
对所有数据进行运算的类函数。

DSCore.Object.IsNull(System.Object)
确定给定对象是否为空。
object: 要测试的对象。
对象是否为空。
is null

DSCore.Object.Identity(System.Object)
返回所传入的对象，不执行任何操作。
object: 对象。
相同对象

DSCore.Object.Type(System.Object)
返回表示为字符串的对象的类型。
object: 要查询类型的对象
Returns: 对象的类型。