DSCore.CurveMapper.SquareRootCurve
在“曲线映射器”中表示平方根曲线。
曲线遵循平方根函数，并受两个控制点的影响。

DSCore.CurveMapper.SquareRootCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
返回分布在曲线中的 X 和 Y 值。