DSCore.ColorRange.ByColorsAndParameters(System.Collections.Generic.IList{DSCore.Color},System.Collections.Generic.IList{Autodesk.DesignScript.Geometry.UV})
通过提供颜色列表和 UV 创建 ColorRange。
colors: 颜色列表。
parameters: 介于 (0.0,0.0) 和 (1.0,1.0) 之间的参数列表。
Returns: ColorRange 对象。

DSCore.ColorRange.GetColorAtParameter(Autodesk.DesignScript.Geometry.UV)
按指定参数返回该颜色范围内的颜色。
parameter: 介于 (0.0,0.0) 和 (1.0,1.0) 之间的 UV。
Returns: 颜色。