DSCore.IO.Image
图像位图的操作方法。

DSCore.IO.Image.ReadFromFile(System.IO.FileInfo)
作为位图加载文件。
file: 要加载其图像的文件对象
文件中的图像对象

DSCore.IO.Image.Pixels(System.Drawing.Bitmap,System.Nullable{System.Int32},System.Nullable{System.Int32})
读取图像文件，并返回指定网格位置的颜色值。
image: 要获取其像素颜色的图像对象
xSamples: 在 X 轴方向采样网格点的数量。
ySamples: 在 Y 轴方向采样网格点的数量。
指定网格点处的颜色
read,image,bitmap,png,jpg,jpeg

DSCore.IO.Image.FromPixels(DSCore.Color[][])
由像素二维列表构造图像。
colors: 表示像素的颜色二维矩形列表
二维像素列表中的图像

DSCore.IO.Image.FromPixels(DSCore.Color[],System.Int32,System.Int32)
由像素平面列表(宽度和高度)构造图像。
colors: 表示像素的颜色列表
width: 新图像的宽度(以像素为单位)
height: 新图像的高度(以像素为单位)
像素列表中的图像

DSCore.IO.Image.Dimensions(System.Drawing.Bitmap)
返回图像的宽度和高度。
image: 要用于获得维数的图像。
图像宽度(以像素为单位)
图像高度(以像素为单位)

DSCore.IO.Image.WriteToFile(System.String,System.Drawing.Bitmap)
根据给定文件名将图像写入路径。
image: 要写入的图像
创建图像对象
write image,image,file,filepath