DSCore.Data.DataNodeDynamoType
表示 Dynamo 支持的 DataType 的类

DSCore.Data.DataNodeDynamoType.#ctor(System.Type,System.String,System.String)
表示 Dynamo 支持的 DataType 的类

DSCore.Data.DataNodeDynamoType.Type
基本类型

DSCore.Data.DataNodeDynamoType.Name
替代类型名称的可选名称(`Number` 而不是 `long`)

DSCore.Data.DataNodeDynamoType.TypeId
导线格式 $typeid (例如 "autodesk.math:point3d-1.0.0")。
对于不使用 $typeid 序列化'基元类型为 Null。

DSCore.Data.DataNodeDynamoType.Level
要在 UI 中显示的层次级别

DSCore.Data.DataNodeDynamoType.IsLastChild
如果类型是层次结构的最后一个子级(出于 UI 目的)

DSCore.Data.DataNodeDynamoType.Parent
类型的父级(如果有)