DSCore.String
管理字符串的方法。

DSCore.String.ToNumber(System.String)
将字符串转换为整数或双精度数。
string: 要转换的字符串
整数或双精度数
2number,str2number,strtonumber,string2number,stringtonumber,int,double,cast

DSCore.String.GetNumber(System.String)
从目标字符串中获取所有数字字符串作为字符串
string: 要获取的目标字符串
字符串中的数字
getnumber,tonumber,strtonumber,numberinstring,string2number,stringtonumber,int,double,cast

DSCore.String.Concat(System.String[])
将多个字符串合并为单个字符串。
strings: 要合并的字符串列表。
由字符串列表生成的字符串。
concatenate,join,combine strings

DSCore.String.Length(System.String)
返回给定字符串中包含的字符数。
string: 要查找其长度的字符串
字符串中的字符数
count,size,characters,chars,length,sizeof

DSCore.String.Split(System.String,System.String[])
使用由给定分隔符字符串确定的分段，
将单个字符串拆分为字符串列表。
string: 要拆分的字符串
separators: 确定拆分终点和起点的字符串(若存在)。
由输入字符串生成的字符串列表
divide,separator,delimiter,cut,csv,comma,

DSCore.String.Join(System.String,System.String[])
将多个字符串合并为单个字符串，在每个连接的字符串之间
插入给定分隔符。
separator: 要在连接的字符串之间插入的字符串。
strings: 要连接为单个字符串的字符串。
由包括分隔符字符的字符串列表生成的字符串。
join,separator,build csv,concat,construct

DSCore.String.ToUpper(System.String)
将给定字符串全部转换为大写字符。
string: 要转换为大写的字符串
大写字符串
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.ToLower(System.String)
将给定字符串全部转换为小写字符。
string: 要转换为小写的字符串
小写字符串
2lowercase,to lowercase,tolowercase,lowercase

DSCore.String.ToTitle(System.String)
将给定字符串转换为标题大小写。
str: 要转换为标题大小写的字符串
标题大小写字符串
2titlecase,to titlecase,to title case,totitlecase,titlecase

DSCore.String.ChangeCase(System.String,System.Boolean)
将给定字符串基于布尔参数全部转换为大写字符
或小写字符。
string: 要转换为大写或小写的字符串。
upper: 结果为“True”时转换为大写，结果为“False”时转换为小写。
大小写已转换的字符串。
2lowercase,to lowercase,tolowercase,lowercase,
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.Substring(System.String,System.Int32,System.Int32)
从给定字符串检索子字符串。子字符串始于给定
字符位置并具有给定长度。
string: 要获取其子字符串的字符串
startIndex: 原始字符串中子字符串的起始字符位置
length: 子字符串中的字符数
由原始字符串生成的子字符串
subset,get string,part,smaller string

DSCore.String.Contains(System.String,System.String,System.Boolean)
确定给定字符串是否包含给定子字符串。
string: 要在其中搜索的字符串
searchFor: 要搜索的子字符串
ignoreCase: 比较是否考虑字母大小写
字符串是否包含子字符串
test,within,in,is in,part of

DSCore.String.CountOccurrences(System.String,System.String,System.Boolean)
计算给定字符串内非重叠匹配项的子字符串数。
string: 要在其中搜索的字符串
searchFor: 要搜索的子字符串
ignoreCase: 比较是否考虑字母大小写
字符串中子字符串非重叠匹配项的数量
count,substring,count occurrences,numberof,search,find,within

DSCore.String.Replace(System.String,System.String,System.String)
将字符串中所有匹配项的文字替换为其他文字。
string: 要替换子字符串的字符串。
searchFor: 要替换的文字。
replaceWith: 用以替换的文字。
已替换过的字符串。
replace,overwrite,override,find and replace

DSCore.String.EndsWith(System.String,System.String,System.Boolean)
确定给定字符串是否以给定子字符串结尾。
string: 要搜索其结尾的字符串
searchFor: 要搜索其结尾的子字符串
ignoreCase: 要在比较中忽略字母大小写，则为 true；要考虑字母大小写，则为 false
如果字符串以子字符串开始，则为 true；如果不是，则为 false
test,does end,last,str end,terminated

DSCore.String.StartsWith(System.String,System.String,System.Boolean)
确定给定字符串是否以给定子字符串开头。
string: 要搜索其开头的字符串
searchFor: 要搜索开头的子字符串。
ignoreCase: 要在比较中忽略字母大小写，则为 true；要考虑字母大小写，则为 false
如果字符串以子字符串开始，则为 true；如果不是，则为 false
test,beginswith,start,string start,front

DSCore.String.TrimWhitespace(System.String)
删除给定字符串开头和结尾的所有空格。
string: 要修剪的字符串。
已删除开头和结尾空格的字符串。
trimstring,cleanstring,whitespace,blanks,spaces,string trim

DSCore.String.TrimLeadingWhitespace(System.String)
删除给定字符串开头的所有空格。
string: 要修剪的字符串。
已删除前导空格的字符串。
trim string,clean string,trim leading whitespaces,string trim

DSCore.String.TrimTrailingWhitespace(System.String)
删除给定字符串结尾的所有空格。
string: 要修剪的字符串。
已删除结尾空格的字符串。
trim string,clean string,trim trailing whitespaces,string trim

DSCore.String.IndexOf(System.String,System.String,System.Boolean)
查找字符串内子字符串第一个匹配项从零开始的索引。
如果找不到索引，则返回 -1。
string: 要在其中搜索的字符串
searchFor: 要搜索的子字符串
ignoreCase: 比较是否考虑字母大小写
子字符串第一个匹配项的索引或 -1 (若未找到)
index of,find substring,where,search

DSCore.String.AllIndicesOf(System.String,System.String,System.Boolean)
查找子字符串在字符串内出现的索引列表。
string: 要用于搜索的字符串。
searchFor: 要搜索的子字符串。
ignoreCase: 比较是否考虑字母大小写。
找到子字符串的索引列表(整型)
all indices of,find substring,where,search

DSCore.String.LastIndexOf(System.String,System.String,System.Boolean)
查找字符串内子字符串最后一个匹配项从零开始的索引。
如果找不到索引，则返回 -1。
string: 要在其中搜索的字符串。
searchFor: 要搜索的子字符串。
ignoreCase: 比较是否考虑字母大小写。
子字符串最后一个匹配项的索引或 -1 (若未找到)。
last index of,find substring,where,search

DSCore.String.PadLeft(System.String,System.Int32,System.String)
通过在左侧填充空格达到指定总长度，
使给定字符串的字符右对齐。
string: 要填充的字符串
newLength: 填充后的字符串总长度
padChars: 要用于填充的字符，默认为空格
通过填充前导空格达到指定总长度使字符右对齐的字符串。
pad left,right align,right-align,pad,string space,whitespace

DSCore.String.PadRight(System.String,System.Int32,System.String)
通过在右侧填充空格达到指定总长度，
使给定字符串的字符左对齐。
string: 要填充的字符串
newLength: 填充后的字符串总长度
padChars: 要用于填充的字符，默认为空格
通过填充尾部空格达到指定总长度使字符左对齐的字符串
pad right,left align,left-align,pad string space,whitespace

DSCore.String.Center(System.String,System.Int32,System.String)
通过在原始字符任一侧加入空格来增加字符串长度。
string: 要居中的字符串
newLength: 居中后的字符串总长度
padChars: 要用于居中的字符，默认为空格
通过填充前导或后续空格达到指定总长度
使字符串居中。
center align,center-align,centered,whitespace,expand string,surround

DSCore.String.Insert(System.String,System.Int32,System.String)
在给定索引处将一个字符串插入另一个字符串。
string: 要插入到的字符串。
index: 要插入字符串的索引位置。
toInsert: 要插入的字符串。
已插入子字符串的字符串。
insertstring,insert string

DSCore.String.Remove(System.String,System.Int32,System.Nullable{System.Int32})
删除字符串的字符。
string: 要删除字符的字符串。
startIndex: 要开始删除字符的索引位置。
count: 要删除的字符数，
注意: 如果“计数”为负值，删除过程为从右到左。
已删除字符的字符串。
delete,rem,shorten