DSCore.CurveMapper.GaussianCurve
表示“曲线映射器”中的高斯曲线。
高斯曲线遵循由四个控制点定义的钟形分布。

DSCore.CurveMapper.GaussianCurve.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
指示当前是否正在调整节点大小，以防止意外的控制点更新。

DSCore.CurveMapper.GaussianCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
返回分布在曲线中的 X 和 Y 值。