DSCore.ObjectComparer
使用以下规则执行两个对象的比较函数。
1. 编号都假定为最小，然后是布尔值、字符串和指针。
2. 如果两个对象都为 IComparable 和相同类型，然后使用
其原生比较机制。
3. 如果两个输入为值类型，但其中较大的为布尔值。
4. 否则将它们全部转换为双精度并比较。
5. 否则如果仅有一个值类型，则值类型对象较小。
6. 否则如果仅有一个字符串，则该字符串小于其他字符串。
7. 否则不知道如何比较，因此基于 HashCode 对他们进行最佳比较。