DSCore.ColorRange1D.ByColorsAndParameters(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double})
通过提供颜色列表和参数，创建 ColorRange1D。
colors: 颜色列表。
parameters: 介于 0.0 和 1.0 之间的参数列表。
Returns: 一个 ColorRange1D 对象。

DSCore.ColorRange1D.GetColorAtParameter(DSCore.ColorRange1D,System.Double)
按指定参数返回该颜色范围内的颜色。
parameter: 介于 0.0 和 1.0 之间的值。
Returns: 颜色。

DSCore.ColorRange1D.Default
使用默认颜色方案创建 ColorRange1D。