DSCore.TimeSpan
表示经过的时段(没有具体开始或结束日期)的对象。

DSCore.TimeSpan.ByDateDifference(System.DateTime,System.DateTime)
生成一个新的 TimeSpan，由两个 DateTime 的时间差计算得到。
dateTime: 要减去其的 DateTime
otherDateTime: 要减去的 DateTime
两个日期的 TimeSpan 差

DSCore.TimeSpan.Zero
表示已用时间为零的 TimeSpan。
表示已用时间为零的 TimeSpan

DSCore.TimeSpan.MaxValue
可以表示的最大 TimeSpan。
TimeSpan 表示的可能最大值

DSCore.TimeSpan.MinValue
可以表示的最小 TimeSpan。
TimeSpan 表示的可能最小值

DSCore.TimeSpan.Create(System.Double,System.Double,System.Double,System.Double,System.Double)
由时间的间隔创建新 TimeSpan。
days: 间隔的天数。
hours: 间隔的小时。
minutes: 间隔的分钟。
seconds: 间隔的秒数。
milliseconds: 间隔的毫秒。
创建的 TimeSpan

DSCore.TimeSpan.Scale(System.TimeSpan,System.Double)
将 TimeSpan 乘以比例因子
timeSpan: 要乘以的 TimeSpan
scaleFactor: TimeSpan 的缩放量。例如，缩放系数 2 将生成
双倍的间隔时间量。
TimeSpan 乘积

DSCore.TimeSpan.Negate(System.TimeSpan)
对 TimeSpan 求反
timeSpan: 要求反的 TimeSpan
负 TimeSpan

DSCore.TimeSpan.Add(System.TimeSpan,System.TimeSpan)
加上两个 TimeSpan
timeSpan1: 要加上的 TimeSpan
timeSpan2: 要加上的其他 TimeSpan
相加后得到的 TimeSpan

DSCore.TimeSpan.Subtract(System.TimeSpan,System.TimeSpan)
减去两个 TimeSpan
timeSpan1: 要减去其的 TimeSpan
timeSpan2: 要减去的 TimeSpan
正在从差集生成 TimeSpan

DSCore.TimeSpan.FromString(System.String)
尝试解析字符串中的 TimeSpan
string: TimeSpan 的字符串表示。
已解析字符串中的 TimeSpan

DSCore.TimeSpan.Components(System.TimeSpan)
提取 TimeSpan 的各个分量。
timeSpan: 要获取其分量的 TimeSpan
天数(整型)
小时数(整型)
分钟数(整型)
秒数(整型)
毫秒数(整型)

DSCore.TimeSpan.TotalDays(System.TimeSpan)
将由 TimeSpan 表示的总时间量转换为
不确切的天数。
timeSpan: 要获取其总天数的 TimeSpan
总天数

DSCore.TimeSpan.TotalHours(System.TimeSpan)
将由 TimeSpan 表示的总时间量转换为
不确切的小时数。
timeSpan: 要获取其总小时数的 TimeSpan
总小时数

DSCore.TimeSpan.TotalMinutes(System.TimeSpan)
将由 TimeSpan 表示的总时间量转换为
不确切的分钟数。
timeSpan: 要获取其总分钟数的 TimeSpan
总分钟数

DSCore.TimeSpan.TotalSeconds(System.TimeSpan)
将由 TimeSpan 表示的总时间量转换为
不确切的秒数。
timeSpan: 要获取其总秒数的 TimeSpan
总秒数

DSCore.TimeSpan.TotalMilliseconds(System.TimeSpan)
将由 TimeSpan 表示的总时间量转换为
不确切的毫秒数。
timeSpan: 要获取其总毫秒数的 TimeSpan
总毫秒数