DSCore.Compare
比较方法。

DSCore.Compare.GreaterThan(System.Object,System.Object)
如果 a 大于 b，则返回“True”。
a: 可比较的对象。
b: 可比较的对象。
布尔结果。
larger,bigger

DSCore.Compare.GreaterThanOrEqual(System.Object,System.Object)
如果 a 大于或等于 b，则返回“True”。
a: 可比较的对象。
b: 可比较的对象。
布尔结果。
larger,bigger,equal

DSCore.Compare.LessThan(System.Object,System.Object)
如果 a 小于 b，则返回“True”。
a: 可比较的对象。
b: 可比较的对象。
布尔结果。
less,smaller

DSCore.Compare.LessThanOrEqual(System.Object,System.Object)
如果 a 小于或等于 b，则返回“True”。
a: 可比较的对象。
b: 可比较的对象。
布尔结果。
smaller,equal