DSCore.Math
数学运算的执行方法。

DSCore.Math.Random(System.Nullable{System.Int32})
生成范围 [0, 1) 内的随机双精度数。
seed: 随机数生成器的种子值。
介于 0 和 1 之间的随机数。
random,seed

DSCore.Math.Random(System.Double,System.Double)
生成 [lower_number, higher_number) 范围内的随机数。
value1: 随机数范围的下限。
value2: 随机数范围的上限。
[lower_number, higher_number) 范围内的随机数。
random,numberrange

DSCore.Math.Random(System.Double,System.Double,System.Int32)
根据初始种子值在 [lower_number, higher_number) 范围内生成随机数。
value1: 随机数范围的下限。
value2: 随机数范围的上限。
seed: 随机数生成器的种子值。
[lower_number, higher_number) 范围内的随机数。
random,numberrange,seed

DSCore.Math.RandomList(System.Int32)
生成包含给定数量的范围 [0, 1) 内随机双精度数
的列表。
amount: 结果列表将包含的随机数的数量。
介于 0 和 1 之间的随机数的列表。
random,listcontains

DSCore.Math.RandomList(System.Int32,System.Double,System.Double,System.Int32)
根据初始种子值，在已定义的范围 [lower_number, higher_number)
内生成包含给定数量的随机双精度数的列表。
amount: 结果列表将包含的随机数的数量。
value1: 随机数范围的下限。
value2: 随机数范围的上限。
seed: 随机数生成器的种子值。
[lower_number, higher_number) 范围内的随机数的列表。
random,listcontains,seed

DSCore.Math.PiTimes2
Pi 常数乘以 2
2 乘 Pi。
2pi,2*pi,twopi,two*pi

DSCore.Math.Average(System.Collections.Generic.IList{System.Double})
求数字列表的平均值。
numbers: 要求解平均值的数字列表。
数字列表的平均值。
avg,mean

DSCore.Math.Map(System.Double,System.Double,System.Double)
根据输入范围，将输入值映射到 0 和 1 之间的数字。
rangeMin: 输入范围的最小值。
rangeMax: 输入范围的最大值。
inputValue: 要映射的数字。
映射的值。
map,range,minimum,maximum,normalize,scale,remap

DSCore.Math.MapTo(System.Double,System.Double,System.Double,System.Double,System.Double)
将输入值映射到介于 targetRangeMin 和 targetRangeMax 之间的数字。
rangeMin: 输入范围的最小值。
rangeMax: 输入范围的最大值。
inputValue: 要映射的数字。
targetRangeMin: 新范围的最小值。
targetRangeMax: 新范围的最大值。
映射的值。
map,range,mapto,minimum,maximum,normalize,scale,remap

DSCore.Math.RemapRange(System.Collections.Generic.IList{System.Double},System.Double,System.Double)
调整数字列表的范围，同时保留
分布率。
numbers: 要调整范围的数字列表。
newMin: 新的范围最小值。
newMax: 新的范围最大值
重新映射到新范围的列表。
remap range

DSCore.Math.kRadiansToDegrees
将此功能/方法从 Math.dll 移动到该 DSCoreNode.dll

DSCore.Math.PI
数学常数 Pi，即 3.14159...
常数 Pi
3.141592653589793

DSCore.Math.E
数学常数 e，即 2.71828...
常数 e
exp,2.718281828459045

DSCore.Math.GoldenRatio
黄金比例，即 (1 + sqrt(5))/2 = 1.61803...
黄金比例
golden,ratio,divine,phi,tau,1.61803398875

DSCore.Math.RadiansToDegrees(System.Double)
将以弧度为单位的角度换算为以度为单位的角度。
radians: 以弧度为单位的角度。
以度为单位的角度。
radians,degrees,angle

DSCore.Math.DegreesToRadians(System.Double)
将以度为单位的角度换算为以弧度为单位的角度。
degrees: 以度为单位的角度。
以弧度为单位的角度。
degrees,radians,angle

DSCore.Math.Abs(System.Double)
查找数字的绝对值。
number: 要获取其绝对值的数字
数字的绝对值
absolute value,magnitude

DSCore.Math.Equals(System.Double,System.Double,System.Double)
此方法仅供“等于”(带有公差) NodeModel 节点使用

DSCore.Math.Abs(System.Int64)
查找数字的绝对值。
integer: 数字。
数字的绝对值。
absolute value,magnitude

DSCore.Math.Acos(System.Double)
查找余弦为给定比率的角度的反余弦。
ratio: 角度的余弦，范围为 [-1, 1]。
余弦为输入比率的角度。
acosine,arccosine

DSCore.Math.Asin(System.Double)
查找正弦为给定比率的角度的反正弦。
ratio: 角度的正弦，范围为 [-1, 1]。
正弦为输入比率的角度
asine,arcsin

DSCore.Math.Atan(System.Double)
查找正切为给定比率的角度的反正切。
ratio: 角度的正切。
正切为输入比率的角度
atangent,arctangent

DSCore.Math.Atan2(System.Double,System.Double)
查找两个数字商的反正切。返回的角度
的正切为比率: 分子/分母。
numerator: 角度正切的分子。
denominator: 角度正切的分母。
正切为分子/分母的角度
atangent,arctangent

DSCore.Math.Ceiling(System.Double)
返回大于此数字的第一个整数
number: 要向上舍入的数字。
大于此数字的第一个整数
ceiling,round

DSCore.Math.Cos(System.Double)
查找角度的余弦。
angle: 要求解余弦的以度为单位的角度。
角度的余弦
cosine

DSCore.Math.Cosh(System.Double)
查找角度(弧度)的双曲余弦。
angle: 以弧度为单位的角度。
角度的双曲余弦
hyperbolic cosine

DSCore.Math.DivRem(System.Int64,System.Int64)
查找被除数/除数的余数。
dividend: 被除数。
divisor: 除数。
除法的余数
remainder

DSCore.Math.EvaluateFormula(System.String,System.String[],System.Object[])
通过给定参数映射计算 NCalc 公式。
formulaString: NCalc 公式
parameters: 变量名称
arguments: 变量绑定
类型: var[]..[] (公式计算结果)

DSCore.Math.Exp(System.Double)
返回数字的指数，数值的常数 e 次幂。
number: 数字。
数字的指数。
exponential

DSCore.Math.Floor(System.Double)
返回小于此数字的第一个整数。
number: 要向下舍入的数字
小于此数字的第一个整数
round

DSCore.Math.Log(System.Double)
查找范围 (0, ∞) 内数字的自然对数。
number: 大于 0 的数字。
数字的自然对数。
natural,logarithm,ln

DSCore.Math.Log(System.Double,System.Double)
查找指定底数的数字的对数。
number: 大于 0 的数字。
logBase: 范围 [0,1),(1, ∞) 内对数的底数。
数字的对数。
logarithm,ld,lg

DSCore.Math.Log10(System.Double)
查找以 10 为底数的数字的对数。
number: 大于 0 的数字。
数字的对数。
logarithm

DSCore.Math.Max(System.Double,System.Double)
返回两个数字中的较大值。
value1: 要比较的数字。
value2: 要比较的数字。
两个数字中的较大值。
maximum,greater,larger

DSCore.Math.Max(System.Int64,System.Int64)
返回两个数字中的较大值。
int1: 要比较的数字。
int2: 要比较的数字。
两个数字中的较大值。
maximum,greater,larger

DSCore.Math.Min(System.Double,System.Double)
返回两个数字中的较小值。
value1: 要比较的数字。
value2: 要比较的数字。
两个数字中的较小值。
minimum,lesser,smaller

DSCore.Math.Min(System.Int64,System.Int64)
返回两个数字中的较小值。
int1: 要比较的数字。
int2: 要比较的数字。
两个数字中的较小值。
minimum,lesser,smaller

DSCore.Math.Pow(System.Double,System.Double)
求数字的指定次幂。
number: 要进行幂运算的数字。
power: 数字幂运算的幂。
数字幂运算的幂。
^,power,raise,exponent

DSCore.Math.Rand
生成范围 [0, 1) 内的随机数。
范围 [0, 1) 内的随机数。
random,numberrange

DSCore.Math.Round(System.Double)
将数字舍入到最接近的整数值。
请注意，此方法将返回一个双精度浮点数，而不是整数类型。
number: 要舍入的数字。
最接近此数字的整数值。

DSCore.Math.Round(System.Double,System.Int32)
将数字舍入为指定数字的小数位数。
number: 要舍入的数字
digits: 返回值中的小数位数
最接近值的数字，其中包含与数字相等的小数位数

DSCore.Math.Sign(System.Double)
返回数字符号: -1、0 或 1。
number: 要获取其符号的数字
数字的符号: -1、0 或 1

DSCore.Math.Sign(System.Int64)
返回数字符号: -1、0 或 1。
int: 要获取其符号的整数
数字的符号: -1、0 或 1

DSCore.Math.Sin(System.Double)
查找角度的正弦。
angle: 要求解正弦的以度为单位的角度。
角度的正弦。
sine

DSCore.Math.Sinh(System.Double)
查找角度(弧度)的双曲正弦。
angle: 以弧度为单位的角度。
角度的双曲正弦。
hyperbolic

DSCore.Math.Sqrt(System.Double)
查找范围 [0, ∞) 内数字的正平方根。
number: 范围 [0, ∞) 内的数字。
数字的正平方根。
square,root,radical

DSCore.Math.Tan(System.Double)
查找角度的正切。
angle: 角度(以弧度为单位)
角度的正切
tangent

DSCore.Math.Tanh(System.Double)
查找角度(弧度)的双曲正切。
angle: 角度(以弧度为单位)
角度的双曲正切
hyperbolic,tanh

DSCore.Math.Sum(System.Collections.Generic.IEnumerable{System.Double})
查找一系列数字的总和
values: 要加上以求和的数字
数值的总和
mass addition,massadd

DSCore.Math.Factorial(System.Int64)
查找正整数的阶乘结果。
number: 正整数
整数的阶乘结果。
!

DSCore.Math.Xor(System.Boolean,System.Boolean)
布尔 XOR: 当且仅当一个输入内容为“是”时，才会返回“是”。
bool: 布尔值
otherBool: 其他布尔值
布尔结果
xor,exclusive,or

DSCore.Math.DoCheckedCast(System.Double)
在选中的上下文中执行对长值的转换。如果操作产生溢出，
则会发出警告并返回溢出结果。
value: 要执行的操作
Returns: 操作的结果