DSCore.IO.FileSystem
处理文件的方法。

DSCore.IO.FileSystem.AbsolutePath(System.String,System.String)
返回给定路径的绝对路径。如果给定路径是
相对路径，则会根据当前工作空间
进行解析。如果文件不在相对路径而位于
给定 hintPath，则会返回 hintPath。
path: 相对路径或完整路径
hintPath: 最后一个解析路径
Returns: 绝对路径

DSCore.IO.FileSystem.FileFromPath(System.String)
从给定文件路径创建文件对象。

DSCore.IO.FileSystem.ReadText(System.IO.FileInfo)
读取文本文件并作为字符串返回内容。
file: 要从中读取文本的文件对象
文本文件的内容。
read file,text,file

DSCore.IO.FileSystem.MoveFile(System.String,System.String,System.Boolean)
将指定文件移动到新位置
path: 现有路径的字符串表示
newPath: 新路径的字符串表示
overwrite: 切换为覆盖现有文件
节点执行任务，不产生输出

DSCore.IO.FileSystem.DeleteFile(System.String)
删除指定文件。
path: 要删除的文件路径
节点执行任务，不产生输出

DSCore.IO.FileSystem.CopyFile(System.IO.FileInfo,System.String,System.Boolean)
复制文件。
file: 要复制的文件对象
destinationPath: 目标文件路径的字符串表示
overwrite: 切换为覆盖现有文件
节点执行任务，复制操作成功时返回 True。

DSCore.IO.FileSystem.FileExists(System.String)
确定某个文件是否存在于给定路径中。
path: 表示文件路径的字符串
如果文件存在，则为 true；如果不是，则为 false
filepath

DSCore.IO.FileSystem.WriteText(System.String,System.String)
将文字内容写入按路径指定的文件
filePath: 要写入到的路径
text: 文字内容
无输出
write file,text,file,filepath

DSCore.IO.FileSystem.AppendText(System.String,System.String)
将文字内容附加到按路径指定的文件
filePath: 要写入到的路径
text: 文字内容
节点执行任务，不产生输出
append file,write file,text,file,filepath

DSCore.IO.FileSystem.CombinePath(System.String[])
将多个字符串合并为单个文件路径。
strings: 要合并为路径的字符串
合并的文件路径

DSCore.IO.FileSystem.FileExtension(System.String)
从文件路径返回扩展名。
path: 要获取其扩展名的路径
文件扩展名

DSCore.IO.FileSystem.ChangePathExtension(System.String,System.String)
更改文件路径扩展名。
path: 要更改其扩展名的路径
newExtension: 新扩展名的字符串表示
扩展名已更改的文件路径

DSCore.IO.FileSystem.DirectoryName(System.String)
返回文件路径的目录名。
path: 要获取其目录信息的路径
文件路径的目录名
directorypath

DSCore.IO.FileSystem.FileName(System.String,System.Boolean)
返回文件路径的文件名。
path: 要获取其文件名的路径
withExtension: 切换为在结果中包含扩展名
文件路径中的文件名

DSCore.IO.FileSystem.FileHasExtension(System.String)
确定文件路径是否包含扩展名。
path: 要查找扩展名的路径
如果文件路径包含扩展名，则为 true；如果不是，则为 false

DSCore.IO.FileSystem.GetDirectoryContents(System.IO.DirectoryInfo,System.String,System.Boolean)
将返回包含在给定目录内的文件和目录的列表。可选的 searchString 可用于过滤结果。
directory: 要获取其内容的目录
searchString: 用于过滤结果的搜索字符串
includeSubdirectories: 设置为“true”以包含子目录中的文件和文件夹(递归)，或设置为“false”以仅包含给定目录的顶层结果。
通过查询得到的文件
通过查询得到的目录

DSCore.IO.FileSystem.CopyDirectory(System.IO.DirectoryInfo,System.String,System.Boolean)
将目录复制到目标位置。
directory: 要复制的目录
destinationPath: 磁盘上复制操作的目标
overwriteFiles: 切换为覆盖现有目录
节点执行任务，不产生输出

DSCore.IO.FileSystem.DeleteDirectory(System.String,System.Boolean)
删除目录。
path: 磁盘上指向目录的路径
recursive: 是否删除此目录的所有内容，默认值为“False”。
节点执行任务，不产生输出

DSCore.IO.FileSystem.DirectoryExists(System.String)
确定给定路径是否存在目录。
path: 磁盘上指向目录的路径
如果目录存在，则为 true；如果不是，则为 false
directorypath

DSCore.IO.FileSystem.MoveDirectory(System.String,System.String,System.Boolean)
将目录移动到新位置。
path: 现有路径的字符串表示
newPath: 新路径的字符串表示
overwriteFiles: 切换为覆盖现有文件
节点执行任务，不产生输出