DSCore.Properties.Resources
强类型资源类别，用于查看本地化字符串等。

DSCore.Properties.Resources.ResourceManager
返回该类别所用的缓存 ResourceManager 实例。

DSCore.Properties.Resources.Culture
使用该强类型资源类别，替换用于查找所有资源的
当前线程的 CurrentUICulture 特性。

DSCore.Properties.Resources.BitmapOverflowError
查找类似“提供的颜色数据太大，无法适应图像边界。”的本地化字符串。

DSCore.Properties.Resources.CurveMapperEqualMinMaxWarning
查找类似“• 最小值和最大值必须不同。”的本地化字符串。

DSCore.Properties.Resources.CurveMapperInvalidCountWarning
查找类似“• 值必须是数字列表或单个数字≥ 2。”的本地化字符串。

DSCore.Properties.Resources.CurveMapperInvalidCurveWarning
查找类似“• 选定曲线的控制点无效。”的本地化字符串。

DSCore.Properties.Resources.CurveMapperInvalidXYFormatWarning
查找类似“• X 和 Y 输入必须是单个数字(而非列表)。”的本地化字符串。

DSCore.Properties.Resources.DefineDataSupportedInputValueExceptionMessage
查找类似“输入必须是单个值或非嵌套列表。”的本地化字符串。

DSCore.Properties.Resources.DefineDataUnexpectedInputExceptionMessage
查找类似“此节点预计需要 {0} 输入，但却收到 {1} 输入。请提供预计输入，或在节点的下拉菜单中拾取新类型。”的本地化字符串。

DSCore.Properties.Resources.DefineDataUnsupportedCombinationOfDataTypesExceptionMessage
查找类似“此节点不支持当前输入列表 {0} 中的数据类型组合。请确保输入列表包含相同数据类型的项，或包含具有公共父类型的混合类型的项。”的本地化字符串。

DSCore.Properties.Resources.DefineDataUnsupportedDataTypeExceptionMessage
查找类似“此节点不支持当前输入数据类型({0})。请在下拉菜单中查看支持的数据类型。”的本地化字符串。

DSCore.Properties.Resources.EnumDateOfWeekFriday
查找类似“星期五”的本地化字符串。

DSCore.Properties.Resources.EnumDateOfWeekMonday
查找类似“星期一”的本地化字符串。

DSCore.Properties.Resources.EnumDateOfWeekSaturday
查找类似“星期六”的本地化字符串。

DSCore.Properties.Resources.EnumDateOfWeekSunday
查找类似“星期日”的本地化字符串。

DSCore.Properties.Resources.EnumDateOfWeekThursday
查找类似“星期四”的本地化字符串。

DSCore.Properties.Resources.EnumDateOfWeekTuesday
查找类似“星期二”的本地化字符串。

DSCore.Properties.Resources.EnumDateOfWeekWednesday
查找类似“星期三”的本地化字符串。

DSCore.Properties.Resources.Exception_Deserialize_Bad_Format
查找类似“{0} 类型的 json 格式设置不正确”的本地化字符串。

DSCore.Properties.Resources.Exception_Deserialize_Unsupported_Cache
查找类似“无法加载存储的数据。”的本地化字符串。

DSCore.Properties.Resources.Exception_Serialize_Depth_Unsupported
查找类似“深度 {0} 超过路径为‘{2}’的最大深度 {1}”的本地化字符串。

DSCore.Properties.Resources.Exception_Serialize_DesignScript_Unsupported
查找类似“此类几何图形无法序列化。”的本地化字符串。

DSCore.Properties.Resources.Exception_Serialize_Unsupported_Type
查找类似“无法存储 {0} 类型的数据。”的本地化字符串。

DSCore.Properties.Resources.ExportToCSVObsolete
查找类似“而是使用 Data.ExportCSV 节点”的本地化字符串。

DSCore.Properties.Resources.FactorialNegativeInt
查找类似“Math.Factorial 的输入值不能为负。”的本地化字符串。

DSCore.Properties.Resources.FactorialOverflow
查找类似“Math.Factorial 的返回值已超出范围。”的本地化字符串。

DSCore.Properties.Resources.FindPointsWithinRadiusNullPointMessage
查找类似“必须提供一个中心点。”的本地化字符串。

DSCore.Properties.Resources.FindPointsWithinRadiusSearchRadiusMessage
查找类似“搜索半径不能为零。”的本地化字符串。

DSCore.Properties.Resources.FromObjectObsolete
查找类似“此节点已过时，请使用‘对象的字符串’”的本地化字符串。

DSCore.Properties.Resources.IntegerOverflow
查找类似“操作导致整数溢出。其结果可能异常。”的本地化字符串。

DSCore.Properties.Resources.InvalidDestinationPathErrorMessage
查找类似“用作复制路径的目标文件路径无效。”的本地化字符串。

DSCore.Properties.Resources.InvalidKeysErrorMessage
查找类似于“一个或多个输入类型不匹配。用列表作关键字不受支持。”的本地化字符串。

DSCore.Properties.Resources.InvalidKeysLenghtErrorMessage
查找类似“项目数与关键字数不匹配。”的本地化字符串。href=InvalidKeysLenghtErrorMessage.html。

DSCore.Properties.Resources.LoadImageFromPathObsolete
查找类似“而是使用 File.FromPath -> Image.ReadFromFile 节点”的本地化字符串。

DSCore.Properties.Resources.MissingPythonEngine
查找类似于“找不到选定的 Python 引擎”的本地化字符串。

DSCore.Properties.Resources.ObjectArgumentExceptionMessage
查找类似于“对象不能为空，请提供适当的值。”的本地化字符串。

DSCore.Properties.Resources.QuadtreeConstructionEmptyUVSetMessage
查找类似“无法由空点集构造四叉树。”的本地化字符串。

DSCore.Properties.Resources.QuadtreeConstructionNullUVSetMessage
查找类似“无法由空 UV 集构造四叉树。”的本地化字符串。

DSCore.Properties.Resources.ReadImageObsolete
查找类似“而是使用 File.FromPath -> Image.ReadFromFile -> Image.Pixels 节点”的本地化字符串。

DSCore.Properties.Resources.ReadTextObsolete
查找类似“而是使用 File.FromPath -> File.ReadText 节点。”的本地化字符串。

DSCore.Properties.Resources.StringRemoveCountOutOfRangeMessage
查找类似“计数超出范围！”的本地化字符串。

DSCore.Properties.Resources.StringRemoveStartIndexOutOfRangeMessage
查找类似“开始索引超出范围！”的本地化字符串。

DSCore.Properties.Resources.StringToNumberInvalidNumberMessage
查找类似“不是有效数字。”的本地化字符串。

DSCore.Properties.Resources.WebRequestNullUrlMessage
查找类似类似“url 不能为空。”的本地化字符串。

DSCore.Properties.Resources.WriteImageObsolete
查找类似“而是使用 Image.WriteToFile 节点”的本地化字符串。