DSCore.CurveMapper.CurveBase
表示“曲线映射器”中所有曲线类型的基类。
提供用于生成和检索曲线值的常用功能。

DSCore.CurveMapper.CurveBase.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
要由派生类实现的用于生成曲线值的抽象方法。

DSCore.CurveMapper.CurveBase.GetCurveXValues(System.Collections.Generic.List{System.Double},System.Boolean)
检索 X 值的常用方法。

DSCore.CurveMapper.CurveBase.GetCurveYValues(System.Collections.Generic.List{System.Double},System.Boolean)
检索 Y 值的常用方法。

DSCore.CurveMapper.CurveBase.GenerateFromDomain(System.Collections.Generic.List{System.Double},System.Func{System.Double,System.Double})
通过将域输入映射到画布空间并对曲线函数求值来生成 X 和 Y 值。