DSCore.DateTime
表示特定日期和时间的对象。

DSCore.DateTime.MinValue
可以表示的最早日期和时间。
DateTime 表示的可能最小值

DSCore.DateTime.MaxValue
可以表示的最晚日期和时间。
DateTime 表示的可能最大值

DSCore.DateTime.Now
当前系统日期和时间。
表示当前时间的 DateTime

DSCore.DateTime.Today
当前系统日期，时间设置为午夜。
表示今天的 DateTime

DSCore.DateTime.Format(System.DateTime,System.String)
按指定格式将指定日期和时间返回为字符串。
dateTime: 要设置格式的 DateTime
format: 日期格式的字符串表示。使用 InvariantCulture 可独立于用户的操作系统语言进行输出。
默认为标准格式 "F":“2017 年 2 月 21 日星期二，23:02:43”。
搜索“MSDN 自定义日期和时间格式字符串”获取完整的格式说明符列表。
表示为字符串的 DateTime

DSCore.DateTime.ByDate(System.Int32,System.Int32,System.Int32)
在确切日期创建新 DateTime。
year: 确切年份 (1-9999)
month: 确切月份 (1-12)
day: 确切日期 (1-[具体日期])
创建自日期的 DateTime

DSCore.DateTime.ByDateAndTime(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
在确切日期和时间创建新 DateTime。
year: 确切年份 (1-9999)
month: 确切月份 (1-12)
day: 确切日期 (1-[具体日期])
hour: 确切小时 (0-23)
minute: 确切分钟 (0-59)
second: 确切秒钟 (0-59)
millisecond: 确切毫秒 (0-999)
创建自日期和时间的 DateTime

DSCore.DateTime.SubtractTimeSpan(System.DateTime,System.TimeSpan)
DateTime 减去 TimeSpan，生成新 DateTime。
dateTime: 起始 DateTime
timeSpan: 要减去的时间量
相减后得到的 DateTime

DSCore.DateTime.AddTimeSpan(System.DateTime,System.TimeSpan)
DateTime 加上 TimeSpan，生成新 DateTime。
dateTime: 起始 DateTime
timeSpan: 要加到 DateTime 的时间量
加上时间间隔后得到的 DateTime

DSCore.DateTime.DaysInMonth(System.Int32,System.Int32)
计算给定年份的给定月份有多少天。
year: 确切年份 (1-9999)
month: 确切月份 (1-12)
月份的天数

DSCore.DateTime.IsDaylightSavingsTime(System.DateTime)
确定给定 DateTime 是否为夏令时。
dateTime: 用于确定是否有夏令时的 DateTime
如果 DateTime 是夏令时时间，则为 true；如果不是，则为 false

DSCore.DateTime.IsLeapYear(System.Int32)
确定给定年份是否为闰年。
year: 确切年份 (1-9999)
如果年份是闰年，则为 true；如果不是，则为 false

DSCore.DateTime.FromString(System.String)
尝试解析字符串中的 DateTime
string: DateTime 的字符串表示
已解析字符串中的 DateTime

DSCore.DateTime.Date(System.DateTime)
仅提取 DateTime 的日期。时间分量设定为 0。
dateTime: DateTime。
日期起始于 DateTime
Date

DSCore.DateTime.Components(System.DateTime)
提取 DateTime 的各个分量。
dateTime: 要获取其分量的 DateTime
年份的数字表示(1-9999)
月份的数字表示(1-12)
日的数字表示(1-[当月天数])
小时的数字表示(0-23)
分钟的数字表示(0-59)
秒的数字表示(0-59)
毫秒的数字表示(0-999)

DSCore.DateTime.DayOfWeek(System.DateTime)
从给定 DateTime 返回一星期中的某一天。
dateTime: 要获取其一周中的某天的 DateTime 对象
一周中的某天

DSCore.DateTime.DayOfYear(System.DateTime)
返回年份的具体某一天 (0-366)
dateTime: 要获取年份的具体某一天的 DateTime
从起始年份算起的天数

DSCore.DateTime.TimeOfDay(System.DateTime)
生成新 TimeSpan，表示自给定 DateTime 的
午夜起经过的时间量。
dateTime: DateTime。
从午夜开始的 TimeSpan