DSCore.CurveMapper.BezierCurve
表示“曲线映射器”中的贝塞尔曲线。
贝塞尔曲线由四个控制点定义，并提供平滑插值。

DSCore.CurveMapper.BezierCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
获取基于指定参数和限制的插值 Y 值。