DSCore.Color.Red
查找颜色的红色分量，0 到 255。
RGB 颜色模型的红色值，介于 0 和 255 (含)之间的整数。

DSCore.Color.Green
查找颜色的绿色分量，0 到 255。
RGB 颜色模型的绿色值，介于 0 和 255 (含)之间的整数。

DSCore.Color.Blue
查找颜色的蓝色分量，0 到 255。
RGB 颜色模型的蓝色值，介于 0 和 255 (含)之间的整数。

DSCore.Color.Alpha
查找颜色的 Alpha 分量，0 到 255。
Alpha 值，介于 0 和 255 (含)之间的整数。

DSCore.Color.ByARGB(System.Int32,System.Int32,System.Int32,System.Int32)
按 Alpha、红色、绿色和蓝色分量构造颜色。
alpha: Alpha 值(介于 0 和 255 (含)之间)
red: RGB 颜色模型的红色值(介于 0 和 255 (含)之间)
green: RGB 颜色模型的绿色值(介于 0 和 255 (含)之间)
blue: RGB 颜色模型的蓝色值(介于 0 和 255 (含)之间)
从 ARGB 创建的颜色
color

DSCore.Color.Brightness(DSCore.Color)
返回该颜色的亮度值。
color: 要查询亮度的颜色
亮度值(介于 0 和 1 (含)之间)

DSCore.Color.Saturation(DSCore.Color)
返回该颜色的饱和度值。
介于 0 和 1 (含)之间的饱和度值(双精度)。

DSCore.Color.Hue(DSCore.Color)
返回该颜色的色调值。
color: 颜色对象
颜色的色调值，介于 0 和 1 (含)之间的双精度数。
hues

DSCore.Color.Components(DSCore.Color)
按以下顺序列出颜色分量: Alpha、红、绿、蓝。
color: 颜色对象
Alpha 值，介于 0 和 255 (含)之间的整数。
RGB 颜色模型的红色值，介于 0 和 255 (含)之间的整数。
RGB 颜色模型的绿色值，介于 0 和 255 (含)之间的整数。
RGB 颜色模型的蓝色值，介于 0 和 255 (含)之间的整数。
alpha,red,green,blue

DSCore.Color.BuildColorFrom1DRange(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double},System.Double)
从起点颜色和终点颜色之间的颜色渐变中返回颜色。
parameters: 沿颜色采样范围为介于 0 和 1 之间的值。
给定范围内的颜色。
color,range,gradient

DSCore.Color.Lerp(DSCore.Color,DSCore.Color,System.Double)
两种颜色之间的线性插补。
start: 起点颜色。
end: 终点颜色。
t: 介于 0.0 和 1.0 之间的参数。
Returns: 插补的颜色或白色。

DSCore.Color.Blerp(System.Collections.Generic.IList{DSCore.Color.IndexedColor2D},Autodesk.DesignScript.Geometry.UV)
颜色集之间的双线性插补。
Returns: 插补的颜色或白色。
This algorithm is not the same as the solution found from wikipedia
(reference: https://en.wikipedia.org/wiki/Bilinear_interpolation)

DSCore.Color.Add(DSCore.Color,DSCore.Color)
通过合并两个现有颜色的 ARGB 值来构造颜色。
color: 要添加的颜色
otherColor: 要添加的其他颜色
添加两种颜色后的颜色结果

DSCore.Color.Multiply(DSCore.Color,System.Double)
将输入颜色乘以数字会产生较深的颜色。输入颜色必须具有小于 255 的 Alpha 值。
color: 要乘以的颜色
multiplier: 乘数值
相乘后的颜色结果

DSCore.Color.Divide(DSCore.Color,System.Double)
将输入颜色除以数字会产生较浅的颜色并移除颜色色调
color: 要除以的颜色
dividend: 被除数值
相除后的颜色结果