DSCore.List
列表的创建和操纵方法。

DSCore.List.Empty
返回一个空列表。
空列表。
empty list, emptylist,[]

DSCore.List.UniqueItems(System.Collections.IList)
创建包含给定列表中所有唯一项的新列表。
list: 要用于过滤出重复项的列表。
已过滤的列表。
removes,duplicates,remove duplicates,cull duplicates,distinct,listcontains

DSCore.List.Contains(System.Collections.IList,System.Object)
确定给定列表是否包含给定条目。此功能会完全搜索所包含的子列表。
list: 要在其中搜索的列表
item: 要查找的条目
如果列表包含条目，则为 true；如果不是，则为 false
item,search,in,listcontains

DSCore.List.IsHomogeneous(System.Collections.IList)
检查列表中的条目是否类型相同。
list: 要检查是否同质的列表。
列表是否均质。
homogeneous,allequal,same,type

DSCore.List.IsRectangular(System.Collections.IList)
检查列表中所有行中的条目数是否相同。
list: 要检查行是否具有相同数量条目的列表。
列表是否在所有行中具有相同的条目数。
rectangular,isrectangular,same,sublist,row

DSCore.List.IsUniformDepth(System.Collections.IList)
检查列表中的条目是否深度相同。
list: 要检查项目是否深度相同的列表。
列表深度是否统一。
depth,uniform,isuniformdepth,sublist,jagged

DSCore.List.SetDifference(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
返回新列表，其中包含 List1 中的对象，但排除 List2 中的对象。
list1: 要包含在新列表中的对象列表
list2: 要在新列表中排除的对象列表
包含 List1 中但不包含 List2 中对象的新列表
difference,setdifference,set

DSCore.List.SetIntersection(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
返回新列表，其中同时包含 List1 和 List2 中的对象。
list1: 要与 list2 进行比较的对象列表
list2: 要与 list1 进行比较的对象列表
同时包含 List1 和 List2 中对象的新列表
intersection,setintersection,set,overlap

DSCore.List.SetUnion(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
返回新列表，其中包含 List1 或 List2 中的对象。
list1: 要包含的对象列表
list2: 要包含在 List1 中的对象列表
包含 List1 或 List2 中对象的新列表
union,setunion,set

DSCore.List.IndexOf(System.Collections.IList,System.Object)
返回给定列表中图元的索引。给定列表和目标图元之间的匹配必须是严格匹配(即 int 对应 int、double 对应 double、string 对应 string、object 对应 object 等)。
list: 要在其中查找图元的列表。
element: 要返回索引的图元。
列表中图元的索引。如果未找到严格匹配，将返回无效索引 -1。
index,indexof

DSCore.List.CountFalse(System.Collections.IList)
返回给定列表中“否”布尔值的数量。
list: 用来查找“否”布尔值的列表。
列表中“否”布尔值的数量。
false,count

DSCore.List.CountTrue(System.Collections.IList)
返回给定列表中“是”布尔值的数量。
list: 用来查找“是”布尔值的列表。
列表中布尔值的数量。
true,count

DSCore.List.Insert(System.Collections.IList,System.Object,System.Int32)
将图元插入指定索引的列表中。
list: 将插入图元的列表
element: 要插入的图元
index: 指定要插入的图元在列表中的位置
包含已插入图元的列表
insert,add

DSCore.List.Reorder(System.Collections.IList,System.Collections.IList)
根据索引的给定列表，重新排序输入列表。
list: 要重新排序的列表
indices: 用于对列表中的条目重新排序的索引
重新排序的列表
reorder,index,indices

DSCore.List.SortIndexByValue(System.Collections.Generic.List{System.Double})
按条目排序列表并返回索引。
list: 要进行排序的条目列表
已排序列表中条目的索引
sort,index,value

DSCore.List.NormalizeDepth(System.Collections.IList,System.Int32)
根据给定等级，返回 multidimensional 列表。
list: 深度要根据等级进行标准化的列表。
rank: 列表要进行标准化的等级。默认值为 1。
已标准化等级的列表。
depth,normalize

DSCore.List.Reverse(System.Collections.IList)
以相反顺序创建包含给定列表各项的新列表。
list: 要颠倒顺序的列表。
已颠倒顺序的列表
flip,listcontains

DSCore.List.__Create(System.Collections.IList)
创建包含给定项的新列表。
items: 要存储在新列表中的项目。

DSCore.List.Sublists(System.Collections.IList,System.Collections.IList,System.Int32)
使用 DesignScript 范围语法由列表构建子列表。
list: 要用于创建子列表的列表。
ranges: 子列表元素的索引范围。
例如 \"{0..3,5,2}\"
offset: 要应用到子列表的偏移。
例如，偏移量为 2 的范围 \"0..3\" 会生成
{0,1,2,3}{2,3,4,5}{4,5,6,7}...
类型: var[]..[]
sublists,build sublists,subset,

DSCore.List.Sort(System.Collections.Generic.IEnumerable{System.Object})
使用内置自然排序给列表排序。
list: 要排序的列表
已排序的列表
sort,order,sorted

DSCore.List.MinimumItem(System.Collections.Generic.IEnumerable{System.Object})
从列表返回最小值。
list: 要获取其最小值的可比较条目列表
列表中的最小值条目。
least,smallest,find min

DSCore.List.MaximumItem(System.Collections.Generic.IEnumerable{System.Object})
返回列表的最大值。
list: 要获取其最大值的可比较条目列表
列表中的最大值条目。
greatest,largest,biggest,find max

DSCore.List.FilterByBoolMask(System.Collections.IList,System.Collections.IList)
通过在单独布尔列表中查找相应索引
过滤序列。
list: 要过滤的列表。
mask: 表示掩码的布尔列表。
掩码索引为“True”的项。
掩码索引为“False”的项。
filter,in,out,mask,dispatch,bool filter,boolfilter,bool filter

DSCore.List.Deconstruct(System.Collections.IList)
给定列表，生成列表第一项和包含除第一项外所有项
的新列表。
list: 要拆分的列表。
列表的第一项(类型: var[]..[])
列表的其余项(类型: var[]..[])
first,rest,list split,listcontains

DSCore.List.SortByKey(System.Collections.IList,System.Collections.IList)
根据列表关键字对列表进行排序
list: 要排序的列表
keys: 关键字列表，关键字必须可排序(例如，数字、字符串)
类型: var[]..[]
类型: var[]..[]
sort;key

DSCore.List.GroupByKey(System.Collections.IList,System.Collections.IList)
根据项目的关键值将其编组到子列表
list: 要编组为子列表的项目列表
keys: 关键值(输入列表中每项一个)用于编组项目
子列表清单，包含按关键值编组的项目
关键值对应于每个组
list;group;groupbykey;

DSCore.List.GroupBySimilarity(System.Collections.IList,System.Double,System.Boolean)
聚类根据元素索引的邻接性和值的相似性列出元素
list: 要根据邻接性和相似性分组为子列表的项目列表
tolerance: 对类似项目进行分组的阈值
considerAdjacency: 用于控制节点是否应考虑邻接性的布尔值。
包含按相似值分组的项目的子列表
包含分组值的原始索引的子列表
list;group;similar;adjacent;adjacency;groupbyadjacency;groupadjacentitems;groupsimilaritems;cluster;tolerance

DSCore.List.LevenshteinDistance(System.String,System.String)
编辑距离是用于获取 2 个字符串之间距离的算法
|源

DSCore.List.AddItemToFront(System.Object,System.Collections.IList)
在列表开头添加一项。
item: 要添加的项目。项目可以是对象或列表。
list: 要用于添加项的列表。
包含已添加项的列表
insert,add,item,front,start,begin

DSCore.List.AddItemToEnd(System.Object,System.Collections.IList)
在列表末尾添加一项。
item: 要添加的项目。项目可以是对象或列表。
list: 要用于添加项的列表。
包含已添加项的列表
insert,add,item,end

DSCore.List.TakeItems(System.Collections.IList,System.Int32)
从列表开始部分提取一些项。
list: 要用于提取项的列表。
amount: 要提取的项数。如果为负值，则从列表结尾开始提取项。
已提取项的列表。
get,sub,sublist,extract

DSCore.List.DropItems(System.Collections.IList,System.Int32)
从列表开始删除一些项目。数量为负值时，
从列表末尾删除项目。
list: 要删除项的列表。
amount: 要删除的项数。如果为负值，则从列表结尾开始删除项。
剩余项的列表。
drop,remove,shorten

DSCore.List.ShiftIndices(System.Collections.IList,System.Int32)
将列表中的索引右移给定数量。
list: 要移动的列表。
amount: 索引移动的数量。如果为负值，则索引将左移。
索引移动后的列表。
shift,offset

DSCore.List.GetItemAtIndex(System.Collections.IList,System.Int32)
返回指定索引处给定列表的项。
list: 要用于提取项的列表。
index: 要提取的项的索引。
给定索引处列表的项。
get,item,index,fetch,at,getfrom,get from,extract

DSCore.List.ReplaceItemAtIndex(System.Collections.IList,System.Int32,System.Object)
替换指定索引处给定列表的项。
list: 要替换项的列表。
index: 要替换的项的索引。
item: 要插入的项。
已替换过项的新列表。
replace,switch

DSCore.List.ReplaceItemAtIndices(System.Collections.IList,System.Collections.Generic.IList{System.Int32},System.Object)
替换给定列表中位于指定索引处的项。
list: 要替换项的列表。
indices: 要替换的项的索引。
item: 要插入的项。
包含已替换项的新列表。
replace,switch

DSCore.List.Slice(System.Collections.IList,System.Nullable{System.Int32},System.Nullable{System.Int32},System.Int32)
根据开始索引、结束索引和步长，
从给定列表返回单个子列表。
list: 要切分的列表。
start: 切分起点的索引。
end: 切分终点的索引。
step: 原始列表中用于切分项的索引的数量。
给定列表的切分中的项。
list,sub,sublist,subrange,get sublist

DSCore.List.RemoveItemAtIndex(System.Collections.IList,System.Int32[])
删除指定索引处给定列表的项。
list: 要删除一个或多个项的列表。
indices: 要删除的项的索引。
删除项后的列表。
index,indices,cull,remove,item

DSCore.List.DropEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
在给定偏移后是给定值倍数的索引处
删除给定列表的项。
list: 要删除项的列表/
n: 将删除是该参数倍数的索引。
offset: 从列表开始部分忽略的项数。
删除项后的列表。
nth,remove,cull,every

DSCore.List.TakeEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
在给定偏移后是给定值倍数的索引处
提取给定列表的项。
list: 要用于提取项的列表。
n: 将提取是该数字倍数(在偏移后)
的索引。
offset: 从列表开始部分忽略的项数。
列表的项。
fetch,take,every,nth

DSCore.List.IsEmpty(System.Collections.IList)
确定给定列表是否为空。
list: 要检查是否为空的列表
如果列表为空，则为 true；如果不是，则为 false
test,is,empty,null,count

DSCore.List.AllTrue(System.Collections.IList)
确定给定列表中的所有条目是否为布尔值且值为“真”。
list: 要检查所有条目是否为“是”的列表。
如果列表中的所有条目都是“true”，则为 true；如果一个或多个条目不是“true”，则为 false
test,all,true,istrue

DSCore.List.AllFalse(System.Collections.IList)
确定给定列表中的所有条目是否为布尔值且值为“否”。
list: 要检查所有条目是否为“否”的列表。
如果列表中的所有条目都是“false”，则为 true；如果一个或多个条目不是“false”，则为 false
test,all,false,isfalse

DSCore.List.AnyTrue(System.Collections.IList)
确定给定列表中的任何项目是否为布尔值且为真值。
list: 要检查任何项目是否为真的列表。
任何项目是否为真。
test,any,true,istrue

DSCore.List.AnyFalse(System.Collections.IList)
确定给定列表中的任何项目是否为布尔值且为假值。
list: 要检查任何条目是否为假的列表。
任何项目是否为假。
test,any,false,isfalse

DSCore.List.Count(System.Collections.IList)
返回存储于给定列表中的项数。
list: 要用于获取项数的列表。
列表长度。
listlength,list length,count,size,sizeof

DSCore.List.Join(System.Collections.IList[])
将所有给定列表合并为单个列表。
lists: 要合而为一的各列表。
已合并的列表。
join lists,merge,concatenate

DSCore.List.FirstItem(System.Collections.IList)
返回列表中的第一项。
list: 要从中获取第一项的列表。
列表第一项。
get,fetch,first,item,start

DSCore.List.RestOfItems(System.Collections.IList)
删除给定列表的第一项。
list: 要用于获取其余项的列表。
列表其余项。
get,fetch,rest,end,rest of list

DSCore.List.Chop(System.Collections.IList,System.Collections.Generic.List{System.Int32})
将列表分割为指定长度的一组连续子列表。列表分区的起点位于列表顶部。
list: 要分割为子列表的列表
lengths: 通过输入列表创建的连续子列表的长度
从列表创建的子列表
sublists,build sublists,slices,partitions,cut,listcontains,chop

DSCore.List.DiagonalRight(System.Collections.IList,System.Int32)
矩阵中从左下角到右上角沿每条对角线的列表元素。
list: 平面列表
subLength: 每个新子列表的长度。
沿矩阵对角线的元素的列表。
diagonal,right,matrix,get diagonals,diagonal sublists

DSCore.List.DiagonalLeft(System.Collections.IList,System.Int32)
矩阵中从左上角到右下角沿每条对角线的列表元素。
list: 平面列表。
rowLength: 每个新子列表的长度。
沿矩阵对角线的元素的列表。
diagonal,left,matrix,get diagonals,diagonal sublists

DSCore.List.Transpose(System.Collections.IList)
在列表的列表中互换行和列。
如果一些行长短不一，
则空值将作为占位符插入结果
数组中，使其始终为矩形。
lists: 要转置的列表的列表
已转置的列表的列表
transpose,flip matrix,matrix,swap,rows,columns

DSCore.List.Clean(System.Collections.IList,System.Boolean)
从给定任意维度列表清除空值数据和空列表数据
list: 包含要清理的空值和空子列表的列表
preserveIndices: 提供一个选项来保留数据索引
已转置列表的列表
以免滤除非尾部空值
Returns: 清除了空值和空列表后的列表

DSCore.List.OfRepeatedItem(System.Object,System.Int32)
创建包含给定项和给定次数的列表。
item: 要重复的项。
amount: 要重复的次数。
已重复项的列表。
repeat,repeated,duplicate,list of item,fill list,copies,listcontains

DSCore.List.Cycle(System.Collections.IList,System.Int32)
通过连接给定列表的副本创建新列表。
list: 要重复的列表。
amount: 要重复的次数。
已重复列表的列表(类型: var[]..[])
repeat,repeated,duplicate,repeated list,concat list

DSCore.List.LastItem(System.Collections.IList)
检索列表中的最后一项。
list: 要获取其最后一项的列表
列表中的最后一项
get,fetch,last,item,end of list

DSCore.List.Shuffle(System.Collections.IList)
打乱列表，并将列表各项的顺序设定为随机。
list: 要打乱的列表。
已随机化的列表。
random,randomize,shuffle,jitter,randomness

DSCore.List.Shuffle(System.Collections.IList,System.Int32)
打乱列表，基于初始种子值随机化其项目的顺序。
list: 要打乱的列表。
seed: 随机数生成器的种子值。
已随机化的列表。
random,randomize,shuffle,jitter,randomness,seed

DSCore.List.Permutations(System.Collections.IList,System.Nullable{System.Int32})
生成给定列表的给定长度的所有排列。
list: 要排列的列表。
length: 每个排列的长度。
给定长度的列表的排列(类型: var[]..[])
permutation,permutations

DSCore.List.Combinations(System.Collections.IList,System.Int32,System.Boolean)
生成给定列表的给定长度的所有组合。
list: 要生成其组合的列表
length: 每个组合的长度
replace: 在选定项进行组合后是否将其删除，默认值
为“False”。
给定长度列表的组合
combo

DSCore.List.FirstIndexOf(System.Collections.IList,System.Object)
给定一项，会返回列表中首个匹配项从零开始的
索引。若列表中找不到该项，则返回 -1。
list: 要用于搜索的列表。如果此参数为空值，则返回 -1。
item: 要查找的项。
Returns: 列表中该项从零开始的索引，或 -1 (若未找到)。

DSCore.List.AllIndicesOf(System.Collections.IList,System.Object)
给定一项，会返回列表中所有匹配项从零开始的
索引。若列表中找不到该项，则返回空列表。
list: 要用于搜索的列表。如果此参数为空，则返回空列表。
item: 要查找的项。
若找到，则返回其所有匹配项从零开始的索引列表，
若列表中不存在该项，则返回空列表。

DSCore.List.Flatten(System.Collections.IList,System.Int32)
按一定数量展开列表的嵌套列表。
list: 要展开的列表。
amount: 要删除的列表嵌套的层(-1 将删除所有列表嵌套)
按数量展开的列表
flatten,completely

DSCore.List.IndexInList(System.Collections.IList,System.Object)
作为使用 IList.Contains 的备用方法，前者使用 Enumerable.SequenceEqual 检查
条目是否已包含在列表中，并且条目是否为数字。如果找到则返回索引，
否则返回 -1。
list: 要检查是否包含条目的列表。
item: 需要查找的条目。
列表中条目的索引。

DSCore.List.GetDepth(System.Object)
获取给定列表的最大深度。
list: 用于获取深度的输入列表。
给定列表的深度。

DSCore.List.CountBool(System.Collections.IList,System.Boolean)
返回给定列表中指定布尔值的数量。
list: 用来查找布尔值的列表。
value: 要查找的布尔值
列表中指定布尔值的数量。

DSCore.List.IncreaseDepth(System.Collections.IList,System.Int32)
按指定数量增加给定列表的深度。通过创建新列表
并包含给定列表以增加深度。
list: 要增加深度的列表。
amt: 要增加的深度数量。
深度按数量增加的新列表。

DSCore.List.DoubleConverter(System.Object)
将整数转换为双精度，否则返回输入对象。