DSCore.CurveMapper.LinearCurve
Představuje lineární křivku v uzlu CurveMapper.
Lineární křivka je rovná čára mezi dvěma řídicími body.

DSCore.CurveMapper.LinearCurve.LineEquation(System.Double)
Vypočítá hodnoty Y (souřadnice kreslicí plochy) pro minimální a maximální hodnoty X

DSCore.CurveMapper.LinearCurve.SolveForXGivenY(System.Double)
Vypočítá hodnoty X (souřadnice kreslicí plochy) pro minimální a maximální hodnoty Y

DSCore.CurveMapper.LinearCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Vrací hodnoty X a Y rozložené po křivce.