DSCore.CurveMapper.ParabolicCurve
Představuje parabolickou křivku v uzlu CurveMapper.
Křivka se řídí kvadratickou rovnicí založenou na dvou řídicích bodech.

DSCore.CurveMapper.ParabolicCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Vrací hodnoty X a Y rozložené po křivce.