DSCore.IO.Image
Metody pro práci v nástroji Image Bitmaps

DSCore.IO.Image.ReadFromFile(System.IO.FileInfo)
Načte soubor jako rastrový obrázek.
file: Objekt souboru k načtení obrázku
Objekt obrázku ze souboru

DSCore.IO.Image.Pixels(System.Drawing.Bitmap,System.Nullable{System.Int32},System.Nullable{System.Int32})
Načte soubor obrázku a vrátí hodnoty barev v zadaných umístěních rastru.
image: Objekt obrázku k získání barev pixelů
xSamples: Počet ukázkových bodů rastru ve směru X
ySamples: Počet ukázkových bodů rastru ve směru Y
Barvy v zadaných bodech rastru
read,image,bitmap,png,jpg,jpeg

DSCore.IO.Image.FromPixels(DSCore.Color[][])
Vytvoří obrázek z 2D seznamu pixelů.
colors: 2D obdélníkový seznam barev představující pixely
Obrázek z 2D seznamu pixelů

DSCore.IO.Image.FromPixels(DSCore.Color[],System.Int32,System.Int32)
Vytvoří obrázek z plochého seznamu pixelů, šířky a výšky.
colors: Seznam barev představujících pixely
width: Šířka nového obrázku v pixelech
height: Výška nového obrázku v pixelech
Obrázek ze seznamu pixelů

DSCore.IO.Image.Dimensions(System.Drawing.Bitmap)
Vrátí šířku a výšku obrázku.
image: Obrázek, jehož rozměry chcete získat
šířka obrázku v pixelech
výška obrázku v pixelech

DSCore.IO.Image.WriteToFile(System.String,System.Drawing.Bitmap)
Zapište obrázek do cesty pro daný název souboru.
image: Obrázek, který chcete zapsat
Vytvořený objekt obrázku
write image,image,file,filepath