DSCore.CurveMapper.GaussianCurve
Představuje Gaussovu křivku v uzlu CurveMapper.
Gaussova křivka sleduje zvonovité rozložení, které je definováno čtyřmi řídicími body.

DSCore.CurveMapper.GaussianCurve.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Označuje, zda je aktuálně měněna velikost uzlu, aby se zabránilo nezamýšleným aktualizacím řídicích bodů.

DSCore.CurveMapper.GaussianCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Vrací hodnoty X a Y rozložené po křivce.