DSCore.String
Metody pro správu řetězců

DSCore.String.ToNumber(System.String)
Převádí řetězec na celé číslo nebo hodnotu typu double.
string: Řetězec k převedení
Celé číslo nebo číslo typu double
2number,str2number,strtonumber,string2number,stringtonumber,int,double,cast

DSCore.String.GetNumber(System.String)
Získat všechny číselné řetězce z cílového řetězce jako řetězec
string: Cílový řetězec, který má být získán
Číslo v řetězci
getnumber,tonumber,strtonumber,numberinstring,string2number,stringtonumber,int,double,cast

DSCore.String.Concat(System.String[])
Zřetězí více řetězců do jediného řetězce.
strings: Seznam řetězců pro zřetězení
Řetězec vytvořený ze seznamu řetězců
concatenate,join,combine strings

DSCore.String.Length(System.String)
Vrací počet znaků obsažených v daném řetězci.
string: Řetězec k nalezení délky
Počet znaků v řetězci
count,size,characters,chars,length,sizeof

DSCore.String.Split(System.String,System.String[])
Rozdělí jeden řetězec na seznam řetězců, s děleními
určenými podle daných oddělovacích řetězců.
string: Řetězec pro rozdělení
separators: Řetězce, které (pokud existují) určují konec a začátek rozdělení.
Seznam řetězců vytvořený ze vstupního řetězce
divide,separator,delimiter,cut,csv,comma,

DSCore.String.Join(System.String,System.String[])
Zřetězí více řetězců do jediného řetězce, přičemž vloží daný
oddělovač mezi každý spojený řetězec.
separator: Řetězec, který má být vložen mezi spojené řetězce
strings: Řetězce, které mají být spojeny do jediného řetězce
Řetězec vytvořený ze seznamu řetězců, včetně znaku oddělovače
join,separator,build csv,concat,construct

DSCore.String.ToUpper(System.String)
Převede zadaný řetězec na všechna velká písmena.
string: Řetězec k převedení na velká písmena
Řetězec velkými písmeny
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.ToLower(System.String)
Převede zadaný řetězec na všechna malá písmena.
string: Řetězec k převedení na malá písmena
Řetězec malými písmeny
2lowercase,to lowercase,tolowercase,lowercase

DSCore.String.ToTitle(System.String)
Převede zadaný řetězec na velikost písmen nadpisu.
str: Řetězec k nastavení na velikost písmen nadpisu
Řetězec pro velikost písmen nadpisu
2titlecase,to titlecase,to title case,totitlecase,titlecase

DSCore.String.ChangeCase(System.String,System.Boolean)
Převede zadaný řetězec na všechna velká nebo všechna
malá písmena, a to na základě logického parametru.
string: Řetězec, který má být převeden na velká nebo malá písmena
upper: True, pokud chcete převést na velká písmena, false, chcete-li převést na malá písmena
Řetězec s převedenou velikostí písmen
2lowercase,to lowercase,tolowercase,lowercase,
2uppercase,to uppercase,touppercase,uppercase

DSCore.String.Substring(System.String,System.Int32,System.Int32)
Načte dílčí řetězec z daného řetězce. Dílčí řetězec začíná v daném
umístění znaku a má danou délku.
string: Řetězec, jehož dílčí řetězec chcete převzít
startIndex: Počáteční umístění znaku dílčího řetězce v původním řetězci
length: Počet znaků v dílčím řetězci
Dílčí řetězec z původního řetězce
subset,get string,part,smaller string

DSCore.String.Contains(System.String,System.String,System.Boolean)
Určuje, zda zadaný řetězec obsahuje daný dílčí řetězec.
string: Řetězec, ve kterém se má hledat
searchFor: Dílčí řetězec, který chcete vyhledat
ignoreCase: Určuje, zda porovnání bere v úvahu velká a malá písmena
Určuje, zda řetězec obsahuje dílčí řetězec
test,within,in,is in,part of

DSCore.String.CountOccurrences(System.String,System.String,System.Boolean)
Spočítá počet nepřekrývajících se výskytů dílčího řetězce uvnitř daného řetězce.
string: Řetězec, ve kterém se má hledat
searchFor: Dílčí řetězec, který chcete vyhledat
ignoreCase: Určuje, zda porovnání bere v úvahu velká a malá písmena
Počet nepřekrývajících se výskytů dílčího řetězce v řetězci
count,substring,count occurrences,numberof,search,find,within

DSCore.String.Replace(System.String,System.String,System.String)
Nahradí všechny výskyty textu v řetězci jiným textem.
string: Řetězec, v němž chcete nahradit dílčí řetězce.
searchFor: Text, který má být nahrazen
replaceWith: Text, kterým chcete nahradit
Řetězec s provedených nahrazením
replace,overwrite,override,find and replace

DSCore.String.EndsWith(System.String,System.String,System.Boolean)
Určuje, zda zadaný řetězec končí daným dílčím řetězcem.
string: Řetězec, jehož konec chcete hledat
searchFor: Dílčí řetězec, který chcete na konci řetězce hledat
ignoreCase: Hodnota True k ignorování velkých a malých písmen, hodnota False k braní v úvahu velká a malá písmena
Hodnota True, pokud řetězec začíná dílčím řetězcem, hodnota False, pokud nezačíná
test,does end,last,str end,terminated

DSCore.String.StartsWith(System.String,System.String,System.Boolean)
Určuje, zda zadaný řetězec začíná daným dílčím řetězcem.
string: Řetězec, jehož začátek chcete hledat
searchFor: Dílčí řetězec, který chcete na začátku řetězce hledat
ignoreCase: Hodnota True k ignorování velkých a malých písmen, hodnota False k braní v úvahu velká a malá písmena
Hodnota True, pokud řetězec začíná dílčím řetězcem, hodnota False, pokud nezačíná
test,beginswith,start,string start,front

DSCore.String.TrimWhitespace(System.String)
Odstraní všechny bílé znaky ze začátku a konce daného řetězce.
string: Řetězec, který se má zkrátit
Řetězec s odstraněnými počátečními a koncovými bílými znaky
trimstring,cleanstring,whitespace,blanks,spaces,string trim

DSCore.String.TrimLeadingWhitespace(System.String)
Odstraní všechny bílé znaky ze začátku daného řetězce.
string: Řetězec, který se má zkrátit
Řetězec s odstraněnými počátečními bílými znaky
trim string,clean string,trim leading whitespaces,string trim

DSCore.String.TrimTrailingWhitespace(System.String)
Odstraní všechny bílé znaky z konce daného řetězce.
string: Řetězec, který se má zkrátit
Řetězec s odstraněnými koncovými bílými znaky
trim string,clean string,trim trailing whitespaces,string trim

DSCore.String.IndexOf(System.String,System.String,System.Boolean)
Najde index založený na nule prvního výskytu dílčího řetězce uvnitř řetězce.
Vrací -1, pokud nelze najít žádný index.
string: Řetězec, ve kterém se má hledat
searchFor: Dílčí řetězec, který chcete vyhledat
ignoreCase: Určuje, zda porovnání bere v úvahu velká a malá písmena
Index prvního výskytu dílčího řetězce nebo -1, pokud jej nelze najít
index of,find substring,where,search

DSCore.String.AllIndicesOf(System.String,System.String,System.Boolean)
Najde seznam indexů, kde se podřetězec zobrazí uvnitř řetězce.
string: Řetězec, ve kterém se má hledat.
searchFor: Dílčí řetězec, který chcete vyhledat.
ignoreCase: Určuje, zda porovnání bere v úvahu velká a malá písmena.
Seznam indexů, kde je nalezen dílčí řetězec (typ: int[])
all indices of,find substring,where,search

DSCore.String.LastIndexOf(System.String,System.String,System.Boolean)
Najde index založený na nule posledního výskytu dílčího řetězce uvnitř řetězce.
Vrací -1, pokud nelze najít žádný index.
string: Řetězec, ve kterém se má hledat.
searchFor: Dílčí řetězec, který chcete vyhledat
ignoreCase: Určuje, zda porovnání bere v úvahu velká a malá písmena.
Index posledního výskytu dílčího řetězce nebo -1, pokud jej nelze najít
last index of,find substring,where,search

DSCore.String.PadLeft(System.String,System.Int32,System.String)
Zarovná znaky v daném řetězci doprava tím, že vyplní prostory vlevo až
po zadanou celkovou délku.
string: Řetězec k vyplnění
newLength: Celková délka řetězce po vyplnění
padChars: Znak pro vyplnění, ve výchozím nastavení jde o mezeru
Řetězce zarovnané doprava vyplněním úvodních bílých znaků na zadanou celkovou délku
pad left,right align,right-align,pad,string space,whitespace

DSCore.String.PadRight(System.String,System.Int32,System.String)
Zarovná znaky v daném řetězci doleva tím, že vyplní prostory vpravo až
po zadanou celkovou délku.
string: Řetězec k vyplnění
newLength: Celková délka řetězce po vyplnění
padChars: Znak pro vyplnění, ve výchozím nastavení jde o mezeru
Řetězce zarovnané doleva vyplněním koncových bílých znaků na zadanou celkovou délku
pad right,left align,left-align,pad string space,whitespace

DSCore.String.Center(System.String,System.Int32,System.String)
Zvětšuje šířku řetězce obklopením původních znaků mezerami z obou stran.
string: Řetězec k vystředění
newLength: Celková délka řetězce po vystředění
padChars: Znak pro vystředění, ve výchozím nastavení jde o mezeru
Řetězce zarovnané na střed tím, že je obklopíte počátečními a koncovými
bílými znaky na zadanou celkovou délku.
center align,center-align,centered,whitespace,expand string,surround

DSCore.String.Insert(System.String,System.Int32,System.String)
Vloží řetězec do jiného řetězce v daném indexu.
string: Řetězec, do kterého se má provést vložení.
index: Index, ve kterém chcete vložit
toInsert: Řetězec, který se má vložit
Řetězec s vloženým dílčím řetězcem
insertstring,insert string

DSCore.String.Remove(System.String,System.Int32,System.Nullable{System.Int32})
Odstraní znaky z řetězce.
string: Řetězec, z něhož se mají odebrat znaky.
startIndex: Index, ve které chcete začít s odstraňováním
count: Počet znaků, které mají být odebrány.
Poznámka: Pokud je hodnota Počet záporná, bude proces odebírání probíhat zprava doleva.
Řetězec s odstraněnými znaky
delete,rem,shorten