DSCore.Math
Metody pro provádění matematických operací

DSCore.Math.Random(System.Nullable{System.Int32})
Vytvoří náhodnou hodnotu typu double v rozsahu [0, 1).
seed: Výchozí hodnota pro generátor náhodných čísel
Náhodné číslo mezi 0 a 1
random,seed

DSCore.Math.Random(System.Double,System.Double)
Vytvoří náhodné číslo v rozsahu [lower_number, higher_number).
value1: Dolní konec rozsahu pro náhodné číslo.
value2: Horní konec rozsahu pro náhodné číslo.
Náhodné číslo v rozsahu [lower_number, higher_number).
random,numberrange

DSCore.Math.Random(System.Double,System.Double,System.Int32)
Vytvoří náhodné číslo v rozsahu [lower_number, higher_number) na základě počáteční výchozí hodnoty.
value1: Dolní konec rozsahu pro náhodné číslo.
value2: Horní konec rozsahu pro náhodné číslo.
seed: Výchozí hodnota pro generátor náhodných čísel.
Náhodné číslo v rozsahu [lower_number, higher_number).
random,numberrange,seed

DSCore.Math.RandomList(System.Int32)
Vytvoří seznam obsahující dané množství náhodných hodnot typu double
v rozsahu [0, 1).
amount: Množství náhodných čísel, které bude seznam výsledků obsahovat
Seznam náhodných čísel mezi 0 a 1
random,listcontains

DSCore.Math.RandomList(System.Int32,System.Double,System.Double,System.Int32)
Vytvoří seznam obsahující dané množství náhodných dvojic
v definovaném rozsahu [lower_number, higher_number) na základě počáteční výchozí hodnoty.
amount: Množství náhodných čísel, které bude seznam výsledků obsahovat.
value1: Dolní konec rozsahu pro náhodné číslo.
value2: Horní konec rozsahu pro náhodné číslo.
seed: Výchozí hodnota pro generátor náhodných čísel.
Seznam náhodných čísel v rozsahu [lower_number, higher_number).
random,listcontains,seed

DSCore.Math.PiTimes2
Konstanta pí vynásobená 2
2 krát pí
2pi,2*pi,twopi,two*pi

DSCore.Math.Average(System.Collections.Generic.IList{System.Double})
Zprůměruje seznam čísel.
numbers: Seznam čísel, která chcete zprůměrovat
Zprůměruje seznam čísel.
avg,mean

DSCore.Math.Map(System.Double,System.Double,System.Double)
Mapuje vstupní hodnotu na číslo mezi 0 a 1 na základě vstupního rozsahu.
rangeMin: Minimální hodnota vstupního rozsahu
rangeMax: Maximální hodnota vstupního rozsahu
inputValue: Číslo, které má být mapováno
Mapovaná hodnota
map,range,minimum,maximum,normalize,scale,remap

DSCore.Math.MapTo(System.Double,System.Double,System.Double,System.Double,System.Double)
Mapuje vstupní hodnotu na číslo v rozsahu určeném parametry targetRangeMin a targetRangeMax.
rangeMin: Minimální hodnota vstupního rozsahu
rangeMax: Maximální hodnota vstupního rozsahu
inputValue: Číslo, které má být mapováno
targetRangeMin: Minimální hodnota nového rozsahu
targetRangeMax: Maximální hodnota nového rozsahu
Mapovaná hodnota
map,range,mapto,minimum,maximum,normalize,scale,remap

DSCore.Math.RemapRange(System.Collections.Generic.IList{System.Double},System.Double,System.Double)
Upraví rozsah seznamu čísel při zachování
distribučního poměru.
numbers: Seznam čísel, jehož rozsah chcete upravit
newMin: Nové minimum rozsahu
newMax: Nové maximum rozsahu
Seznam přiřazen k novému rozsahu.
remap range

DSCore.Math.kRadiansToDegrees
Umožňuje přesunout funkce/metody z knihovny Math.dll do této knihovny DSCoreNode.dll.

DSCore.Math.PI
Matematická konstanta pí, 3,14159...
Konstanta Pí
3.141592653589793

DSCore.Math.E
Matematická konstanta e, 2,71828...
Konstanta E
exp,2.718281828459045

DSCore.Math.GoldenRatio
Zlatý poměr, (1 + sqrt(5))/2 = 1,61803...
Hodnota zlatého řezu
golden,ratio,divine,phi,tau,1.61803398875

DSCore.Math.RadiansToDegrees(System.Double)
Převede úhel v radiánech na úhel ve stupních.
radians: Úhel v radiánech
Úhel ve stupních
radians,degrees,angle

DSCore.Math.DegreesToRadians(System.Double)
Převede úhel ve stupních na úhel v radiánech.
degrees: Úhel ve stupních
Úhel v radiánech
degrees,radians,angle

DSCore.Math.Abs(System.Double)
Najde absolutní hodnotu čísla.
number: Číslo k získání absolutní hodnoty z
Absolutní hodnota čísla
absolute value,magnitude

DSCore.Math.Equals(System.Double,System.Double,System.Double)
Tuto metodu pouze používá uzel NodeModel s hodnotou Rovná se (s tolerancí)

DSCore.Math.Abs(System.Int64)
Najde absolutní hodnotu čísla.
integer: Číslo
Absolutní hodnota čísla
absolute value,magnitude

DSCore.Math.Acos(System.Double)
Najde inverzní kosinus, což je úhel, jehož kosinus je daný poměr.
ratio: Kosinus úhlu, číslo v rozsahu [-1, 1]
Úhel, jehož kosinus je vstupní poměr
acosine,arccosine

DSCore.Math.Asin(System.Double)
Najde inverzní sinus, což je úhel, jehož sinus je daný poměr.
ratio: Sinus úhlu, číslo v rozsahu [-1, 1]
Úhel, jehož sinus je vstupní poměr
asine,arcsin

DSCore.Math.Atan(System.Double)
Najde inverzní tangens, což je úhel, jehož tangens je daný poměr.
ratio: Tangens úhlu
Úhel, jehož tangens je vstupní poměr
atangent,arctangent

DSCore.Math.Atan2(System.Double,System.Double)
Najde inverzní tangens kvocientu dvou čísel. Vrací úhel,
jehož tangens je poměr: čitatel/jmenovatel.
numerator: Čitatel tangens úhlu
denominator: Jmenovatel tangens úhlu
Úhel, jehož tangens je čitatel/jmenovatel
atangent,arctangent

DSCore.Math.Ceiling(System.Double)
Vrací první celé číslo větší než určité číslo
number: Číslo pro zaokrouhlení nahoru
První celé číslo větší než číslo
ceiling,round

DSCore.Math.Cos(System.Double)
Najde kosinus úhlu.
angle: Úhel ve stupních, jehož kosinus chcete určit
Kosinus úhlu
cosine

DSCore.Math.Cosh(System.Double)
Najde hyperbolický kosinus úhlu (v radiánech).
angle: Úhel v radiánech
Hyperbolický kosinus úhlu
hyperbolic cosine

DSCore.Math.DivRem(System.Int64,System.Int64)
Najde zbytek po výpočtu dělenec/dělitel.
dividend: Číslo, které má být děleno
divisor: Číslo, kterým má být děleno
Zbytek po dělení
remainder

DSCore.Math.EvaluateFormula(System.String,System.String[],System.Object[])
Vyhodnotí vzorec NCalc s daným mapováním parametru.
formulaString: Vzorec NCalc
parameters: Názvy proměnných
arguments: Vazby proměnných
typ: var[]..[] (výsledek výpočtu vzorce)

DSCore.Math.Exp(System.Double)
Vrací exponenciální funkci čísla, konstantu e umocněnou na číslo hodnoty.
number: Číslo
Exponenciální funkce čísla
exponential

DSCore.Math.Floor(System.Double)
Vrací první celé číslo menší než určité číslo
number: Číslo pro zaokrouhlení nahoru
První celé číslo menší než dané číslo
round

DSCore.Math.Log(System.Double)
Najde přirozený logaritmus čísla v rozsahu (0, ∞).
number: Číslo větší než 0
Přirozený logaritmus čísla
natural,logarithm,ln

DSCore.Math.Log(System.Double,System.Double)
Najde logaritmus čísla s určeným základem.
number: Číslo větší než 0
logBase: Základ logaritmu v rozsahu [0,1), (1, ∞)
Logaritmus čísla
logarithm,ld,lg

DSCore.Math.Log10(System.Double)
Najde dekadický logaritmus čísla.
number: Číslo větší než 0
Logaritmus čísla
logarithm

DSCore.Math.Max(System.Double,System.Double)
Vrací větší ze dvou čísel.
value1: Číslo, které chcete porovnat
value2: Číslo, které chcete porovnat
Větší ze dvou čísel
maximum,greater,larger

DSCore.Math.Max(System.Int64,System.Int64)
Vrací větší ze dvou čísel.
int1: Číslo, které chcete porovnat
int2: Číslo, které chcete porovnat
Větší ze dvou čísel
maximum,greater,larger

DSCore.Math.Min(System.Double,System.Double)
Vrací menší ze dvou čísel.
value1: Číslo, které chcete porovnat
value2: Číslo, které chcete porovnat
Menší ze dvou čísel
minimum,lesser,smaller

DSCore.Math.Min(System.Int64,System.Int64)
Vrací menší ze dvou čísel.
int1: Číslo, které chcete porovnat
int2: Číslo, které chcete porovnat
Menší ze dvou čísel
minimum,lesser,smaller

DSCore.Math.Pow(System.Double,System.Double)
Umocní číslo na danou mocninu.
number: Číslo, které má být umocněno na danou mocninu
power: Mocnina, na kterou chcete číslo umocnit
Číslo umocněné na danou mocninu
^,power,raise,exponent

DSCore.Math.Rand
Vytvoří náhodné číslo v rozsahu [0, 1).
Náhodné číslo v rozsahu [0, 1)
random,numberrange

DSCore.Math.Round(System.Double)
Zaokrouhlí číslo na nejbližší celé číslo.
Tato metoda vrátí číslo s plovoucí desetinnou čárkou a s přesností na dvě desetinná místa a nikoli celé číslo.
number: Číslo k zaokrouhlení
Celé číslo nejbližší danému číslu

DSCore.Math.Round(System.Double,System.Int32)
Zaokrouhlí číslo na zadaný počet zlomkových číslic.
number: Číslo k zaokrouhlení
digits: Vrácená hodnota bude obsahovat zlomkové číslice
Číslo nejblíže k hodnotě, která obsahuje počet zlomkových číslic rovných číslicím

DSCore.Math.Sign(System.Double)
Vrací znaménko čísla: -1, 0 nebo 1.
number: Číslo k získání znaménka
Znaménko čísla: -1, 0 nebo 1

DSCore.Math.Sign(System.Int64)
Vrací znaménko čísla: -1, 0 nebo 1.
int: Celé číslo k získání značky
Znaménko čísla: -1, 0 nebo 1

DSCore.Math.Sin(System.Double)
Najde sinus úhlu.
angle: Úhel ve stupních, jehož sinus chcete určit
Sinus úhlu
sine

DSCore.Math.Sinh(System.Double)
Najde hyperbolický sinus úhlu (v radiánech).
angle: Úhel v radiánech
Hyperbolický sinus úhlu
hyperbolic

DSCore.Math.Sqrt(System.Double)
Najde kladnou druhou odmocninu čísla v rozsahu [0, ∞).
number: Číslo v rozsahu [0, ∞)
Kladná druhá odmocnina čísla
square,root,radical

DSCore.Math.Tan(System.Double)
Najde tangens úhlu.
angle: Úhel v radiánech
Tangens úhlu
tangent

DSCore.Math.Tanh(System.Double)
Najde hyperbolický tangens úhlu (v radiánech).
angle: Úhel v radiánech
Hyperbolický tangens úhlu
hyperbolic,tanh

DSCore.Math.Sum(System.Collections.Generic.IEnumerable{System.Double})
Najde součet posloupnosti čísel.
values: Čísla k přidání do součtu
Součet hodnot
mass addition,massadd

DSCore.Math.Factorial(System.Int64)
Najde výsledek faktoriálu kladného celého čísla.
number: Kladné celé číslo
Výsledek faktoriálu celého čísla
!

DSCore.Math.Xor(System.Boolean,System.Boolean)
Logický operátor XOR: Vrátí hodnotu true, pokud – a pouze pokud – má přesně jeden ze vstupů hodnotu true.
bool: Booleovská hodnota
otherBool: Jiná booleovská hodnota
Výsledek ve formě logické hodnoty
xor,exclusive,or

DSCore.Math.DoCheckedCast(System.Double)
Provede odlitek až po zkontrolovaný kontext. Pokud operace vyvolá přetečení,
zobrazí se upozornění a výsledek přetečení se vrátí.
value: Operace, která se má provést
Returns: Výsledek operace