DSCore.Properties.Resources
Třída prostředků silného typu k vyhledávání lokalizovaných řetězců apod.

DSCore.Properties.Resources.ResourceManager
Vrátí instanci třídy ResourceManager uloženou ve vyrovnávací paměti, která je použita touto třídou.

DSCore.Properties.Resources.Culture
Přepíše vlastnost CurrentUICulture aktuálního vlákna pro všechna
vyhledávání prostředků pomocí této třídy prostředků silného typu.

DSCore.Properties.Resources.BitmapOverflowError
Vyhledá lokalizovaný řetězec podobný řetězci „Zadaná data barev jsou příliš velká, aby se vešla do hranic obrázku.“.

DSCore.Properties.Resources.CurveMapperEqualMinMaxWarning
Vyhledá lokalizovaný řetězec podobný řetězci • Minimální a maximální hodnoty se musí lišit.

DSCore.Properties.Resources.CurveMapperInvalidCountWarning
Vyhledá lokalizovaný řetězec podobný řetězci • Hodnoty musí být seznam čísel nebo jedno číslo ≥ 2.

DSCore.Properties.Resources.CurveMapperInvalidCurveWarning
Vyhledá lokalizovaný řetězec podobný řetězci • Řídicí body pro vybranou křivku nejsou platné.

DSCore.Properties.Resources.CurveMapperInvalidXYFormatWarning
Vyhledá lokalizovaný řetězec podobný řetězci • Vstupy X a Y musí být jednotlivá čísla (ne seznamy).

DSCore.Properties.Resources.DefineDataSupportedInputValueExceptionMessage
Vyhledá lokalizovaný řetězec podobný řetězci „Vstup musí být jedna hodnota nebo seznam bez vnoření.“

DSCore.Properties.Resources.DefineDataUnexpectedInputExceptionMessage
Vyhledá lokalizovaný řetězec podobný řetězci „Tento uzel očekával vstup {0}, ale obdržel vstup {1}. Zadejte očekávaný vstup nebo vyberte nový typ v rozevírací nabídce uzlu.“

DSCore.Properties.Resources.DefineDataUnsupportedCombinationOfDataTypesExceptionMessage
Vyhledá lokalizovaný řetězec podobný řetězci „Tento uzel nepodporuje kombinaci typů dat v aktuálním seznamu vstupů {0}. Zkontrolujte, zda seznam vstupů obsahuje položky stejného typu dat nebo kombinaci typů se společným nadřazeným typem.“

DSCore.Properties.Resources.DefineDataUnsupportedDataTypeExceptionMessage
Vyhledá lokalizovaný řetězec podobný řetězci „Tento uzel nepodporuje aktuální typ vstupních dat ({0}). V rozevírací nabídce zobrazte podporované typy dat.“

DSCore.Properties.Resources.EnumDateOfWeekFriday
Vyhledá lokalizovaný řetězec podobný řetězci „Pátek“.

DSCore.Properties.Resources.EnumDateOfWeekMonday
Vyhledá lokalizovaný řetězec podobný řetězci „Pondělí“.

DSCore.Properties.Resources.EnumDateOfWeekSaturday
Vyhledá lokalizovaný řetězec podobný řetězci „Sobota“.

DSCore.Properties.Resources.EnumDateOfWeekSunday
Vyhledá lokalizovaný řetězec podobný řetězci „Neděle“.

DSCore.Properties.Resources.EnumDateOfWeekThursday
Vyhledá lokalizovaný řetězec podobný řetězci „Čtvrtek“.

DSCore.Properties.Resources.EnumDateOfWeekTuesday
Vyhledá lokalizovaný řetězec podobný řetězci „Úterý“.

DSCore.Properties.Resources.EnumDateOfWeekWednesday
Vyhledá lokalizovaný řetězec podobný řetězci „Středa“.

DSCore.Properties.Resources.Exception_Deserialize_Bad_Format
Vyhledá lokalizovaný řetězec podobný řetězci „Json pro typ {0} nebyl správně naformátován.“.

DSCore.Properties.Resources.Exception_Deserialize_Unsupported_Cache
Vyhledá lokalizovaný řetězec podobný řetězci „Uložená data nelze načíst.“.

DSCore.Properties.Resources.Exception_Serialize_Depth_Unsupported
Vyhledá lokalizovaný řetězec podobný řetězci „Hloubka {0} překračuje maximální hloubku {1} v cestě "{2}"“.

DSCore.Properties.Resources.Exception_Serialize_DesignScript_Unsupported
Vyhledá lokalizovaný řetězec podobný řetězci „Tento typ geometrie nelze serializovat.“.

DSCore.Properties.Resources.Exception_Serialize_Unsupported_Type
Vyhledá lokalizovaný řetězec podobný řetězci „Nelze uložit data typu {0}.“.

DSCore.Properties.Resources.ExportToCSVObsolete
Vyhledá lokalizovaný řetězec podobný řetězci „Použijte raději uzel Data.ExportCSV.“.

DSCore.Properties.Resources.FactorialNegativeInt
Vyhledá lokalizovaný řetězec podobný řetězci „Vstupní hodnota funkce Math.Factorial nemůže být záporná.“.

DSCore.Properties.Resources.FactorialOverflow
Vyhledá lokalizovaný řetězec podobný řetězci „Návratová hodnota funkce Math.Factorial je mimo rozsah.“.

DSCore.Properties.Resources.FindPointsWithinRadiusNullPointMessage
Vyhledá lokalizovaný řetězec podobný řetězci „Je nutné zadat střed.“.

DSCore.Properties.Resources.FindPointsWithinRadiusSearchRadiusMessage
Vyhledá lokalizovaný řetězec podobný řetězci „Poloměr vyhledávání nemůže být nula.“.

DSCore.Properties.Resources.FromObjectObsolete
Vyhledá lokalizovaný řetězec podobný řetězci „Tento uzel je zastaralý. Použijte řetězec String from Object.“.

DSCore.Properties.Resources.IntegerOverflow
Vyhledá lokalizovaný řetězec podobný řetězci „Operace vedla k přetečení celého čísla. Její výsledek může být nečekaný.“.

DSCore.Properties.Resources.InvalidDestinationPathErrorMessage
Vyhledá lokalizovaný řetězec podobný řetězci "Jako cesta ke kopírování se používá neplatná cesta k cílovému souboru.."

DSCore.Properties.Resources.InvalidKeysErrorMessage
Vyhledá lokalizovaný řetězec podobný řetězci „Jeden nebo více vstupních typů se neshoduje. Seznamy klíčů nejsou podporovány.“.

DSCore.Properties.Resources.InvalidKeysLenghtErrorMessage
Vyhledá lokalizovaný řetězec podobný řetězci „Počet položek se neshoduje s počtem klíčů.“ href=InvalidKeysLenghtErrorMessage.html.

DSCore.Properties.Resources.LoadImageFromPathObsolete
Vyhledá lokalizovaný řetězec podobný řetězci „Raději použijte uzly File.FromPath -> Image.ReadFromFile.“.

DSCore.Properties.Resources.MissingPythonEngine
Vyhledá lokalizovaný řetězec podobný řetězci „Vybraný modul Python nebylo možné nalézt.“.

DSCore.Properties.Resources.ObjectArgumentExceptionMessage
Vyhledá lokalizovaný řetězec podobný řetězci „Objekt nemůže mít hodnotu null, zadejte správnou hodnotu.“.

DSCore.Properties.Resources.QuadtreeConstructionEmptyUVSetMessage
Vyhledá lokalizovaný řetězec podobný řetězci „Nelze sestavit objekt QuadTree z prázdné množiny bodů.“.

DSCore.Properties.Resources.QuadtreeConstructionNullUVSetMessage
Vyhledá lokalizovaný řetězec podobný řetězci „Objekt QuadTree nemůže být sestaven z množiny UV s hodnotou null.“.

DSCore.Properties.Resources.ReadImageObsolete
Vyhledá lokalizovaný řetězec podobný řetězci „Raději použijte uzly File.FromPath -> Image.ReadFromFile -> Image.Pixels.“.

DSCore.Properties.Resources.ReadTextObsolete
Vyhledá lokalizovaný řetězec podobný řetězci „Raději použijte uzly File.FromPath -> File.ReadText.“.

DSCore.Properties.Resources.StringRemoveCountOutOfRangeMessage
Vyhledá lokalizovaný řetězec podobný řetězci „Počet je mimo rozsah.“.

DSCore.Properties.Resources.StringRemoveStartIndexOutOfRangeMessage
Vyhledá lokalizovaný řetězec podobný řetězci „Počáteční index je mimo rozsah.“.

DSCore.Properties.Resources.StringToNumberInvalidNumberMessage
Vyhledá lokalizovaný řetězec podobný řetězci „Číslo není platné.“.

DSCore.Properties.Resources.WebRequestNullUrlMessage
Vyhledá lokalizovaný řetězec podobný řetězci „Adresa URL nesmí mít hodnotu null.“.

DSCore.Properties.Resources.WriteImageObsolete
Vyhledá lokalizovaný řetězec podobný řetězci „Raději použijte uzel Image.WriteToFile.“.