DSCore.CurveMapper.BezierCurve
Představuje Bezierovu křivku v uzlu CurveMapper.
Bezierova křivka je definována čtyřmi řídicími body a nabízí hladkou interpolaci.

DSCore.CurveMapper.BezierCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Zobrazí interpolované hodnoty Y podle přiřazených parametrů a mezí.