DSCore.CurveMapper.CurveBase
Představuje základní třídu pro všechny typy křivek v uzlu CurveMapper.
Nabízí běžnou funkcionalitu ke generování a načítání hodnot křivky.

DSCore.CurveMapper.CurveBase.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Abstraktní metoda implementovaná odvozenými třídami ke generování hodnot křivek.

DSCore.CurveMapper.CurveBase.GetCurveXValues(System.Collections.Generic.List{System.Double},System.Boolean)
Obvyklá metoda získávání hodnot X.

DSCore.CurveMapper.CurveBase.GetCurveYValues(System.Collections.Generic.List{System.Double},System.Boolean)
Obvyklá metoda získávání hodnot Y.

DSCore.CurveMapper.CurveBase.GenerateFromDomain(System.Collections.Generic.List{System.Double},System.Func{System.Double,System.Double})
Vygeneruje hodnoty X a Y mapováním vstupů domény do prostoru kreslicí plochy a vyhodnocením funkce křivky.