DSCore.Color.Red
Umožňuje najít červenou složku barvy, 0 až 255.
Hodnota červené barvy pro barevný model RGB, typ int mezi 0 a 255, včetně.

DSCore.Color.Green
Umožňuje najít zelenou složku barvy, 0 až 255.
Hodnota zelené barvy pro barevný model RGB, typ int mezi 0 a 255, včetně

DSCore.Color.Blue
Umožňuje najít modrou složku barvy, 0 až 255.
Hodnota modré barvy pro barevný model RGB, typ int mezi 0 a 255, včetně

DSCore.Color.Alpha
Umožňuje najít alfa složku barvy, 0 až 255.
Hodnota alfa, typ int mezi 0 a 255, včetně

DSCore.Color.ByARGB(System.Int32,System.Int32,System.Int32,System.Int32)
Umožňuje vytvořit barvu pomocí alfa, červené, zelené a modré složky.
alpha: Hodnota alfa (mezi 0 a 255, včetně)
red: Červená hodnota pro barevný model RGB (mezi 0 a 255, včetně)
green: Zelená hodnota pro barevný model RGB (mezi 0 a 255, včetně)
blue: Modrá hodnota pro barevný model RGB (mezi 0 a 255, včetně)
Barva vytvořená z modelu ARGB
color

DSCore.Color.Brightness(DSCore.Color)
Vrátí hodnotu jasu pro tuto barvu.
color: Barva pro dotaz jasu
Hodnota jasu (mezi 0 a 1, včetně)

DSCore.Color.Saturation(DSCore.Color)
Vrátí hodnotu sytosti pro tuto barvu.
Hodnota sytosti, mezi 0 a 1, včetně.

DSCore.Color.Hue(DSCore.Color)
Vrátí hodnotu odstínu pro tuto barvu.
color: Objekt barvy
Hodnota odstínu pro barvu jako hodnota double mezi 0 a 1, včetně
hues

DSCore.Color.Components(DSCore.Color)
Zobrazí seznam složek pro barvy v pořadí: alfa, červená, zelená a modrá.
color: Objekt barvy
Hodnota alfa, typ int mezi 0 a 255, včetně
Hodnota červené barvy pro barevný model RGB, typ int mezi 0 a 255, včetně
Hodnota zelené barvy pro barevný model RGB, typ int mezi 0 a 255, včetně
Hodnota modré barvy pro barevný model RGB, typ int mezi 0 a 255, včetně
alpha,red,green,blue

DSCore.Color.BuildColorFrom1DRange(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double},System.Double)
Vrátí barvu z barevného gradientu mezi počáteční a koncovou barvou.
parameters: Hodnoty mezi 0 a 1 v rozsahu, pro který chcete barvu vzorkovat
Barvy v daném rozsahu
color,range,gradient

DSCore.Color.Lerp(DSCore.Color,DSCore.Color,System.Double)
Umožňuje provést lineární interpolaci mezi dvěma barvami.
start: Počáteční barva
end: Koncová barva
t: Parametr v rozmezí 0.0 až 1.0
Returns: Interpolovaná barva nebo bílá barva

DSCore.Color.Blerp(System.Collections.Generic.IList{DSCore.Color.IndexedColor2D},Autodesk.DesignScript.Geometry.UV)
Umožňuje provést bilineární interpolaci mezi sadu barev.
Returns: Interpolovaná barva nebo bílá barva
This algorithm is not the same as the solution found from wikipedia
(reference: https://en.wikipedia.org/wiki/Bilinear_interpolation)

DSCore.Color.Add(DSCore.Color,DSCore.Color)
Vytvořte barvu tvořenou kombinací dvou ARGB hodnot dvou existujících barev.
color: Barva k přidání
otherColor: Další barva k přidání
Výsledek barvy při přidání dvou barev

DSCore.Color.Multiply(DSCore.Color,System.Double)
Vynásobte vstupní barvu číselným násobitelem a vytvořte tmavší barvu. Hodnota alfa vstupní barvy musí být menší než 255.
color: Barva pro násobení
multiplier: Hodnota násobitele
Výsledek barvy z násobení

DSCore.Color.Divide(DSCore.Color,System.Double)
Vydělte vstupní barvu číselným dělitelem a vytvořte jasnější barvu a odeberte barevný nádech.
color: Barva k dělení
dividend: Hodnota dělitele
Výsledek barvy z dělení