DSCore.Data.DataNodeDynamoType
Třída představující typ dat podporovaný aplikací Dynamo

DSCore.Data.DataNodeDynamoType.#ctor(System.Type,System.String,System.String)
Třída představující typ dat podporovaný aplikací Dynamo

DSCore.Data.DataNodeDynamoType.Type
Základní typ

DSCore.Data.DataNodeDynamoType.Name
Volitelný název, který přepíše název typu (`NUmber` místo `long`)

DSCore.Data.DataNodeDynamoType.TypeId
Formát drátu $typeid (například „autodesk.math:point3d-1.0.0“).
Null pro primitivní typy, které nepoužívají serializaci $typeid.

DSCore.Data.DataNodeDynamoType.Level
Hierarchická úroveň, která se má zobrazit v uživatelském rozhraní

DSCore.Data.DataNodeDynamoType.IsLastChild
Pokud je typ poslední podřazený prvek hierarchie (pro účely uživatelského rozhraní)

DSCore.Data.DataNodeDynamoType.Parent
Nadřazený objekt Type, pokud existuje