DSCore.ColorRange.ByColorsAndParameters(System.Collections.Generic.IList{DSCore.Color},System.Collections.Generic.IList{Autodesk.DesignScript.Geometry.UV})
Zadáním seznamů barev a atributů UV vytvořte objekt ColorRange.
colors: Seznam barev
parameters: Seznam parametrů v rozsahu (0.0,0.0) a (1.0,1.0)
Returns: Objekt ColorRange

DSCore.ColorRange.GetColorAtParameter(Autodesk.DesignScript.Geometry.UV)
Vrátí barvu v daném rozsahu barev určeném zadaným parametrem.
parameter: Atribut UV v rozsahu (0.0,0.0) a (1.0,1.0)
Returns: Barva