DSCore.Data.MaxDepthJsonTextWriter
Podtřída objektu JsonTextWriter, která omezuje maximální podporovanou hloubku objektu, aby se zabránilo kruhovým referenčním selháním při serializaci libovolných typů objektů .NET.