DSCore.CurveMapper.PowerCurve
Představuje křivku mocninné funkce v uzlu CurveMapper.
Křivka je definována mocninnou rovnicí odvozenou z řídicího bodu.

DSCore.CurveMapper.PowerCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Vrací hodnoty X a Y rozložené po křivce.