DSCore.Quadtree.ByUVs(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.UV})
Umožňuje vytvořit objekt QuadTree obsahující doménu (0,0)->(1,1).
uvs: Sada atributů UV v doméně (0,0) -> (1,1)
Returns: Objekt QuadTree

DSCore.Quadtree.FindPointsWithinRadius(Autodesk.DesignScript.Geometry.UV,System.Double)
Umožňuje najít v objektu QuadTree všechny body (souřadnice UV), které jsou uvnitř oblasti určené poloměrem a souřadnicí UV.
center: Souřadnice UV středu prohledávané oblasti
radius: Poloměr prohledávané oblasti
Returns: Seznam souřadnic UV