DSCore.List
Metody pro tvorbu a práci se seznamy

DSCore.List.Empty
Vrátí prázdný seznam.
Prázdný seznam
empty list, emptylist,[]

DSCore.List.UniqueItems(System.Collections.IList)
Vytvoří nový seznam obsahující všechny jedinečné položky v daném seznamu.
list: Seznam, z něhož se mají filtrovat duplicity
Filtrovaný seznam
removes,duplicates,remove duplicates,cull duplicates,distinct,listcontains

DSCore.List.Contains(System.Collections.IList,System.Object)
Určuje, zda zadaný seznam obsahuje danou položku. Tato funkce prohledává dílčí seznamy, které jsou v něm obsažené.
list: Seznam, ve kterém se má vyhledávat
item: Položka, kterou chcete hledat
Hodnota True, pokud seznam obsahuje danou položku, hodnota False, pokud ji neobsahuje
item,search,in,listcontains

DSCore.List.IsHomogeneous(System.Collections.IList)
Zkontrolujte, zda jsou položky v seznamu stejného typu.
list: Seznam, jehož homogenita má být kontrolována
Označuje, zda je seznam homogenní.
homogeneous,allequal,same,type

DSCore.List.IsRectangular(System.Collections.IList)
Zkontrolujte, zda je počet položek ve všech řádcích seznamu stejný.
list: Seznam, ve kterém má být kontrolováno, zda řádky obsahují stejný počet položek
Označuje, že je ve všech řádcích seznamu stejný počet položek.
rectangular,isrectangular,same,sublist,row

DSCore.List.IsUniformDepth(System.Collections.IList)
Zkontrolujte, zda mají položky v seznamu stejnou hloubku.
list: Seznam, ve kterém má být kontrolováno, zda mají položky stejnou hloubku
Označuje, zda je hloubka seznamu stejná.
depth,uniform,isuniformdepth,sublist,jagged

DSCore.List.SetDifference(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Vrátí nový seznam obsahující objekty, které jsou v seznamu List1, ale nejsou v seznamu List2.
list1: Seznam objektů k zahrnutí v novém seznamu
list2: Seznam objektů k vyřazení z nového seznamu
Nový seznam obsahující objekty, které jsou v seznamu List1, ale nejsou v seznamu List2
difference,setdifference,set

DSCore.List.SetIntersection(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Vrátí nový seznam obsahující objekty, které jsou v seznamu List1 i v seznamu List2.
list1: Seznam objektů k porovnání se seznamem List2
list2: Seznam objektů k porovnání se seznamem List1
Nový seznam obsahující objekty, které jsou v seznamu List1 i v seznamu List2
intersection,setintersection,set,overlap

DSCore.List.SetUnion(System.Collections.Generic.IList{System.Object},System.Collections.Generic.IList{System.Object})
Vrátí nový seznam obsahující objekty, které jsou v seznamu List1 nebo v seznamu List2.
list1: Seznam objektů k zahrnutí
list2: Seznam objektů k zahrnutí do seznamu List1
Nový seznam obsahující objekty, které jsou v seznamu List1 nebo v seznamu List2
union,setunion,set

DSCore.List.IndexOf(System.Collections.IList,System.Object)
Vrací index prvku v daném seznamu. Shoda mezi daným seznamem a cílovým prvkem musí být striktní (tj. int k int, double k double, string ke string, object k object atd.).
list: Seznam, ve kterém má být prvek hledán
element: Prvek, jehož index chcete vrátit
Index prvku v seznamu. Pokud není nalezena striktní shoda, je vrácen neplatný index -1.
index,indexof

DSCore.List.CountFalse(System.Collections.IList)
Vrátí počet logických hodnot False v daném seznamu
list: Seznam, ve kterém mají být logické hodnoty False hledány
Počet logických hodnot False v seznamu
false,count

DSCore.List.CountTrue(System.Collections.IList)
Vrátí počet logických hodnot True v daném seznamu
list: Seznam, ve kterém mají být logické hodnoty True hledány
Počet logických hodnot True v seznamu
true,count

DSCore.List.Insert(System.Collections.IList,System.Object,System.Int32)
Vloží do seznamu prvek, a to na místo určené zadaným indexem.
list: Seznam, do kterého bude prvek vložen
element: Prvek k vložení
index: Určuje umístění vkládaného prvku v seznamu
Seznam s vloženým prvkem
insert,add

DSCore.List.Reorder(System.Collections.IList,System.Collections.IList)
Změní pořadí položek ve vstupním seznamu na základě daného seznamu indexů.
list: Seznam, ve kterém má být změněno pořadí položek
indices: Indexy sloužící k určené nového pořadí položek v seznamu
Seznam s položkami ve změněném pořadí
reorder,index,indices

DSCore.List.SortIndexByValue(System.Collections.Generic.List{System.Double})
Seřadí položky v seznamu a vrátí jejich indexy.
list: Seznam položek k seřazení
Indexy položek v seřazeném seznamu
sort,index,value

DSCore.List.NormalizeDepth(System.Collections.IList,System.Int32)
Vrátí vícerozměrný seznam na základě daného počtu úrovní.
list: Seznam, jehož hloubka má být normalizována na základě počtu úrovní
rank: Počet úrovní pro normalizaci seznamu. Výchozí hodnota je 1.
Seznam s normalizovaným počtem úrovní
depth,normalize

DSCore.List.Reverse(System.Collections.IList)
Vytvoří nový seznam obsahující položky daného seznamu, ale v obráceném pořadí.
list: Seznam, jehož pořadí se má obrátit
Obrácený seznam
flip,listcontains

DSCore.List.__Create(System.Collections.IList)
Vytvoří nový seznam obsahující dané položky.
items: Položky, které mají být uloženy v novém seznamu

DSCore.List.Sublists(System.Collections.IList,System.Collections.IList,System.Int32)
Sestaví dílčí seznamy ze seznamu pomocí syntaxe rozsahu DesignScript.
list: Seznam, ze kterého chcete vytvořit dílčí seznamy
ranges: Rozsahy indexů prvků dílčích seznamů
Například \"{0.. 3,5,2} \".
offset: Odsazení, které chcete použít na dílčí seznam
Například rozsah \" 0.. 3\" s odsazením 2 vytvoří
{0,1,2,3}{2,3,4,5}{4,5,6,7}...
typ: var[]..[]
sublists,build sublists,subset,

DSCore.List.Sort(System.Collections.Generic.IEnumerable{System.Object})
Seřadí seznam pomocí vestavěného přirozeného řazení.
list: Seznam k seřazení
Seřazený seznam
sort,order,sorted

DSCore.List.MinimumItem(System.Collections.Generic.IEnumerable{System.Object})
Vrací minimální hodnotu ze seznamu.
list: Seznam porovnatelných položek, z něhož se má brát minimální hodnota
Minimální položka ze seznamu
least,smallest,find min

DSCore.List.MaximumItem(System.Collections.Generic.IEnumerable{System.Object})
Vrací maximální hodnotu ze seznamu.
list: Seznam porovnatelných položek, z něhož se má brát maximální hodnota
Maximální položka ze seznamu
greatest,largest,biggest,find max

DSCore.List.FilterByBoolMask(System.Collections.IList,System.Collections.IList)
Filtruje pořadí na základě vyhledávání příslušných indexů v samostatném seznamu
logických hodnot.
list: Seznam k filtrování
mask: Seznam logických hodnot představujících masku
Položky, jejichž index masky je true (pravda)
Položky, jejichž index masky je false (nepravda)
filter,in,out,mask,dispatch,bool filter,boolfilter,bool filter

DSCore.List.Deconstruct(System.Collections.IList)
Když je dán seznam, vytváří první položku v seznamu a nový seznam obsahující všechny položky
kromě první.
list: Seznam k rozdělení
První položka v seznamu (typ: var[]..[])
Zbytek seznamu (typ: var[]..[])
first,rest,list split,listcontains

DSCore.List.SortByKey(System.Collections.IList,System.Collections.IList)
Seřadit seznam podle jeho klíčů
list: seznam, který má být seřazen
keys: seznam klíčů, klíče se musejí dát řadit (např. čísla, řetězce)
typ: var[]..[]
typ: var[]..[]
sort;key

DSCore.List.GroupByKey(System.Collections.IList,System.Collections.IList)
Seskupí položky do dílčích seznamů na základě podobných klíčových hodnot.
list: Seznam položek k seskupení do dílčích seznamů
keys: Klíčové hodnoty; jedna na položku v seznamu vstupů; použito k seskupení položek
seznam dílčích seznamů, s položkami seskupenými podle podobných klíčových hodnot
klíčová hodnota odpovídající každé skupině
list;group;groupbykey;

DSCore.List.GroupBySimilarity(System.Collections.IList,System.Double,System.Boolean)
Shluky uvádějí seznam prvků podle přilehlosti jejich indexů a podobnosti jejich hodnot
list: Seznam položek, které mají být seskupeny do dílčích seznamů podle přilehlosti a podobnosti
tolerance: Prahová hodnota pro seskupení podobných položek
considerAdjacency: Booleovská hodnota, která určuje, zda má uzel brát v úvahu přilehlost či nikoliv.
seznam dílčích seznamů s položkami seskupenými podle podobných hodnot
seznam dílčích seznamů obsahující původní indexy seskupených hodnot
list;group;similar;adjacent;adjacency;groupbyadjacency;groupadjacentitems;groupsimilaritems;cluster;tolerance

DSCore.List.LevenshteinDistance(System.String,System.String)
Levenštejnova vzdálenost je algoritmus používaný k získání vzdálenosti mezi 2 řetězci
| Zdroj

DSCore.List.AddItemToFront(System.Object,System.Collections.IList)
Přidá položku na začátek seznamu.
item: Položka, která má být přidána. Může to být objekt nebo seznam.
list: Seznam, do něhož se má položka přidat
Nový s přidanými položkami
insert,add,item,front,start,begin

DSCore.List.AddItemToEnd(System.Object,System.Collections.IList)
Přidá položku na konec seznamu.
item: Položka, která má být přidána. Může to být objekt nebo seznam.
list: Seznam, do něhož se má položka přidat
Seznam s přidanými položkami
insert,add,item,end

DSCore.List.TakeItems(System.Collections.IList,System.Int32)
Načte množství položek ze začátku seznamu.
list: Seznam, z něhož se má načítat
amount: Množství položek, které se mají načítat. Pokud je hodnota záporná, položky jsou převzaty z konce seznamu.
Seznam extrahovaných položek
get,sub,sublist,extract

DSCore.List.DropItems(System.Collections.IList,System.Int32)
Odebere ze začátku seznamu určitý počet položek. Pokud je zadán záporný počet,
jsou položky odebrány z konce seznamu.
list: Seznam, z něhož se mají odebrat položky
amount: Množství položek, které se mají odebrat. Pokud je hodnota záporná, položky jsou odebrány z konce seznamu.
Seznam zbývajících položek
drop,remove,shorten

DSCore.List.ShiftIndices(System.Collections.IList,System.Int32)
Posune indexy v seznamu doprava o zadané množství.
list: Seznam, který má být posunut
amount: Množství, o které se mají posunout indexy. Pokud je hodnota záporná, indexy se posunu doleva.
Posunutý seznam
shift,offset

DSCore.List.GetItemAtIndex(System.Collections.IList,System.Int32)
Vrátí položku z daného seznamu, který se nachází v určeném indexu.
list: Seznam, ze kterého se má načíst položka
index: Index položky, která se má načíst
Položka v seznamu v daném indexu
get,item,index,fetch,at,getfrom,get from,extract

DSCore.List.ReplaceItemAtIndex(System.Collections.IList,System.Int32,System.Object)
Nahradit položku z daného seznamu, který se nachází v daném indexu.
list: Seznam, v němž se má položka nahradit
index: Index položky, která se má nahradit
item: Položka ke vložení
Nový seznam s nahrazenou položkou
replace,switch

DSCore.List.ReplaceItemAtIndices(System.Collections.IList,System.Collections.Generic.IList{System.Int32},System.Object)
Nahradí položky daného seznamu, které se nacházejí na určených indexech.
list: Seznam, v němž se má položka nahradit.
indices: Indexy položek, které mají být nahrazeny.
item: Položka ke vložení.
Nový seznam s nahrazenými položkami.
replace,switch

DSCore.List.Slice(System.Collections.IList,System.Nullable{System.Int32},System.Nullable{System.Int32},System.Int32)
Vrátí jeden dílčí seznam z daného seznamu, a to na základě počátečního indexu, koncového indexu
a počtu kroků.
list: Seznam, z něhož se má vytvořit řez
start: Index, od kterého se má zahájit řez
end: Index, u kterého se má ukončit řez
step: Množství indexů položek je odděleno jako v původním seznamu.
Položky v řezu daného seznamu
list,sub,sublist,subrange,get sublist

DSCore.List.RemoveItemAtIndex(System.Collections.IList,System.Int32[])
Odstraní položku z daného seznamu v daném indexu.
list: Seznam, z něhož se má odebrat položka či položky
indices: Index nebo indexy položek, které mají být odebrány
Seznam s odebranými položkami
index,indices,cull,remove,item

DSCore.List.DropEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
Odebere položky ze zadaného seznamu v indexech, které jsou násobky
dané hodnoty, po daném odsazení.
list: Seznam, z něhož se mají odebrat položky
n: Indexy, které jsou násobky tohoto argumentu, budou odebrány.
offset: Množství položek, které mají být ignorovány od začátku seznamu
Seznam s odebranými položkami
nth,remove,cull,every

DSCore.List.TakeEveryNthItem(System.Collections.IList,System.Int32,System.Int32)
Načte položky ze zadaného seznamu v indexech, které jsou násobky
dané hodnoty, po daném odsazení.
list: Seznam, z něhož se mají načíst položky
n: Indexy, které jsou násobky tohoto čísla (po odsazení),
budou načteny
offset: Množství položek, které mají být ignorovány od začátku seznamu
Položky ze seznamu
fetch,take,every,nth

DSCore.List.IsEmpty(System.Collections.IList)
Určuje, zda je zadaný seznam prázdný.
list: Seznam ke zkontrolování, pokud je prázdný
Hodnota True, pokud je seznam prázdný, hodnota False, pokud není
test,is,empty,null,count

DSCore.List.AllTrue(System.Collections.IList)
Určuje, zda jsou všechny položky v daném seznamu logické hodnoty a zda mají hodnotu True.
list: Seznam, ve kterém má být kontrolováno, zda mají všechny položky hodnotu True
Hodnota True, pokud všechny položky ze seznamu mají hodnotu True, hodnota False, pokud jeden nebo více předmětu nemají hodnotu True
test,all,true,istrue

DSCore.List.AllFalse(System.Collections.IList)
Určuje, zda jsou všechny položky v daném seznamu logické hodnoty a zda mají hodnotu False.
list: Seznam, ve kterém má být kontrolováno, zda mají všechny položky hodnotu False.
Hodnota True, pokud všechny položky ze seznamu mají hodnotu False, hodnota False, pokud jedna nebo více položek nemají hodnotu False
test,all,false,isfalse

DSCore.List.AnyTrue(System.Collections.IList)
Určuje, zda je některá položka v daném seznamu booleovskou hodnotou a má hodnotu True.
list: Seznam, ve kterém má být kontrolováno, zda má některá položka hodnotu True.
Určuje, zda má některá položka hodnotu True.
test,any,true,istrue

DSCore.List.AnyFalse(System.Collections.IList)
Určuje, zda je některá položka v daném seznamu booleovskou hodnotou a má hodnotu False.
list: Seznam, ve kterém má být kontrolováno, zda má některá položka hodnotu False.
Určuje, zda má některá položka hodnotu False.
test,any,false,isfalse

DSCore.List.Count(System.Collections.IList)
Vrátí počet položek uložených v daném seznamu.
list: Seznam, u něhož chcete načíst počet položek
Délka seznamu
listlength,list length,count,size,sizeof

DSCore.List.Join(System.Collections.IList[])
Zřetězí všechny dané seznamy do jednoho.
lists: Seznamy, které chcete spojit do jednoho
Spojený seznam
join lists,merge,concatenate

DSCore.List.FirstItem(System.Collections.IList)
Vrátí první položku v seznamu.
list: Seznam, z něhož chcete načíst první položku
První položka v seznamu
get,fetch,first,item,start

DSCore.List.RestOfItems(System.Collections.IList)
Odebere první položku z daného seznamu.
list: Seznam, jehož zbytek chcete načíst
Zbytek seznamu
get,fetch,rest,end,rest of list

DSCore.List.Chop(System.Collections.IList,System.Collections.Generic.List{System.Int32})
Rozdělí seznam do sady po sobě jdoucích dílčích seznamů s určenými délkami. Rozdělení seznamu začíná v horní části seznamu.
list: Seznam k rozdělení na dílčí seznamy
lengths: Délky po sobě jdoucích dílčích seznamů budou vytvořeny ze seznamu vstupů.
Dílčí seznamy vytvořené ze seznamu
sublists,build sublists,slices,partitions,cut,listcontains,chop

DSCore.List.DiagonalRight(System.Collections.IList,System.Int32)
Vypíše prvky podél každé úhlopříčky v matici z levého dolního rohu do pravého horního rohu.
list: Plochý seznam
subLength: Délka každého nového dílčího seznamu
Seznamy prvků podél úhlopříček matice
diagonal,right,matrix,get diagonals,diagonal sublists

DSCore.List.DiagonalLeft(System.Collections.IList,System.Int32)
Vypíše prvky podél každé úhlopříčky v matici z levého horního rohu do pravého dolního rohu.
list: Plochý seznam
rowLength: Délka každého nového dílčího seznamu
Seznamy prvků podél úhlopříček matice
diagonal,left,matrix,get diagonals,diagonal sublists

DSCore.List.Transpose(System.Collections.IList)
Zamění řádky a sloupce v seznamu seznamů.
Pokud jsou některé řádky kratší než jiné,
jsou jako zástupné znaky vloženy nulové hodnoty
tak, aby bylo výsledné pole vždy pravoúhlé.
lists: Seznam seznamů ke transponování
Seznam transponovaných seznamů
transpose,flip matrix,matrix,swap,rows,columns

DSCore.List.Clean(System.Collections.IList,System.Boolean)
V daném seznamu libovolných kót odstraní nulové hodnoty a prázdné seznamy.
list: Seznam obsahující nulové hodnoty a prázdné dílčí seznamy k vyčištění
preserveIndices: Zadejte možnost, díky které se zachovají rejstříky dat
Seznam transponovaných seznamů
tak, aby nebylo možné filtrovat koncové nulové hodnoty.
Returns: Seznam bez nulových hodnot a prázdných seznamů

DSCore.List.OfRepeatedItem(System.Object,System.Int32)
Vytvoří seznam obsahující danou položku, a to tolikrát, kolikrát je zadáno.
item: Položka, která se má opakovat
amount: Počet opakování
Seznam opakovaných položek
repeat,repeated,duplicate,list of item,fill list,copies,listcontains

DSCore.List.Cycle(System.Collections.IList,System.Int32)
Vytvoří nový seznam zřetězením kopií daného seznamu.
list: Seznam k opakování
amount: Počet opakování
Seznam opakovaných seznamů typů: var[]..[]
repeat,repeated,duplicate,repeated list,concat list

DSCore.List.LastItem(System.Collections.IList)
Načte poslední položku v seznamu.
list: Seznam k získání poslední položky
Poslední položka v seznamu
get,fetch,last,item,end of list

DSCore.List.Shuffle(System.Collections.IList)
Zamíchá seznam a přiřadí položkám náhodné pořadí.
list: Seznam, který chcete zamíchat
Seznamu s náhodným pořadím
random,randomize,shuffle,jitter,randomness

DSCore.List.Shuffle(System.Collections.IList,System.Int32)
Zamíchá obsah seznamu, přičemž na základě počáteční výchozí hodnoty náhodně uspořádá jeho položky.
list: Seznam, který chcete zamíchat
seed: Výchozí hodnota pro generátor náhodných čísel
Seznamu s náhodným pořadím
random,randomize,shuffle,jitter,randomness,seed

DSCore.List.Permutations(System.Collections.IList,System.Nullable{System.Int32})
Vytváří všechny permutace dané délky daného seznamu.
list: Seznam, který chcete permutovat
length: Délka každé permutace
Permutace seznamu dané délky (typ: var[]..[])
permutation,permutations

DSCore.List.Combinations(System.Collections.IList,System.Int32,System.Boolean)
Vytváří všechny kombinace dané délky daného seznamu.
list: Seznam ke generování kombinací
length: Délka každé kombinace
replace: Určuje, zda jsou položky odebrány po výběru pro kombinaci. Výchozí
hodnotou je false (nepravda).
Kombinace seznamu dané délky
combo

DSCore.List.FirstIndexOf(System.Collections.IList,System.Object)
Po zadání položky vrací rejstřík s nulami prvního výskytu položky
v seznamu. Pokud položka nebyla nalezena v seznamu, je vrácena hodnota -1.
list: Seznam k vyhledávání. Pokud je výsledkem argumentu nulová hodnota, je vrácena hodnota -1.
item: Položka, kterou chcete hledat
Returns: Rejstřík s nulami dané položky v seznamu nebo hodnota -1, pokud není položka nalezena

DSCore.List.AllIndicesOf(System.Collections.IList,System.Object)
Po zadání položky vrací rejstřík s nulami všech výskytů položky
v seznamu. Pokud položka nebyla nalezena, je vrácen prázdný seznam.
list: Seznam k vyhledávání. Pokud je výsledkem argumentu nulová hodnota, je vrácen prázdný seznam.
item: Položka, kterou chcete hledat
Seznam rejstříků s nulami všech výskytů položky, pokud je
nalezena, nebo prázdný seznam v případě, že položka v seznamu neexistuje.

DSCore.List.Flatten(System.Collections.IList,System.Int32)
Vyrovná vnořený seznam seznamů o určitou hodnotu.
list: Seznam k vyrovnání
amount: Hladiny vnoření seznamu k odebrání (-1 odebere všechna vnoření seznamu)
Vyrovnaný seznam o určité množství
flatten,completely

DSCore.List.IndexInList(System.Collections.IList,System.Object)
Jedná se o alternativu k použití metody IList.Contains, kdy se pomocí metody Enumerable.SequenceEqual kontroluje, zda
je položka obsažena v seznamu. Položka je v tomto případě typu Pole. Pokud je nalezena, vrátí příslušný index,
a pokud ne, vrátí hodnotu –1.
list: Seznam, ve kterém má být přítomnost položky kontrolována
item: Položka, kterou je třeba najít
Index položky v seznamu

DSCore.List.GetDepth(System.Object)
Získejte maximální hloubku daného seznamu.
list: Vstupní seznam, jehož hloubka má být získána
Hloubka daného seznam

DSCore.List.CountBool(System.Collections.IList,System.Boolean)
Vrátí počet výskytů zadané logické hodnoty v daném seznamu.
list: Seznam, ve kterém má být logická hodnoty hledána
value: Logická hodnota, která má být hledána
Počet výskytů zadané logické hodnoty v seznamu

DSCore.List.IncreaseDepth(System.Collections.IList,System.Int32)
Zvětšete hloubku daného seznamu o zadanou hodnotu. Hloubka je zvětšena
vytvořením nového seznamu, v němž bude daný seznam obsažen.
list: Seznam, jehož je hloubka má být zvětšena
amt: Hodnota, o kterou má být hloubka zvětšena
Nový seznam, jehož hloubka je zvětšeno o danou hodnotu

DSCore.List.DoubleConverter(System.Object)
Číslo typu integer převede na číslo typu double, jinak vrátí vstupní objekt.