DSCore.CurveMapper.SineWave
Představuje sinusoidu v uzlu CurveMapper.
Sinusová vlna je definována dvěma řídicími body a řídí se trigonometrickou funkcí.

DSCore.CurveMapper.SineWave.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Vrací hodnoty X a Y rozložené po křivce.