DSCore.Thread
Funkce pro práci s vlákny vyhodnocení

DSCore.Thread.Pause(System.Object,System.Int32)
Pozastaví aktuální vlákno vyhodnocení na danou dobu.
object: Objekt k procházení.
msTimeout: Doba pozastavení vlákna, v milisekundách
Procházený objekt