DSCore.Compare
Srovnávací metody

DSCore.Compare.GreaterThan(System.Object,System.Object)
Pokud je hodnota a větší než hodnota b, vrátí hodnotu true.
a: Porovnatelný objekt
b: Porovnatelný objekt
Výsledek ve formě logické hodnoty
larger,bigger

DSCore.Compare.GreaterThanOrEqual(System.Object,System.Object)
Pokud je hodnota a větší než hodnota b nebo je jí rovna, vrátí hodnotu true.
a: Porovnatelný objekt
b: Porovnatelný objekt
Výsledek ve formě logické hodnoty
larger,bigger,equal

DSCore.Compare.LessThan(System.Object,System.Object)
Pokud je hodnota a menší než hodnota b, vrátí hodnotu true.
a: Porovnatelný objekt
b: Porovnatelný objekt
Výsledek ve formě logické hodnoty
less,smaller

DSCore.Compare.LessThanOrEqual(System.Object,System.Object)
Pokud je hodnota a menší než hodnota b nebo je jí rovna, vrátí hodnotu true.
a: Porovnatelný objekt
b: Porovnatelný objekt
Výsledek ve formě logické hodnoty
smaller,equal