DSCore.TimeSpan
Objekt představující uplynulé časové období, bez konkrétního počátečního nebo koncového data

DSCore.TimeSpan.ByDateDifference(System.DateTime,System.DateTime)
Vytvoří novou hodnotu TimeSpan vypočtenou jako rozdíl mezi dvěma položkami DateTime
dateTime: Položka DateTime k odečtení
otherDateTime: Položka DateTime k odečtení
Hodnota TimeSpan mezi dvěma daty

DSCore.TimeSpan.Zero
Hodnota TimeSpan reprezentující nulový uplynulý čas
Hodnota TimeSpan reprezentující uplynulý čas nuly

DSCore.TimeSpan.MaxValue
Největší hodnota TimeSpan, která může být reprezentována
Maximální možná hodnota TimeSpan

DSCore.TimeSpan.MinValue
Nejmenší hodnota TimeSpan, která může být reprezentována
Minimální možná hodnota TimeSpan

DSCore.TimeSpan.Create(System.Double,System.Double,System.Double,System.Double,System.Double)
Vytvoří novou hodnotu TimeSpan z časového rozsahu.
days: Dny rozsahu
hours: Hodiny rozsahu
minutes: Minuty rozsahu
seconds: Sekundy rozsahu
milliseconds: Milisekundy rozsahu
Vytvořená hodnota TimeSpan

DSCore.TimeSpan.Scale(System.TimeSpan,System.Double)
Znásobí hodnotu TimeSpan faktorem měřítka
timeSpan: Hodnota TimeSpan ke znásobení
scaleFactor: Množství pro změnu měřítka hodnoty TimeSpan. Například faktor měřítka 2
zdvojnásobí časový rozsah.
Produkt hodnoty TimeSpan

DSCore.TimeSpan.Negate(System.TimeSpan)
Zneguje hodnotu TimeSpan
timeSpan: Hodnota TimeSpan ke znegování
Negativní hodnota TimeSpan

DSCore.TimeSpan.Add(System.TimeSpan,System.TimeSpan)
Přidá dvě hodnoty TimeSpan
timeSpan1: Hodnota TimeSpan k přidání
timeSpan2: Jiná hodnota TimeSpan k přidání
Výsledná hodnota TimeSpan ze součtu

DSCore.TimeSpan.Subtract(System.TimeSpan,System.TimeSpan)
Odečte dvě hodnoty TimeSpan
timeSpan1: Hodnota TimeSpan k odečtení
timeSpan2: Hodnota TimeSpan k odečtení
Výsledná hodnota TimeSpan z odečtení

DSCore.TimeSpan.FromString(System.String)
Pokusí se načíst hodnotu TimeSpan z řetězce
string: Řetězcová reprezentace hodnoty TimeSpan
Hodnota TimeSpan z analyzovaného řetězce

DSCore.TimeSpan.Components(System.TimeSpan)
Extrahuje jednotlivé komponenty hodnoty TimeSpan.
timeSpan: Hodnota TimeSpan k získání komponent
Počet dnů (typ int)
Počet hodin (typ int)
Počet minut (typ int)
Počet sekund (typ int)
Počet milisekund (typ int)

DSCore.TimeSpan.TotalDays(System.TimeSpan)
Převede celkový čas reprezentovaný hodnotou TimeSpan na
nepřesný počet dnů.
timeSpan: Hodnota TimeSpan pro dotaz celkových dnů
Celkový počet dnů

DSCore.TimeSpan.TotalHours(System.TimeSpan)
Převede celkový čas reprezentovaný hodnotou TimeSpan na
nepřesný počet hodin.
timeSpan: Hodnota TimeSpan pro dotaz celkových hodin
Celkový počet hodin

DSCore.TimeSpan.TotalMinutes(System.TimeSpan)
Převede celkový čas reprezentovaný hodnotou TimeSpan na
nepřesný počet minut.
timeSpan: Hodnota TimeSpan pro dotaz celkových minut
Celkový počet minut

DSCore.TimeSpan.TotalSeconds(System.TimeSpan)
Převede celkový čas reprezentovaný hodnotou TimeSpan na
nepřesný počet sekund.
timeSpan: Hodnota TimeSpan pro dotaz celkových sekund
Celkový počet sekund

DSCore.TimeSpan.TotalMilliseconds(System.TimeSpan)
Převede celkový čas reprezentovaný hodnotou TimeSpan na
nepřesný počet milisekund.
timeSpan: Hodnota TimeSpan pro dotaz celkových milisekund
Celkový počet milisekund