DSCore.DateTime
Objekt představující určité datum a čas

DSCore.DateTime.MinValue
Nejdřívější datum a čas, které mohou být reprezentovány
Minimální možná položka DateTime

DSCore.DateTime.MaxValue
Nejpozdější datum a čas, které mohou být reprezentovány
Maximální možná položka DateTime

DSCore.DateTime.Now
Aktuální systémové datum a čas
Položka DateTime reprezentující aktuální čas

DSCore.DateTime.Today
Aktuální systémové datum s časem nastaveným na půlnoc
Položka DateTime reprezentující dnešek

DSCore.DateTime.Format(System.DateTime,System.String)
Vrátí zadané datum a čas v podobě řetězce v zadaném formátu.
dateTime: Položka DateTime k formátování
format: Řetězcová reprezentace formátu data. Používá vlastnost InvariantCulture, jejíž výstup je nezávislý na jazyku operačního systému uživatele.
Jako výchozí je nastaven standardní formát „F“: „Úterý, 21. února 2017 23:02:43“.
Úplný seznam specifikátorů formátu najdete v článku Vlastní řetězce formátu data a času ve službě MSDN.
Položka DateTime reprezentovaná jako řetězec

DSCore.DateTime.ByDate(System.Int32,System.Int32,System.Int32)
Vytvoří novou hodnotu DateTime v přesném datu.
year: Přesný rok (1–9999)
month: Přesný měsíc (1–12)
day: Přesný den (1 – [počet dní v měsíci])
Položka DateTime vytvořená z data

DSCore.DateTime.ByDateAndTime(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
Vytvoří novou hodnotu DateTime v přesném datu a čase.
year: Přesný rok (1–9999)
month: Přesný měsíc (1–12)
day: Přesný den (1 – [počet dní v měsíci])
hour: Přesná hodina (0–23)
minute: Přesná minuta (0–59)
second: Přesná sekunda (0–59)
millisecond: Přesná milisekunda (0–999)
Položka DateTime vytvořená z data a času

DSCore.DateTime.SubtractTimeSpan(System.DateTime,System.TimeSpan)
Odečte hodnotu TimeSpan od hodnoty DateTime, čímž vznikne nová hodnota DateTime.
dateTime: Počáteční hodnota položky DateTime
timeSpan: Hodnota k odečtení
Výsledný prvek DateTime z odečtení

DSCore.DateTime.AddTimeSpan(System.DateTime,System.TimeSpan)
Přičte hodnotu TimeSpan k hodnotě DateTime, čímž vznikne nová hodnota DateTime.
dateTime: Počáteční hodnota položky DateTime
timeSpan: Hodnota času k přidání do položky DateTime
Výsledná položka DateTime z přidání hodnoty timespan

DSCore.DateTime.DaysInMonth(System.Int32,System.Int32)
Vypočítá počet dnů v daném měsíci daného roku.
year: Přesný rok (1–9999)
month: Přesný měsíc (1–12)
Počet dní v měsíci

DSCore.DateTime.IsDaylightSavingsTime(System.DateTime)
Určuje, zda u dané hodnoty DateTime platí letní čas.
dateTime: Položka DateTime, která se používá k určení, zda tam jsou letní časy
Hodnota True, pokud je položka DateTime v letním čase, hodnota False, pokud není

DSCore.DateTime.IsLeapYear(System.Int32)
Určuje, zda je daný rok přestupný.
year: Přesný rok (1–9999)
Hodnota True, pokud je rok přestupný, hodnota False, pokud není

DSCore.DateTime.FromString(System.String)
Pokusí se načíst položku DateTime z řetězce
string: Řetězcová reprezentace položky DateTime
Položka DateTime z analyzovaného řetězce

DSCore.DateTime.Date(System.DateTime)
Extrahuje z hodnoty DateTime pouze datum. Komponenty času jsou nastaveny na hodnotu 0.
dateTime: Hodnota DateTime
datum z položky DateTime
Date

DSCore.DateTime.Components(System.DateTime)
Extrahuje jednotlivé komponenty hodnoty DateTime.
dateTime: Položka DateTime k získání komponent
Numerická reprezentace roku (1–9999)
Numerická reprezentace měsíce (1–12)
Numerická reprezentace dne (1-[dní v měsíci])
Numerická reprezentace hodiny (0–23)
Numerické znázornění minut (0–59)
Numerická reprezentace sekund (0–59)
Numerická reprezentace milisekund (0–999)

DSCore.DateTime.DayOfWeek(System.DateTime)
Vrátí den v týdnu z dané hodnoty DateTime.
dateTime: Objekt položky DateTime k získání dne týdne
Den v týdnu

DSCore.DateTime.DayOfYear(System.DateTime)
Vrací den roku (0–366).
dateTime: Položka DateTime k získání dne roku
Počet dnů od začátku roku

DSCore.DateTime.TimeOfDay(System.DateTime)
Vytvoří novou hodnotu TimeSpan, která představuje čas uplynulý od půlnoci
dané hodnoty DateTime.
dateTime: Hodnota DateTime
Hodnota TimeSpan od půlnoci