DSCore.IO.FileSystem
Metody pro práci se soubory

DSCore.IO.FileSystem.AbsolutePath(System.String,System.String)
Ze zadané cesty vrátí absolutní cestu. Pokud je zadaná cesta
relativní cestou, bude rozpoznána s ohledem na aktuální
pracovní prostor. Pokud soubor neexistuje v relativní cestě, ale existuje
v zadané cestě hintPath, bude jako výsledek vrácena cesta hintPath.
path: Relativní nebo úplná cesta
hintPath: Poslední rozpoznaná cesta
Returns: Absolutní cesta

DSCore.IO.FileSystem.FileFromPath(System.String)
Z dané cesty k souboru vytvoří objekt souboru.

DSCore.IO.FileSystem.ReadText(System.IO.FileInfo)
Čte textový soubor a vrací obsah jako řetězec.
file: Objekt souboru ke čtení textu
Obsah textového souboru
read file,text,file

DSCore.IO.FileSystem.MoveFile(System.String,System.String,System.Boolean)
Přesune určený soubor do nového umístění.
path: Řetězcová reprezentace existující cesty
newPath: Řetězcová reprezentace nové cesty
overwrite: Přepnout k přepsání existujících souborů
Uzel provede úlohu, nevytvoří výstup

DSCore.IO.FileSystem.DeleteFile(System.String)
Odstraní zadaný soubor.
path: Cesta k souboru k vymazání
Uzel provede úlohu, nevytvoří výstup

DSCore.IO.FileSystem.CopyFile(System.IO.FileInfo,System.String,System.Boolean)
Zkopíruje soubor.
file: Objekt souboru ke kopírování
destinationPath: Řetězcová reprezentace cílové cesty souboru
overwrite: Přepnout k přepsání existujících souborů
Uzel provede úlohu, vrací hodnotu true, pokud bude akce kopírování úspěšná.

DSCore.IO.FileSystem.FileExists(System.String)
Určuje, zda soubor existuje v zadané cestě.
path: Řetězec představující cestu k souboru
Hodnota True, pokud soubor existuje, hodnota False, pokud neexistuje
filepath

DSCore.IO.FileSystem.WriteText(System.String,System.String)
Zapíše textový obsah do souboru určeného cestou.
filePath: Cesta, do níž se má zapisovat
text: Textový obsah
Žádný výstup
write file,text,file,filepath

DSCore.IO.FileSystem.AppendText(System.String,System.String)
Připojit obsah textu do souboru určeného cestou
filePath: Cesta, do níž se má zapisovat
text: Textový obsah
Uzel provede úlohu, nevytvoří výstup
append file,write file,text,file,filepath

DSCore.IO.FileSystem.CombinePath(System.String[])
Sloučí více řetězců do jedné cesty k souboru.
strings: Řetězce pro sloučení do cesty
Kombinovaná cesta k souboru

DSCore.IO.FileSystem.FileExtension(System.String)
Vrátí příponu pro cestu k souboru.
path: Cesta k získání přípony
Přípona souboru

DSCore.IO.FileSystem.ChangePathExtension(System.String,System.String)
Změní příponu pro cestu k souboru.
path: Cesta ke změnění přípony
newExtension: Reprezentující řetězec nové přípony
Cesta k souboru se změněnou příponou

DSCore.IO.FileSystem.DirectoryName(System.String)
Vrátí název adresáře pro cestu k souboru.
path: Cesta k získání informace o adresáři
Název adresáře cesty k souboru
directorypath

DSCore.IO.FileSystem.FileName(System.String,System.Boolean)
Vrátí název souboru pro cestu k souboru.
path: Cesta k získání názvu souboru
withExtension: Přepnout k zahrnutí přípony ve výsledku
Název souboru z cesty k souboru

DSCore.IO.FileSystem.FileHasExtension(System.String)
Určuje, zda cesta k souboru obsahuje příponu či nikoli.
path: Cesta ke kontrole přípony
Hodnota True, pokud cesta k souboru obsahuje příponu, hodnota False, pokud ji neobsahuje

DSCore.IO.FileSystem.GetDirectoryContents(System.IO.DirectoryInfo,System.String,System.Boolean)
Vrátí seznam souborů a adresářů, které jsou obsaženy v daném adresáři. K filtrování výsledků lze použít volitelný řetězec vyhledávání.
directory: Adresář k získání obsahů
searchString: Hledat řetězec používaný k filtrování výsledků
includeSubdirectories: Nastavte hodnotu na True, pokud chcete zahrnout soubory a složky do podadresářů (rekurzivní) nebo nastavte hodnotu na False, pokud chcete zahrnout výsledky pouze z nejvyšší úrovně daného adresáře.
Výsledné soubory z dotazu
Výsledné adresáře z dotazu

DSCore.IO.FileSystem.CopyDirectory(System.IO.DirectoryInfo,System.String,System.Boolean)
Zkopíruje adresář do cílového umístění.
directory: Adresář ke zkopírování
destinationPath: Cílové umístění operace kopírování na disku
overwriteFiles: Přepnout pro přepsání existujícího adresáře
Uzel provede úlohu, nevytvoří výstup

DSCore.IO.FileSystem.DeleteDirectory(System.String,System.Boolean)
Odstraní adresář.
path: Cesta k adresáři na disku
recursive: Určuje, zda chcete odstranit veškerý obsah adresáře, či nikoli. Výchozí hodnotou je false (nepravda).
Uzel provede úlohu, nevytvoří výstup

DSCore.IO.FileSystem.DirectoryExists(System.String)
Určuje, zda adresář existuje v zadané cestě.
path: Cesta k adresáři na disku
Hodnota True, pokud adresář existuje, hodnota False, pokud neexistuje
directorypath

DSCore.IO.FileSystem.MoveDirectory(System.String,System.String,System.Boolean)
Přesune adresář do nového umístění.
path: Řetězcová reprezentace existující cesty
newPath: Řetězcová reprezentace nové cesty
overwriteFiles: Přepnout k přepsání existujících souborů
Uzel provede úlohu, nevytvoří výstup