DSCore.ObjectComparer
Implementuje funkci Compare pro dva objekty podle následující pravidla.
1. Předpokládá se, že jde o čísla nejmenšího datového typu, logické hodnoty, řetězcové hodnoty a ukazatele.
2. Pokud jde o dva objekty rozhraní IComparable a stejného typu, je použit
nativní mechanismus porovnání tohoto rozhraní.
3. Pokud jsou oba vstupy typu hodnota, ale jeden z nich je logická hodnota, je logická hodnota považována za větší.
4. Jinak jsou všechny vstupy převedeny na hodnoty typu double a porovnány.
5. Jinak platí, že pokud je pouze jeden vstup typu hodnota, je objekt typu hodnota považován za menší.
6. Jinak platí, že pokud je pouze jeden vstup typu řetězec, je tento řetězec považován za menší než ostatní vstupy.
7. Jinak platí, že pokud není způsob porovnání znám, je nejlepší provést porovnání na základě hodnoty hash.