DSCore.Data.ParseJSON(System.String)
Analýza převede libovolný řetězec JSON na hodnotu. Jedná se o opak funkce JSON.Stringify.
json: Řetězec JSON
Typ výsledku závisí na obsahu ze vstupního řetězce. Typ výsledku může být základní hodnota (například řetězec, booleovská hodnota, hodnota double), seznam nebo slovník.

DSCore.Data.ToNative(Newtonsoft.Json.Linq.JToken)
Implementace analýzy pro převod typů JToken na nativní objekty .NET.
token: JToken k analýze na N

DSCore.Data.DynamoJObjectToNative(Newtonsoft.Json.Linq.JObject)
Implementace analýzy pro převod typů objektů JObject na určité objekty aplikace Dynamo (například geometrie, barva, obrázky atd.)
Throws System.Exception:

DSCore.Data.StringifyJSON(System.Object)
Funkce Stringify převede libovolnou hodnotu nebo seznam libovolných hodnot do formátu JSON. Při provádění operace na seznamu je možné použít replikace a získat seznam řetězců JSON.
values: Seznam hodnot
Řetězec JSON, kde se základní typy (například celé číslo, double, booleovský), seznamy a slovníky převedou na asociovaný typ JSON.

DSCore.Data.CanObjectBeCached(System.Object)
Pomocná funkce k určení, zda lze objekt uložit do mezipaměti nebo zda se jedná o typ null, „null“ nebo prázdný seznam.
inputObject: Objekt ke kontrole

DSCore.Data.Remember(System.Object,System.String)
Funkce pro ukládání uzlu Data.Remember do mezipaměti
inputObject: Objekt k uložení do mezipaměti
cachedJson: Volitelný soubor json existující mezipaměti

DSCore.Data.DataNodeDynamoTypeList
Statický seznam pro všechny typy dat podporované aplikací Dynamo
Returns: Seznam obsahující podporované typy dat

DSCore.Data.#cctor
Statický konstruktor

DSCore.Data.SafeExtractDictionaryValue(System.Collections.Generic.Dictionary{System.String,System.Object},System.String)
Pomocná funkce pro bezpečné extrahování hodnoty slovníku
dict: Slovník, ze kterého se má extrahovat hodnota
key: Klíč dvojice klíč/hodnota

DSCore.Data.EvaluateDefineDataNode(System.Object,System.String,System.Boolean,System.Boolean,System.String)
Toto je funkce používaná aplikací AST k vyhodnocení uzlu Definovat data.
Při provádění ověření zpracovává část logiky uzlu.
inputValue: Vstupní hodnota proti směru proudu
typeString: Typ jako řetězec (Úkol: Lepší je předat objekt typu 'Type' pro přímé porovnání typů)
isList: Pokud je vstup typu `ArrayList`
isAutoMode: Pokud je uzel v automatickém režimu.
playerValue: Hodnota předávaná do uzlu aplikací Přehrávač skriptů Dynamo, pokud existuje.

DSCore.Data.FindCommonAncestor(System.Collections.ArrayList)
Funkce, která pomáhá najít typ v případě, že byl v režimu AutoMode předán objekt ArrayList objektů
list: Vstupní hodnota, u které se očekává, že bude typu ArrayList

DSCore.Data.LikelyAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
Pomocná funkce vracející uzel nejnižší úrovně ze seznamu uzlů DataNodeDynamoType
nodes: Seznam DataNodeDynamoType k vyhodnocení

DSCore.Data.FindClosestCommonAncestor(System.Collections.Generic.List{DSCore.Data.DataNodeDynamoType})
Pomocná funkce pro určení společného předchůdce v seznamu typů dat
nodes: Seznam uzlů DataType, které chcete vyhodnotit

DSCore.Data.FindCommonAncestorBetweenTwoNodes(DSCore.Data.DataNodeDynamoType,DSCore.Data.DataNodeDynamoType)
Rekurzivní funkce pro hledání společného předchůdce mezi dvěma typy aplikace Dynamo
Vystoupí nahoru na hierarchický strom pravděpodobného předchůdce, dokud se
node: Zkontrolovat, zda je tento uzel odvozen od pravděpodobného předchůdce
likelyAncestor: Pravděpodobný předchůdce, ze kterého by měl být uzel odvozen

DSCore.Data.GetListFromTypes(System.Collections.ArrayList)
Vrátí seznam objektů DataNodeDynamoTypes z objektu ArrayList objektů.
list: Objekt ArrayList objektů, které chcete přeformátovat

DSCore.Data.IsUnusedDefineDataInput(System.Object)
Zkontroluje, zda vstup Definovat data není použit (má hodnotu null nebo je prázdný seznam).
inputValue: Vstupní hodnota z grafu.
Returns: True, pokud má být vstup považován za nepřipojený nebo nepoužitý.

DSCore.Data.IsSingleValueOrSingleLevelArrayList(System.Object)
Zkontrolujte, zda je vstupní objekt jedna hodnota nebo objekt ArrayList jedné úrovně.
obj: Vstupní objekt k vyhodnocení

DSCore.Data.IsSupportedDataNodeDynamoType(System.Object,System.Type,System.Boolean)
Funkce k ověření typu vstupu oproti podporovaným typům vstupů aplikace Dynamo
inputValue: Vstupní data k ověření
type: Typ vstupu poskytnutý uživatelem. Musí odpovídat typu inputValue.
isList: Hodnota této booleovské operace určuje, zda je vstupem jeden objekt nebo seznam.

DSCore.Data.IsItemOfType(System.Object,System.Type)
Tato metoda kontroluje, zda je položka požadovaným typem dat aplikace Dynamo
'IsInstanceOfType' zpětně kontroluje dědičnost.
item: Položka, pro kterou se má zkontrolovat typ dat
dataType: Typ dat, vůči kterému se má provést kontrola
Returns: Výsledek true nebo false na základě ověření kontroly

DSCore.Data.IsDerivedFrom(System.Type,System.Type)
Tato metoda kontroluje, zda je typ odvozen od základního typu.
derivedType: Typ, který chceme potvrdit
baseType: Základní typ, se kterým porovnáváme