DSCore.Object
Obecné funkce, které pracují se všemi daty

DSCore.Object.IsNull(System.Object)
Určuje, zda má zadaný objekt hodnotu null.
object: Objekt k testování.
Určuje, zda má objekt hodnotu null.
is null

DSCore.Object.Identity(System.Object)
Vrací, co je předáno, a nic neprovádí.
object: Objekt.
Stejný objekt

DSCore.Object.Type(System.Object)
Vrátí typ objektu v podobě řetězce.
object: Objekt pro dotaz typu
Returns: Typ objektu