DSCore.ColorRange1D.ByColorsAndParameters(System.Collections.Generic.List{DSCore.Color},System.Collections.Generic.List{System.Double})
Po zadání seznamů barev a parametrů vytvoří objekt ColorRange1D.
colors: Seznam barev
parameters: Seznam parametrů v rozmezí 0.0 až 1.0
Returns: Objekt ColorRange1D

DSCore.ColorRange1D.GetColorAtParameter(DSCore.ColorRange1D,System.Double)
Vrátí barvu v daném rozsahu barev v zadaném parametru.
parameter: Hodnota v rozmezí 0.0 až 1.0
Returns: Barva

DSCore.ColorRange1D.Default
Pomocí výchozího barevného schématu vytvoří objekt ColorRange1D.