DSCore.CurveMapper.SquareRootCurve
Představuje křivku druhé odmocniny v uzlu CurveMapper.
Křivka sleduje funkci druhé odmocniny a je ovlivněna dvěma řídicími body.

DSCore.CurveMapper.SquareRootCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Vrací hodnoty X a Y rozložené po křivce.