DSCore.CurveMapper.PerlinNoiseCurve
Představuje křivku Perlinova šumu v uzlu CurveMapper.
Křivka generuje procedurální šum podle řídicích bodů a funkcí Perlinova šumu.

DSCore.CurveMapper.PerlinNoiseCurve.GenerateCurve(System.Collections.Generic.List{System.Double},System.Boolean)
Vrací hodnoty X a Y rozložené po křivce.